{
  "slug": "the-flash-101-pilot-2014",
  "title": "the flash 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 1,
  "characters": [
    "WELLS"
  ],
  "total_words": 12715,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CENTRAL CITY - STREETS - DAY 7   7  Barry -- still running -- KNOCKS into a WOMAN carrying GROCERIES -- BOXES, CANS and FRUIT hit the pavement -- Barry  has   to stop and help her re-bag her fallen food -- BARRY I am so sorry. EXT. CENTRAL CITY BANK - DAY 8   8  Back with West, Chyre and Singh -- SINGH Detective, you can’t keep covering for him.   If he’s not here -- BARRY (O.S.) Sorry, I’m late, Captain Singh. They turn -- Barry FLASHES his BADGE -- ducks the tape -- SINGH At least you’re consistent.   What was it   this   time, Mr. Allen?   Did you forget to set your alarm? Before you answer, I should remind you, that the excuse you used last time was car trouble.   Want to know why that one was particularly memorable? BARRY I don’t own a car. SINGH So which is it?   Are you just a giant flake?   Or are you off doing something I wouldn’t approve of?  Barry isn’t fast enough with an excuse -- DET. WEST He was running an errand for me. (turns) Barry,   did you get me what I asked for?  BARRY Uh... yeah... I, um... I have it right here.  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   4.  (CONTINUED)",
      "characters": [],
      "action_text": "Barry checks his pockets -- searching -- pulls out a HALF- EATEN CANDY BAR -- sheepishly hands it to West -- BARRY I may have had a few bites. SINGH Impress us with your forensic acumen, Mr. Allen. Suddenly in the spotlight, Barry sees the BODY on the sidewalk.   He lifts the tarp -- begins to examine -- BARRY Multiple gunshots to the chest... You’ll want to notify his wife.   He was married. DET. CHYRE There was no wedding ring. Barry points to a RED SCAR visible under the man’s shirt -- BARRY He’s had heart surgery.   Fairly recently.   A side effect of which can be edema -- fluid retention.  Barry reaches into the man’s shirt -- pulls out A WEDDING RING ON A CHAIN -- West smiles to Singh --   the kid’s good   -- Barry moves over to the TIRE MARKS on the ground -- BARRY Getaway car is a   Corvette.  Corvette’s have a rear super wide tire.   Specific to that model.   12 inches.   I wear a size eleven shoe. I just added an inch.   And there’s something else... Barry takes Chyre’s pen and picks at a STICKY BROWN SUBSTANCE on the pavement -- sniffs it --   winces - - BARRY Fecal excrement.   Animal, I’d guess. DET. CHYRE My dad gave me that pen.   Before   he died. Singh gets right up in Barry’s face --  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   5.  CONTINUED: 8   8  (CONTINUED) SINGH You’re lucky you’re good.   Next time you show up late for your job, it might not be there. Singh walks away, pissed -- Off West, staring at Barry -- EXT. CENTRAL CITY STREETS - MOMENTS LATER 9   9  West and Barry, just past the crime scene, the streets are FILLING UP with PEOPLE.   In the distance we can see a clear view of S.T.A.R. LABS.   A GLEAMING GLASS and STEEL STRUCTURE. DET. WEST Alright, fess up.   Where were you? For real. BARRY (busted) I spent a few days in Starling City. DET. WEST You can’t keep ducking work so you can go off chasing down one of these urban legends. BARRY There were reports of a man in Starling who could bend steel with his bare hands. DET. WE",
      "dialogue_count": 0,
      "word_count": 4695
    },
    {
      "scene_number": 2,
      "slugline": "INT. CENTRAL CITY POLICE DEPARTMENT - BULLPEN - DAY 32   32  Detective West has Barry in a warm hug -- the rest of the station DENIZENS crowd around --   a welcome home moment   -- OFFICER VUKUVICH Yeah, that was one hell of a nap you took, baby face.   And you still look twelve. Everyone LAUGHS -- good natured ribbing -- DET. WEST You scared the hell out of us, kiddo. DISPATCHER (ON RADIO) Detective West, we got a 5.15 in progress at Gold City Bank.   Two dead.   Weather’s bad on the south side, so grab your rain gear. DET. WEST (back on the clock) I’m sorry, Barry.   I’ve got to go. BARRY Do you need my help -- DET. WEST You take it easy.   Plenty for you to do once you settle in.   Let’s go,   partner ! As West heads out - Barry turns expecting Chyre -- but instead --   Detective Thawne approaches   -- DET. THAWNE Hey, Allen.   Glad to see you. BARRY Uh, thanks, Eddie. DET. THAWNE (brightly) Hey, Iris. IRIS (cold) Detective.   You should go.   My dad doesn’t like to be kept waiting.  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   25.  (CONTINUED)",
      "characters": [],
      "action_text": "Thawne heads out, confused by her demeanor.   Something catches Barry’s eye on the WALL: PHOTOS of fallen officers, Barry sees DETECTIVE FRED CHYRE -- IRIS The night of the explosion.   Clyde Mardon shot and killed Chyre. Mardon and his brother died trying to escape.   Their plane crashed. Suddenly a UNI enters -- dragging in a JUNKIE in CUFFS -- UNIFORMED OFFICER Hey, Barry!   Good to see you! JUNKIE Screw you!  Barry sees the junkie grab the Uni’s SIDEARM -- when -- TIME SLOWS AGAIN! -- the gun aimed right at the cop -- the sound slows down -- low, like a record player -- and then --  The world snaps back to life -- as the Uni grabs the gun back and tussles with the junkie -- BARRY Iris, I... uh... need some time alone.   In my lab.   I’ll call you tonight.   I promise. As a freaked out Barry heads up the stairs -- Off Iris... INT. CENTRAL CITY POLICE DEPARTMENT - BARRY’S LAB - DAY 33   33  QUICK CUTS as Barry turns to the MINI-CAM on his COMPUTER, draws BLOOD, loads a TEST TUBE OF BLOOD into an ANALYZER -- looks at THE DIGITAL CLOCK on the SCREEN -- 00:00:00 -- OVER THIS: BARRY (O.S.) Subject spent nine months and three days in a coma after being struck by lightning -- Barry looks up at the BOARDED UP SKYLIGHT -- BARRY Subject has been experiencing the passage of time at a different rate. (considers it)  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   26.  CONTINUED: 32   32  (MORE)  (CONTINUED) Pathophysiologic explanations for hallucinations and skewed perspective could be explained by hypoxia... swelling of the brain... Barry looks, it’s still 00:00:00, the second hand frozen -- BARRY Or something else... Barry approaches the clock --the SECOND HAND moves -- the AMBIENT SOUND in the room changes -- Barry looks at the computer, confused -- RECORD TIME: 00:00:01 -- BARRY Record time one tenth of a second? Barry hits PLAYBACK -- a BLURRED IMAGE -- A BRIEF HIGH- PITCHED sound -- Barry types -- PLAYBACK set at one tenth of the speed -- hits PLAYBACK again -",
      "dialogue_count": 0,
      "word_count": 786
    },
    {
      "scene_number": 3,
      "slugline": "INT. ALLEN FAMILY HOME - BARRY’S ROOM - NIGHT (FLASHBACK) 36   36  Young Barry being put to bed by his MOM and DAD -- HENRY ‘Night, slugger. Nora -- kissing Barry’s black eye -- NORA Sweet dreams, my beautiful boy. The Allens TURN OFF THE LIGHTS and leave -- MOMENTS LATER -- Young Barry sleeping -- when a LOUD ROAR 36A   36A  stirs him -- his eyes opening -- shocked to see -- the WATER in the glass beside his bed -- miraculously rising into the air -- just like in the Crime Lab before the lightning bolt -- he looks over at his FISH TANK -- the water rising -- off Young Barry, scared -- INT. ALLEN FAMILY HOME - LIVING ROOM - NIGHT (FLASHBACK) 36B   36B  Young Barry, warily coming down the stairs -- the house filled with a strange cacophonous SOUND -- a roaring wind -- YOUNG BARRY Mom? Barry reaches the first floor, coming around a corner -- his eyes widening -- when he sees -- The room awash in wind and light -- as if a TWISTER were spinning in his home -- CRACKLES OF RED and YELLOW ELECTRICITY bursting from the funnel -- inside the maelstrom -- is NORA -- SCREAMING -- YOUNG BARRY MOM!!!  OMITTED 37   37  END OF ACT TWO  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   28.",
      "characters": [],
      "action_text": "ACT THREE EXT. FERRIS AIR - TEST FIELD - DAY 38   38  Nothing but flat arid OVERGROWN TARMACS in all directions -- a gleaming stainless steel S.T.A.R. Labs MOBILE UNIT is parked in the wide expanse -- Wells, Caitlin, Cisco and Hartley, at their stations, look down from the truck. HARTLEY This is a joke.   There’s no way he can run that fast.   This is a complete waste of time. CAITLIN We’ve been wasting the last nine months.   What’s one more day? Cisco calls out to someone   behind   the truck -- CISCO How does it fit? A beat of anticipation -- as we wait for Barry Allen to step out --   dressed as the iconic superhero   -- but instead -- Barry comes into view wearing an ILL-FITTING HELMET with GOGGLES -- RUNNER’S SHIRT, SHORTS, ELBOW and KNEE PADS, a MONITORING BAND around his bicep, and RIDICULOUSLY SOLED BOOTS WITH TREADS --   FAR FROM the Flash... for now.  CISCO At least you’ll be moving so fast no one will see you. BARRY (re: airfield) What happened to this place? CISCO Ferris Air sold it off.   There was an incident in Coast City.   A crash.   One of their test pilots disappeared. (beat) Hartley will monitor your energy output and Caitlin your vitals. BARRY What do you do?  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   29.  (CONTINUED) CISCO I make the toys, man.   Check it out. Cisco hands Barry a SMALL GOLD HEADSET with an ANTENNA -- CISCO This is a two-way headset with a camera I modified, typically designed to combat battlefield impulse noise, or in your case, a potential sonic boom. BARRY Maybe you guys should cover your ears. Hartley flares as Cisco moves off -- Barry turns to Caitlin -- BARRY Something I said? CAITLIN Hartley’s deaf. (off Barry’s surprise) The night of the explosion, he lost his hearing. BARRY It doesn’t seem like he’s -- CAITLIN He designed a cochlear device that restored partial hearing.   It’s not the same.   And it left him in a perpetual state of being unpleasant to be around. BARRY I notice you don’t smile too much. CA",
      "dialogue_count": 0,
      "word_count": 2920
    },
    {
      "scene_number": 4,
      "slugline": "INT. S.T.A.R. LABS - THE CORTEX - DAY 53   53  Hartley, Caitlin and Cisco at their stations -- BARRY (O.S.) I wasn’t the only one... They turn and see Barry -- BARRY ...affected by the particle accelerator explosion, was I? The trio react -- caught -- WELLS (O.S.) We don’t know for sure. Barry turns -- sees Wells -- time to come clean -- BARRY You said the city was safe.   That there was no residual danger.   But that’s not true.   What really happened that night? Wells turns -- a long beat -- then -- WELLS The accelerator went active.  INT. S.T.A.R. LABS - THE CORTEX - NIGHT (FLASHBACK) 54   54  Wells pops open a bottle of CHAMPAGNE, pours Caitlin’s glass full -- you couldn’t pry the smile off her face -- Caitlin holds up her hand, moves her finger wearing an ENGAGEMENT RING -- KYLE grins --   Caitlin and Kyle kiss -- champagne flowing --  WELLS (V.O.) We felt like heroes.   Then it all went wrong.  Suddenly, the CHAMPAGNE starts to float into the air -- everyone reacts with fear -- Wells turns to Hartley who’s hand SLAMS DOWN on a RED CONTROL BUTTON -- INT. ELECTRON STORAGE RING - NIGHT (FLASHBACK) 55   55  Endless tunnels stretching into the distance -- HIGH-SPEED HIGH-ENERGY PARTICLE BEAMS shoot through the tunnels -- then THEY START TO WARP AND BEND -- EXPLODING --   taking us to --  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   40.  (CONTINUED)",
      "characters": [
        "WELLS"
      ],
      "action_text": "CISCO This keeps getting cooler! BARRY (angrily) It’s not cool!   A man died.   Mardon must have gotten his powers the same way I did.   From the storm cloud.   And he’s still out there. We have to stop him before he hurts anyone else. WELLS That’s a job for the police. BARRY I work for the police. WELLS As a forensic assistant.   I built the particle accelerator to make this city, this world a better place.   Instead, it cost me my company, my reputation... Everyone reacts -- all of them victims in some way -- WELLS ... but then I found you.   Inside your body could be the map to that new world.   Vaccines, medicines, genetic therapies... all treasures buried in your cells.   We can’t risk losing everything just so you can go out and play hero. (then) You’re not a hero.   You’re just a young man who was struck by lightning. Hurt beyond words, Barry leaves -- EXT. CENTRAL CITY STREETS - DAY 57   57  Barry super-speeds through the traffic -- his emotions in turmoil -- as he picks up speed, we MATCH CUT to --  EXT. SUBURBAN STREET - NIGHT (FLASHBACK) 58   58  Young Barry -- sweating, out of breath, as he runs home -- fast as his legs will take him -- finally slowing -- as his face is lit by FLASHING RED and BLUE lights -- we REVEAL --  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   42.  CONTINUED: 56   56",
      "dialogue_count": 1,
      "word_count": 663
    },
    {
      "scene_number": 5,
      "slugline": "EXT. ALLEN FAMILY HOME - NIGHT (FLASHBACK) 59   59  Surrounded by POLICE CRUISERS -- NEIGHBORS trying to get a glimpse -- Barry pushes through the gawkers -- running up the front path to his home in time to see -- HIS FATHER -- being led out in CUFFS by TWO UNIS -- pleading with the officers -- HENRY I swear to God!   I didn’t do this! BARRY Dad...? HENRY Barry! BARRY Dad, why are they taking you? Where’s Mom? HENRY I didn’t do this!   Please, I need to be with my son.   What’s going to happen to my son?? Barry watches, helpless as the Unis stuff Henry into the back of a cruiser -- and then Barry hears -- CORONER (O.S.) Joe, you know these people? DET. WEST (O.S.) Yeah.   My daughter’s best friends with their kid... INT. ALLEN FAMILY HOME - LIVING ROOM (FLASHBACK) 60   60  Barry steps inside -- FURNITURE overturned -- FAMILY PICTURES smashed -- Barry sees the CORONER and a YOUNGER, UNIFORMED OFFICER WEST   -- standing over a TARP -- West spots him -- DET. WEST Barry, are you okay?   Where have you been? Barry isn’t listening -- he moves closer to the tarp -- West tries to stop him -- but Barry pulls it back revealing -- Barry’s mother -- NORA -- her eyes wide open, her face fixed in fear -- murdered -- as Young Barry SCREAMS -- BARRY MOMMMMM...!  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   43.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 245
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ROAD - NIGHT 61   61  Barry super-speeding, tears in his eyes -- SKIDS to a stop on the EMPTY ROAD -- managing to stay on his feet (barely) -- Barry looks up -- A CITY SKYLINE -- on the roadside, a LARGE SIGN reads “Welcome To Starling City.” BARRY (V.O.) So that’s my story.   Like I said, it’s pretty hard to believe.   But it’s the truth. EXT. ROOFTOP - NIGHT 62   62  Overlooking the city -- as we realize the VOICE OVER we heard at the beginning has been Barry speaking to someone... BARRY I’ve spent my whole life searching for what might have killed my mom. Searching for the impossible.... Never imagining I would become the impossible. The camera PANS OFF Barry -- coming around to find -- A HOODED FIGURE -- all in DARK GREEN -- A BOW in his hand -- his mask down --   it is OLIVER QUEEN -- AKA THE ARROW   -- ARROW So why come to me?   Something tells me you didn’t just run six hundred miles to say hi to a friend. BARRY I screwed up.   I was chasing the bad guy and... someone died. ARROW If you do this, you’re going to make mistakes.   I have.   But the good you do will far outweigh the bad. BARRY How do you know?   What if Wells is right?   What if I’m not a hero, what if I’m just a guy who was struck by lightning? ARROW I don’t think that lighting bolt struck you, Barry.   I think it chose you.  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   44.  (CONTINUED)",
      "characters": [],
      "action_text": "BARRY I’m just not sure I’m like you, Oliver.   I don’t know if I can be some... vigilante. ARROW I know.   You can be better.   You can give people hope in a way I never could.   Moving through your city like a guardian angel.   Making a difference, saving people...   in a flash. Yeah, Oliver just said that...  ARROW You’ve got a good heart.   Now you have fast legs. Barry reacts -- his mother’s words echoing from the past -- ARROW (grins) Just take your own advice... (donning mask)  Wear a mask.  With that, the Arrow NOCKS an ARROW and FIRES -- THWIKT! -- a CABLE trails after the arrow -- which pierces a nearby CRANE -- The Arrow LEAPS off the roof -- Barry smiles -- BARRY Cool... Then, Barry turns and super-speeds away -- ANGLE ON ANOTHER ROOFTOP 63   63  Where the Arrow has landed -- looking down and seeing Barry ZOOM DOWN the street -- Arrow can’t help but smile. ARROW Cool. END OF ACT FOUR  THE FLASH   \"PILOT\"   White Production Draft   2/3/14   45.  CONTINUED: 62   62 ACT FIVE INT. S.T.A.R. LABS - THE CORTEX - NIGHT 64   64  Barry holds court before Hartley, Caitlin and Cisco -- working off EVIDENCE PHOTOS and a LARGE MAP OF CENTRAL CITY -- BARRY I went over the NTSB evidence from the plane crash that supposedly killed Clyde and Mark Mardon. Neither of their bodies were recovered.   Plotting a course from their takeoff would have put them smack in the center of the energy dispersion caused by the explosion here.   They got a full taste of whatever you unleashed. HARTLEY Wells made it very clear, we are not getting involved in this. BARRY I’ve been going over unsolved cases from the past nine months.   There’s been a sharp increase in unexplained deaths, missing people. Your meta-humans have been busy. I’m not blaming you.   I know you didn’t mean for any of this to happen.   I know you all lost something.   But I need your help to catch Mardon.   And anyone else out there like him. Barry looks to them.   Are you guys with me?  CISCO This whole city’s been ang",
      "dialogue_count": 0,
      "word_count": 3406
    }
  ]
}