{
  "slug": "the-nun-2018",
  "title": "the nun",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 15839,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BARELY-A-ROAD - LATER Branches block the sun. The darkness seems to dampen the sounds. Maybe that’s why everything seems so... dead. SISTER IRENE If I may ask, Father, why is it the Church sends you on such tasks? FATHER BURKE The Church reaches out to me when it needs an investigation into unusual phenomenon associated with Catholicism.   Unofficially they call it ‘miracle hunting’... SISTER IRENE I thought we were here because of a suicide... FATHER BURKE We are. But I confess that is only part of our investigation. We also have orders from the Vatican to determine if the grounds are still...   Holy. And off her look -- Frenchie stops. Points through the trees: FRENCHIE I can give you my opinion on the matter now, Father. They look and see -- A CASTLE. Or it used to be, anyway. A long time ago. But for the last several hundred years it’s been home to THE ABBEY OF ST. CARTA Look, there are no vampires in this movie. But if there were, you’d totally understand why just by looking at this place. It’s a FORTRESS. Round Towers. Walls of Stone. Built to withstand the attack of Foreign Invaders and Time Itself. SISTER IRENE That doesn’t look like any Abbey I’ve seen, Father... 18.",
      "characters": [],
      "action_text": "Father Burke throws her a look:   No, me neither . CUT TO: A WOOD CROSS. SLOWLY PULL BACK, revealing --  Whoa . It is not alone. Just one of HUNDREDS. Big Crosses. Little Crosses. Iron Crosses. Stone Crosses. Stick. Twig. Woven. I mean, the Hill of Crosses ain’t got nothing on this place. It’s like a MOAT OF RELIGION that surrounds the Abbey. Father Burke, Sister Petra and Frenchie approach. Their eyes on the Abbey that looms ahead of them. Father Burke notes a TOWER that appears to have suffered some damage. FATHER BURKE A result of the war? FRENCHIE Bombing raids, yes. I’ve heard stories of how the ground shook for days after them. I have tried to find more information on the castle itself but there is no record of it in the village and the locals only spit when it is mentioned... FATHER BURKE Spit? SISTER IRENE To ward off evil. FRENCHIE It’s an old and silly superstition... Drawing closer -- FATHER BURKE Did you try to contact someone inside when you found the nun? FRENCHIE I did. But no one responded. But then again in the two years I’ve been delivering supplies she was the first nun I’d seen. 19. SISTER IRENE It is a convent of cloistered nuns. They live with a spirit of detachment from material things and being set apart from the world in order to maintain their intimate relationship with Jesus Christ... It isn’t unusual for them to not make contact with an outsider. Good to know. FATHER BURKE Did you mention your discovery to anyone in town? FRENCHIE The delivery man I replaced. But he told me to shut up about it... SISTER IRENE What does he say about this place? FRENCHIE I’ve only heard him speak of it once -- when he was pissed -- er, sorry -- inebriated. But it was gibberish... (remembering...) Mostly. Drawing closer to the entrance, Burke stops. Looks down. Sees BLOOD on the stone. It’s like a Rorschach Test. If you ask me it kinda looks like... ...nah, nevermind. FRENCHIE (CONT’D) That’s where I found her. They look up. See the Frayed End of the Rope sw",
      "dialogue_count": 0,
      "word_count": 4005
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CHAPEL - NIGHT - CONTINUOUS Sister Irene stops right outside the exit. Suddenly confronted with the night. Her eyes scan the landscape. She feels too exposed. But then --  Tingtingting...  Sister Irene looks over in the direction of the cemetery.  TingTingTingTing...  She moves over into the CEMETERY Tombstones in shadow seem like abandoned ancient alien artifacts. Sister Irene walks among them. A stranger in an even stranger land as she continues to follow the --  TingTingTinTingTingTingTing...  Leads her to an OLD GRAVE. She kneels down. Sets the Lantern beside her. It illuminates the TINY BELL continuing to ring. She stops the bell. Pauses. Like, now what? But then she looks down at the ground. Scared, she puts her ear close to the earth. Listens. And through the dirt she hears -- THE MUFFLED SCREAMS OF FATHER BURKE. Sister Irene. Stunned. How is that possible? This grave looks like it’s been filled for decades. Nevermind that for now -- SISTER IRENE Father! FATHER! Starts to dig her fingers into the dirt. Scraping it away, desperate. Continue to call out for -- SISTER IRENE (CONT’D) Father! I can hear you! 38.",
      "characters": [],
      "action_text": "She looks around for something to help her. Sees the SHOVEL Frenchie used earlier leaning against the grave. Gets up. Grabs it. She begins to dig. And dig. And dig.  Thump!  Must be the coffin. Not six feet under. But far enough. Lets the shovel drop. Returns to using her hands. As she sweeps away the surface dirt, she reveals HUNDREDS OF TINY CROSSES. Scratched deep into the lid of the COFFIN. Father Burke continues to POUND against the lid. Sister Irene pries it open. Father Burke sits right up, gasping for life. He grasps onto Sister Irene like she’s just pulled him from the depths of death. Eventually able to muster -- FATHER BURKE Thank you... Sister... thank... Streaked with dirt and sweat, Sister Irene looks past Father Burke and back into the coffin. It’s filled with BOOKS. EXT. CHAPEL - EARLY MORNING As the day’s first light breaks, we hear the WHISPERING of -- INT. CHAPEL - GUEST BEDROOM - CONTINUOUS -- Sister Irene. Kneeling at her bedside. Reciting her Lauds. Eyes closed. Her voice trembles, fingers fidget. Still clearly rocked by the events of last night. SISTER IRENE -- is now, and ever shall be, world without end. Amen. Alleluia. Doesn’t sound so joyous though. She opens her eyes. They take in the small room, lit soft by the purple dawn. She sighs: Damn. Wasn’t a dream. CUT TO: MEDIEVAL ILLUSTRATIONS. 39. Details exquisitely gruesome. Blueprints for strange torture devices. Animals staked. Men skinned. Women burned. And WORDS. Inked in elaborate script. I guess they’re in Latin? Romanian? Not sure. But they seem like -- FATHER BURKE (O.S.) -- Witchcraft. He looks up from writing in his JOURNAL as Sister Irene enters the SMALL KITCHEN Candles BURN. The morning sun still weak. Several Ancient Texts open on the table. Other stacked on the floor. A treasure trove of medieval madness. FATHER BURKE (CONT’D) Incantations, spells, curses, unholy rituals used to conjure demons and devils and open portals to the underworld. Most of these books are hundreds of y",
      "dialogue_count": 0,
      "word_count": 11834
    }
  ]
}