{
  "slug": "the-shape-of-water-2017",
  "title": "the shape of water",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 21,
  "characters_count": 0,
  "characters": [],
  "total_words": 20340,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. GILES APARTMENT - NIGHT 5   5 Full of books. ENTIRELY full of them. Here and there are half- finished illustrations. Large original art from ADVERTISEMENTS. Two cats- SNOWFLAKE and LILLIE stroll lazily. GILES (over sirens) Did the sirens wake you up? Hard at work at a drawing table- is GILES: late 60’s, refined and prim: wool vest, bow tie and tortoiseshell glasses. When he speaks he has a ever-so-slight stutter (which gets worse when he gets nervous). GILES (CONT’D) It’s a fire. The chocolate factory. It rained a little - not enough to put it out... Rains are late this year... You smell that? Toasted cocoa. Tragedy and delight- hand in hand... Giles is coloring an illustration of a happy family around a BRIGHT RED JELL-O MOLD. A sign reads: THE FUTURE IS HERE!! On his forehead: THREE pairs of eyeglasses. He raises one and lowers another one- grabs a brush. We see a   toupee   resting on top of an acrylic paint box. Elisa puts the eggs and carrot down on a side table. He caresses/taps her cheek. GILES (CONT’D) Oh, Darling child. I’d waste away to nothing without you looking after me. I am the proverbial starving artist am I not?  Shirley Temple dances on the stairs with Bojangles on “The Little Colonel”.  GILES (CONT’D) Oh- watch that- Bojangles- the stair dance. He slides his chair to see better. GILES (CONT'D) Will you look at that? Very hard to do. Cagney did it- different- but beautiful- we should watch that one day... 4",
      "characters": [],
      "action_text": "Elisa looks at the TV. Does a few tap steps. Sirens go by. GILES (CONT’D) Elisa: Wake me up when you come back. Breakfast’s on me, Child. He goes back to his painting. Looks in the mirror and smiles. Paints the smile on the father figure in the ad. INT. APARTMENT CORRIDOR - SAME 6   6 Both sides of the corridor are blocked by FILM CANS. Elisa- low heeled shoes in one hand and a paper sandwich bag in the other- moves past the cans and reaches a red door. She exits. EXT. ARCADE CINEMA AND TENEMENT BUILDING - NIGHT 7   7 She stands at the top of a fire escape. A breeze blows by. The city lights glow in the distance. Looks at her watch: 10:55 ELISA climbs down. She exits past the ARCADE CINEMA MARQUEE. She takes the steps in Bojangles fashion. She takes the steps in Bojangles fashion. The cinema owner, MR. ARZOUMANIAN, is changing the marquee lettering for THE STORY OF RUTH, helped by an ASSISTANT. MR. ARZOUMANIAN Elisa- when yoo bring the rent- stay for the bible moovie, eh? Theatre’s empty... A FIRE ENGINE SCREAMS BY- On the horizon- A couple of blocks away: the fire: A Glowing SIGN Sputters: ANNELY’S chocolate. A few people hurry towards the scene. Elisa crosses the street. OMITTED 7A   7A 5",
      "dialogue_count": 0,
      "word_count": 478
    },
    {
      "scene_number": 2,
      "slugline": "EXT. TV REPAIR SHOP / BUS STOP - NIGHT 8   8 Elisa looks at a shoe store window. On display on a little rotating platform: a pair of SILVER DANCE shoes. She starts whistling a happy tune. Elisa dances around- and then sits down on- a bus bench in front of an appliance store. A CLOCK signals 11:05 On TV, over her whistle: MARTIN LUTHER KING. KENNEDY. RUSSIAN SATELLITES. CUBAN MISSILE CRISIS on other monitors. THEN- A WAVING AMERICAN FLAG. PROGRAMMING ENDS. The bus arrives. INT. CITY BUS - NIGHT 9   9 Elisa, still whistling. Almost entirely alone, on the bus (except for a FAT GUY snoring) looking out the window with great longing. POV Industrial landscape passes by- reflections of fire and smoke against blue steel night sky. She uses her beret and scarf as a pillow. She closes her eyes. OMITTED 10   10 EXT. OCCAM RD - NIGHT 10A   10A BUS drives by a huge clock and plaque that reads: OCCAM AEROSPACE RESEARCH CENTER. The time: 11:55 EXT. 1284 OCCAM RD. BUILDING - NIGHT 11   11 A SQUARE, SQUAT concrete structure. Employees rush towards the building. ELISA climbs out of the bus- walks in. THRONGS OF WORKERS walk out- OMITTED 12   12 6",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 206
    },
    {
      "scene_number": 3,
      "slugline": "INT. ELEVATOR - NIGHT 12A   12A Elisa in an elevator- goes down, down, down until it opens into: Her watch: 11:58 INT. HERDING AREA - NIGHT 13   13 WORKERS are moving out. A GOLF CART arrives with MP’s Elisa runs and barely makes it. Yolanda, a Latin girl, protests. A PUNCH CLOCKS, Standing in line we see ZELDA, a plump African American woman in her 30’s. She signals Elisa to get in. Elisa runs and barely makes it. Yolanda a Latin girl, protests. YOLANDA Hey- watch it, Dummy!! ZELDA Leave her alone, Woman. I was keeping her place. YOLANDA I get reported- I come looking for you and the mute... ZELDA You do that, Yolanda. You do that. Elisa checks in- CLACK!! 12:00 PM CUT TO: INT. LOCKER ROOM - SAME 14   14 Elisa, Zelda and others get dressed in their JANITORIAL and KITCHEN / SERVICE garments. Change their shoes to low-heeled ones. All around them: Propaganda posters: “Loose Lips Sink Ships” etc 7",
      "characters": [],
      "action_text": "ZELDA My feet are killin’ me already- We ain’t started and my feet are already killin’ me- OMITTED 15   15 INT. LONG CORRIDOR 15A   15A 6 cleaning ladies walk down the corridor in 2 lines of 3. They split off and walk into the adjacent labs. Behind them Elisa and Zelda follow and continue down the corridor. INT. LONG CORRIDOR (GREEN SCREEN, NOT TRANSLIGHT) 16   16 ZELDA I wear ‘em low-heeled shoes and it hurts just the same. My toes get all bunched up- and I feel like dyin’. Lord. Zelda and Elisa push into a long corridor full of SLAUGHTERHOUSE-STYLE DOORS, each bearing a number and a letter (B-67, C-25, etc). A GROUP OF SCIENTISTS walks alongside a MAN IN A CANVAS ASTRONAUT SUIT. They carry a multitude of canvas DUCTS extruding from it. About a DOZEN MP's guard the corridor. INT. JET ENGINE LAB - SAME 17   17 Elisa removing a piece of chewing gum. Zelda empties a WASTE BASKET. ZELDA Made Brewster pigs in a blanket tonight before leavin’. Fresh dough- the good sausages- thick- and Boy, he just ate ‘em up. (beat) No thank-yous- no yum-yums- not a peep, tho- Man is silent as the grave. But if farts were flattery, honey- he would be Shakespeare- 8",
      "dialogue_count": 0,
      "word_count": 376
    },
    {
      "scene_number": 4,
      "slugline": "INT. COMMAND CENTER - SAME 17A   17A Zelda and Elisa empty waste baskets. ZELDA Then I get home and I make him breakfast. Bacon and eggs and buttered toast. I butter the man’s toast, Elisa. Both sides- As if he were a child... And I don’t get a “Thank You” INT. LAB - SAME 18   18 Zelda picks up a waste basket and a few pieces of paper- ZELDA Hey- Lou- Lou! You boys mind throwing the trash in the bin? That’s what it’s for... A BESPECTACLED MAN (Dr. BOB HOFFSTETLER) measures the temperature of the water with a long, industrial thermometer. He eyes Zelda. ZELDA (CONT'D) Yes. That’s what it’s for... Hard to believe, uh? LOU Alright.   Alright. Sorry Zelda. Elisa and Zelda mop and sweep around a group of workers readying a big Filter/storage TANK of massive proportions next to a tiled HOLDING POOL. Roughly 20 men working at the same time. Fleming supervises the entire operation. The WORKERS are making a mess. Elisa signs Zelda. ZELDA I don’t know Honey. I don’t know what they’re doing. (purposefully loud) Mostly making a Goddam mess is what I’d say... Hoffstetler whispers in Fleming’s ear. 9",
      "characters": [],
      "action_text": "FLEMING (dabs his nose) Zelda, please- Watch the volume. And, there’s no call for the blaspheme, please- ZELDA Yessir, sorry, Mr. Fleming, Sir- FLEMING (claps his hands) A moment of your time- Today, we will be receiving a new team and asset here in T-4. This here is Dr. Robert Hoffstetler... Zelda and Elisa look at each other. FLEMING (CONT’D) I don’t want to bolster - or overstate the matter- (proud laughter) -but this may be the most sensitive asset ever to be housed in this facility... Hoffstetler looks at Elisa. Everybody suddenly turns to attention. The sliding steel door opens and MP’s pour in- Fleming thumbs them out. The door slowly slides opens and- Zelda and Elisa pick up their carts and- as they exit- -they see a group of SPECIALISTS wheel a MASSIVE STEEL CYLINDER into the room. It’s twice the size of an iron lung and more elaborate. It is escorted by 4 MP's, and a square-jawed, steely-eyed man dressed in a black, immaculate suit and tie: RICHARD STRICKLAND, 30’s. In his right hand: an electric CATTLE PROD. The CYLINDER SHAKES!! SOMETHING LARGE MOVES INSIDE!! IT HOWLS!! A WEBBED HAND slams against the glass!!! A WEBBED PALM HITS THE GLASS!! Elisa jumps, startled. HOFFSTETLER (to Fleming) They have to leave- 10 FLEMING Yes- yes- HOFFSTETLER You: help me move the cylinder into the compressor! There! They exit. Elisa sees a large form moving in the tank as they- -close the door. DISSOLVE TO: INT. MEN’S BATHROOM - NIGHT 19   19 ZELDA Will you look at this? Elisa removes dirty towels from the multiple towel racks and puts on fresh ones. Zelda points to the urinals. ZELDA (CONT’D) Look- Some of the best minds in our country- peeing all over the floor in this here facility. (beat) There's pee freckles on the ceiling!! How do they get it up there? ZELDA resumes mopping the checkered floor. ZELDA (CONT’D) Just how big a target do they need, you figure? They get enough practice that’s for sure. My Brewster, no one ever called him a great mind, even he hits the can",
      "dialogue_count": 0,
      "word_count": 930
    },
    {
      "scene_number": 5,
      "slugline": "INT. BUS - DAWN 19C   19C Elisa leans her head on the window. Dawn bathes her. The light grows and grows- cleansing and magical. DISSOLVE TO: EXT. STREETS OF BALTIMORE - EARLY MORNING 20   20 Busy streets. A VAN Pulls up- Out climb Giles and Elisa. GILES Yeah. I’m wearing the hair. Watch out for that car... Giles straightens his toupee (now on his head) Elisa signs. GILES (CONT'D) Does it look good? They cross the street towards “DIXIE DOUG PIES.” CUT TO: INT. “DIXIE DOUG PIES” DINER - DAY 21   21 Giles and Elisa stand before a glass and Stainless-steel, PIE VENDING COLUMN/DISPLAY. GILES It was eternal, see? Tantalus never even achieved the escape of death. The fruit on the branches was always just out of reach... His gaze drifts subtly to the PIE GUY at the register. He’s manly, masculine, like a construction worker. With pie. PIE GUY (O.S.) Thank yeew. Y’all come back, y’heah? Elisa watches Giles watching the guy, his glances filled with longing. GILES ...the water in the stream always receded just when he stooped to drink. And that's why we say things like, look at those tantalizing pies— (Elisa signs) (MORE) 14",
      "characters": [],
      "action_text": "I don’t like the colors either, but they taste alright. Try it. My treat. You want cold milk? At the COUNTER: PIE GUY Welcome to Dixie Doug’s, folks. That’ll be all? GILES For the moment. PIE GUY Hey- I’ve seen you in here before, right? GILES Oh, well- I- yes- I’ve been here. A couple of times as a matter of fact. PIE GUY Partial to key lime pie? GILES A craving I indulge in. It cannot possibly be good for me. Nothing I like is... PIE GUY Oh, no- It’s a mighty fine pie, key lime. GILES And the color is so vivid!! PIE GUY Vivid! Now, there’s a word I- there’s a word for ya... GILES A vivid word! It most certainly is. Elisa rolls her eyes. GILES (CONT'D) And would you be the famous “Dixie Doug” himself? PIE GUY Heck, no. Pies are trucked down throughout the country. It's called “franchising”, see? GILES (CONT'D) (MORE) 15 There’s thirty-two Dixie Doug’s all over the country. He indicates the illuminated glass column that rotates to display the pies. He shrugs. PIE GUY (CONT’D) They give us the spinners, the signage- That there’s “Pie Boy” our mascot. They tell us what we gotta say— What to wear and such— there's a manual lays it all out. They figured out what people like, scientifically. I don't really talk that way, I'm from Ottawa. GILES You had me completely fooled. (beat) “That’s-a-great-a-pie...” The Little guy is Italian is he?! PIE GUY I guess so- GILES How clever! He watches Pie Guy pack them up, admiring his muscular arms. Finished, Pie Guy looks up smiling. PIE GUY Well, Thank yewww. Y'all come back now, y'heah? EXT. GILES’ APARTMENT - DAY 22   22 They eat their pie and watch NAME THAT PRICE (or any morn/noon game show). Cats beg for pie. GILES “Y’all come back” Do you think he meant it? He had noticed me- you heard that yourself. Elisa rolls her eyes. Stops eating. GILES (CONT’D) Well, this pie is rather sordid, but- Don’t spit it out- We could try a different flavor next time. PIE GUY (CONT'D) 16 Elisa hands him the half-eaten pie and wipes her green tong",
      "dialogue_count": 0,
      "word_count": 2302
    },
    {
      "scene_number": 6,
      "slugline": "INT. STRICKLAND’S OFFICE - NIGHT 35   35 STRICKLAND’S sitting down in his office (his fingers covered by clean bandages with a stain of blood and iodine)- he looks pale and pissed. Behind him: a bank of security monitors. STRICKLAND (reads a file) Zelda D. Fuller. How long have you two known each other, Zelda? ZELDA About Ten years, Sir. STRICKLAND No siblings, Zelda? ZELDA No, Sir... STRICKLAND That’s not common, is it? For your people? ZELDA Momma died after me- After I was born. STRICKLAND What does the “D” stand for? Elisa and Zelda sit in front of him, like girls at the principal’s office. ZELDA My “D”? Delilah, Sir- on account of the bible. STRICKLAND Dee-Li-lah. . . ZELDA Beg your pardon? Strickland takes a HARD GREEN CANDY from a plastic bag. Sucks on it. STRICKLAND Delilah- she betrays Samson- Lulls him to sleep, cuts his hair- Philistines torture him, humiliate him- burn his eyes out. Turned him into a   thing-  26",
      "characters": [],
      "action_text": "ZELDA Guess my momma didn’t read the good book close enough.. STRICKLAND And you- (reads Elisa’s file) Elisa... Elisa Esposito. Doesn’t Esposito means “Orphan”? She nods. STRICKLAND (CONT’D) (reads file) Our Lady of Sorrows Orphanage in Putnam... Putnam? ZELDA They found her- by the river- in the water... STRICKLAND That what they told you, uh? Elisa nods. STRICKLAND (CONT’D) It was you that found my fingers? She nods. Hands him back his ring. Puts it on the other hand. STRICKLAND (CONT’D) Three hours in surgery - They rebuilt the first phalanx- here- sutured the tendons. Don’t know if it’s going to take- (beat) There was mustard on them. (beat) A paper bag. Best you could do? ZELDA It’s all we had... (beat) I answer mostly, on account that she can’t talk. Long pause. STRICKLAND What do you mean she can’t talk? ZELDA She can’t. 27 STRICKLAND She can’t? Is she deaf? Elisa signs ZELDA Mute, sir. STRICKLAND’s ears prick up. He is suddenly interested- animated. STRICKLAND Mute. (points at scars) That what did it? Cut your voice box? Elisa signs. Zelda translates: ZELDA She sez: Since she was a baby... STRICKLAND Who would do that to a baby? This world is sinful. Wouldn't you say, Dee-li-lah (beat) Well- lemme say this upfront. He arranges the symmetry of his desk implements. STRICKLAND (CONT'D) You clean that lab. You get out. Arranges the pens- turns towards Elisa. STRICKLAND (CONT’D) The thing we keep in there, is an affront. Do you know what an affront is, Zelda? ZELDA Something offensive, Sir. STRICKLAND That’s right- That’s right- And I should know. (beat) I’ve dragged that filthy thing- out of the river muck in South America and all the way here- (beat) And along the way we didn’t get to like each other much. 28 He takes two- three pain pills... STRICKLAND (CONT’D) You may think that thing looks human- Stands on two legs, but- we’re created in the Lord’s image. And you don’t think that’s what the Lord looks like, do you? ZELDA I wouldn’t know, Sir. What the Lord l",
      "dialogue_count": 0,
      "word_count": 1779
    },
    {
      "scene_number": 7,
      "slugline": "INT. KITCHEN - DAY 55   55 Waiters come in an out of a busy kitchen. Sitting in front of a HUGE LOBSTER TANK: LEO MIHALKOV, a severe man with slow, deliberate speech (in Russian with subtitles) drinks vodka and smokes. Hoffstetler & BURLY RUSSIAN enter. MIHALKOV “Bob.”   How are you?  The group laughs. Not Hoffstetler. He responds in flat but fluent, unaccented Russian. HOFFSTETLER  I was sitting like a moron on a concrete block in the middle of nowhere for an hour. I took three taxis to get there. Again.  (looks at Burly)  Why can’t we just meet here? It’s the same restaurant every time!!  MIHALKOV  I could change my mind.  HOFFSTETLER  But you don’t.  MIHALKOV  But I could-  (pours a drink)  So- Tell us,   “Bob”- HOFFSTETLER  Dimitri, Comrade- Not   “Bob.”   Who names himself with one syllable?  Dimitri/Hoffstetler offers him his notebook: in it diagrams and anatomical notes. Hoffstetler hands him the Blueprints. MIHALKOV  What is this, Dimitri? Sit- Sit-  HOFFSTETLER  Anatomical notes- and- Layout of the laboratory where the asset is being studied. Everything we need for the extraction.  36",
      "characters": [],
      "action_text": "MIHALKOV  I will pass it on to the directorate.  Mihalkov opens a bottle of vodka. Pours. MIHALKOV (CONT’D)  Distilled four times- arrives by diplomatic valise. Minsk. Isn’t that your hometown?  HOFFSTETLER  We must do it as soon as possible- (beat) This creature, Mihalkov- I think it may be able to communicate.  MIHALKOV  Communicate.  HOFFSTETLER  With us. I have reason to believe it is   intelligent. It- it responds to language- to music... (beat) Will you please pass that up also?  MIHALKOV  I will.  A WAITER brings three plates of steaming lobster tails and a filet mignon and a pot of butter. The Burly Russian eats. MIHALKOV (CONT’D) Now- eat, Dimitri. They call this “Surf-” BURLY RUSSIAN “...and Turf”. MIHALKOV “Surf and Turf” A feast. They boil the lobsters right here. They squeak a little but they are so soft and sweet. KISSING MY BABY GOODBYE by Jon Erik Kellso starts. OMITTED 55aA   55aA 37",
      "dialogue_count": 0,
      "word_count": 335
    },
    {
      "scene_number": 8,
      "slugline": "INT. HERDING AREA - NIGHT 55A   55A Elisa checks her time card. Strickland- calmly smoking a cigarette-   watches her. She sneaks an uncomfortable glance. He smiles. She moves away. OMITTED 56   56 INT. LAUNDRY AREA - NIGHT 56A   56A ELISA and ZELDA sort the towels, lab coats and dirty linens into thin, tall laundry carts. YOLANDA and 3 OTHERS do as much. Elisa fills up itemized sheets- tears them up and puts them in the bags. INT. LOADING DOCK - NIGHT 57   57 -Loading Dock where there is a LAUNDRY TRUCK. They load the soiled sheets and towels. Nearby- A couple of African American and Latin workers are smoking. A cafeteria worker (Duane) offers a drag- DUANE Hey, Zelda, want a smoke? ZELDA That shit’s not good for you, Duane. DUANE Feels good. ZELDA It does, doesn’t it? She looks at Elisa. ZELDA (CONT’D) C’mon Elisa, just one. Elisa shakes her head, looks at a VIDEO CAMERA above them. DUANE They can’t see us, they push that camera up at break time. With the broom- 38",
      "characters": [],
      "action_text": "Lou points at a dirty broom. LOU This here’s a blind spot. DUANE Hey, Elisa, how come you always taking all them boiled eggs at the cafeteria? Can’t nobody eat seven eggs a day. ZELDA Mind your own, Duane. Leave her alone. DUANE Girl can’t speak but she sure can eat. INT. LONG CORRIDOR - NIGHT 58   58 Elisa pushes her cart down the corridor. INT. LAB - NIGHT 59   59 Elisa enters the lab with her cart and equipment. Closes behind her- hears a plaintive whimper- not unlike that of a whale. Much to her surprise- The Amphibian Man is on a plinth. Chained to a large METAL PLATE ON THE FLOOR. Chains on his neck and arms, force him to kneel. He looks at her. She looks around: Surgical instruments are ready. Lights are centered on the creature. The creature howls in pain- gasping. Elisa drops her lunch bag- -an egg rolls out- She moves closer- tries to free him when- CLACK! The DOOR begins to OPEN. She picks up her stuff and hides. Strickland ENTERS. Removes his jacket. Pops a few sticks of gum in his mouth. Pulls out the cattle prod. The creature howls for help. Strickland raises the cattleprod. 39 STRICKLAND Miss me? I took a candy break. This? Is it this that scares you? You should be used to it by now... He shocks the creature. STRICKLAND (CONT’D) There you are again. Making that god-awful sound. Is that you crying? Is that what it is? You hurting? Huh? Or maybe you’re angry? Yeah. Maybe you’d like to get another bite at me. Elisa watches him go over to the plinth, staring down the creature. The creature’s fins “fluff up” and change colors. It hisses. Strickland sucks his candy and cattleprods it- makes it go wild. STRICKLAND (CONT’D) I can’t tell- Are you begging? ‘Cause to me it’s just the worst fucking noise I’ve ever heard. Elisa’s horrified to realize she left one of the BOILED EGGS out. It’s inches from Strickland’s foot. He kicks it. It rolls. Strickland picks up the egg. Looks around. Elisa hides, she can barely breathe. CUT TO: INT. CORRIDOR “B” - SAME 60   60 ",
      "dialogue_count": 0,
      "word_count": 584
    },
    {
      "scene_number": 9,
      "slugline": "INT. LAB - SAME 61   61 Strickland walks towards the bank of medical monitors. Elisa tenses. The door opens. Hoffstetler et al, enter. STRICKLAND General Hoyt! Welcome, Sir! Everything’s ready. Good to have you here, Sir! Technicians pour in. Elisa hides. GENERAL HOYT Good God. Is that it? (matter of fact) Much bigger than I pictured. STRICKLAND Ain’t that something? Ugly as sin. The natives in the Amazon worshipped it- GENERAL HOYT Well- It sure doesn’t look like much of a God right now, does it? Strickland takes a pill or two. Hoffstetler Examines the creature: BLOOD in his hands. STRICKLAND They were primitives, sir. Tossed offerings into the water; flowers, fruits, crap like that... Tried to stop the oil drill with bows and arrows. That didn’t end too well. HOFFSTETLER What happened? He's bleeding. You cannot keep doing this- STRICKLAND It’s an animal, Hoffstetler. Just keeping it tame. Elisa watches from her hiding place. GENERAL HOYT (flips through folder) “Oxygen osmosis- dioxide exchange.” What are we lookin’ at here, Son? 41",
      "characters": [],
      "action_text": "HOFFSTETLER This creature, Sir- I’ve never seen anything like like it. Ever. It can alternate between two entirely separate breathing mechanisms... STRICKLAND Mudskipper can do that. HOFFSTETLER You want to put a man in space for days,   weeks even, he’s going to have to endure conditions the human body just wasn’t made for. But this- This means long-term survivability in space.   This gives us an edge against the Soviets.  GENERAL HOYT How long can it breathe outside the water? STRICKLAND shows him a CHRONOMETER. Ticking. STRICKLAND Really- Thirty minute intervals. It’s been out now, about... twenty eight- so we should start to see the effects. They wait. The creature suffers. STRICKLAND (CONT’D) Reality, is, Sir- We don’t know jackshit about this thing- GENERAL HOYT Soviets want it- We know that much. Those cockeyed bastards- They send a dog up into space- We get a laugh. But next thing we know- they send a   human   up -- a Ruskie, orbiting our planet, doing God knows what? And then who’s laughing? Krushchev. That’s who- We let him put a dog in space, he laughs, puts a commie in space, he laughs, puts missiles in Cuba. Have we learned nothing? STRICKLAND Give'm a dog, they take Cuba. 42 GENERAL HOYT You got that right. They laugh. The creature spasms in pain. HOFFSTETLER Sir. I would advise- They watch as the creature struggles to breathe. HOFFSTETLER (CONT’D) We need to get him back in the water-- STRICKLAND Let us go over the mark for once, See where it takes us. The creature starts convulsing. Elisa steps out from behind the monitors, ready to act. Hoffstetler sees her. His eyes stop her. Strickland waits: looks at the chronometer. STRICKLAND (CONT’D) Scientists- they are like artists: They fall in love with their playthings. He looks right at the creature, who’s gasping, in agony. The second hand on the chronometer crosses the minute mark. STRICKLAND (CONT’D) Now- Over here, Sir- right here- you see? (mirror signals his ribcage) The creature has a thick joint",
      "dialogue_count": 0,
      "word_count": 2432
    },
    {
      "scene_number": 10,
      "slugline": "INT. CADILLAC DEALERSHIP - DUSK 78   78 STRICKLAND is admiring a beautiful Cadi 1962 Coupe: All Fins. Jet tail lights. Sleek metal body. DEALER Cadillac DeVille. Best car ever made. V8, 390 CID, clean, crisp like a fresh dollar bill. Climb right in- STRICKLAND I am just idling around. The Dealer (blue suit, blue tie) opens the door using a blue handkerchief. DEALER AM/FM stereo sound, Air conditioner, power windows, power breaks, power steering, power seats... (beat) All deluxe interior appointment choices. 143 options. The Taj-Mahal on wheels. STRICKLAND I’m not sure about the green. DEALER Oh, no. Not green, my friend. (beat) Teal. STRICKLAND Well, Teal looks green to me. DEALER But it isn’t, see? It’s a limited edition. Twelve coats of paint. Polished by hand. All authentic chrome detailing. Four out of five successful men in America drive a Cadillac. STRICKLAND That a fact? DEALER This here is the future. And you strike me as a man who is heading there. 55",
      "characters": [],
      "action_text": "STRICKLAND Where? DEALER Why- The Future. You are the man of the future. (beat) You belong in this car. Strickland climbs in. CHICA CHICA BOOM starts in the soundtrack. CUT TO: MONTAGE 78A   78A -STRICKLAND drives his brand new car. He smiles. Other Cars honk at him. -Drivers give him the “thumbs up” -He is in a dream. -ELISA AND ZELDA MOP THE CORRIDOR. 78AB   78AB OMITTED 78B   78B -STRICKLAND ENTERS THE COMPLEX. GOES BY THE GUARD SHACK. 78C   78C -VIEW FROM CARGO AREA IN CINEMA. IN THE BACK ALLEY GILES LAYS 78CaA   78CaA A STENCIL TO LETTER THE SIDE OF THE VAN: LAUNDRY. BY HIS SIDE: THE LAUNDRY SHEET WITH THE LOGO. He lays the paint. - STRICKLAND PARKS HIS CAR. 78CA   78CA OMITTED 78CC   78CC - GILES PULLS THE STENCIL AND ADMIRES HIS HANDIWORK. 78CD   78CD 56 - STRICKLAND CLEANS A SMALL SPOT ON THE FIN. 78CE   78CE He crosses the parking lot, like a king- -and goes by the smoking employees. -ELISA LOADS TOWELS INTO A LAUNDRY VAN. 78D   78D OMITTED 78DD   78DD OMITTED 78E   78E INT. LAB - NIGHT 78F   78F Elisa empties a paper basket. In the B.G. Hoffstetler and other SCIENTISTS monitor the creature on the gurney. Elisa approaches a small door in the far side of the lab- marked SERVICE CORRIDOR. Hoffstetler watches her surreptitiously. INT. NARROW CORRIDOR - NIGHT 79   79 -Elisa peeks at the narrow service corridor. Walks through it. Emerges into- INT. LOADING DOCK - NIGHT 79AA   79AA - the loading dock... INT. LOADING DOCK - SAME 79A   79A ZELDA smokes her cigarette with the gang. She watches as Elisa enters the dock and looks at the VIDEO CAMERA. INT. GILES APARTMENT - DAY 80   80 The music carries on. On TV, Carmen Miranda dances. GILES So I will drive down the loading dock- at exactly 05:00 am. (beat) (MORE) 57 Shifts are changing, yes- So we have... Elisa signs: “FIVE” GILES (CONT'D) ...five minutes... Five A.M. Five, five. Give me your watch. You’ll move the camera... We’ll synchronize our watches. Just like the movies. (beat) I’m so proud of you. You’re not a",
      "dialogue_count": 0,
      "word_count": 1011
    },
    {
      "scene_number": 11,
      "slugline": "INT. COMMAND CENTER - NIGHT 88   88 Hoffstetler marches towards Strickland’s office. INT. STRICKLAND’S OFFICE - SAME 89   89 HOFFSTETLER We need to delay the procedure. Strickland is reading a book by Norman Vincent Peale. STRICKLAND Knock first. HOFFSTETLER What? STRICKLAND Knock before entering my office. HOFFSTETLER This is urgent- STRICKLAND Go back out. Knock. Then I’ll let you in and we’ll talk. That’s the protocol. Follow the protocol. In spite of himself, Hoffstetler obeys. Knocks. STRICKLAND (CONT'D) Come in. Hoffstetler enters. He is about to talk when- STRICKLAND (CONT’D) Will you get the door for me? Hoffstetler closes the door. STRICKLAND (CONT’D) See? That is the way. Now- Now we can talk. HOFFSTETLER I need more time. STRICKLAND No. HOFFSTETLER We shouldn’t kill this creature... 61",
      "characters": [],
      "action_text": "STRICKLAND Look- Don't let the fact that you feel like a loser now, that your competitive tendencies have been engaged— HOFFSTETLER I'm not competitive! I don't want an intricate, beautiful thing destroyed. STRICKLAND Don’t let that cloud your judgement- HOFFSTETLER You're like a child with a transistor radio, you think if you smash it open you can look at the inside, see how it works. But you can't. It's smashed. It doesn’t work. You kill the music. STRICKLAND Bob- I don't hear you. Music? That thing dies. You learn. I leave. Out of here. Settle down. My family settles down. Somewhere. Nicer. Real. A real city. HOFFSTETLER This creature- and I am certain of this- Is intelligent. Capable of language, of understanding- emotions. Long beat. Minuscule shrug and then: STRICKLAND So are the Soviets, the Gooks-   and we still kill them, don’t we? Bottom line is, this is not a petting zoo- And I don't want to be in this shithole any longer than I need. Do you? Hoffstetler sees the camera MOVE on the loading docks. Strickland remains unaware. STRICKLAND (CONT’D) Do you? HOFFSTETLER No, Sir, I don’t. 62 STRICKLAND A-ha- So I made it so we both win. You can thank me later. SING, SING, SING by Benny Goodman starts OMITTED 90   90 INT. LOADING DOCK - SAME 91   91 Hoffstetler sees the broom and the camera. He gets it. He hurries- OMITTED 92-93   92-93 INT. LAUNDRY AREA - SAME 93A   93A Elisa packs a laundry cart with wet towels. INT. HERDING AREA - DAY 93B   93B End of shift. Throngs of WORKERS heading out. Everybody else is punching in. Zelda looks around. YOLANDA Hey- what are you waiting for? ZELDA Have you seen Elisa? Yolanda rolls her eyes. The elevator starts beeping. Zelda signals her to “go.” She looks at the “OUT” cards-   Elisa’s still in. She punches it and- -heads back into the complex. OMITTED 93C   93C OMITTED 94   94 63",
      "dialogue_count": 0,
      "word_count": 453
    },
    {
      "scene_number": 12,
      "slugline": "INT. LAB - SAME 95   95 Elisa- with the laundry cart- approaches the holding pool. Quietly. The Amphibian Man is half in, half out. When it sees her, it retreats. Scared. She removes her shoes- enters the water. The Amphibian Man raises its head above water, looking at Elisa with huge, pained eyes. He hates mankind, but not her. He approaches her. Hoffstetler quietly enters the room. HOFFSTETLER Did you move the camera? On the loading dock? Elisa turns and spots him: Caught! She freezes. He holds up a hand-- HOFFSTETLER (CONT’D) Is that where you are taking him? Through the service tunnels? (beat) That’s very smart- Stunned, she nods. He hands her the keys to the manacles and iron collar. HOFFSTETLER (CONT’D) Who do you work for? (beat) Please tell me you’re not doing this alone. Elisa shakes her head: “No.” He pulls out a set of skeleton keys and drops them. HOFFSTETLER (CONT’D) Good. Listen to me- there are certain things you need to know... OMITTED 96   96 OMITTED 97   97 64",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 175
    },
    {
      "scene_number": 13,
      "slugline": "INT. LAB - SAME 98   98 Hoffstetler helps Elisa get the creature in the cart. HOFFSTETLER Water must be kept at seventy-five to eighty-five percent salinity. Hands her a bottle of pills and a few scientific measuring trinkets. HOFFSTETLER (CONT'D) His water must be kept at seventy- five to eighty-five percent salinity. Mix one of these in- every three days- Raw protein diet is a must. (Beat) In five minutes- I'll meet you at the loading dock- The lights will go out, so be prepared... She opens a side door and enters- INT. NARROW CORRIDOR - SAME 98A   98A The narrow service corridor. She pushes the cart. Fast. POV: Her watch: 4:57 AM INT. CORRIDOR “B” 98B   98B Hoffstetler exits the lab- cautiously. Then runs down the length of the corridor. INT. STRICKLAND’S OFFICE - SAME 99   99 Strickland turns to the monitors and sees Hoffstetler running down the corridor. He frowns but gets distracted by- FLEMING Sir, you need to sign this week’s release forms... Offers him a pen. 65",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 172
    },
    {
      "scene_number": 14,
      "slugline": "INT. UTILITY INCLINED HALLWAY - SAME 99A   99A Hoffstetler pulls out the “popper” and sets it for THREE MINUTES He attaches it magnetically to the MAIN FUSE BOX. He- -STARTS IT. tic-tac-tic-tac- EXT./INT. RAMP SECURITY BOOTH, LOADING DOCKS - SAME 100   100 Giles pulls up in the van. The Guard (eating soup) steps out. GUARD This is a restricted entrance, sir. GILES Laundry pick-up. GUARD Turn on the light- Giles obeys, turns on the interior light in the van. GUARD (CONT’D) You don’t look like laundry. GILES Thank You. GUARD Have your pass? Giles produces his forged ID. INT. CORRIDOR - SAME 101   101 Hoffstetler- moves. Syringe ready in his hand. INT. INCLINED UTILITY HALLWAY - SAME 102   102 The “popper” counts down... INT. STRICKLAND’S OFFICE - SAME 103   103 Strickland reviews the monitors. Sees the van next to the Security Booth. Concerned. STRICKLAND Who’s that? What’s that van? 66",
      "characters": [],
      "action_text": "Gives him back the pen. FLEMING Gosh- I don’t know, Sir- A laundry truck? Strickland grabs the phone. Dials OMITTED 104   104 EXT./INT. RAMP SECURITY BOOTH, LOADING DOCKS - SAME 105   105 GUARD Michael Parker. Is that you? GILES I am indeed. Michael Parker. Fifty seven just as it says right there. He discreetly coiffes his hair. The phone rings. As the Guard examines the pass- The age number looks odd. He smudges it: 57 reveals 51. GUARD Step out of the vehicle, sir. GILES Oh, dear- I am not good at this- The Guard pulls out his gun. GUARD Out of the vehicle. Now. GILES Would you have believed fifty- three? GUARD I will not say it again- Out. Now. INT. STRICKLAND’S OFFICE - SAME 105A   105A Strickland hangs up- grabs his cattle prod- exits- OMITTED 106-108   106-108 67",
      "dialogue_count": 0,
      "word_count": 291
    },
    {
      "scene_number": 15,
      "slugline": "INT. COMMAND CENTER 109   109 Strickland Signals to 2 MP’s. Fleming trails. STRICKLAND Follow me. INT. LOADING DOCK - SAME 110   110 Elisa emerges from the lab, pushing the laundry basket into the loading dock. ZELDA (O.S.) Elisa! She freezes, turning to see Zelda in the corridor. ZELDA (CONT’D) Are you out of your mind?!! INT. INCLINED UTILITY HALLWAY - SAME 110A   110A The “popper” counting down. EXT. SECURITY BOOTH, LOADING DOCKS - SAME 111   111 The Guard cocks his gun. GUARD Get out. Now! Giles struggles with the belt. GILES I swear I’m not doing this on purpose. Actually, mechanical objects and I- Suddenly (while Giles is turned around), Hoffstetler pops out from behind and plunges the syringe into the Guard’s neck. He falls down and out of sight. HOFFSTETLER Go! Now! GILES Who the--?? HOFFSTETLER She’s waiting for you at the dock! Go! Now! 68",
      "characters": [],
      "action_text": "The van enters the complex. Hoffstetler pulls the Guard into the shack. INT. CORRIDOR “B” - SAME 111A   111A Strickland overtakes the corridor and enters- INT. THE LAB - SAME 111B   111B Strickland stands there. The creature is gone. He sees the SKELETON KEYS on the floor. STRICKLAND (to Fleming) The laundry Van- OMITTED 111C   111C INT. NARROW UTILITY HALLWAY - SAME 111D   111D 3... 2... 1... POP!!! It CLICKS open and emits a strong discharge. Melts the fuse box with a spark. OMITTED 111E   111E INT. CORRIDOR 111F   111F Emergency lighting in the corridor. Strickland leads Fleming and the MP’s out of the lab and run down the corridor. INT. LOADING DOCK - SAME 112   112 Van pulls up. They push the cart- together- towards the rear doors. Zelda opens the door, Giles comes out. Zelda and Elisa remove towels from the cart. Hoffstetler assists. GILES Elisa. Wha- who is this man? He had a needle and... Elisa signs. 69 GILES (CONT’D) He’s with us? INT. VAN CABIN 113   113 Looks at Elisa: The Amphibian Man is uncovered. GILES Oh, God-   He is so beautiful! Zelda moves the laundry hamper out of the way. Elisa and the Amphibian Man go into the van as Giles gets in the driver’s seat. GILES   (2) (CONT’D) Are we ready?   Are we ready? Hoffstetler closes the rear doors as the van pulls away. He and Zelda move off. INT. LOADING DOCK - SAME 114   114 The Van smashes against the Teal Cadillac. BAMMM!! It locks on the bumper. OMITTED 115-116   115-116 INT. LOADING DOCK 117   117 The Van is stuck on the bumper. It further smashes the Cadillac. GILES Did I do that? Are you okay? Finally, It rips it off. - the bumper tumbles away. Strickland and the MP’s rush into the docks. Strickland shoots after the van. He stops. The lights come back on as the van speeds away- FLEMING Guns down. We need to re-assess. Let him work. Let him do his thing. 70 Strickland looks at his smashed Cadillac. STRICKLAND Teal... OMITTED 118   118 OMITTED 119   119 EXT. BALTIMORE HIGHWAY - SAME 120   120 The van ",
      "dialogue_count": 0,
      "word_count": 1116
    },
    {
      "scene_number": 16,
      "slugline": "INT. ELEVATOR - NIGHT 135A   135A ZELDA That’s good, you keep that up. Elisa signs, what? ZELDA (CONT’D) ( sotto ) Looking like you don’t know anything. Lord help me if they ask me if I do. I am not a good liar-- (beat) Except to Brewster. Takes a lot of lies to keep a marriage going... INT. HERDING AREA - NIGHT 136   136 Elisa and Zelda check in. MP’s watch everyone coming in and out. Behind the central glass window Strickland argues, agitated with Fleming. INT. COMMAND CENTER - SAME 137   137 FLEMING If you’ll allow me, sir? In my opinion, we are looking at a highly- trained group, Sir. Behind the glass, in the corridor: the employees punch in their cards. Amongst them: Zelda and Elisa. FLEMING (CONT’D) I’m thinking- Conceivably- Sir- Special Forces and so on and so forth. STRICKLAND Red Army Special forces? FLEMING Conceivably. Fleming nods, solemn. Dabs his runny snot. FLEMING (CONT’D) A highly-trained, well-financed, elite group. (MORE) 75",
      "characters": [],
      "action_text": "Infiltration took less than five minutes, Sir. Highly efficient. Fearless precision He looks out. Elisa meets his eyes. He smiles. She turns away. STRICKLAND It’s a theory. Run with it. FLEMING Yes, Sir. You won’t regret it. CUT TO: INT. GILES APARTMENT - NIGHT 137A   137A Giles pushes away his commercial paintings and pulls out a large portfolio- Full of male nudes. He takes a large sketch pad. INT. GILES APARTMENT - MOMENTS LATER 137AB   137AB Giles places a blank paper on his easel.   He sketches the Amphibian Man. INT. BATHROOM - NIGHT 137B   137B Giles sits on a small chair by the tub. Sketching the Amphibian man. GILES You are not the anomaly, are you? (beat) We are. We are what happened to you- did we not? He sketches the fish man’s eyes. GILES (CONT’D) Were you always alone? Did you ever have someone? (beat) Do you know what happened to you? (beat) ‘Cause I don’t. (beat) I swear I don’t- I look in the mirror and all I recognize are my eyes- in the face of this old man. FLEMING (CONT’D) 76 Points at himself. GILES (CONT'D) Seems like I was born both too early or too late for my life... Sits by the creature’s side. GILES (CONT’D) Maybe we’re both relics. The Amphibian Man blinks. OMITTED 138-148   138-148 INT. STRICKLAND’S OFFICE - NIGHT 149   149 Strickland stands outside his office- contemplating. Rolls up his sleeves. Video images- rewinding. Strickland, watching, numb with boredom. STRICKLAND 4:10, 4:20, 4:30 SALLY Sir, General Hoyt is on the phone. He signals her to go away. STRICKLAND I know Sally. I will call him back. 4:40. Just then, he sees something on the tape -- Hoffstetler. He freezes on Hoffstetler. He writes down the time: 4:40 am. STRICKLAND (CONT’D) 4:50... 4:50 again. Rewinds all tapes to that time. The camera on the dock moves. He toggles between two moments on the same camera: Sees that someone moved it. Clearly. 77",
      "dialogue_count": 0,
      "word_count": 494
    },
    {
      "scene_number": 17,
      "slugline": "EXT. LOADING DOCK - NIGHT 150   150 LAUNDRY is being loaded. Strickland notices a couple of WORKERS (including DUANE and LOU) smoking under the camera, goes over to them. STRICKLAND You- They hurriedly stub out their cigarettes. STRICKLAND (CONT’D) You smoke out here. Because the camera doesn’t catch it. Worker one gives worker two a look. STRICKLAND (CONT’D) Do you move it- the camera? One of them reluctantly nods. STRICKLAND (CONT’D) Do you always meet at the same time? DUANE End of lunch break. Strickland thinks. STRICKLAND Hoffstetler. Doctor Hoffstetler- has he ever joined you? Confused looks- “Who?” INT. BATHROOM - NIGHT 150A   150A Amphibian Man awakens, looks around - rises from the tub, stepping gingerly out into the room. INT. ELISA’S APARTMENT - NIGHT 150B   150B Giles sleeps on a chair in the bathroom. Amphibian Man takes Giles’ toupée, tries to eat it. Tosses it on the floor. He looks at Giles head - signs “egg” with his hands. OUT OF THE GATE by Jon Erik Kellso starts 78",
      "characters": [],
      "action_text": "Amphibian Man leaves the bathroom. On the kitchen table on a piece of newspaper sits three pair of Elisa’s shoes next to the Duck Brush and the shoe polish.  The green pair. Is it a frog?   He grabs a green shoe and tries to eat it - Spits it out.   He sees the Duck Brush -  Slowly grabs for it and attempts eating it.  He pulls out the brush while chewing it. Spits it out. Amphibian Man sniffs. He smells food somewhere in the kitchen. He turns and approaches the fridge.  Sliding his hand around the fridge, he opens the door, grabs a jar of mustard.  He licks around the jar - nothing. Drops the jar. He takes  out a bottle of milk - licks around it turning it upside down  as milk spills out onto the floor. He tries to suck up the  last drops of milk, drops the bottle.  A leftover piece of green pie sits on the shelf. He takes out  the pie, licks it, then throws it on the floor.  He opens the freezer, grabs a n ICE CUBE TRAY.  He tries to lick the tray.   His tongue sticks to the tray. He pulls. It won’t come off.   He panics!! He grabs it with  his other hand, pulls it off of his tongue.  Now it is stuck to both hands.   He pulls it off his Right  hand, then violently flicks it off of his Left hand.  INT. CORRIDOR - APARTMENT COMPLEX - NIGHT 150C   150C Fish Man steps out into the hallway.  He sniffs more as he moves toward Giles’ door. He stops at  the door, inhales deeply.  INT. GILES APARTMENT - NIGHT 150D   150D  Amphibian Man enters timidly. He sees the drawings of himself, stares at them. He crouches down, looking at each  painting.  He catches sight of the TV. MR ED is on. He goes over to it, mesmerized by the music. He watches intently. He hears a HISS. He disengages and turns, sees LILLIE baring  its fangs, hair standing on end. 79 The Amphibian Man responds in kind. And eats LILLIE. SNOWFLAKE approaches the creature- hissing. INT. ELISA’S APARTMENT - SAME 150E   150E Giles awakes and he goes to his apartment. There- INT. GILES APARTMENT - SAME 150F   150F Am",
      "dialogue_count": 0,
      "word_count": 2522
    },
    {
      "scene_number": 18,
      "slugline": "EXT. CADILLAC / STRICKLAND’S FRONT PORCH - NIGHT 172A   172A It’s raining like hell. Strickland exits the house drink in hand- enters the car. Takes a cigarette, lights it. He uncovers his fingers: they are black. He presses one- it squirts a yellow liquid. And thinks. CUT TO: INT. ELISA’S APARTMENT - BATHROOM - DAY 173   173 The tub’s filling up. The creature watches. She opens and closes the HOT/COLD faucet. Tests the water. She takes the box of algae that Hoffstetler gave her. She opens the box. She gets an idea. Smiles and looks around the bathroom. -opens the faucet on the sink. The sink overflows She takes the towels- sealing the cracks- and uses a towel to stuff the space between the door and the floor. The water continues to run- CAMERA GOES BELOW 174   174 -Into the theatre- Water pours from above and onto the empty seats and- -onto the scattered customers’ faces. They get up from their seats. CUT BACK: Elisa is floating, naked, next to the Amphibian Man- now the entire BATHROOM is immersed in water. She embraces him- Eyes closed, feeling him underneath her and the water on her face. His markings move rhythmically like a melody. She intakes and holds. 92",
      "characters": [],
      "action_text": "As the water goes above her head. They float underwater. Contemplating each other. CUT TO: INT. GILES APARTMENT - DAY 175   175 Giles gets up. He absentmindedly puts on his robe- folds in his MURPHY BED and heads to his drawing table. On it: the large format sketch of the Amphibian Man (which is looking beautiful) Giles takes Iodine and cotton and removes the bandage from his arm: the wounds are gone. He catches his reflection on his reference mirror- and is startled to discover- SHOCK!! -His head has hair. A lot of it. It’s growing from his scalp... And his beard is darker, his skin tighter. He pulls his hair- It’s his. Looks down inside his pajama trousers. GILES Well, Oh, well- Hello! He hurries- INT. HALLWAY - DAY 176   176 Across the hall. MR. ARZOUMANIAN What is going on? I’ve got water pouring into the bible movie. I have four paying customers. I can’t afford a refund. GILES It’s a pipe. It’s a pipe. I’ll take care of it. I’ll fix it. MR. ARZOUMANIAN I can’t have water pouring into the goddamn bible movie. GILES Alright. I’ll take care of it. Elisa! Elisa! 93",
      "dialogue_count": 0,
      "word_count": 405
    },
    {
      "scene_number": 19,
      "slugline": "INT. ELISA’S APARTMENT - SAME 177   177 Water spills from the bathroom door. Giles treads carefully. GILES Oh, God- Elisa? Knocks on the bathroom door. Water projecting from its entire contour. Noises. The door opens. Water pours out. Inside the Amphibian Man and Elisa, naked, covering herself with the plastic curtain. Giles, soaked, laughs. In the soundtrack: Trixie Smith sings MY UNUSUAL MAN INT. GILES APARTMENT - SAME 178   178 Giles towels his hair. GILES I’m toweling my hair, Elisa.   My hair.   And- and- look at the arm: healed. As if nothing had happened... You said he was a god. I don’t know. He ate a cat... (beat) You know what this means? We have to keep him around- just a little bit longer. You don’t want to lose him, do you? (beat) We cannot just- let him go- like that- We gotta keep him. CUT TO: INT. COMMAND CENTER / STRICKLAND’S OFFICE - DAY 179   179 Hoffstetler meets Strickland. HOFFSTETLER You wanted to see me? STRICKLAND Transcribe it, Sally. SALLY Right away, Sir. 94",
      "characters": [],
      "action_text": "STRICKLAND Come on up- I have a few questions for you. HOFFSTETLER Of course. Strickland climbs the steps to his office. HOFFSTETLER (CONT’D) Thank you. Strickland gives him some water. STRICKLAND Have a seat. They sit. HOFFSTETLER How’s it going? The investigation. STRICKLAND Well- we have a promising lead. HOFFSTETLER Really? That’s good to hear. They sit. STRICKLAND You joined us in Galveston. But where were you before, Hoffstetler? Where did you come to us from- HOFFSTETLER Doctor. STRICKLAND Excuse me? HOFFSTETLER Doctor Hoffstetler. Protocol. (beat) Wisconsin. Madison. STRICKLAND That’s right- You gave up a tenure track position. Didn’t ya? Gave it all up for us. HOFFSTETLER I did. 95 STRICKLAND I suppose you’re getting ready to leave us now, then- Hoffstetler drinks. HOFFSTETLER Only if the creature isn’t found. STRICKLAND What do you think? You think we will-? Find it? HOFFSTETLER Well, you said you had a lead. Long beat. STRICKLAND I do. A HANDFUL OF STARS by Jon Eric Kellso starts. INT. GILES APARTMENT 179AA   179AA Giles paints a portrait of Elisa and the Amphibian Man. It rains outside. Camera dollies across his window and discovers- INT. ELISA’S APARTMENT - DAWN 179A   179A The creature eyes the rain - almost pained- like a doggie who wants out. She watches him touch the glass. She touches his shoulder. Scales come off in her hand. OMITTED 179B   179B OMITTED 179C   179C EXT. DOCKS / CANAL - DAWN 179D   179D Elisa walks the canals- Rain. The waters are rising, churning. Growing. 96 Near the 30ft mark. OMITTED 179E   179E OMITTED 179F   179F EXT. BROWNSTONE BUILDINGS STREET / LOBBY - DAY 180   180 Raining. HOFFSTETLER, lugging two empty suitcases into his building. Watching from across the street: FLEMING IN HIS CAR. INT. HOFFSTETLER’S APARTMENT - DAY 181   181 Hoffstetler enters his apartment. Telephone is ringing. HOFFSTETLER Hello? He looks around- tense. Out the window. MIHALKOV’S VOICE Extraction is ready. Same place, Forty-eight hours. HOFFSTETLER ",
      "dialogue_count": 0,
      "word_count": 915
    },
    {
      "scene_number": 20,
      "slugline": "EXT. BATHROOM - SAME 184   184 BAMM!! The door opens. Strickland enters. Almost entirely out of breath- suffocating- gasping. Panicked. He tries to calm down. Wets his face- lets the water run. Liquid oozes from his hand. He pulls at the thread and pulls at it- -and it unravels his lapel. He gets angry and removes his jacket violently and throws it down on the floor. Then he looks deep in the mirror. Deep eye contact with himself. STRICKLAND Thirty-six hours. Deliver. You deliver. That’s what you do. You deliver. You don’t fail- A fly lands on his hand, rubs its legs. CUT TO: OMITTED 185-186   185-186 INT. GILES APARTMENT - DAY 186A   186A Giles- all energy- paints a large canvas image of the amphibian man. Elisa goes by. She enters her apartment without saying a single word. OMITTED 187   187 INT. KITCHEN, ELISA’S APARTMENT - NIGHT 188   188 Elisa rips off a leaf in her calendar: The leaf exposed now reads:   RAIN. DOCKS.  She looks at window, Pelted by rain. Buckets and pails on her floor pick up water from ceiling leaks. The Creature stands under one particularly big leak in the kitchen. Later: Elisa peels eggs for the Amphibian Man. He looks grey, weak. Barely eats. 100",
      "characters": [],
      "action_text": "He looks at her- Suddenly, she whistles softly, then signs and then, finally, sings- quietly at first: ELISA You'll never know just how much I’ve loved you... You'll never know just how much I care... AMPHIBIAN MAN doesn’t react, she puts down her spoon and continues- with her impossibly sweet voice: ELISA (CONT'D) And if I tried, I still couldn't hide my love for you... You ought to know, for haven't I told you so... A million or more times She gets up and sings to him- The Walls of the kitchen vanish and she stands, dressed in a sequined gown, surrounded by a musical stage. ELISA (CONT'D) You went away and my heart went with you I speak your name in my every prayer... AMPHIBIAN MAN gets up, suddenly sparkling, dreamy and attentive. He moves close to her and gently takes her in his arms. ELISA (CONT’D) If there is some other way to prove That I love you, I swear I don't know how... They move close to each other and dance gently, in harmony. ELISA (CONT’D) You'll never know if you don't know now... At the end of the song / choreography, everything goes back to normal. They eat in silence. The creature wheezes. OMITTED 189   189 101",
      "dialogue_count": 0,
      "word_count": 421
    },
    {
      "scene_number": 21,
      "slugline": "INT. LOCKER ROOM - NIGHT 189A   189A Zelda changes her shoes- and is about to step out when she spots: Elisa, crying her eyes out. They look at each other. ZELDA Elisa. What is it, honey? INT. ELISA’S BATHROOM - NIGHT 190   190 In the tub, the Fish Man wheezes as if he were on dry land. ZELDA Oh- No, Honey, no- He doesn’t look too good. (beat) This is bad. I’m going to call Hoffstetler... Elisa pours water onto him but it doesn’t help. Helpless, she looks out the window at the RAIN beginning to come down outside. INT. CORRIDOR - NIGHT 190A   190A Reading Hoffstetler’s card, Zelda dials the public phone. INT. HOFFSTETLER’S APARTMENT - NIGHT 191   191 Raining. Hoffstetler closes his bags. Leaves. Closes the door. The phone rings. And rings- and rings- EXT. BACK ALLEY - NIGHT 191A   191A THE AMPHIBIAN MAN Is WEAK. Giles, Zelda and Elisa help him stand under the rain. SOAKING. HIS GILLS AND FINS extend. Gills open. It breathes!! INT. CORRIDOR - NIGHT 191B   191B ZELDA When I was a little girl- I found a turtle sitting out in the middle of the road. Crossing it slowly. Car could run it over any minute. (MORE) 102",
      "characters": [],
      "action_text": "So, I picked it up, took it to a pond way back behind my house... and I laid it down under a big camphor tree, and I thought... “Mmmh- It’s gonna be so happy here”. And I left it there. (beat) But that night I figured out I had no idea where it was going... Far as I know it was bringing food to its nest or- looking to   porcreate - or escaping an owl. And maybe the worst place to keep it- maybe the place it was running from was that pond under that camphor tree. (looks at the fish) I didn’t care. I just did what I wanted with it... Giles Hugs Elisa: GILES You love him, Honey- We know what to do... Let him go... She nods. INT. ELISA’S APARTMENT - NIGHT 191BA   191BA Giles leaves Elisa at her doorstep. She spots the creature by the kitchen window. Standing under a water leak. Weak. Elisa and the Amphibian Man head for the bathroom but pause. INT. ELISA’S APARTMENT - NIGHT 191C   191C She guides him to her bed. They lie down. She embraces him. He embraces her back. She leans on his chest. Closing her eyes. She hears his heart. Thump-thump-thump-thump- it becomes the rhythm of waves, the murmur of the sea. She looks up- -at the ceiling, that suddenly becomes a deep, dark ocean. ZELDA (CONT'D) 103 She raises her hand: Webbing seems to extend from her thumb to her index. She closes her eyes and smiles. CUT TO: EXT. BROWNSTONE BUILDINGS STREET - NIGHT 192   192 Sitting in Fleming’s car- Strickland spies through a pair of binoculars. He looks ill- sweaty. FLEMING Sir- If you don’t mind me saying so: You don’t look too well. STRICKLAND Shut up... Fleming lowers the window- there is a smell he can’t pinpoint. FLIES walk around Strickland’s hand. FLEMING Sir- do you smell that? I- I think is it your fingers... They’re black, Sir- Strickland snatches the binoculars. STRICKLAND There he is- Doctor fucking shit- bird. FLEMING There’s no call for cursing, Sir- Hoffstetler exits his building, opens his umbrella- carrying the leather suitcases and a baquelite radio into the rain. ST",
      "dialogue_count": 0,
      "word_count": 2943
    }
  ]
}