{
  "slug": "the-man-from-uncle-2015",
  "title": "the man from uncle",
  "genre": "action",
  "format": "film",
  "scenes_count": 20,
  "characters_count": 2,
  "characters": [
    "SECRETARY",
    "SOLO"
  ],
  "total_words": 22225,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. EAST BERLIN STREETS - DAY Solo easily loses his tail. He heads to the address on the napkin. Outside is a car, Solo gets in. INT. CAR - DAY The driver, ERNST, is a jovial looking fellow with an air of gypsy about him. He flashes a gold-toothed smile at Solo. ERNST If I was a rich man, la la la la. SOLO You’re about to be. Here’s your scotch. Solo fetches a bottle of single malt out of his case. ERNST Glendronach 33. How did you find this? SOLO You owe me. That was harder to get through than a pair of jeans. ERNST The jeans as well?? You’re the messiah. Solo produces the jeans. SOLO And you’re greedy, Ernst, but I like you anyway. Now here is an address, and we need to move, the Russians are onto my target. Ernst looks genuinely excited and starts to unbuckle his trousers. SOLO(CONT’D) What are you doing Ernst? ERNST I can’t wait... He continues his mission. Solo rolls his eyes.  2.",
      "characters": [],
      "action_text": "ERNST (CONT’D) You even got the right size, and I am a little heavier than I used to be. SOLO I predicted that. Did you get me a gun? Ernst pulls his coat off the back seat, only to reveal a large machine gun. SOLO (CONT’D) It’s a machine gun, Ernst. I asked for something discreet. ERNST I am sorry, but it’s the best I could do. The Stasi watch everything. Since the Russians took over, it’s almost impossible to make a dishonest living. Not like when you were in business. Don’t you miss the old black-market days? This hits a nerve with Solo. SOLO What? The hunger, the cold, the filth? Not really, can we go now? I’m in something of a rush. EXT. GARAGE - DAY Ernst points out a dodgy looking automotive repair shop under the arches of the busy railway track. ERNST It’s a chop shop, I used this place for years, but since things have tightened up, there’s not a lot of business here anymore. You want me to wait here? SOLO Yeah, pick me up on the corner, and Ernst, we need to get the girl over the Wall tonight. ERNST It’s all arranged boss.  3.",
      "dialogue_count": 0,
      "word_count": 375
    },
    {
      "scene_number": 2,
      "slugline": "INT. GARAGE - DAY The walls are covered with motor-racing posters and photographs of famous drivers. Solo approaches a mechanic who is working under a car, we can just see a pair of feet. SOLO (SUBTITLE) (in German) I’m looking for Frau Teller. The mechanic rolls out from under the car. Meet GABY TELLER, a 28 year-old knockout in a boiler suit. GABY (in German) I’m a little backed up, I won’t be able to get to your car until next week. Gaby affects a hard edge but her clothing, ruffled hair and the oil-smudge on her cheek only serve to accentuate her vulnerability. SOLO (in German) My name is Napoleon Solo. I’m here about your father Frau Teller. Gaby tenses. Solo smiles reassuringly. SOLO (CONT’D) We need your help. GABY (in English) American? Solo nods. GABY (CONT’D) I haven’t seen my father since I was ten years old. SOLO I imagine you’re aware of what your father did during the war? GABY He was the senior scientist in the Nazi rocket program. Is there anything else to know?  4.",
      "characters": [],
      "action_text": "SOLO After that, he came to work for the U.S. at Los Alamos. Five years ago, he disappeared without a trace. We’ve been looking for him ever since, but this is the first sign we’ve had of him. This picture was taken a week ago by one of our agents in Egypt. Solo shows Gaby a black-and-white photograph of half a dozen men seated at a conference table. Three are wearing high level military uniforms. Solo points to one man who is standing, gesticulating with his arms as if to make a point. He’s an older professorial type. GABY That’s him... She can’t hide the emotion in her voice. SOLO It appears your father is in the process of making a deal to sell a nuclear bomb to the Egyptians. That’s not great news for Israel, which isn’t good news for the rest of us. Nasty business nuclear war. GABY Look, I’m not proud of what my father has done, but I told you, I haven’t seen or heard from him in eighteen years. SOLO We believe he’s working for this man. He points to a man seated next to the Professor. He’s dressed in an expensive linen suit but his face is mostly covered by the Professor’s arm. GABY I can’t help you. She disappears back under the car. Solo pulls her back out again. SOLO But I bet you know someone who can. An old friend, a relative?  5. Gaby thinks about it, shakes her head. GABY I can’t... SOLO If you’ll agree to help us, I can have you on the other side of the Wall tonight. GABY You do understand that I could be tortured and imprisoned just for listening to you? SOLO I’m offering you a new life. Freedom from all of that. GABY How do I know you are who you say you are? How do I know that anything you’ve told me is true? He looks her directly in the eyes. SOLO I know this is sudden. I wish there was more time. But that’s how urgent the situation is. I will protect you and I will get you over that wall. I just need you to... GABY Trust you? SOLO Trust me. And she almost does. Almost but... GABY Why? Because you’re handsome and have a nice smile? SOLO Shall I mak",
      "dialogue_count": 0,
      "word_count": 982
    },
    {
      "scene_number": 3,
      "slugline": "INT. KURYAKIN’S CAR - DAY He rounds the corner to find Gaby looking over her shoulder, reversing straight at him at forty miles an hour. Kuryakin has no time to dodge. CUT TO: EXT. EAST BERLIN STREETS - DAY CRASH. There is an enormous smash as both cars come to a halt. However, Gaby’s car is relatively undamaged. She tears away. CUT TO: INT. GABY’S CAR - DAY Gaby turns to a shaken Solo. GABY You okay? SOLO Where did you learn to drive like this? GABY What’s the point in fixing cars if you can’t drive them? CUT TO: EXT. EAST BERLIN STREETS - DAY Kuryakin coolly climbs out of the wreckage of his car, and surveys all the other cars that have stopped to look at the incident. He eventually sees one at the back, it looks fast. He walks up to the DRIVER. DRIVER (in German) I saw the whole thing, that woman’s a lunatic! Kuryakin waves his gun at him with a gesture that says “this is my car now” and the journey continues. CUT TO:  9.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 182
    },
    {
      "scene_number": 4,
      "slugline": "INT. GABY’S CAR - DAY She continues to drive fast, avoiding traffic, but eventually she finds herself behind a rubbish truck, picking up trash. Another car is close behind her, she’s stuck. She calmly looks around. SOLO We can’t stay here. GABY Really? You’re very observant. She glances at a parallel road a block over, searching for another way out. Suddenly, a car tears down the parallel road. We only see it for a flash, but we know it’s Kuryakin. Solo and Gaby look at each other. GABY (CONT’D) He couldn’t have seen us? Pause. We hear a screech of tires. SOLO Shall we get out of here? Kuryakin’s car tears back and stops. How could he possibly have seen them? Within a second, he is firing shots from his pistol just inches away from their target. Gaby doesn’t hang around. Again she puts the car in reverse, forcing the car behind her back. This gives her enough room to mount the curb, knocking the TRASH COLLECTORS out of the way. She’s off again. CUT TO: INT. KURYAKIN’S CAR - DAY Kuryakin steers with one hand, and shoots with the other. He’s calmer than a coma. CUT TO: INT. GABY’S CAR - DAY Solo shoots back. Gaby downshifts. GABY That man can drive. Can’t you shoot better than that?  10.",
      "characters": [],
      "action_text": "SOLO You concentrate on the road. She makes a hard left into an alley. Solo is thrown to one side and drops his gun on the floor. CUT TO: EXT. EAST BERLIN STREETS - DAY Kuryakin overshoots. CUT TO: INT. GABY’S CAR - DAY Solo picks up his gun. GABY Better? Suddenly, her expression changes. GABY (CONT’D) Oh no! Up ahead is a sharp drop as a steep stone pedestrian staircase leads down to the road below. Solo looks behind them. Kuryakin is catching up again. Sirens are approaching behind him. Gaby is slowing down. Solo stays cool. SOLO We can make it. Gaby is shaking her head. Solo starts to climb into the back seat. GABY What are you doing? SOLO We need more weight in the back. GABY I can’t...  11. SOLO You can. You don’t, we’re both dead... Trust me... Now put your foot down. Gaby looks at him, hits the gas, and they’re airborne. EXT. STEPS - DAY Amazingly, the car lands on the steps, the back flies up, but it doesn’t flip. Instead, it carries on down the steps, reaching the bottom with a crunch. Kuryakin stops his car at the top of the steps. He climbs out of his car and watches them speed away. INT. GABY’S CAR - DAY Solo breathes a sigh of relief. SOLO I’m impressed. You alright? GABY That’s a stupid question. SOLO Shall I drive now? GABY You’re okay, pal. Just stay where you are. More sirens. Flashing lights in the distance. SOLO In there. He points to a multi-story parking structure. INT. PARKING STRUCTURE - DAY Gaby parks her car. INT. CAR - DAY Solo and Gaby sit, tensely listening to the sirens go by. Gradually, the sound fades into the distance.  12. GABY Still going over the Wall tonight? SOLO Follow me. He climbs out of the car. INT. PARKING STRUCTURE - DAY As Solo and Gaby head for the exit, a car turns into the structure. Solo pulls Gaby down behind a car. As the vehicle passes, they see that it’s Kuryakin. SOLO Who is this guy? He pulls her through the back-door. EXT. ALLEYWAY - DAY As he and Gaby hurry down the alleyway, Solo looks back to see Kuryakin, l",
      "dialogue_count": 0,
      "word_count": 1319
    },
    {
      "scene_number": 5,
      "slugline": "INT. SAFE HOUSE - NIGHT Solo watches as a DOCTOR examines Gaby. She winces as he touches her bruised ribs. SOLO (to himself) Welcome to freedom. There’s a knock on the door and SANDERS enters. He’s an effete little man with an air of great cunning and intelligence about him. He’s also Solo’s boss. SANDERS Well done Solo. Solo stares at him for a long beat. SOLO Why don’t we step outside. INT. SAFE HOUSE - KITCHEN - NIGHT Sanders puts the kettle on. SANDERS Well, it appears the Russians are as anxious as we are to find Professor Teller. SOLO I’ve had enough. SANDERS What is your secret? (beat) You know there’s no one in the history of the Agency with a higher success rate when it comes to recruiting and running female assets. You’re a bit of a legend. A long pause. Solo stares at Sanders. SOLO You heard what I said. SANDERS You need a break.  17.",
      "characters": [],
      "action_text": "SOLO No, I have had enough. Twelve years of playing your little games. I’m done. SANDERS You seem to be forgetting something... You’re on thin ice Solo, and there are things, unpleasant things, lurking under it. SOLO Threatening me with a prison cell has lost its traction Sanders. Put me away, it’s better for everyone’s health. SANDERS Pull yourself together Solo. Solo suddenly grabs him by the throat and pins him against the wall. SOLO This won’t mean much to you, but she trusted me. SANDERS Look Solo, she’s going to be okay. There’s a beat, Solo releases his grip. SANDERS (CONT’D) I tell you what, let’s meet again tomorrow, we’ll talk about it sensibly. EXT. EGYPTIAN BARRACKS - GYM - EARLY MORNING An EGYPTIAN OFFICER is running outside the barracks, he looks fit and has an expression like he means it. We become aware of a man running up behind him. This is ALEXANDER SKORPIOS, he’s dressed to run. ALEXANDER Colonel. I heard you were an early bird. The Egyptian acknowledges him, but continues running.  18. COLONEL I like the sand before the sun beats it. ALEXANDER I hope I am not bothering you? COLONEL Not in the least, you and the Professor have done Egypt a great service... But I thought you had left already, Mr... “Smith.” ALEXANDER I’m back for the day. A couple of loose ends I needed to tie up. By way, my name is Alex... COLONEL No. Please. Let’s stick to protocol. ALEXANDER Oh, I’m confident you can be trusted Colonel. I’m Alexander Skorpios. COLONEL Good to meet you, Mr. Skorpios. ALEXANDER You’re quite a legend in the camp, Colonel, winner of the army triathlon six years in a row. (beat) Do you mind if I train with you today? I am an amateur athlete myself and this will be my last opportunity, since our business is concluded. COLONEL You’re welcome to, but I warn you, this is not a short work out. ALEXANDER Two hours every morning. A twelve mile run, followed by a two mile swim, and a cool down in the gym. Your routine is famous. I’ll drop out as soon as you",
      "dialogue_count": 0,
      "word_count": 702
    },
    {
      "scene_number": 6,
      "slugline": "INT. GYM - DAY Alexander is on the bench with a bar over him... ALEXANDER Could you spot me? Alexander thumps out ten reps of a very heavy weight. ALEXANDER (CONT’D) Your turn. COLONEL That weight is too much. ALEXANDER It’s all in your mind, Colonel. CUT TO: The Colonel is on the bench, under a weight that he has to struggle with. Alexander stands over him, almost mockingly. ALEXANDER (CONT’D) Push push, that’s the spirit Colonel, now we’re getting somewhere. Let’s see how strong you really are. At which point, Alexander releases the weight and the Colonel takes the strain. ALEXANDER (CONT’D) That’s it. Now tell me, how long have you been a spy? The Colonel is about to explode with the weight that’s over him. COLONEL Take the weight off me. I don’t know what you’re talking about. ALEXANDER You’re just not trying hard enough. Who are you working for, the Americans, or the Russians? The Colonel can’t take the weight for much longer. COLONEL Please...!  21.",
      "characters": [],
      "action_text": "ALEXANDER Tell me what I want to know, and I can help you. COLONEL The Americans... and the Russians. ALEXANDER Thank you Colonel. Alexander reaches down and takes hold of the bar. COLONEL How did you know? ALEXANDER You and your government have no idea who you’re dealing with Colonel. With almost superhuman strength, he raises the bar before he slams it down. EXT. WEST BERLIN - PARK - DAY A beautiful sunny day. Solo is walking with Sanders through public gardens. SANDERS How’s the girl? Is she going to be helpful? He walks into a public restroom, gesturing that Solo should follow. INT. PARK RESTROOM - DAY Sanders checks the cubicles. SOLO I think so... SANDERS You’ll have to do better than that. SOLO There’s an old friend and colleague of her father’s, a Rudolph Von Trulsch, endearingly known as “Uncle Rudi.” Lives in Greece, works for a big shipping company.  22.  (MORE) She’s sure if anybody will be in touch with her father, he’s the man. Sanders is relieving himself. SANDERS Rudi Von Trulsch. I think I have a file on him somewhere. Name of the shipping company? SOLO Triton. SANDERS Even more interesting, rumor has it they smuggled Nazi gold to South America after the war. Can she be trusted? SOLO That’s your department now sir, I got you the girl and I got you a name. Now I’m done. SANDERS No Solo, you’ll be done when I tell you you’re done. SOLO I don’t think you understand. I am over it, for about a thousand reasons, not least of which, I am losing whatever advantage I had over these people. That lunatic Russian android they put on me yesterday isn’t like men I have come up against before. He was a relentless Olympian. That was the closest I have come to termination in the last ten years. It wasn’t   me  that saved   me , it was a banana skin here and a rabbit foot there. In other words, luck. You want to send me back to the cell, send me. I’ll go. But I am done here. A MAN wearing a hat enters, shutting Sanders up. Solo looks over his shoulder as the Man rais",
      "dialogue_count": 0,
      "word_count": 1020
    },
    {
      "scene_number": 7,
      "slugline": "INT. CIA CINE ROOM - DAY Lights off, a Super 8 film fills us in: Images of a child soldier getting a medal. A young man swimming in the Olympics. Another image pops up of him firing a gun at a target with deadly accuracy. SANDERS Kuryakin’s father was killed by the Nazis at the siege of Leningrad. The day he got the news, our boy joined the army. He was fourteen. Killed so many Germans he was given the nickname “The Leningrad Plague.” The KGB recruited him after the war and spent years refining him. His one flaw appears to be his temper. But make no mistake, he’s their top agent. CUT TO: INT. KGB CINE ROOM - DAY Oleg clicks his finger and the lights are off, and Oleg walks in front of the film projected onto a wall. Now it’s Solo’s turn. OLEG (SUBTITLE) Solo was a sergeant in the Marines during the war. He was awarded the Military Cross for bravery. He was stationed in Berlin after the war, where he became involved in multiple criminal activities, mostly dealing in black-market goods. He speaks many languages, and he’s highly cultured for all the wrong reasons. He has a a broad knowledge of art, wine, antiques, only in order to know it’s black market value.   He was facing a fifteen year prison sentence for his crimes, but the CIA recognized his talent and offered to withhold his sentence, as long as he worked for them. Since then, he has been involved in some of their most important and dangerous clandestine operations. He has consistently bested our top operatives.  26.  (MORE)",
      "characters": [],
      "action_text": "He’s not predictable. He’s not a product of the system. Kuryakin nods. CUT TO: Sanders paces in front of Solo. SANDERS Your main mission is to prevent the delivery of the bomb. That is the first priority. However, you have a second obligation. Professor Teller’s research represents the next generation of nuclear weapons technology. It’s way ahead of anything we or the Russians have currently, and clearly he’s succeeded in putting it into practice. That research will be on a disk. We must have that disk and above all else, it must not fall into the hands of the Russians. CUT TO: Oleg lies on a sofa while Kuryakin paces. OLEG ...it is essential that we get it and not the Americans. Once you have completed your main mission... CUT TO: Sanders stops pacing. SANDERS You are to use any means... CUT TO: Oleg gets off the sofa. OLEG ...necessary to secure it. Do I make... CUT TO: Sanders stares at Solo.  27.  OLEG (SUBTITLE) (CONT'D) SANDERS ...myself clear? CUT TO: INT. SAFE HOUSE - KITCHEN - DAY Gaby sits opposite Solo, who passes her a cup of tea. She’s looking much better. GABY I kept my end of the deal, and I almost died for it. And now you want me to come to Greece? SOLO Look we don’t have much time, and I need access to Uncle Rudi. If anybody knows where your father is, it’s him, and if there’s one person he’ll tell, it’s you. GABY I can’t do this. I don’t know this world, you’re asking me to be something I am not. SOLO Trust me. All I need you to be is yourself. I’ll guide you through it, this is what I do. Look at it as a holiday. You can see the sights, get a tan. And I promise there’ll be no danger. She’s melting. GABY Promise? SOLO Promise. The chemistry between them is undeniable, but Solo’s all business. SOLO (CONT’D) Now, you need some clothes. Let’s go shopping.  28.",
      "dialogue_count": 0,
      "word_count": 610
    },
    {
      "scene_number": 8,
      "slugline": "INT. CLOTHING STORE - DAY A nice mid-range place that sells sensible clothes. Solo watches as Gaby looks at dresses. He spots an elegant black dress. SOLO This one isn’t bad. He shows Gaby the dress. She shakes her head. GABY Black is for funerals. She turns to look at another dress. A troubled look passes over Solo’s face. He’s all too aware that Gaby’s wellbeing is again his responsibility. GABY (CONT’D) So Russia and America have become friends over this issue have they? SOLO Well, friends might be an overstatement... But as coincidence would have it, you do already know the man we have to partner with. GABY Know him? How can I know him? At which point, Solo spots Kuryakin. As usual, he’s dressed in an outlandishly colorful and mismatched get-up, which he somehow manages to make cool. SOLO (to Kuryakin) You’re early. KURYAKIN We’re in a hurry. GABY Wait just a second. Isn’t that the man...? SOLO Yes, it is. I told you, you know him. GABY You’ve got to be kidding.  29.",
      "characters": [
        "SECRETARY"
      ],
      "action_text": "SOLO It’s going to be fine. Kuryakin smiles and takes her hand. KURYAKIN Ilya Kuryakin. You are quite a driver young lady, I like that in a woman. GABY I feel sick. Make it stop. SOLO That’s perfectly normal, you’ll get used to the feeling. He sees the dress. KURYAKIN Did you pick this dress? Looking at Solo. KURYAKIN (CONT’D) There is no way my woman is wearing this dress. GABY What do you mean “my woman?” Solo, what does he mean? SOLO I think you should leave this department to me, no offense but... KURYAKIN My fiancee would never wear this. GABY Fiancee? They ignore her. SOLO Really, now you’re a Russian fashion expert? And that suit is your qualification? KURYAKIN So you’re an expert on what a Russian architect looks like, Cowboy?  30. GABY I’m not doing this. She storms out of the shop. Solo looks sarcastically at Ilya. SOLO Good work. KURYAKIN Your job was to prepare her. SOLO Your job was to give me time. EXT. STREET - EVENING It’s a beautiful evening. Gaby paces in front of a fountain while Solo talks. SOLO He’s an architect designing a new resort for heroes of the Soviet Union by the Black Sea. The Minister has a weakness for classical architecture so he’s been sent to Greece to study it. He’s managed to get a visa for his fiancee. GABY (in horror) Me?! SOLO It’s the perfect cover. Since Uncle Rudi lives in Athens, it’s only natural that you would pay him a visit to tell him the good news, and ask him about your father. GABY Now you want me to be an actress? SOLO It’s easier than it seems, I’ll coach you through it. Gaby shakes her head. GABY This is insane.  31. SOLO You can do it Gaby, I’ll admit it’s a challenge, but I know you can handle it. She considers, but again she’s melting. GABY I can’t believe I’m doing this. What will you be doing while I’m playing the Russian bride? SOLO I’ll be playing an executive for American oil, on a business trip to check out Triton shipping, Rudi’s employer. EXT. SKORPIOS ISLAND - BEACH - DAY PROFESSOR UDO TELLER, Gaby’",
      "dialogue_count": 1,
      "word_count": 4365
    },
    {
      "scene_number": 9,
      "slugline": "EXT. RACETRACK - PITS - DAY Gaby, Rudi, and the mechanics watch Alexander’s car going round the track. Alexander comes tearing into the pits. He jumps out of the car. He looks up at the time. ALEXANDER (to Gaby) Who are you? UNCLE RUDI Alexander, this is my goddaughter Gaby. Alexander takes Gaby’s hand, holds it a little too long. ALEXANDER You should come and work for me. I mean it. GABY I live in East Germany. ALEXANDER Arrangements can be made... Gaby gestures to Kuryakin. GABY This is my fiancee, Ilya. KURYAKIN Pleased to meet you. He extends his hand, but Alexander has already turned back to Gaby. ALEXANDER I believe that each one of us has a destiny and I can help you with yours. GABY You don’t know what my destiny is. ALEXANDER I know greatness when I see it, and I have the means to encourage its potential. I can make you great... Now show me what you did to that engine. They walk over to the car, out of Kuryakin’s earshot.  52.",
      "characters": [],
      "action_text": "GABY You’re quite full of yourself, aren’t you? ALEXANDER I can afford to be. Come to lunch tomorrow. He looks at Kuryakin with disdain. ALEXANDER (CONT’D) Alone. Rudi will arrange it. INT. GRAND HOTEL - SUITE - EVENING Kuryakin paces angrily. KURYAKIN He’s a Nazi if I ever saw one. GABY You need to control your temper. SOLO I agree. Kuryakin gives him a look. SOLO (CONT’D) What do you think of him? GABY I think he’s an athletic, good- looking gazillionaire, who’s offered me a job and made advances toward me. (beat) I think I quite like him. SOLO Yes, but do you think he’s up to no good? GABY If you mean by no good, is he planning on stealing me away from my fiancee? The answer is yes. KURYAKIN Well that’s not happening. No way!  53. GABY I don’t know what you’re upset about, you’re not even my fiancee. KURYAKIN As far as he knows, I am, and I am for the purposes of this mission. So, like I said, it’s not happening. Exasperated. SOLO I mean by “no good,” is he a neo- Nazi involved in the selling of a nuclear weapon to start a war? Not whether or not he is trying to jump your bones. GABY I might need a second conversation before he’ll confess to that ambition. SOLO I agree. Go to lunch tomorrow. Alone. Rattle that tree. There’s fruit up there somewhere. We just need to find it. KURYAKIN (grumpy) I’d be better off on my own. I’m going to get an early night. INT. GRAND HOTEL - ROOM - NIGHT Solo changes into some dark clothing, arms himself, and slips out of his room. EXT. DOCKS - NIGHT A big sign reads: TRITON SHIPPING AND AEROSPACE. Solo slips past a security guard hut and onto the pier, which appears to be entirely occupied by Skorpios. Moving through the cranes and stacks of containers, Solo looks around. There are big storage warehouses, an enormous tanker being loaded up, and at the very end, a bunker-like building which houses Triton Aerospace.  54. This building has a high fence around it and is heavily guarded by uniformed security. Just inside is a guard tower",
      "dialogue_count": 0,
      "word_count": 1950
    },
    {
      "scene_number": 10,
      "slugline": "EXT. OCEAN - NIGHT SPLASH. They land in the dark water below, find their bearings, and kick up towards the surface. Bullets smack the water around them as Guards fire from the windows of the building. There are more men running along the dock. The two agents swim away from the pier, towards a cluster of fishing and pleasure boats that are moored inside the harbor for the night. SOLO You seemed to have a little trouble in the water. Did you learn to swim late in life? KURYAKIN Actually, I won a silver at the Olympics, but holding a gun in each hand does make it more challenging. He raises his hands, revealing the two guns - you’re left thinking how could he swim at all with them? In the distance, the sound of an approaching engine. A big motorboat with a searchlight on the front. The beam catches Kuryakin. He ducks underwater. The driver accelerates and in seconds the boat has reached where Kuryakin is swimming. The DRIVER cuts the motor and the boat floats silently. The men scan the water on the starboard side, where they last saw Kuryakin. The boat has cut the two men off from one another. Kuryakin floats as still as he can, ducking under whenever the spotlight passes over him. Solo treads water on the other side of the boat, watching. He can hear the voices of the Guards, talking to each other in Greek. One of the Guards takes something out of a bag. Tosses it into the water. KABOOM! A grenade. Even on the other side of the boat, Solo is pummeled by the shock-wave. Kuryakin is hit full force. He clutches his ears in agony.  62.",
      "characters": [],
      "action_text": "The guard tosses another grenade in for good measure. Kaboom! Kuryakin is rocked by another shock-wave. The men on the boat scan the water, they find something with the spotlight beam. The engine starts and they move towards it. It’s Kuryakin’s shoe. Satisfied that their job is done, they move off. And sure enough, Kuryakin has blacked out and is sinking. Slowly, slowly he drifts down towards the ocean floor. Then Solo is there, grabbing him under the arms and kicking up to the surface. SOLO Come on, come on. He slaps Kuryakin. Twists his nose. Nothing. Finally, he’s forced to give him mouth-to-mouth. Kuryakin sputters awake. KURYAKIN Okay! I’m okay! SOLO You don’t look so okay. We’ve got to get out of here Mr. Olympics, can you swim? Kuryakin nods. INT. GRAND HOTEL - SUITE - NEXT DAY Gaby is putting the finishing touches on her makeup. She wears a beautiful dress and looks stunning. Solo sits at the desk, fiddling with some kind of electronic device. Kuryakin is on the phone. He hangs up, looks at Gaby and Solo. KURYAKIN Alexander’s chauffeur is waiting for you downstairs. Solo shakes his head.  63. SOLO I don’t know about this... After last night’s debacle, they’ll be suspicious of everyone. He glares at Kuryakin. KURYAKIN I’m not the one who set off the alarm, Cowboy. SOLO I’ve told you there was no alarm on the vault. Obviously they found the door someone had kicked in! GABY Are you two really going to do this again? That shuts Solo and Kuryakin up. GABY (CONT’D) Our best shot is to continue as if nothing has changed. Which means, I need to go and have my lunch with Alexander and accept his job offer. The two men look at each other, they know she’s right. SOLO I’ll fit you with a homing device just in case. Solo shows her the device he’s been fiddling with. It looks like a metal lighter. SOLO (CONT’D) Latest technology. Ten mile radius. Two day battery. And it’ll light your cigarette. He flicks it to demonstrate. SOLO (CONT’D) Flick it the other way and it sends",
      "dialogue_count": 0,
      "word_count": 1714
    },
    {
      "scene_number": 11,
      "slugline": "EXT. ALEXANDER’S VILLA - VERANDA - DAY Alexander pours more wine. ALEXANDER ... you will accept my offer? GABY I will accept your offer, but it must include certain requisites. ALEXANDER Go on. GABY I want to see my father, and I want to be a part of what he is doing. UNCLE RUDI I told you, she’s one of us. ALEXANDER What reason do you have for thinking that I know anything about your father? Other than what Rudi has told me. GABY The same reason that I know who broke into your laboratories last night. ALEXANDER This wine agrees with you. Are you going to tell me something interesting? GABY My “fiancee” is a KGB agent, and he thinks you’re up to no good, Mr. Alexander Skorpios, and so do a lot of other people. She takes out the device Solo gave her, and places it on the table. GABY (CONT’D) He’s tracking me as we drink. CUT TO:  71.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 163
    },
    {
      "scene_number": 12,
      "slugline": "EXT. ALEXANDER’S VILLA - WOODS - DAY Ilya listens in horror. CUT TO: INT. ALEXANDER’S VILLA - VERANDA - DAY GABY He’s been teamed with a CIA agent. You know him as Max Holstein, of Texas Oil. You should be flattered gentlemen, you have managed to do what nobody else could, ally the superpowers. ALEXANDER Why are you telling me this? GABY Please, you know who my father is, and Uncle Rudi’s been grooming me since I was a child. We share the same beliefs Mr. Skorpios. I just think your views may be a little more liberal than mine. Alexander looks at Rudi. Rudi nods, stands, and walks out the room. ALEXANDER Before we go any further, you need to understand something. Rudi has gone to fetch his photo album. It’s very important that you look very carefully at the pictures in this book. As they say, “a picture is a thousand words.” Rudi returns with the book and presents it to Alexander. Alexander opens it, and shows it to Gaby. He studies her, looking for a reaction. ALEXANDER (CONT'D) Your “Uncle” Rudi is a man of considerable hidden talents. Rudi shrugs modestly. ALEXANDER (CONT’D) ...which he has gone to great trouble to document.  72.",
      "characters": [],
      "action_text": "Gaby cannot hide her horror as she stares at her godfather. ALEXANDER (CONT’D) Our friends, we treat like family, but our enemies... Am I making myself clear? There is a pause, then Gaby looks up and deep into his eyes. GABY As a river of gin. Just give me an opportunity to demonstrate my loyalty to the cause. Alexander and Rudi share a look. ALEXANDER (to Rudi) Isn’t the CIA agent having lunch with my sister right now? UNCLE RUDI He is. ALEXANDER Then don’t you have a call to make? Rudi leaves, Alexander turns to Gaby. ALEXANDER (CONT’D) It seems your father is having some doubts... CUT TO: INT. SKORPIOS GYM - DAY Dimitri has Solo in a choke hold. His face is turning red. He twists and pushes, and just manages to get out of it. Dimitri whacks Solo on the side of the head. He goes down hard. The ogre lumbers over to him and grabs him by the scruff of the neck. That’s when Solo strikes. Kick to the balls. One, two punch, and Dimitri collapses. Solo heads out the door and straight for...  73.",
      "dialogue_count": 0,
      "word_count": 396
    },
    {
      "scene_number": 13,
      "slugline": "INT. ELENA’S OFFICE - DAY She’s on the phone. Solo stands before her. ELENA Really? How interesting. I shouldn’t have any trouble handling that. She hangs up and smiles at Solo. SOLO I think I may be ready for the advanced class after all. ELENA There’s more to you than meets the eye, Max. She pours some water from a carafe into a glass for Solo. He drains it in one. SOLO Shall we get on with it? CUT TO: EXT. ALEXANDER’S VILLA - WOODS - DAY Kuryakin hauls his gear through the trees, heading up the hill, towards the van. Then he hears it, the unmistakable sound of large animals running through the undergrowth. He looks back to see two Rottweilers bounding towards him. He starts to run. CUT TO: EXT. ALEXANDER’S VILLA - COURTYARD - DAY Alexander ushers Gaby into a waiting helicopter which takes flight. Rudi, in the meantime, gets into his Mercedes, which roars off. CUT TO:  74.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 163
    },
    {
      "scene_number": 14,
      "slugline": "EXT. ALEXANDER’S VILLA - WOODS - DAY Kuryakin runs. Here come the dogs. Kuryakin stops. He knows he can’t outrun the them. As they leap at him, he swings the heavy receiver, and catches one of the dogs on the side of the head, stunning it. The other goes for his throat. CUT TO: INT. SKORPIOS GYM - DAY Solo and Elena circle each other. Solo’s starting to look a bit wobbly. SOLO I must commend you on your choice of drug. I thought I detected a trace of alfonsiamonoitrate in my water. I can only imagine that within the next few minutes I'll be no good to anyone. ELENA I did warn you that advanced is a whole new level. Solo stumbles. ELENA (CONT’D) But I will go easy on you. She slowly reaches out and pushes him gently on the nose. Solo collapses. CUT TO: EXT. ALEXANDER’S VILLA - WOODS - DAY Kuryakin is still wrestling with the dog. He hears the shouts of men approaching. He looks over to see a GUARD aiming a rifle at him. Kuryakin manages to roll over so that the dog takes the bullet. It let’s go of him with a yelp. Kuryakin manages to scramble the rest of the way up the hill. He jumps into the van and screeches away. CUT TO:  75.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 224
    },
    {
      "scene_number": 15,
      "slugline": "INT. SKORPIOS GYM BASEMENT - TORTURE ROOM - DAY Solo wakes up to find himself in what looks like a surgery. Elena is gone. He is strapped to a gurney and Uncle Rudi is standing over him. There’s a glass window in one wall, through which Solo can see two MEN standing guard. UNCLE RUDI Once upon a time there was a little boy. You wouldn’t describe him as a particularly special little boy, he was neither tall or handsome, charismatic or amusing. In fact, he appeared to be exceedingly dull. Because of this boy’s apparent shortcomings, he was bullied mercilessly and relentlessly by the other children. Year merged with miserable year, as life continued to be a living hell. But what the other boys didn’t understand about their victim, is that he didn’t see them as enemies. He saw them as instruments of learning. A priceless lesson was gleaned from his tormentors. Man has only two masters in this world. And their names, Mr. Solo, are pain and fear. As the boy grew older, he found he had an extraordinary talent for eliciting these gods in others. So, on the principle of playing to your strengths, he decided to make their cultivation his life’s work. Fortunately for this boy, history presented an unprecedented opportunity, a world war. You may have heard of the Dark Angel of Ravensberg, the Butcher of Belsen, or my favorite, the Fifth Horseman, Doctor Apocalypse. What history has failed to relate is that this was not three individuals, but the tireless work of a single artist. Rest assured that you are in experienced hands, and trust me, when I say, Mr. Solo, you will tell me the truth. But we can take our time, there is no hurry...  76.",
      "characters": [],
      "action_text": "SOLO That’s quite a story. And I appreciate the trouble you’ve gone to on my account, but I fear your talents may be wasted, as I’m perfectly happy to tell you whatever you want to know. My name is Fredrick Johnson, I am a freelance industrial spy, I steal technology from corporations and sell it to the highest bidder. The German smiles, and nods to an ASSISTANT who is hovering in the background. All of a sudden, Solo is jolted into a spasm of extraordinary proportions. After five seconds it stops and smoke starts to rise from his hair. UNCLE RUDI While you were resting, I took the liberty of inserting some electrodes into the nerve center at the base of your spine, hurts doesn’t it? Shall we start again? CUT TO: EXT. TRITON HEADQUARTERS - DAY Down the street from the entrance to the offices, is a separate street entrance to the Spartan Boxing Academy. Kuryakin pulls over and parks the van. He opens his briefcase, takes out several clips of extra ammunition, which he loads into his pockets. He gets out of the car. INT. SKORPIOS GYM - LOBBY - DAY Kuryakin walks in. There’s a THUG manning the reception desk. KURYAKIN I’d like to join your gym. The receptionist eyes him sullenly, says something unintelligible in Greek. RECEPTIONIST No Ingleesh.  77. We see Kuryakin’s hand go behind his back, in what we know as the signature position for the “KGB Kiss.” Close on: Kuryakin’s hands. We see one fly out, and hear the sound of the slap. CUT TO: INT. SKORPIOS GYM BASEMENT - TORTURE ROOM - DAY The torture continues. Another jolt. More smoking hair. UNCLE RUDI Mr. Solo, I don’t think you took me very seriously. In the background, through the window, we see Kuryakin shoot and generally dispose of the two GUARDS. The glass is sound proof. Solo can see Kuryakin in the background and watches the Guards drop, he tries not to give away his relief. Rudi turns as his Assistant wheels over a table full of instruments of torture, but is too distracted to notice that the Guards are no lon",
      "dialogue_count": 0,
      "word_count": 764
    },
    {
      "scene_number": 16,
      "slugline": "INT. SKORPIOS GYM BASEMENT - TORTURE ROOM - DAY Uncle Rudi is now in the chair. Needless to say, he has turned quite pale. Solo’s hand hovers over the electrical switch. KURYAKIN Where’s the warhead? Rudi hesitates. Solo turns up the pain. UNCLE RUDI Ahh... Skorpios! KURYAKIN Skorpios? UNCLE RUDI The family’s private island. SOLO And Gaby? UNCLE RUDI She’s there too. Kuryakin looks at Solo. KURYAKIN (to Uncle Rudi) Tell him... UNCLE RUDI What??? KURYAKIN How you know about us... UNCLE RUDI Gaby. (proudly) She’s one of us now. KURYAKIN Just in case you had any doubts. Annoyed, Solo jacks up the power. Rudi squeals. SOLO And when are the Egyptians taking delivery of the bomb?  79.",
      "characters": [],
      "action_text": "UNCLE RUDI You’re too late. Solo’s hand hovers over the switch. UNCLE RUDI (CONT’D) Tomorrow. No more, please! Solo stares at him and steps away from the switch. SOLO Now tell me about your organization. Rudi looks relieved. UNCLE RUDI At the end of the war, some of our leadership managed to escape to South America. We’ve been steadily rebuilding since then. We have more power, money, and influence than you can imagine. It doesn’t matter what happens to me or even the bomb. This is only the beginning. You can’t stop them, but you can take care of yourselves. You’re practical men, you can kill me, but you know it won’t make any difference. Let’s make a deal. I can have Swiss bank accounts set up today. Name your price. Solo’s eyebrows raise as he looks at Kuryakin. SOLO I have to admit that does sound like an attractive idea. What do you think? Five million each? KURYAKIN I think Ten. UNCLE RUDI Ten million each. Done! SOLO I dunno... on second thought. I think I’d rather just cook you.  80.",
      "dialogue_count": 0,
      "word_count": 301
    },
    {
      "scene_number": 17,
      "slugline": "INT. SKORPIOS GYM BASEMENT - TORTURE ROOM - ANTEROOM - DAY Through the window, we can see a faintly out of focus Rudi jolting around, but we can’t hear a sound. There’s a sound of running feet above them. KURYAKIN How are you feeling? SOLO Sore. Kuryakin hands Solo one of his high-tech guns. INT. SKORPIOS GYM - DAY Solo and Kuryakin reach the narrow corridor at the top of the stairs, and are immediately attacked on both sides by the Students we saw earlier, who are armed with nunchuks, swords, and various martial arts weapons. They shoot a couple of them, but the sheer numbers mean the fighting soon becomes hand-to-hand. A spectacular martial arts battle ensues as Solo and Kuryakin fight eight men at the same time. Kuryakin once again demonstrates his extraordinary martial arts skills. Solo can take care of himself, but now and then needs some help from Kuryakin. As they make their way towards the entrance, Kuryakin suddenly points at one of their would-be attackers, who are now approaching with a lot more caution. KURYAKIN You! The MAN turns tail and runs. Kuryakin goes after him. SOLO What are you doing?... The entrance is this way. Kuryakin grabs the Man, but three more attack him. Solo is forced to go to his aid. They’re fighting the four attackers, but all Kuryakin appears to be interested in is the left wrist of the Man he ran after. Finally, he manages to pull his shirtsleeve up.  81.",
      "characters": [],
      "action_text": "KURYAKIN Dammit! He goes bonkers, taking out his frustration on the attackers. Solo shakes his head in disbelief. SOLO Your father’s watch again? This has to stop. Kuryakin storms out of the building. EXT. SKORPIOS ISLAND - FORTRESS - DAY Alexander’s helicopter flies over Skorpios Island which is a C-shaped rock sticking out of the ocean. In the center of the C is a deepwater harbor, where a tanker is laid up for repairs. Built into the rock, defending the harbor, is the ancient fortress. On the other side of the harbor, there is a village with a thick cluster of fishing boats. There is a half mile long causeway, which joins the island to the mainland. EXT. SKORPIOS ISLAND - CASTLE - DAY Alexander’s helicopter descends into the castle courtyard. On three sides, there are massive stone walls, and the fourth side is the rock itself. In the middle of the fourth side, there is the bunker-like entrance to the old German gun emplacement, which has clearly been modernized and put to a different use. The helicopter lands. Alexander and Gaby climb out. ALEXANDER Please follow me. She does. They are lead through the heavily guarded castle to a large terrace, overlooking the sea. Seated on a chair, staring out into the distance, is the Professor. Alexander grabs Gaby’s arm.  82. ALEXANDER (CONT’D) Eighteen years. This is quite a moment. Gaby nods. ALEXANDER (CONT’D) Remember, you have very little time. Gaby looks Alexander in the eyes. GABY Leave him to me. EXT. SKORPIOS ISLAND - CASTLE TERRACE - DAY Gaby walks out onto the terrace. Her father turns at the sound of her footsteps. He looks pale and gaunt. He rises to meet her. UDO (SUBTITLE) (in German) Gaby? GABY (SUBTITLE) Father. He studies her face, not entirely sure. He then takes her hand. But instead of clasping it, he turns it over looking for something - a small scar on her wrist. UDO (SUBTITLE) Oh God. It really is you. He puts his head in his hands. UDO (SUBTITLE) (CONT’D) Forgive me. As you get older you start to do",
      "dialogue_count": 0,
      "word_count": 3405
    },
    {
      "scene_number": 18,
      "slugline": "INT. SKORPIOS ISLAND - CELL - NIGHT Gaby is seated on a stone bench. Outside the cell, one of the Guards looks at his watch. Nods to the other, who starts to unlock the door. INT. SKORPIOS ISLAND - CELL - NIGHT One of the men raises his gun to shoot her. Gaby closes her eyes. Ready to die. Two shots. Gaby opens her eyes to find Solo standing over her. The two Guards lie at his feet. Kuryakin and the others are behind in a fire-fight with other Guards. Solo helps her up. She’s shaking. GABY I... She throws her arms around him and holds on for dear life. Solo is awkward, doesn’t know what to do, but gradually his arms close around her. Kuryakin interrupts the moment. KURYAKIN The warhead. Gaby pulls herself together. Kuryakin continues down the corridor. Gaby follows. SOLO (to Jockelson) Find a radio and get us some help. He’s about to follow the others, when he spots something familiar about the Guard he just shot. He bends over him and takes something off his left wrist. INT. SKORPIOS ISLAND - CONTROL ROOM - NIGHT Empty. The bank of monitors flicker. Kuryakin enters, scans them, spots Alexander and Nikos passing various cars in a garage.  98.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 212
    },
    {
      "scene_number": 19,
      "slugline": "INT. SKORPIOS ISLAND - UNDERGROUND GARAGE - NIGHT Gaby, Solo, and Kuryakin enter. There’s a tunnel entrance at one end. Alexander’s car engine can be heard echoing back down the tunnel. There are several ATVs (lightweight SUV’s on steroids with huge tires) parked in a row, and a line of dirt bikes as well. Kuryakin slings his rifle over his shoulder and jumps on a bike. Solo heads for an ATV. SOLO (to Gaby) You drive. The ATV and the bike hurtle down the tunnel. EXT. SKORPIOS ISLAND - ROAD - EARLY MORNING It’s just starting to get light out as the ATV and the bike fly out of what appears to be a cave in side of the rock. They splash through a foot of ocean water, and careen up onto the causeway, which connects the island to the mainland. Alexander’s car is ahead in the distance. He’s in a souped-up Land Rover. INT. ATV - EARLY MORNING Solo and Gaby are travelling at tremendous speed, but Alexander is quite far ahead. GABY Do you hate me? SOLO Does it matter? GABY What do you think? Solo smiles. SOLO I think you can drive better than this. The road winds as it travels uphill.  99.",
      "characters": [],
      "action_text": "Gaby accelerates, taking the turns at alarming speed, but she’s not getting any closer. Suddenly, she jams on the brakes. Reverses. There’s a dirt track heading up a steep slope. GABY Hold on tight. They bounce up the hill at tremendous speed, flying through the air as they hit bumps. But once they crest the hill the track joins the road again, and now they’re just behind Alexander. Kuryakin has followed behind on his bike. Now, instead of taking the road, he continues across country, heading uphill to a vantage point where he can see the road below. In the meantime, the road is heading into woodlands as Gaby and Solo close in on Alexander. Gaby bumps the back of the Land Rover. Alexander jams on his brakes, trying to shake her off. It’s bumper cars until Gaby sees an opening. She accelerates up the bank and passes Alexander. She then swerves the ATV down in front of the Land Rover, forcing it off the road and into a ditch. The ATV flips and lands upside down next to the Land Rover. CUT TO: EXT. HILLTOP - EARLY MORNING Kuryakin can barely see the cars through the trees. He raises the rifle and looks through the sight. Relief as he sees Solo crawl out of the ATV and pull Gaby out. CUT TO: EXT. WOODLANDS - EARLY MORNING Nikos lies nearby, also unconscious. Solo tries to help Gaby to her feet, but she yelps in pain. GABY I think my leg is broken. SOLO I’m never getting in a car with you again.  100. Whack! Alexander comes out of nowhere, knocking Solo off his feet. Solo fights Alexander, but the Spartan is bigger and better. CUT TO: EXT. HILLTOP - EARLY MORNING Kuryakin tries to take a shot, but between the trees and the moving bodies, he’s just as likely to hit the wrong person. CUT TO: EXT. WOODLANDS - EARLY MORNING Solo is being pummeled. Alexander punches him so hard that he’s pretty much knocked senseless. Finally, he gets behind Solo and lifts him by the neck. CUT TO: EXT. HILLTOP - EARLY MORNING Kuryakin tracks the action through his sight. Finger on the trigger",
      "dialogue_count": 0,
      "word_count": 657
    },
    {
      "scene_number": 20,
      "slugline": "EXT. WOODLANDS - MORNING Clutching his shoulder, Solo reaches inside Alexander’s jacket and snags the disk, which he pockets. He then leans back against a tree. Kuryakin arrives his bike. Hurries over to Solo. Kuryakin grins, seeing that Solo is okay. KURYAKIN Sorry I had to shoot you, Cowboy. SOLO Something you’ve been wanting to do since we met. KURYAKIN Is he dead? Kuryakin goes over to Alexander’s body ostensibly to check and surreptitiously rummages through his pockets. SOLO I’ve got something for you. He produces Kuryakin’s father’s watch. SOLO (CONT’D) After all that, you shot the guy who took it and didn’t even recognize him. Kuryakin’s eyes light up. KURYAKIN I love you, Cowboy! He kisses Solo on both cheeks. SOLO Ouch. Be gentle with me! The sound of a helicopter approaching rapidly. A British naval helicopter lands in a field just beyond the trees, and Waverly steps out. INT. HELICOPTER - DAY A battered Solo, Kuryakin, and Gaby, whose leg in a splint, watch as four MEN carefully carry the warhead over to the helicopter, and place it in the hold.  102.",
      "characters": [
        "SOLO"
      ],
      "action_text": "One of the men comes over and says something to Waverly. He then walks over to the warhead, where they talk some more. The sound of the helicopter drowns out what they are saying. Waverly comes over to our trio. WAVERLY Well, it appears we have the wrong warhead. GABY But it’s identical to the one... WAVERLY It is, only there’s no plutonium. It’s a decoy. We’ve been had. (to pilot) Let’s go. Waverly gets into the front of the helicopter and starts barking orders into the radio. INT. HELICOPTER - DAY Waverly finishes on the radio. WAVERLY They’ve searched the castle from top to bottom. Nothing. No sign of the warhead or Elena Skorpios. We’ve had the place locked up all night. Radar, sonar, aerial patrols, no ships have been in or out of the harbor, including submarines. But... some fishing boats left the village this morning just before dawn. The Harbor Master is being brought to the carrier to help us. Solo stares at the decoy. CUT TO: INT. AIRCRAFT CARRIER - BRIDGE - DAY The HARBOR MASTER is standing in front of the group. HARBOR MASTER One hundred and twenty seven fishing boats left the village before dawn as they do every day.  103.  (MORE) They are now spread over a two hundred mile radius. CAPTAIN We don’t know the name, let alone the location of the boat that we’re looking for. It will be impossible for us to find and search more than twenty boats in the next few hours. I simply don’t have the manpower. Solo looks up, he shuts his eyes in thought. FLASHBACK TO: The photograph he saw in Alexander’s office. Achilles Skorpios with his kids standing in front his fishing boat. But the name is obscured. Only the middle two letters “ON” are visible. Solo thinks harder. FLASHBACK TO: A second, older picture (in gym) of Achilles Skorpios as a young man standing in front of the boat. This time only the last two letters “AS” are visible. FLASHBACK TO: Elena’s face as she says: ELENA My father was obsessed with the “Spartan way.” FLASHBACK TO: The Secretary giving Solo th",
      "dialogue_count": 1,
      "word_count": 2721
    }
  ]
}