{
  "slug": "the-sun-is-also-a-star-2019",
  "title": "the sun is also a star",
  "genre": "drama",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 20815,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. THE UNITED PALACE THEATER - DAY - FANTASY  A number of SENIORS stand in line. “Congratulations Class of 2019 - The Bronx High School of Science” is on the marquee. Natasha and Bev squeeze in as the line moves forward. NATASHA (V.O.) It’s a city where hard work and determination are constants against unknown variables in the equation for success--  INT. THE UNITED PALACE THEATER - EVENING - FANTASY  Inside the ornate auditorium, velvet seats are filled with FAMILY and FRIENDS. The STUDENTS, now dressed in graduation caps and gowns, enter single file to Pomp and Circumstance.  INT. STAGE - EVENING - FANTASY  PRINCIPAL and FACULTY on stage. Natasha’s poised at the edge. Like a runner in blocks. Her name is barely called when she marches across the stage to claim her diploma. NATASHA (V.O.) ...And dreams can become tangible when you reach out and grab them.  EXT. STATEN ISLAND BACKYARD - NIGHT - FANTASY  A Caribbean-American Graduation Party in full swing. Lights strung from corner posts. A Jamaican flag stretched across the fence. Jerk chicken and fish on the grill. Dishes with curried goat, oxtails, plantains, peas and rice. ADULTS in traditional garb. And TEENS on a makeshift dance floor. Find Natasha and Bev in the middle. Dancing. Laughing. NATASHA (V.O.) I wouldn’t have wanted this perfect night to happen anywhere but here: the city I’m proud to call my home. On Tasha’s face, smiling as she looks at the night sky filled with fireworks and stars. Twinkling. It’s truly magical. MATCH CUT TO: 2.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 258
    },
    {
      "scene_number": 2,
      "slugline": "INT. NATASHA’S APARTMENT - DAY - REALITY  A NASA STAR MAP on a wall. Pull out to reveal Tasha in a small apartment, moving boxes everywhere. NATASHA (V.O.) Or at least a city I used to call my home. Behind her, a LITTLE HAND pulls back the bright blue curtain separating the room. REVEAL: PETER, 9 years old, chocolate with dreadlocks and a grin from ear to ear. NATASHA (V.O.) Unless a cataclysmic blunder is corrected, the odds of me actually graduating with my friends are declining. Rapidly. Peter whips the curtain closed, unseen. NATASHA (V.O.) You see, I’m an illegal immigrant and my family is scheduled for deportation. Tomorrow. WHOOSH - Natasha pulls back the curtain. Peter is juggling a soccer ball on his knees in the next room. ZOOM in on Peter. PETER Look, Tasha! Peter fumbles with the ball. The ball gets away from him, bumping into a neat stack of Natasha’s books. NATASHA How many times do I have to tell you not to practice in our room?! Peter picks his nose and examines what he dug up. NATASHA (CONT’D) Ewww! Peter, stop it. You’ll never get friends that way. PETER Doesn’t matter. I’ll make new friends in Jamaica! Natasha sighs heavily, the weight of her family’s struggles on her shoulders. A key RATTLES in the lock. MRS. KINGSLEY, Natasha’s 40-ish, world-weary mother, drags in from work wearing a waitress uniform. 3.",
      "characters": [],
      "action_text": "She sees a kitchen full of dirty dishes.   NOTE:   Mr. And Mrs. Kingsley both speak with a   heavy Jamaican accent and dialect.  MRS. KINGSLEY Tasha. How many times I’m gonna have to tell you to clean the dishes before I come home? NATASHA You haven’t even closed the door yet and you’re already yelling-- MRS. KINGSLEY It’s not enough to pick up dirty plates at work? I come home to pick up dirty plates too?! NATASHA Mom, please. I’ll do it now. Mrs. Kingsley heads to her bedroom. Natasha goes into the kitchen, draws soapy water and washes the dishes. Mrs. Kingsley emerges from the bedroom wearing a bathrobe. NATASHA (CONT’D) You work too much. MRS. KINGSLEY Somebody gotta keep a roof over all our heads, child. Who else gonna do it? REVEAL: MR. KINGSLEY, late 40s, small frame, sad eyes, sitting in front of the TV. We haven’t noticed him until now. Mr. Kingsley watches as LAWRENCE OLIVIER performs a monologue from “Othello” on screen. He studies him intently. NATASHA (V.O.) My father’s an actor. At least, that’s why he came to America. But that’s not exactly how it’s worked out. PULL OUT: Mr. Kingsley performs the scene along with Olivier. He’s in perfect sync with the actor on TV. NATASHA (V.O.) It’s his fault we’re in this mess. Natasha finishes the dishes. Mrs. Kingsley makes eggs. MRS. KINGSLEY You want breakfast? 4. NATASHA I have an appointment at the Immigration Office this morning. It’s at eight. MRS. KINGSLEY You don’t think it’s time for you to give up now, Tasha? You don’t think what you’re doing is futile? Natasha grabs a piece of fruit off the table. NATASHA There’s still time, Mommy. We have today. And I’m going to use every last second. Can’t give up yet. PETER Don’t think of it as giving up. Think of it as embracing destiny. NATASHA I’d rather make my own. Peter smiles, turns up Sister Nancy’s “Bam Bam” and sings along. Natasha rolls her eyes. She grabs her headphones and her Physics textbook. PETER (re: textbook) We leaving, Tasha. You don’t have to tu",
      "dialogue_count": 0,
      "word_count": 674
    },
    {
      "scene_number": 3,
      "slugline": "INT. DANIEL’S APARTMENT - BEDROOM - DAY  DANIEL JAE HO BAE, 17, stands in front of a mirror sizing himself up in the suit he’s wearing. He adjusts his red tie, clearly uncomfortable in what he’s wearing. DANIEL (V.O.) Today’s the day my whole life has led up to... From outside the room, his mother, MIN SOO, 40s, calls out: MIN SOO (O.S.) (in Korean) Daniel!   I’m making you a special breakfast. Hurry down.  DANIEL (V.O.) The day of my college interview for Yale. DANIEL Coming! DANIEL (V.O.) The day that decides my future. Behind him, shelves full of the world’s greatest poets: Shakespeare, Shelly, Frost, Poe, Plath, Angelou, Hughes. DANIEL (V.O.) Normally I’d write a two-page poem about something of this magnitude. At least a haiku. But today, my anxiety’s holding me hostage. Daniel grabs his writer’s notebook, throws it into his satchel. Takes one final glance at himself. DANIEL (V.O.) Because I need every brain cell focused on nailing this interview. Daniel takes one final glance at himself, then exits.  INT. KITCHEN - DAY  Daniel’s mother steams   frozen dumplings. Daniel pours a bowl of Cap’n Crunch. She shakes her head disapprovingly. Min Soo speaks with a heavy Korean accent. 6.",
      "characters": [],
      "action_text": "MIN SOO Too much sugar. You need a sharp mind today. She grabs the bowl of cereal, replaces it with a plate of dumplings, and pours the dry cereal back into the box. DANIEL (V.O.) I’m pretty sure I inherited my mother’s anxiety...  INT. JFK AIRPORT - CUSTOMS - FLASHBACK  YOUNG MIN SOO and YOUNG DAE HYN, nervous and afraid, present their paperwork to the CUSTOMS AGENT. DANIEL (V.O.) Which started the day she uprooted her whole life in Korea to come to America. For most immigrants, moving to a foreign country is an act of faith. What if you can’t adapt? What if you’re not welcomed? What if you lose all sense of your identity and culture? INT. HOME - FLASHBACK - TWO YEARS LATER FAMILY and FRIENDS crowd the apartment. Min Soo holds her first born, CHARLIE, as ONE-YEAR-OLD DANIEL crawls toward various objects: a stethoscope, pen, basketball, etc. Each object represents a career or “fate.” THIS IS A KOREAN DOLJANCHI or “DOL” where the child “chooses their destiny.” DANIEL (V.O.) So when my brother and I were born, she gave us both an American name and a Korean name. So we would know where we were from. And where we were going. The family cheers as Young Daniel nears the stethoscope, then grabs the PEN instead to his parents’ dismay.  INT. KITCHEN - PRESENT  Min Soo interrogates her son between his bites of breakfast. MIN SOO How’s your grade in math? You don’t like math. 7. DANIEL B plus. But the rest are A’s. MIN SOO Why no A in math yet, Daniel? Aigo! It’s time you get serious... (then, in Korean)  Don’t be like your brother.  Right as she says this, Daniel’s brother, CHARLIE, 19, walks into the kitchen. Pretends he doesn’t hear this, but his resentful demeanor gives him away. MIN SOO (CONT’D) I made mandu. CHARLIE Awww. Daniel’s “special breakfast.” I’ll pass. Charlie strokes Daniel’s hair. Daniel slaps his hand away. DANIEL (V.O.) My brother, Charlie, is an asshole. Charlie grabs the box of Cap’n Crunch, then pours cereal and milk into a bowl and sits. He chomps loudl",
      "dialogue_count": 0,
      "word_count": 851
    },
    {
      "scene_number": 4,
      "slugline": "INT. USCIS - WAITING ROOM - LATER  Natasha frantically charges through the MULTI-CULTURAL RAINBOW of IMMIGRANTS. Heads over to the RECEPTIONIST. Sweating and short of breath. NATASHA Natasha Kingsley for Karen Whitney. The Receptionist checks her appointment sheet, and shakes her head. RECEPTIONIST You’re too late. You’ll have to call the main USCIS line and make a new appointment. NATASHA No, you don’t understand. I can’t reschedule! RECEPTIONIST I’m sorry. You’ll have to call the main line. The Receptionist shrugs and looks down, dismissing Natasha. Natasha starts to panic. NATASHA I don’t have time for that. This is an emergency. The trains were delayed. (getting emotional) Just-- could you please call Ms. Whitney? She told me to come back. RECEPTIONIST Your appointment was for 8 AM. It is now 8:15. She’s seeing another-- NATASHA Please. Just call her. Now! Natasha’s now hysterical voice rings through the reception area. The other applicants stare in her direction. NATASHA (V.O.) (CONT’D) I guess ‘desperation’ translates into every language. The Receptionist nods at a SECURITY GUARD standing by the door. He sets his jaw and turns toward Natasha. 10.",
      "characters": [],
      "action_text": "But before he can reach her, another door opens. A tall, thin, brown-skinned man beckons Natasha: LESTER BARNES, 40s. LESTER (to the Receptionist) It’s alright, Mary. I’ll take her.  INT. USCIS - LESTER BARNES’S OFFICE - MINUTES LATER  Natasha sits in front of an immaculately kept desk. Turns as Lester enters with a RED FILE in his hand. LESTER My name is Lester Barnes. NATASHA Hi, I’m-- He holds up a hand to silence her. LESTER Everything I need to know is in this file. Do yourself a favor and stay quiet while I read it. Natasha falls silent. Reaches across his desk and pockets one of his business cards. After a beat, Lester finally looks up. LESTER (CONT’D) Why are you here? NATASHA Karen--Ms. Whitney--told me to come back. She said maybe there was something-- LESTER Yeah, well Karen’s new. Your family’s last appeal was rejected. The deportation stands as is. You and your family will have to leave tomorrow. He closes the file and pushes a box of tissues toward her in anticipation of her   tears. Natasha shakes it off. NATASHA (V.O.) I didn’t cry when my father told us about the deportation orders. I’m not going to start crying now. Natasha gathers her things. Heads for the door. But she stops with her hand on the knob, swallows her pride. Turns around. 11. NATASHA So there’s really nothing you can do to help me? He taps the closed file with his fingers. LESTER Your dad’s DUI-- NATASHA Is his problem. Why do I have to pay for his mistake? LESTER You’re still here illegally. Natasha nods, on the verge of tears. She heads for the door. LESTER (CONT’D) I’ve been to your country. I’ve been to Jamaica. He smiles at the memory as Natasha turns back to him. LESTER (CONT’D) I had a nice time. Everything is irie there, man. You’ll be alright. Natasha glares at Lester. NATASHA Where did you go? LESTER Negril. Very nice place. NATASHA Did you leave the hotel grounds? LESTER I wanted to but my-- NATASHA But your wife didn’t want to because was she scared, right? LESTER No, it’",
      "dialogue_count": 0,
      "word_count": 1332
    },
    {
      "scene_number": 5,
      "slugline": "INT. GRAND CENTRAL STATION - MAIN CONCOURSE - CONTINUOUS  Daniel and Omar emerge from the train to find themselves in the main concourse of Grand Central Station. DANIEL How much time you got before work? OMAR ‘Bout an hour. Why? Daniel looks to the walkways situated behind on the massive windows overlooking the terminal. DANIEL It’s been a while since we went up. Today’s the perfect day. Daniel starts to make his way through the diverse crowd of people rushing to their trains. DANIEL (CONT’D) Come on! Omar follows after Daniel, almost losing sight of him in the pedestrian traffic.  EXT. TASHA’S HIGH SCHOOL - DAY  Tasha stands outside the fence of her school. Fighting tears. NATASHA (V.O.) It’s still hard for me to believe that after today I may never see this school again. INSERT SHOTS: She and Bev sitting down at the courtyard outside laughing, walking the hallways, gossiping, etc. BACK TO SCENE: The real Bev walks up. BEV Please tell me you have good news. NATASHA (V.O.) Bev’s the closest thing I have to a sister. The longest time we’ve ever been apart is two weeks. NATASHA I wish. I was late, so they wouldn’t let me see Ms. Whitney. 17.",
      "characters": [],
      "action_text": "BEV (desperate) So what does that mean? You’re leaving?! Isn’t there someone else you can talk to? Tasha pulls out the card. NATASHA I’ve got one last shot. This guy Jeremy Fitzgerald. He’s supposed to be some kind of immigration fixer. BEV Oh my God! That’s amazing! (then) Wait, why are you here? He should be “fixing” this! Go! NATASHA I’ve got a few hours before my appointment with him. BEV You should come to Chem Lab and mess with Mr. Busby. He’s got on his polyester mom jeans again. NATASHA My appointment’s uptown. I don’t want to rush. I’m just gonna hit the record store. Kill some time. The bell rings. BEV Text me the address. I’ll skip out after my test and we can grab lunch. NATASHA Perfect. They share a look. Bev heads back inside. Tasha puts her headphones on and queues up Major Lazer album. We hear GET FREE and see it carry her worries away.  INT. GRAND CENTRAL STATION - GLASS WALKWAY - DAY  Daniel and Omar chill behind the oversized windows of the main terminal, overlooking the bustling crowd below. All of Grand Central’s architectural glory in perfect view. 18. DANIEL My life’s gonna go one of two ways after today. If I don’t get into Yale, it’ll be Charlie all over again. And if I do...white jackets and picket fences from now until eternity. OMAR The American Dream. DANIEL Even if I win, I lose. What kind of future is that? OMAR If losing means you’re rich, sign me up. DANIEL I just wish I could do something about it. Daniel sighs. He turns over and lies face up on the walkway. DANIEL (CONT’D) There’s gotta be something more to it all than this. His gaze catches the gigantic mural of the Universe painted on the ceiling of the terminal. DANIEL (CONT’D) You ever notice that before? OMAR Notice what? Off Daniel’s look, Omar joins him on the ground, eyes up. The majesty of the mural is on full display. Several constellations are recognizable. DANIEL It’s a sign. OMAR Oh, see now, you’re just making stuff up. We’ve passed this thing a million times. 19. DAN",
      "dialogue_count": 0,
      "word_count": 2135
    },
    {
      "scene_number": 6,
      "slugline": "INT. MOM AND POP COFFEE SHOP - DAY  Daniel and Tasha sit across from each other at a cozy table. Tasha checks the time on her phone:   10:00 A.M.  DANIEL Wait. Why aren’t you in school? NATASHA (lying) I have a doctor’s appointment in an hour. Tasha sips her coffee. Silence. Daniel fidgets nervously. Blows on his cappuccino so hard a little foam flies up on his face. Tasha chuckles. She then looks at his satchel, suddenly curious. NATASHA (CONT’D) What do you keep in there? DANIEL Not much. My notebook. I carry it pretty much everywhere I go. Daniel pulls out a black notebook. Flips through it quickly. Tasha glances at it. Sees the handwritten blocks of text. NATASHA You’re not a poet, are you? DANIEL No, I just kind of dabble in it. For fun. Next year I’ll be pre-med. Self-conscious, Daniel quickly puts the notebook back in his bag. Tasha notices, leans in. NATASHA (flirting) So what are your poems about? Love? DANIEL Among other things. Yes, love. NATASHA I don’t believe in love. DANIEL Well it exists, whether you believe in it or not. 29.",
      "characters": [],
      "action_text": "NATASHA Oh really? Can you prove it? DANIEL Thousands of love songs. Poetry. The institution of marriage. NATASHA Words on paper. Never mind the fact that eating large amounts of chocolate has the same effect on you as falling in love. DANIEL I love chocolate. He laughs. Tasha laughs, too. DANIEL (CONT’D) You say it’s just words on paper, but you have to admit all those people are feeling something. NATASHA People just want to believe. Otherwise they would have to admit that life is just a random series of good and bad things that happen until one day, you die. DANIEL And you’re okay with believing that life has no meaning? NATASHA I’m okay believing in the things that science can make sense of. If love made sense, more than forty- eight percent of all marriages would make it. DANIEL Are your parents married? NATASHA Yeah, but if that’s what marriage is, it’s not for me. DANIEL So no fate, no magic, no meant-to- be for you? 30. NATASHA Boy, please. Quantum Physics is all the magic I need. DANIEL I don’t think I’ve ever met anyone so charmingly deluded. NATASHA And you find that appealing? DANIEL I find it interesting. (beat, then) What if I told you I could get you to fall in love with me scientifically? Without chocolate. NATASHA I would scoff. A lot. DANIEL I’m serious. It’s a thing. The New York Times had an article about it. Researchers put a bunch of couples in a lab and had them ask each other a bunch of intimate questions. Also, they had to stare into each other’s eyes for four minutes without talking. NATASHA That sounds ridiculous. DANIEL And yet, it’s a real thing. Daniel and Natasha stand in line at the register, waiting to pay. Daniel has his phone out. DANIEL (CONT’D) There are thirty-six questions. How about I choose ten randomly. NATASHA Knock yourself out. It’s never going to happen. DANIEL Great. Question number one, what are the five key ingredients to falling in love? 31. NATASHA I don’t believe in love, remember? (off his look) Okay. Fine--mutual",
      "dialogue_count": 0,
      "word_count": 671
    },
    {
      "scene_number": 7,
      "slugline": "EXT. NYC STREET - DAY  Tasha leads the way, darting in and out of pedestrian traffic, as Daniel struggles to keep up. DANIEL So, where are we headed? NATASHA I am heading to my appointment on the east side and you are, apparently, tagging along with me. DANIEL Yep. And while we’re walking... Daniel takes out his phone. DANIEL (CONT’D) You ready for more questions? NATASHA You are relentless. DANIEL Persistent. Now, question number two: Would you like to be famous and how? NATASHA You first. DANIEL I’d be a famous poet laureate. NATASHA And you’d be broke. DANIEL Broke with money But rich with words. NATASHA What does a poet laureate even do? DANIEL Offers wise and poetic counsel. Tasha makes some gagging sounds. DANIEL (CONT’D) Be cynical all you want, but many a life has been saved by poetry. 33.",
      "characters": [],
      "action_text": "NATASHA You’re not joking, are you? DANIEL What about you? What kind of fame do you want? NATASHA Easy. I’d be a benevolent dictator. Daniel laughs. DANIEL You know, all dictators think they’re benevolent. Even the ones holding machetes. NATASHA Nope. Pure benevolence from me. I would decide what was good for everyone and do it. DANIEL But what if what’s good for one person is not good for another? NATASHA Can’t please everyone. As my poet laureate, you could comfort the loser with a good poem. DANIEL Touché. She glances at him, feeling a surprising connection. They stop at a corner, waiting for the light to change. We enter a MUSICAL MONTAGE of them walking through the city as they get to know each other. The urban sounds melt away as a wistful piece of music takes over. Natasha soaks up the city she’s about to say goodbye to and Daniel continues to try and win her full attention. Daniel pulls out his phone again and begins scrolling through questions. Natasha watches him. NATASHA Tell me again why you’re wearing a suit? (off his groan) Come on, I get to ask questions too. 34. DANIEL Yale. Interview. NATASHA Really. Are you nervous? DANIEL I’m fine. My parents have only been prepping me for this my entire life. NATASHA They’re immigrants, huh? DANIEL Yup. NATASHA Mine too. Do you even want to go to Yale? DANIEL It doesn’t matter what I want. NATASHA It’s your life. DANIEL And what about yours? You sound like you’ve got it all figured out. NATASHA I’m going to be a data scientist. (off his look) Data scientists analyze data and recommend actions based on the results. They’re also very well- paid. DANIEL That’s so practical. Have you always known what you wanted to be? NATASHA Well, it wasn’t predestined. I did research on growing fields in the sciences. I chose one, and tada. DANIEL So, it’s not something you’re passionate about? She shrugs. 35. NATASHA I don’t want to have to rely on anyone or wind up working night shifts just to make ends meet. I can’t live off of",
      "dialogue_count": 0,
      "word_count": 5588
    },
    {
      "scene_number": 8,
      "slugline": "INT. KOREAN RESTAURANT - DAY  Daniel and Tasha sit at a booth in a small hole-in-the-wall joint. Tasha looks over the menu. DANIEL What do you think? NATASHA I’ll eat whatever you tell me to. Daniel rings the little bell attached to the table and a WAITRESS appears almost instantly. She gives Natasha a quick look, turns to Daniel. WAITRESS (in Korean) How can I help you? DANIEL (in Korean) We’ll have two seafood soon dubu, kalbi, and pa jun. The waitress nods and then walks off. NATASHA There’s a bell? DANIEL Awesome, right? It takes all the mystery out of food service. When will my waiter appear? When will I get the check? NATASHA Do American restaurants know about this? Bells should be mandatory. Daniel laughs. NATASHA (CONT’D) No, I changed my mind. Can you imagine some jerk just leaning on the bell demanding ketchup? The Waitress returns and places the soup and two uncooked eggs on the table. She tosses paper-clad spoons and chopsticks into the center of the table. NATASHA (CONT’D) Oh, can I have a fork, please? The Waitress gives her a disapproving look, then walks off. 63.",
      "characters": [],
      "action_text": "NATASHA (CONT’D) Does this mean she’s not going to bring me a fork? Daniel laughs. DANIEL Don’t worry about her. Try this... Daniel pulls the soup bowl towards him. DANIEL (CONT’D) This is   soon dubu. Tasha watches as he cracks the egg into the soup. She does the same, then dips her spoon in and takes a bite. NATASHA Mmm. It’s delicious. Daniel smiles as Tasha does a little happy dance. He watches her eat, amused. A stream of traffic flowing through a door in the rear of the restaurant catches Tasha’s eye. NATASHA (CONT’D) What’s going on back there? This some kind of Korean mafia joint? DANIEL Oh, no. That’s the norebang. (off her look) Korean karaoke. NATASHA Then why don’t I hear any music? DANIEL They have private rooms. Koreans are all about embarrassing themselves in private. A beat, then a mischievous look comes over Daniel’s face. NATASHA Why are you looking at me like that?  INT. NOREBANG - PRIVATE ROOM - NIGHT  A small, dimly lit room. Plush, red leather couches. A large, square coffee table sits in front of the couch. On it, a microphone and a remote. Next to the door there’s a large TV. 64. Daniel pours over the thick song book, he’s been flipping for a while, agonizing over it. Natasha watches him. NATASHA Just choose a song. DANIEL This is norebang. You don’t choose a song. A song chooses you. NATASHA How poetic. DANIEL Isn’t it? NATASHA I don’t know, most poems I’ve read are about three things: love, sex, or the stars. You poets are obsessed with stars. Falling stars. Shooting stars. Dying stars. DANIEL Stars are important. NATASHA Sure, but why not more poems about the sun? The sun is also a star and it’s the most important one. That alone should be worth a poem or two. DANIEL Being the most important star doesn’t make it the most poetic. Who wants to write about something so domineering? I’d rather ruminate on the romantic underdogs that play in the night sky. NATASHA Domineering? You’ve got it all wrong. The sun is a benevolent star. A giver...it’",
      "dialogue_count": 0,
      "word_count": 1093
    },
    {
      "scene_number": 9,
      "slugline": "EXT. NOREBANG/NEW YORK STREET - DAY  Tasha and Daniel squint and shield their eyes as they crash out into the sunlight. DANIEL God, it’s bright out. NATASHA Back to reality. With tears still in her eyes Tasha strides down the sidewalk clearly to get away from everything. DANIEL Wait, what just happened? NATASHA Nothing happened. DANIEL Bullshit. You’re acting completely different. What changed? NATASHA Nothing’s changed. Daniel catches up to her and Tasha looks away. DANIEL What are you so afraid of? NATASHA What are you talking about? DANIEL There’s something real here. I know you feel it too. NATASHA Oh, you know how I feel? Do you? You don’t know shit Daniel. DANIEL What’s your problem? NATASHA This. You and me. This thing. Well this can’t happen. It’s over ok. DANIEL Hey don’t I have a say in this. I know there’s something here. 68.",
      "characters": [],
      "action_text": "Natasha leans in and speaks low, with intesity. NATASHA Oh, well do you know that I’m not a citizen? Huh? So you know that my family is being deported tomorrow? Huh do you know that? Do you know that all this - whatever it is. It NOT meant to be. Do you know that part? Daniel stares, silent. Totally blindsided. DANIEL What? You’re leaving the country? Why didn’t you tell me. It’s like this is all a lie?! NATASHA I didn’t lie to you. I just didn’t tell you everything. DANIEL I postponed my appointment because of you! NATASHA I didn’t ask you to do that. DANIEL But you didn’t say you’d be living in another country in less than twenty-four hours, either. NATASHA It wasn’t your business. DANIEL And it is now? NATASHA Look, Daniel. I told you not to fall for me, okay? I tried. DANIEL No, here’s how you try. You open your mouth and you say the truth. Just say, “Daniel, I’m leaving the country.” “Daniel, don’t fall in love with me.” NATASHA You think a few kisses mean something? 69. DANIEL I think those kisses did. NATASHA Lets just end this. You have your plans and I have mine. DANIEL Sure. Whatever. I get it. Just like that. OK, Have a nice life. Daniel grabs his jacket and strides away. Tasha watches him go.  INT. BLACK HAIR CARE STORE - DAY  Daniel walks into the store visibly upset. His dad’s busy with a customer. Charlie’s face goes into a full asshole smirk as he sees Daniel is alone. CHARLIE Where’s your girlfriend? She dump you already? DANIEL Fuck you, Charlie. Charlie stops smirking, takes a good look at Daniel, noting his tie and jacket are missing. Shirt untucked. CHARLIE Why. Are. You. Here. Little. Brother. Shouldn’t you be interviewing for Second Best School today? A beat. Daniel stares at Charlie, disgusted. DANIEL Why are you such an asshole? Seriously. What’d I ever do to you? CHARLIE Is that what you came back for? To whine about me being mean to you? DANIEL So you don’t have an answer? That’s just the way you’re made? CHARLIE That’s right. I’m stronger",
      "dialogue_count": 0,
      "word_count": 1611
    },
    {
      "scene_number": 10,
      "slugline": "INT. FITZGERALD’S OFFICE - PRESENT  Fitzgerald’s still listening. Now puzzled. FITZGERALD Can’t believe he’d get behind the wheel like that with so much at stake. NATASHA I don’t think he was thinking about anything but how happy... how   free  he was in that moment. On Tasha’s face. There’s more to it than she’s saying. NATASHA (V.O.) That was part of it, but not the whole story...  INT. NATASHA’S APARTMENT - FLASHBACK - NIGHT  Tasha leans her ear against the door of her parents’ bedroom. INSIDE Mr. and Mrs. Kingsley argue. MRS. KINGSLEY When we met you said all my dreams would come true. You remember that, Kingsley? You’re a good actor because you make me believe all the pretty things you say. MR. KINGSLEY I’m tired of your dreams. What ‘bout mine? If it wasn’t for you and the children, my life would be better. If it wasn’t for you and the children I would have all the things I want. I’d be doing the thing God put me on this earth to do.  IN THE HALLWAY -   Tasha slumps down as her father’s words hit her heart. NATASHA (V.O.) But I don’t tell Fitzgerald that part-- that we are my father’s greatest regret because we got in the way of his dreams. 76.",
      "characters": [],
      "action_text": "INT. FITZGERALD’S OFFICE - PRESENT  Fitzgerald sits silent, hands steepled as he thinks. NATASHA (V.O.) I wonder how many stories like mine has Fitzgerald’s heard over the years. How many hopeless cases he’s had to sit through... Fitzgerald looks over one of the forms then gets a yellow legal pad out of his desk drawer, then jots something down. Then he sits in silence for a long beat. His expression very hard to read. Tasha stares at him, nervously. NATASHA (V.O.) Each moment of silence is soul crushing. I knew I shouldn’t have listened to Hannah. Shouldn’t have gotten my hopes up... Then finally-- FITZGERALD Miss Kingsley-- NATASHA It’s okay. I know I’m out of options. Thank you for your time. Tasha moves to get up. But Fitzgerald waves her back down. FITZGERALD You’re never out of options. NATASHA What do you mean? Are you saying you can fix this? FITZGERALD I’m going to go see a judge friend of mine. He’ll be able to get the Voluntary Removal reversed so at least you don’t have to leave tomorrow. After that we can file an appeal with the BIA–the Board of Immigration Appeals... (checks his watch) Give me a couple of hours. I can make this happen. Just need to get the judge to file by six o’clock. Tasha’s taken aback. 77. FITZGERALD (CONT’D) I’ll call you when it’s all sorted out. NATASHA But you think you can sort it out? FITZGERALD Yes. I’ve done it many, many times before. You’ll be fine. He smiles at her confidently. Tasha’s eyes light up. She throws her arms around him in a big, impromptu bear hug. NATASHA Thank you. You have no idea how much this means to me. My family. NATASHA (V.O.) I should call my parents and tell them, but right now, all I can think about is Daniel.  INT. DINER - DAY  Daniel sits at an empty booth. Omar sees him and walks over, looks him up and down. OMAR Dude, what the hell happened to you? Did you get robbed? DANIEL What? (then realizing) I got into a fight. With Charlie. OMAR Oooh! Finally! That dick’s had it coming for a good ten ye",
      "dialogue_count": 0,
      "word_count": 812
    },
    {
      "scene_number": 11,
      "slugline": "INT. BLACK HAIR CARE STORE - DAY  The bell on the door CHIMES with happy optimism as Tasha steps in. Looks behind the counter and sees Charlie on his phone. He barely looks up as Tasha approaches the counter. NATASHA Hey. Charlie finishes with his text and finally looks up. His eye is red and swollen. NATASHA (CONT’D) Wow! That thing’s gonna be black and blue by morning. Charlie raises his hand and touches his eye self-consciously. His knuckles are bruised too. CHARLIE Daniel’s not here. NATASHA I know. I was hoping you could help me find him. Do you have his cell phone number? Charlie leans back in his chair. CHARLIE You two get into a fight? NATASHA Do you have it or not? He flips his phone end over end. CHARLIE What’s your deal? You got a Korean boy fetish or something? NATASHA Charlie. Please. I have something important I need to tell him. CHARLIE Tell me why I should. Tasha thinks... NATASHA Well, think about how much trouble I’ll cause for your brother. He’s in love with me. (MORE) 80.",
      "characters": [],
      "action_text": "You give me his number, he chases after me and you can just sit back and enjoy the show while your parents freak out on him. It’s like you said-- it’ll take all the heat off you. Charlie throws his head back and laughs. CHARLIE That’s a pretty decent pitch. Charlie takes a beat, considers this. Then he pulls up the number and shows it to a surprised Tasha.  EXT. NEW YORK STREET/EXT. HARLEM STREET - MINUTES LATER  INTERCUT AS NECESSARY: Daniel stares down at a number he doesn’t recognize on his phone. Answers it anyway. DANIEL Hello? NATASHA Is this Daniel? DANIEL Natasha? NATASHA Yes, it’s me. Your brother gave me your number. DANIEL Charlie? Yeah, right. Who is this? NATASHA Daniel, it’s me. It’s really me. Daniel stands up, moving away from Omar. DANIEL Why are you calling me? NATASHA Just give me a chance to explain. Daniel is still hurt from their fight. NATASHA (CONT'D) 81. DANIEL Are you sure I’m not a not a   waste of time?  NATASHA Come on, Daniel. It’s complicated. Meet me somewhere. Please? Off Daniel’s look, he’s softening.  EXT. 2ND AVE - MANHATTAN - DAY  Montage of Natasha and Daniel walking and talking through the city. Natasha is explaining her deportation situation to Daniel. Quickly cut, this scene is set to a bittersweet musical theme. Daniel digests her story. DANIEL And I thought my home life was complicated. What’s the good news again? NATASHA Oh, a new lawyer thinks he can get the order reversed... DANIEL Does that mean-- NATASHA I   might   not have to leave tomorrow. DANIEL (beaming) What? Seriously? No way! Daniel LIFTS Tasha off her feet and SPINS her around. NATASHA He wasn’t a hundred-percent sure, but there’s a chance. DANIEL I can’t believe it. Daniel holds Tasha. Their eyes meet. Daniel tilts forward. Before he can kiss her, she pulls away with excitement. NATASHA I got an idea. She takes his hand and leads him towards... 82.",
      "dialogue_count": 0,
      "word_count": 513
    },
    {
      "scene_number": 12,
      "slugline": "EXT. ROOSEVELT ISLAND TRAM STATION - MANHATTAN - DAY  The little Roosevelt Island tram car glides over the East River and into the station. Natasha and Daniel buy tickets.  INT. ROOSEVELT ISLAND TRAM - DUSK  The tram is empty but for Daniel and Tasha. All of New York is in view. A breathtaking panorama. DANIEL Last time I was on this thing was in second grade. And there was an old guy who smelled like tuna fish. NATASHA I hate tuna fish. DANIEL Right? Now I’ve got an idea. Daniel scrolls a playlist on his phone and presses PLAY. We hear PURPLE RAIN by Prince: Tasha smiles. He’s cute. His striking looks illuminated by the setting sun. She looks awkwardly at the floor, then out the window, laughs. He takes her hand, pulls her close. They dance slowly in the middle of the sky. The MUSIC PLAYS as We SWEEP around the car, all of New York City glimmering around them. NATASHA Is it gonna hurt if I kiss you? DANIEL It’ll be a good pain. She pulls him in. Then, a kiss like no other. Sparks fly. Tasha opens her eyes. She pulls back. NATASHA All our kisses aren’t going to be like that are they? DANIEL Like what? NATASHA You know. Insane. Daniel smiles. 83.",
      "characters": [],
      "action_text": "DANIEL I don’t know... maybe we should try it again and see. They kiss again, holding one another as the music continues to play. The entire city lit up at night. Lights twinkling in the surrounding skyscrapers, like stars in the sky.  EXT. ROOSEVELT ISLAND - DOCK - NIGHT  Manhattan glows across the East River. Tasha rests on Daniel’s chest, wrapped in his arms. DANIEL It’s getting late. Are your parents going to be worried about you? NATASHA They’re okay...told them I was with Bev tonight. What about your parents? DANIEL I’ll deal with them later. Tonight’s about us. NATASHA In that case...got any more of those questions for me? DANIEL You’re not in love with me yet? NATASHA (smiles) Nope. DANIEL Don’t worry. We’ve got time now. Tasha nuzzles further into Daniel’s warm body. DANIEL (CONT’D) How about the dinner guest question? NATASHA You mean who I’d invite? DANIEL Yup. 84. NATASHA Easy. Carl Sagan. DANIEL Who? NATASHA You’d like him...a scientist   and   a writer. It was almost romantic how much he loved the universe. (then) People think science is so cold, but it isn’t true. It actually makes you appreciate your life. DANIEL Meaning... Tasha smiles, shifts her gaze upward to the heavens. NATASHA Think about it...the universe is 99.99999% empty space. Nothing but rocks and burning stars spread out over a billion galaxies--and yet here we are, the two of us together, looking out at the universe. We won the cosmic lottery just by being born...the time we have on this earth is extraordinary. It’s up to us to make the most of it. Daniel is speechless. Charmed by her words. They lock eyes. DANIEL I want to make the most of everything...with you. Daniel’s instincts take over. He kisses her. A SHOOTING STAR begins a TIMELAPSE of the night sky, ending as the sun rises above the New York skyline.  EXT. ROOSEVELT ISLAND - DOCK - DAY  Tasha’s already up, watching the sunrise. Daniel’s ALARM goes off, waking him. Tasha greets him with a kiss. TASHA Good morning. 85. DANIEL I",
      "dialogue_count": 0,
      "word_count": 1835
    },
    {
      "scene_number": 13,
      "slugline": "INT. NATASHA’S BUILDING - HALLWAY - DAY  Daniel fidgets with his suit. Tasha feigns a smile. DANIEL Should I take my jacket off? I feel like an idiot. NATASHA You don’t have to be nervous. DANIEL I’m going to meet your parents. Now’s as good a time to be nervous as any. He unbuttons the jacket but doesn’t take it off. NATASHA The good thing is, you can screw up all you want. You’ll probably never see them again.  INT. NATASHA’S APARTMENT - CONTINUOUS 33   33 Tasha cautiously steps in, followed by Daniel. Peter packs suitcases as he sways to loud dancehall music. MRS. KINGSLEY Turn that music off. Peter does just that as Tasha’s Mom sees her. MRS. KINGSLEY (CONT’D) Lawd, ‘Tasha. I been calling and calling you for–- Mrs. Kingsley notices Daniel and pauses. MRS. KINGSLEY (CONT’D) Who’s this? NATASHA This is Daniel. Mrs. Kingsley zeroes in. Examines Daniel more closely. DANIEL Sorry to meet you under these circumstances, Mrs. Kingsley. Daniel shakes Mrs. Kingsley’s hand, then Peter greets him. 94.",
      "characters": [],
      "action_text": "PETER (smiling wide) ’Tasha’s never brought a boy here before. Mrs. Kingsley waves Tasha to the side. MRS. KINGSLEY ’Tasha, I need to talk to you. NATASHA Is it about Daniel? Because if it is, we can just do it right here. He’s my boyfriend. Mr. Kingsley walks in as the words leave Tasha’s lips. MR. KINGSLEY Since when do you have a boyfriend? That’s what you been doing all day and night instead of helping your family pack up? NATASHA No. What I was doing was trying to fix your mistakes. MR. KINGSLEY It don’t look nothing like that to me. (turns to Daniel) You know the situation? Daniel nods. MR. KINGSLEY (CONT’D) Then you know that now’s not the time for strangers to be here. NATASHA He’s not a stranger. He’s my guest. MR. KINGSLEY And this is my house-- NATASHA  Was   your house. You weren’t responsible enough of a father to keep it, remember? Or maybe you couldn’t handle the responsibility of being a father at all... MR. KINGSLEY What’s that supposed to mean? 95. NATASHA I heard what you told mom after the play-- MRS. KINGSLEY Baby. There’s no point in rehashing all this now. MR. KINGSLEY No, man. No, man. I want hear what she has to say to me. Just as father and daughter square off. Daniel interjects. DANIEL Tasha, you don’t have to-- Mr. Kingsley pushes Daniel back. MR. KINGSLEY Say what you have to say, Tasha! Tasha looks at Daniel, she wants to do this. She steps up to her father. NATASHA I heard what you said about me and Peter... That we were your greatest regrets. How could you say that about your own children? The steam comes out of Mr. Kingsley’s engine. He searches futilely for words... NATASHA (CONT’D) I’m sorry that life didn’t give you all the things you wanted. MR. KINGSLEY I didn’t mean it ‘Tasha. It was just talk. All of it was just–- She holds up her hand to stop him. Tears pool in Mr. Kingsley’s eyes. NATASHA Maybe you were right. Maybe you weren’t meant to have us. Maybe you really were cheated. MR. KINGSLEY (shaking his head) Was just talk ‘Ta",
      "dialogue_count": 0,
      "word_count": 1923
    },
    {
      "scene_number": 14,
      "slugline": "INT. AIRPORT - CONTINUOUS Natasha and her family enter the long TSA security line. CLOSE ON her ticket. ONE WAY. EXT. AIRPORT - CONTINUOUS The taxi pulls up to Tasha’s terminal. Daniel hands the cabbie a few bucks and then takes off running. INT. AIRPORT - CONTINUOUS Daniel sprints through the airport, searching for Tasha. TICKETING AREA - CONTINUOUS Daniel panting heavily, hair in his face. No Tasha. He looks up... ON THE DEPARTURES BOARD Countries from all over the world. He finds the flight to Jamaica. Daniel notes the gate. DARTS off. INT. TSA SECURITY CHECKPOINT - CONTINUOUS Tasha and her family wait their turn in the TSA line. ON DANIEL Searching the crowded line for her. No Tasha. Then finally... He spots a familiar AFRO in the crowd of people. He slows to a brisk walk, fixes his hair, then ducks under the stretched barriers, cutting the line. CLOSE ON NATASHA She’s lost in her own world, head down. Forlorn. Then... DANIEL (O.S.) ‘Tasha! She turns at the sound of her name. ANGLE ON DANIEL His eyes go WIDE... 104.",
      "characters": [],
      "action_text": "It’s TASHA! She looks on at Daniel, in disbelief. NATASHA What are you doing here? DANIEL Marry me. Then you can legally stay. NATASHA Marry you? You can’t be serious. (off his look) You are. DANIEL You love me, right? Isn’t that what you just said? NATASHA I do, but-- DANIEL So we’ll elope and we’ll move somewhere cheap... I’ll get a crappy job and write at night... and you can finish school and graduate with your friends and then become a data scientist or-- an astronomer! You can do whatever you want, Tasha. Just stay. NATASHA Daniel... listen. I do really love you. But we have to be smart. We’ve only known each other for a day. A day. You keep saying we’re meant to be, but what if we’re not? An ANNOUNCEMENT drowns her out. GATE AGENT (V.O.) (loudspeaker)  This is the boarding call for flight 436 to Jamaica...  Time’s up. Tears gather in Tasha’s eyes. She takes Daniel by the hand. NATASHA Right now, this is real life. The plane waiting on the tarmac to send me and my family back to Jamaica is very real. I tried to stay... (MORE) 105. I tried everything and I failed, and now that’s it. I have to go. Tasha lets a single tear fall down her face. Daniel wipes it off. They stand face-to-face in the security line. DANIEL I don’t want to lose you. NATASHA What happens next is up to us. We decide our fate. There’s Facetime, emails, Skype... we’ll figure it out. We’re not going to give up, okay? Tasha plants a final kiss on Daniel’s cheek, then rejoins her family in the security line. Daniel looks on, distraught.  INT. TASHA’S PLANE - DUSK  Tasha stares out the window as the sun begins to set. Her mother pats her arm reassuringly. MRS. KINGSLEY It’s going to be okay, Tasha. You’ll see... Tasha manages a small smile. The plane ascends into the night sky. Tasha looks out the window watching the city fade. NATASHA (V.O.) From up here, the city lights look like earth-bound stars. And I know one of those stars is Daniel...  INT. AIRTRAIN - DUSK  Daniel sits on a train, watches",
      "dialogue_count": 0,
      "word_count": 606
    },
    {
      "scene_number": 15,
      "slugline": "INT. TASHA’S PLANE - DUSK  Natasha looks out the window at the city below. The plane climbs higher and higher, into the clouds. DANIEL (V.O.) You are the master alchemist. You light the fire of love in earth and sky in heart and soul.  INT. AIRTRAIN - DUSK  Daniel gazes out the window at all the buildings lit up with people inside, in their homes. DANIEL (V.O.) Through your star... All opposites unite. More than a star.  INT. TASHA’S PLANE - DUSK  Natasha’s face looking out at the horizon. The glow of the sun hits her face just as it sets. DANIEL (V.O.) You are my sun.  EXT. AIRTRAIN - NIGHT  Drone shot of the little train snaking through Queens at night. The Manhattan skyline glimmers in the background. DANIEL (V.O.) My mom’s gonna be pissed when I get home. And that’s fine. Because this time next year, I’ll be someplace else. I don’t know where, but not here. And not Yale either. Am I making a mistake? Maybe. But it’s mine to make.  BEDROOM - NIGHT  SPLIT SCREEN: The two share stories of their day via SKYPE. NATASHA (V.O.) Over the next year, we tried hard to make it work... 107.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 203
    },
    {
      "scene_number": 16,
      "slugline": "INT. KINGSTON HIGH SCHOOL - CLASSROOM - DAY  Tasha’s TEACHER hands her an exam back. It’s an “A.” Her new JAMAICAN BESTIE sees the “A” and gives Tasha a smile. In her bag, her phone lights up. A missed call from Daniel. NATASHA (V.O.) But time and distance are love’s natural enemies.  EXT. HUNTER COLLEGE - DAY  Daniel sprints from the building, hops on his bike and pedals furiously. NATASHA (V.O.) And the days are full.  INT. NYC RESTAURANT   - NIGHT  Daniel runs in, throws on his waiter apron and gets ready for his shift. Nods to Omar who’s taking a dish out into the dining room. In his bag, his phone rings. A Facetime request from Tasha that goes unanswered. DANIEL (V.O.) It’s not that I wanted to let her go...I had to.  EXT. JAMAICAN TOWN - NIGHT  Tasha and her NEW FRIENDS walk through a small town, having a good time. They’re surrounded by little stores and merchants selling their wares. She laughs at a CUTE BOY’S joke. DANIEL (V.O.) It wasn’t possible for her to live in two worlds simultaneously. Heart in one place, body in another.  INT. BOOKSTORE OPEN MIC - NIGHT  Daniel, now in his early 20’s, new hair cut, still sexy, stands at the mic, visibly nervous, reading his poem. DANIEL You are the master alchemist. You light the fire of love in earth and sky in heart and soul. 108.",
      "characters": [],
      "action_text": "NATASHA (V.O.) I let go of Daniel to avoid being ripped apart.  INT. ASTROPHYSICS LAB - DAY  Tasha, now in her early 20’s, engages her CO-WORKERS in a passionate discussion at work. DANIEL (V.O.) And as more years passed, we both entered the adult world of practicalities and responsibilities...  EXT. DANIEL’S APARTMENT - DAY  Daniel reads a rejection letter from a publishing company. He’s heartbroken. NATASHA (V.O.) When my mom died, I thought of him...  INT. TASHA’S APARTMENT - DAY  Later, still wearing her black funeral dress, Tasha looks at the norebang selfie of her and Daniel. NATASHA (V.O.) The magic of that day...  INT. SECOND COMING RECORD STORE - DAY  Daniel walks in. DANIEL (V.O.) ...all the little coincidences it took to get us to meet and fall in love. Daniel peruses the aisles. DANIEL (V.O.) Tasha often talked about the number of events that had to go exactly right to form our universe. She’d said falling in love couldn’t compete. 109. Daniel picks up Lou Reed’s “Transformer,” smiles. DANIEL (V.O.) But I’ve always thought she was wrong about that...  INT. AIRPLANE - NIGHT CHYRON: FIVE YEARS LATER  A FEMALE FLIGHT ATTENDANT walks down the aisle checking on passengers. In the b.g., We SEE a pair of headphones atop a BIG CURLY AFRO that’s been dyed PINK at the ends. DANIEL (V.O.) Maybe our Universe was just taking longer to form... We MOVE IN. It’s Natasha, sitting in the aisle seat. A LITTLE GIRL (6) colors in her book of the COSMOS next to her. The girl meticulously details an image of a STAR with a yellow crayon. We HEAR Prince’s “Purple Rain” coming from Tasha’s headphones. The Little Girl taps Natasha’s shoulder. LITTLE GIRL What are you listening to? NATASHA Just something I like to play when I travel. Do you want to hear it? The girl NODS. Tasha puts the headphones over her ears. Natasha HUMS along to the music. A YOUNG MAN seated in front of them turns around. He peers back at them, his face obscured by the seat. After a verse and a chorus or so, t",
      "dialogue_count": 0,
      "word_count": 710
    }
  ]
}