{
  "slug": "the-haunting-of-hill-house-101-steven-sees-a-ghost-2018",
  "title": "the haunting of hill house 101 steven sees a ghost",
  "genre": "drama",
  "format": "series",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 12923,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HILL HOUSE, THEN - NIGHT Dense, New England woods, lit only by the moonlight. The leaf- less branches crossing our frame like skeletal hands. STEVEN (V.O.) No live organism can continue to exist sanely under conditions of absolute reality, which is why all conscious things - man, child, and beast - must sleep. And dream. The camera moves beyond the trees and branches to REVEAL: A sprawling family home in the woods, all by itself. Large, striking, and brimming with history. Huge windows, brick and iron, with hints of the Gothic in its architecture. The longer one stares, the more off-kilter the house seems to be. All around, the signs of a RENOVATION IN PROGRESS. Scaffolding, tools, abandoned to the late hour. Someone is working hard on this house. LEGEND:   HILL HOUSE. THEN.  STEVEN (V.O.) Hill House, not sane, stood by itself against its hills, holding darkness within. It had stood so for a hundred years before my family moved in, and it might stand for a hundred more. INT. HILL HOUSE, THEN - CONTINUOUS We float through the halls. Past the grand staircase. Past the large, ornate windows. The architecture is old, but the dressing is clearly 1990’s. Small HOME IMPROVEMENT projects throughout the house. Fresh paint on some elements, absent from others. STEVEN (V.O.) Within, walls stood upright, bricks met neatly, floors were firm. Silence lay steadily against the wood and stone of Hill House... We linger on details: CHILDREN’S TOYS, abandoned to the late hour. Patched dry-wall, corners of the bannister in the midst of renovation.",
      "characters": [],
      "action_text": "FAMILY PHOTOS of the CRANES: HUGH (late 30’s), his wife MARY (late 30’s), and the children: STEVEN (11), SHIRLEY (9), THEODORA (7) and the twins, LUKE and NELL (5). STEVEN (V.O.) ... And whatever walked there, walked alone. CUT TO: INT. STEVEN’S ROOM, HILL HOUSE, THEN - CONTINUOUS A boy’s room, with all the expected flourishes of the nineties: a TV, video games. We float toward the boy, asleep in his bed, moonlight on his face. He is YOUNG STEVEN (11). We come to rest on Steven’s face, as he’s stirred from sleep by a sound... The sound of a CHILD CRYING. He blinks, sitting up. CUT TO: INT. UPSTAIRS HALLWAY, HILL HOUSE, THEN - CONTINUOUS He steps into the hallway, looking smaller against the sheer size of the home. High ceilings, archways. The crying is LOUDER now. He sees his sister YOUNG THEO (7) standing by her door, rubbing her eyes. The crying woke her too. YOUNG STEVEN It’s okay Theo, go back to bed. YOUNG THEO Should we wake mom and dad? YOUNG STEVEN I’ve got it. He moves past her, toward the last door in the hall. He pushes it open. CUT TO: 2.",
      "dialogue_count": 0,
      "word_count": 458
    },
    {
      "scene_number": 2,
      "slugline": "INT. NELL’S ROOM, HILL HOUSE, THEN - CONTINUOUS He moves into the room. In the soft glow of the night light, he sees YOUNG NELL (5) perched at the foot of her bed. Crying her little tears, clearly afraid. YOUNG STEVEN You okay Nellie? She shakes her head “no.” YOUNG STEVEN (CONT’D) You scared? She shakes her head “yes.” YOUNG STEVEN (CONT’D) That’s okay, I get scared too sometimes. He steps into the room, and looks over to the bed on the other side, where Nell’s twin brother YOUNG LUKE (5) sleeps soundly, despite his sister’s cries. YOUNG STEVEN (CONT’D) Luke sleeps through anything, huh? What was it? YOUNG NELL (beat) The bent-neck lady. YOUNG HUGH (O.S.) Oh, her again. They turn. Standing in the doorway is YOUNG HUGH CRANE. In his pajamas, eyes tired - but still managing a gentle smile. YOUNG HUGH (CONT’D) Where was she? Nell POINTS to the foot of the bed, almost where her brother is standing. Hugh smiles, stepping into the room. YOUNG HUGH (CONT’D) Oh boy, let’s take a look. He moves to the spot. YOUNG HUGH (CONT’D) Here, huh? She nods. 3.",
      "characters": [],
      "action_text": "YOUNG HUGH (CONT’D) Your big brother must have scared her away. Big brothers are good like that. YOUNG NELL What if she’s hiding? YOUNG HUGH Well let’s make sure she isn’t. Where could she go? Nell’s eyes go to the foot of the bed. Hugh follows her gaze, and crouches to look underneath the bed. YOUNG HUGH (CONT’D) Anyone under here? You better come out, or you’re in trouble. (beat) Hmmm. Not there... He looks up at Nell, who points toward the closet. YOUNG HUGH (CONT’D) Ah. Steven steps aside, watching as his dad goes through the motions for Nell. He smiles, watching close. Learning how. Hugh opens the closet door, moving the clothes to the side. YOUNG HUGH (CONT’D) You better come out, bent-neck lady. Stop scaring Nellie. (beat) Nope, she’s long gone. Nell relaxes a little. YOUNG HUGH (CONT’D) And now, everybody can go back to bed. Steven heads for the door, turning to watch his father tuck Nell back into bed. YOUNG HUGH (CONT’D) There we go. Do you remember what we talked about before? About our dreams? YOUNG NELL They can spill. 4. YOUNG HUGH That’s right. Just like a cup of water spills sometimes. And a kid’s dreams are special, they’re like - At the door, Steven smiles. He remembers this part... YOUNG STEVEN (very softly) An ocean. YOUNG NELL An ocean. YOUNG HUGH That’s right. Sometimes the big dreams can spill out. (turns) Back to bed, Stevie. Steve smiles, and walks away. Hugh turns back to Nell. YOUNG HUGH (CONT’D) I know the bent-neck lady is scary, but that’s all she is. Just a little spill. You know that, right Nellie? She stares at him. YOUNG NELL How long do we have to live here, daddy? YOUNG HUGH Well, I’ve got to finish fixing the house. And then, somebody has to buy it. YOUNG NELL And then we can go? YOUNG HUGH (smiles, feels bad) Yep, then we can go. Just like the last house. She nods. A little relieved. YOUNG HUGH (CONT’D) I love you sweetie. Sweet dreams. CUT TO: 5.",
      "dialogue_count": 0,
      "word_count": 539
    },
    {
      "scene_number": 3,
      "slugline": "INT. UPSTAIRS HALLWAY, HILL HOUSE, THEN - CONTINUOUS Hugh gently CLOSES Nell’s door. Smiles to himself. He starts down the hall, stopping at another door. Hand-drawn letters reading SHIRLEY, clearly decorated by a little girl. Behind him, we can see NELL’S DOOR, CLOSED, in the BG. From inside, he hears A SOFT VOICE SPEAKING. He pushes the door open. The soft light falls on YOUNG SHIRLEY (9), asleep in her bed. Her eyes are closed, but she’s mumbling. YOUNG SHIRLEY (O.S.) (softly) Dancing in the red room. Don’t step so loud. YOUNG HUGH (smiling) You’re dreaming, Shirl. YOUNG SHIRLEY The pandas aren’t dreaming. YOUNG HUGH Pandas, huh? YOUNG SHIRLEY (trailing off) Pandas don’t eat macaroni... YOUNG HUGH Noted. He closes Shirley’s door. He’s about to walk away, but turns to see - NELL’S DOOR IS OPEN AGAIN. Odd, he just closed it... He walks back, looking inside. Nell is lying motionless in bed, on her side. She hasn’t moved since he last saw her. Hugh frowns, and gently closes the door once again. He walks away, leaving the upstairs hallway empty and dark. We linger for a few extra moments, scrutinizing those shadows. Wondering what they’re hiding... CUT TO: 6.",
      "characters": [],
      "action_text": "INT. MASTER BEDROOM, HILL HOUSE, THEN - MOMENTS LATER Hugh CRAWLS back into bed. His wife MARY (30’s) stirs. MARY Everyone alive? YOUNG HUGH Nellie had a nightmare and Shirley’s sleep-talking again. MARY Anything good? YOUNG HUGH Pandas don’t like macaroni, Mary. Mary smiles as Hugh kisses her, and settles back into sleep. Then, a SOUND. Like a GROANING, muffled. From within the walls. Mary’s eyes open. MARY Again? YOUNG HUGH You’re kidding. He sits up, sighing. MARY I thought you replaced the pipes - YOUNG HUGH Gotta be something else, then. Or the guy fucked it up. Another GROAN from the walls. YOUNG HUGH (CONT’D) Fix one problem, find five more. This house is a contractor’s dream. MARY Then how come they keep quitting? They listen. All is quiet again. YOUNG HUGH (beat) Nellie’s ready to go. MARY She’s not alone. I miss the city. 7. YOUNG HUGH This flips how I think it will, I’ll buy you a penthouse off the park. MARY With a doorman. She settles back onto her side to sleep. MARY (CONT’D) (chuckles) Pandas don’t like macaroni. He settles back into his pillow, closing his eyes. CUT TO: INT. NELL’S ROOM, HILL HOUSE, THEN - CONTINUOUS Nell lays in her bed. She hugs her plush bear to her chest. She rolls upright, looking at the spot by the foot of her bed again. There’s nothing there... though we note the DOOR IS OPEN again. Nell rolls onto her side. Facing her brother’s bed. He’s still sound asleep. YOUNG NELL Luke? He SNORTS a little in his sleep, and rolls onto his side, away from her. She frowns. She stares at the NIGHT LIGHT, plugged into the wall. It casts WARM COLORS and SHAPES on the wall above it. She fixes her attention there. Her eyelids getting heavy... She closes her eyes. We watch her try to sleep for a few long moments. And then... Something SHIFTS in the frame behind her. OUT OF FOCUS, IN THE DARK, it’s been there this whole time but we’re only now REALIZING IT - The silhouette of a WOMAN. NECK BENT AT A HORRIBLE ANGLE. CUT TO: 8. INT. WALKER HOUSE, LIV",
      "dialogue_count": 0,
      "word_count": 1307
    },
    {
      "scene_number": 4,
      "slugline": "INT. WALKER HOUSE, LIVING ROOM - LATER Steven moves through the house, taking it in. Taking a moment to look at the PHOTOGRAPHS of Mrs. Walker with her husband, CARL (60’s). Happy photographs, of a normal couple in their golden years. He pauses at one showing Carl by a NEW CAR. Probably the one he died in. Steven notes it, and moves toward the bookcase, glancing at what’s on the shelves - HE STOPS. We see one of the titles that has caught his eye: THE HAUNTING OF DANVERS. BY STEVEN CRANE. Next to it, more books. Similar fonts to the titles. THE HAUNTING OF ARLINGTON CEMETERY. BY STEVEN CRANE. THE HAUNTING OF ALCATRAZ. BY STEVEN CRANE. He sighs, not surprised to see the first book, the thickest book: THE HAUNTING OF HILL HOUSE. BY STEVEN CRANE. He reaches out, picking it up. On the cover is a photograph of HILL HOUSE, as we saw it in the beginning. He turns it over, and on the back - WE SEE THE FAMILY PICTURE from 1992, the faces now familiar to us. Young Hugh, Mary, Young Steven, and his brothers and sisters... MRS. WALKER I’m sorry, I should have told you. I’m a fan. He frowns, looking up. There are at least another EIGHT BOOKS, “THE HAUNTING OF...” series. All written by him. MRS. WALKER (CONT’D) (off the one in his hand) That’s my favorite, the first one. “Silence lay steadily against the wood and stone of Hill House, and whatever walked there, walked alone.” (beat) I can’t imagine what it was like... growing up there. The most famous haunted house in America - 12.",
      "characters": [],
      "action_text": "STEVEN In fairness, it wasn’t famous when we moved in. MRS. WALKER I remember seeing your dad on TV, during the trial. I always wondered how he kept it together, with all the media, the tabloids - STEVEN Well he didn’t exactly hide from the media. (beat) It was a long time ago. He stuffs the book back onto the shelf. STEVEN (CONT’D) And besides, you’ve got me beat. MRS. WALKER What do you mean? STEVEN I mean if you actually saw your husband hanging upside down over your bed, you’ve seen more than I ever have. (beat) I’ve never seen a ghost. MRS. WALKER But your books - STEVEN Not at Arlington, Danvers, Alcatraz, the Queen Mary, or in Williamsburg. And not in Hill House. MRS. WALKER Oh. The way you write, I assumed - STEVEN Other people’s stories. People like you, Irene. I give them the right voice, is all. Mrs. Walker is a little disappointed. MRS. WALKER Well I hope tonight is a game changer for you. 13. STEVEN How so? MRS. WALKER Maybe my Carl can finally give you a story of your own. You were one of his favorite writers, so maybe... that’s the reason. For all of this. She smiles at him, hopeful. He feels sorry for her. STEVEN You know, I can tell you one thing about Hill House that isn’t in the book. MRS. WALKER (lights up) Yes, please! STEVEN All those years, trying to understand what happened in that house, you know what I never found? (beat) A reason. MRS. WALKER (changing the subject) How   are   your brothers and sisters? I’ve wondered, since the book. How are they doing these days? His PHONE RINGS in his pocket. Saved by the bell. He turns, fishing it out. The call is from NELL. It rings for a beat... and he DECLINES THE CALL. MRS. WALKER (CONT’D) You know who I wish would write a book? Your dad. I’d love to hear what he says about that night... STEVEN (beat) You and me both. He steps away, looking further into the house. CUT TO: 14.",
      "dialogue_count": 0,
      "word_count": 626
    },
    {
      "scene_number": 5,
      "slugline": "INT. HOTEL ROOM, LOCATION UNKNOWN - DAY We watch as the outgoing call to STEVEN ends. Reveal NELL (mid 20’s now), looking down at the phone in her hand. The hotel room looks CHEAP, the curtains are DRAWN tight, keeping light out of the room. Nell herself is ON EDGE. Pale, disheveled. Unkempt... and clearly FRIGHTENED. She shakes her head, frustrated - And dials another number: SHIRLEY. CUT TO: EXT. HARRIS FUNERAL HOME - AFTERNOON A humble, stately independent funeral home. The sign out front reads HARRIS FAMILY FUNERAL HOME. Legend:   MASSACHUSETTS.  INT. HARRIS FUNERAL HOME, CONSULTATION ROOM - CONTINUOUS A hand holds a phone. The incoming caller is NELL. A moment, and then the call is DECLINED. REVEAL SHIRLEY (early 30’s now, kind and genuine.) Sitting in a chair, across from a GRIEVING FAMILY. It’s a funeral INTAKE. Her husband RYAN (30’s) sits beside her. SHIRLEY I’m sorry. So are you saying you’d prefer not to do a viewing? GRIEVING FATHER No, we want to, it’s not that. RYAN It’s part of your mother’s pre- need, so it’s already taken care of. GRIEVING MOTHER And we want to. It’s Max, I think he’s just a little... Shirley turns to MAX (8 years old), who is COLORING by the end table, near the CASKET CATALOGS. 15.",
      "characters": [],
      "action_text": "SHIRLEY A little nervous about it? GRIEVING FATHER I’d say “adamantly opposed.” In the nearby OFFICE, the LAND LINE rings. Shirley glances at Ryan, and he stands to answer. RYAN I’m sorry, excuse me a moment. Shirley smiles, getting up from her chair. She crouches next to little Max. SHIRLEY Hi Max. I’m Shirley. He looks up at her, smiling shyly. SHIRLEY (CONT’D) I know this might be a little weird for you, but I promise this is all normal. There’s nothing to be scared of, not a single thing. RYAN (in background) Harris funeral home... she’s with clients, can I have her call you back? He looks back to his drawing. SHIRLEY The reason mommy and daddy are here is that it’s important to say goodbye to Grandma. A viewing is just a way to do that, to see her one last time and tell her you love her. Ryan smiles at Max’s parents. His wife is good at this, and he knows it. Loves her for it. MAX I don’t need to say goodbye. RYAN A lot of people feel that way at first, but they feel much better when they do. 16. MAX That’s what mommy said but she was wrong. Grammy keeps sitting on my bed at night and touching my hair. She doesn’t say anything. She doesn’t talk, even if I yell at her. She just stares at me. And her eyes must hurt. SHIRLEY Why? MAX Because she doesn’t blink. Shirley frowns. CUT TO: INT. HARRIS FUNERAL HOME, FOYER - LATER Shirley and Ryan stand with the parents, looking out the front door where Max plays with a toy on the steps. SHIRLEY We see things like this from time to time. He’s what, eight? GRIEVING MOTHER That’s right. SHIRLEY He’s still a little too young to really understand death. Kids fall back on memories to help them process it. Whatever their strongest memory is, or their most recent, they’ll pull it up. Replay it. Imagine them doing the things they did in life. The parents exchange glances, unsure. SHIRLEY (CONT’D) He’ll be fine. You’ll find the funeral helps. They nod. GRIEVING FATHER Thank you. (beat) (MORE) 17. I don’t mean to embarrass you, but",
      "dialogue_count": 0,
      "word_count": 3509
    },
    {
      "scene_number": 6,
      "slugline": "EXT. HUGH’S HOUSE - NIGHT A small, humble house, nestled in the suburbs. Palm trees abound. Legend:   FLORIDA  INT. HUGH’S BEDROOM - CONTINUOUS HUGH CRANE (in his 60’s now) is asleep in his bed. Silence and darkness in the room... We sense the mattress DEPRESS next to him, as though someone just climbed into bed with him. Hugh’s eyes SLOWLY OPEN. He waits. Nothing. After a few long seconds... A WOMAN’S ARM SILENTLY REACHES AROUND HIM. Spooning him. Pulling herself up against his back. HUGH DOESN’T MOVE. Just lays there, eyes open. Not making a sound. Her arm hangs around him, and finally GOES LIMP, as if she’s just GONE TO SLEEP. VERY slowly, Hugh looks down at the hand dangling in front of him. He swallows. Holds his breath. VERY SLOWLY... so as not to wake her... he begins to ROLL OVER, TURNING TO GET A LOOK AT HER FACE... Slowly he turns, careful to be as SILENT AS POSSIBLE. As he passes the halfway point, almost to the point he could just begin to see her face - SHE SCREAMS - DIRECTLY IN HIS FACE, A HIGH, SHRILL SCREECH - HUGH’S EYES FLY OPEN. HE BOLTS UPRIGHT IN BED. HE’S ALONE... NO ONE ELSE IS THERE. The SHRILL SCREECH is just his RINGING PHONE. 34.",
      "characters": [],
      "action_text": "He catches his breath, letting the nightmare recede. The phone keeps ringing, and he finally lifts it off the night stand. IT’S NELL. He answers the phone, shaken, slowly waking up. HUGH Nell? NELL (O.S.) Daddy... HUGH Honey? You okay? What time is it? He starts to shuffle in the bed, getting comfortable, settling back down. NELL (beat) Do you remember the bent-neck lady? HUGH SITS UP IN BED. Staring ahead, very still now. The color has DRAINED FROM HIS FACE. He takes this VERY SERIOUSLY. HUGH (quietly) Yes. NELL She’s back. Hugh swallows. Catches his breath. HUGH Okay. Okay. (beat) Where are you? CUT TO: INT. NELL’S CAR - INTERCUT Nell is behind the wheel of her car. The engine isn’t running. It is VERY DARK outside, she’s surrounded by OVERGROWN TREES. No street lights AT ALL. NELL I’m at home. In bed. 35. Like she’s parked in the MIDDLE OF THE WOODS. CUT TO: INT. HUGH’S BEDROOM - INTERCUT Hugh sighs. HUGH Okay, stay there. Listen... I want you to go to Steve and Shaye’s. I can drive to Orlando, get a flight to L.A. in the morning. Steve’s the closest, you go to him, and - (beat) I’ll meet you there, sweetie. Nell smiles a little. Sadly. NELL Okay. I love you, daddy. Something about the way she says it doesn’t sit right with Hugh. HUGH Are you okay? INT. NELL’S CAR - INTERCUT Nell smiles, sadly. Tears fall down her cheeks, but her voice doesn’t betray her feelings. NELL I’m fine. I’m sorry to wake you. Good night, daddy. She hangs up. Takes a deep breath. Looks forward, at something we can’t see, in the darkness beyond the front of the car. Then, she GETS OUT OF THE CAR, leaving the DOOR OPEN... and walks into the darkness. CUT TO: INT. HUGH’S BEDROOM - INTERCUT Hugh stares at the phone in his hand. Looking around his room, taking deep breaths. THIS MAN IS AFRAID. He shakes his head, this isn’t possible... 36. Finally, he gets up. Goes to his closet, pulling his bags down. He QUICKLY PACKS HIS THINGS, throwing just what he needs in the suitcase. Bag in hand, he PU",
      "dialogue_count": 0,
      "word_count": 2052
    },
    {
      "scene_number": 7,
      "slugline": "INT. WALKER HOUSE, MASTER BEDROOM - NIGHT Steven’s eyes BURST OPEN. He looks around, catching his breath. Something woke him up... We realize the clock beside him reads 12:03 am. There’s nothing in the room. Steven slowly closes his eyes, going back to sleep. From high above him, the camera SLOWLY BOOMS DOWN on his face until we land in a CLOSE UP... A DROP OF WATER HITS HIS FOREHEAD. He opens his eyes. Looks up at the ceiling... NOTHING OUT OF THE ORDINARY. Just the light fixture, and a whole lot of ceiling. He WAITS. WAITS... ANOTHER DRIP. Intrigued, Steven ROLLS OUT OF BED. Stands up. Looks at the ceiling, the light fixture. Waits. Looks down at the pillow on the bed... WAITS... DRIP. A drop of water hits the pillow. Steven STEPS UP ONTO THE BED, looking up at the ceiling. He STRETCHES ON THE TIPS OF HIS TOES, trying to identify the source of the water... WAITS... WAITS... A CAR HORN BLARES! Steven SPINS, almost FALLING off the bed. He turns, looking out the window - And from his height, he can see the TWO CARS in the intersection that just avoided a collision. Another SHORT HONK, and they go off in separate ways. 45.",
      "characters": [],
      "action_text": "Steven SMILES, catching his breath. STEVEN’S POV: The intersection, dark. DISSOLVE TO: INT. WALKER HOUSE, MASTER BEDROOM - THE NEXT MORNING - Steven’s POV: The intersection, IN DAYLIGHT. STEVEN There was a stop sign there until recently, yes? Steven stands at the window, with Mrs. Walker next to him. MRS. WALKER ... I don’t know, I think so. STEVEN There’s a pole there, see? But no sign. There is indeed a silver pole sticking up from the ground at the intersection... but nothing on it. STEVEN (CONT’D) Kids take them for their dorm rooms. It’s a moderately trafficked area; a four way stop without a sign is bound to have a few near misses. (beat) You slept better with your husband in bed, right? MRS. WALKER Of course. STEVEN You’re probably just noticing the car horns now because you’re not sleeping as well. Things you used to sleep through. (beat) The water... Steven hops up onto the bed. He reaches up, slowly turning unscrewing the bolt holding the light fixture. 46. STEVEN (CONT’D) It was a big storm the night he died, one of the biggest you’ve seen in a long time. MRS. WALKER Yes... STEVEN There’s a leak in your roof. And you just didn’t notice the water damage because... He removes the bolt, and PULLS DOWN THE LIGHT FIXTURE. There, where the power cord goes into the ceiling, is a WATER STAIN. STEVEN (CONT’D) It was covered. It was only drizzling last night, and I even got a few drips. He places the light fixture on the night stand, and waits patiently. Mrs. Walker looks up at the stain, and we can tell... SHE’S EMBARRASSED. STEVEN (CONT’D) This happens all the time, Mrs. Walker. MRS. WALKER And the man I saw hanging from my ceiling? Steven sighs, sitting on the mattress. STEVEN The mind... it is a powerful thing, ma’am. Especially the grieving mind. MRS. WALKER I know what I saw - STEVEN The water, the car horn, you’d be picturing how he died, as much as you wouldn’t want to - MRS. WALKER I saw him. 47. STEVEN And when you push that stuff down, it comes out at ni",
      "dialogue_count": 0,
      "word_count": 2062
    },
    {
      "scene_number": 8,
      "slugline": "INT. STEVEN’S CAR - DAY STEVEN is driving. We’re now in his car, many years later. The passenger seat is EMPTY. He PASSES a sign: LOS ANGELES - 180 miles. A VOICE from his car speakers: VOICE I’m sorry, there’s no Luke Crane at our center. We can contact you if he shows up. STEVEN I appreciate that. Thanks! He reaches out, hanging up the call. Drives, frowning. Considers... and then reaches out, hitting the SPEED DIAL button on his console. Selects the first name on the list: SHAYE. It rings. After several rings, a woman’s voice picks up. SHAYE (long beat) Hello. STEVEN Hey. There’s a beat between them. She’s waiting for him to speak, he’s not sure what to say. SHAYE What do you want? STEVEN So my sister - there’s something up with Nell, she may show up at the house today. SHAYE (beat) At my house? STEVEN At the house, yeah. SHAYE Why? 56.",
      "characters": [],
      "action_text": "STEVEN My dad told her to, and I didn’t get a chance to tell him what’s... She sighs. Steven looks down at the WEDDING RING on his finger, gripping the steering wheel. STEVEN (CONT’D) I’m sorry, you can just point her to me. SHAYE Is that all? He shakes his head. Frustrated. He’s not sure what to say, he could take this conversation in a few different directions, and we sense him trying to pick the one least likely to combust... STEVEN Maybe I can come by, and we can talk about this some more? Nothing. STEVEN (CONT’D) How long does this need to go on, Shaye? You tell me what I have to do, and I’ll do it. I mean, I just want to come home - SHE HANGS UP. He sighs. The road rolls forward in front of him... but the traffic is SLOWING. STEVEN (CONT’D) Great. He slows. Ahead, down the rural highway, it’s BUMPER TO BUMPER. An accident, most likely. STEVEN (CONT’D) Just great. He sits there, staring at the unmoving car. And at the TREES beside the highway... some of the Northern California forest, between the bigger cities. He stares. Thinks.  Remembers...  CUT TO: 57.",
      "dialogue_count": 0,
      "word_count": 359
    },
    {
      "scene_number": 9,
      "slugline": "INT. HILL HOUSE, THEN - DAY The view of the woods, through a window. Another time, before that night. Before the escape... Reveal YOUNG STEVEN looking out at the trees... and at the TREE HOUSE near the house. Behind him, MARY PACES. MARY Luke? Luke! Has anybody seen your brother? Steven smiles, eyes on the tree house. CUT TO: EXT. HILL HOUSE, THEN - MOMENTS LATER Steven crosses the yard, heading toward the tree house. Hand- made, clearly with love, the structure itself sits on an ancient tree, cradled by huge branches. Steven climbs the ladder. INT. TREEHOUSE - MOMENTS LATER Steven POPS UP through the trap door. Nearby, coloring on the floor, YOUNG LUKE (5) JUMPS. YOUNG STEVEN Mom’s looking for you. Steven starts to climb up. Luke goes back to coloring. YOUNG STEVEN (CONT’D) Trying every closet. Every single one. It never occurs to her you’ll be in your tree house. (beat) The one dad built. For you. Luke giggles. YOUNG STEVEN (CONT’D) Dinner’s ready. YOUNG LUKE I don’t wanna go in yet, I don’t like it inside. 58.",
      "characters": [],
      "action_text": "YOUNG STEVEN I hear you. Distant, we hear MARY’S VOICE calling, presumably out the front door. MARY (O.S.) Luke?! Luke sighs. YOUNG STEVEN No rush, my man. He looks around. Lots of toys are scattered, and little Luke has clearly been busy decorating. Next to all the crayon drawings, Luke is hard at work on a sign. He’s gotten a large N and O onto the paper. YOUNG STEVEN (CONT’D) Whatcha making? YOUNG LUKE A new sign. How do you spell “no girls allowed?” YOUNG STEVEN “N.” “O”. YOUNG LUKE I got those. YOUNG STEVEN “G”. Luke starts the “G”. YOUNG STEVEN (CONT’D) I told you last time, that’s a bad idea. What happened to your other sign? YOUNG LUKE Theo ripped it. YOUNG STEVEN I’ll bet. “I”. He looks at the DRAWINGS, scattered around the floor. Drawings of the FAMILY. Steven smiles. YOUNG STEVEN (CONT’D) Is this the family? “R”. 59. Luke starts drawing the “R”. YOUNG LUKE Yep. And then, begins to notice a trend. There are OTHER PEOPLE IN THE DRAWINGS, TOO. YOUNG STEVEN Who’s this? YOUNG LUKE Friend. Steven looks closer. It’s a crude drawing, but there is something striking about it. The eyes are just BLACK CRAYON MARKS. The figure has no FEET. YOUNG STEVEN Your imaginary friends again, huh? YOUNG LUKE What’s next? YOUNG STEVEN “L.” He looks at the drawings. There are several of them... it’s easy to tell who the adults are, given their height. He can see representations of the kids, too... We notice THE CRUDELY DRAWN RED RECTANGLE in some of the pictures... THE RED DOOR... And then these other people. Tall. Grown ups. But less color... and those black eyes... YOUNG STEVEN (CONT’D) You know I used to have imaginary friends too. They go away when you get bigger. “S.” YOUNG LUKE Okay. (looking at his sign.) No girls. Theo can’t rip this one, it’s not allowed. YOUNG STEVEN I’ll tell her. YOUNG LUKE Will you hang out here though? With me? 60. YOUNG STEVEN You want me to? YOUNG LUKE Yeah. That way it’s just the cool kids. You, and me. YOUNG STEVEN Just us? YOUNG LUKE You can ha",
      "dialogue_count": 0,
      "word_count": 1455
    },
    {
      "scene_number": 10,
      "slugline": "INT. STEVEN’S APARTMENT, LIVING ROOM - CONTINUOUS It’s a SMALL place, dark. COLORED LIGHT from an advertisement near the window spills in, painting some of the shadows. Steven drops his bags, hitting the LIGHT - REVEALING NELL, standing in the living room. STEVEN (startled) Jesus! He laughs, shaking his head. STEVEN (CONT’D) Thanks, I needed a good scare. She stands still... her expression SAD. STEVEN (CONT’D) Shaye booted you too, huh? I tried to tell dad. We’re having some issues, but - did you tell Luke where I lived? You bring him here? Nell doesn’t answer. STEVEN (CONT’D) You just stood here and watched him loot me? Christ, Nell. (beat) So you hit up everybody. Dragged Luke out, made Dad hop on a plane... He puts his hands on his hips. STEVEN (CONT’D) Fine. You got us all listening. What do you want? What’s so damn important, Nell? Nell looks up, making eye contact. She starts to MOVE HER LIPS, but she doesn’t make a sound... Steven’s PHONE RINGS. He looks down, lifting it out of his pocket. It’s HUGH. STEVEN (CONT’D) Shit. I didn’t give him the address... 66.",
      "characters": [],
      "action_text": "Behind him, he doesn’t see NELL’S ARM COME UP, POINTING JUST OVER HIS SHOULDER. He answers. STEVEN (CONT’D) Hey. I tried to tell you. HUGH (O.S.) Steve... STATIC. STEVEN Dad? HUGH (O.S.) (static, broken up) - bout - Nell - STEVEN Can’t hear you. HUGH (O.S.) (static) ... you hear me? I said it’s about Nell. STEVEN I know, I just walked in and she - HUGH (O.S.) Nell was lying. STEVEN Shocking. HUGH (O.S.) She wasn’t in LA. She was... at home, Steve. He looks up at Nell. HUGH (O.S.) (CONT’D) She was at   the house . Steven stops, blinking. Smirks a little. HUGH (O.S.) (CONT’D) She... she killed herself. Around three (static) morning... 67. STEVEN (beat, laughs) What? HUGH (O.S.) Last night. At the house, Steve. The   goddamned house -  More STATIC. Steven holds his breath. This doesn’t compute... he turns, to look back where Nell was standing - SHE’S RIGHT IN FRONT OF HIS FACE. INCHES AWAY. He DROPS THE PHONE. HUGH (O.S.) (CONT’D) (over the phone) Steve? Steve, you there? Nell STARES AT HER BROTHER. And just like Mrs. Walker said, Steven doesn’t scream. He just stares back, a look of CONFUSION on his face... As her eyes SLOWLY ROLL UP INTO HER HEAD. SILENTLY, SLOWLY. No fanfare, just... slowly ROLLING BACK, until he can only see the WHITES OF HER EYES... Steven doesn’t move. He doesn’t scream. His mind can’t even PROCESS what he’s seeing... he just STARES. And the RED VEINS spread across them... HER SKIN CHANGES. STRETCHING, losing its color. BECOMING WAXEN, GREY AND DEAD. Her mouth SLOWLY DROPS OPEN... reaching its limit... AND KEEPS GOING. DROPPING LOWER AND LOWER, IMPOSSIBLY LOW... A SOUND COMING FROM HER THROAT - Like a SCREAM, but starting VERY FAR AWAY - BUILDING IN INTENSITY AS HER JAW DROPS - FINALLY BECOMING DEAFENING - Steven’s paralysis is broken. He SCREAMS, FALLING BACKWARD. HITS the ground, looking back up - 68. And just like that, NELL IS GONE. Like she was never there. HUGH (O.S.) (CONT’D) Steven? Steve? Steven GASPS, catching his breath. Eyes wide and ",
      "dialogue_count": 0,
      "word_count": 556
    }
  ]
}