{
  "slug": "the-front-runner-2018",
  "title": "the front runner",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 2,
  "characters": [
    "FIEDLER",
    "DOLE"
  ],
  "total_words": 22766,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOTEL CORRIDOR - DAY  The team moves through heartbroken supporters offering ad  libbed,   “Don’t leave... stay in it...”   A couple secret  service agents push through as PHOTO FLASHES POP.  Wilson continues to remind about policy.  SHORE  We promised homeless to Mondale.  WILSON  People are homeless. The name of  the issue is “homelessness”.  STRATTON  (struggling)  Come on, clear a path...  WILSON  (to Hart)  And Perestroika.  SHORE  It’s a marker for ’88.  HART  (to Wilson)  Homeless and Russians, got it.  Suddenly, COMMOTION. A woman screams. The secret service  agents RUSH at Hart, pushing him back towards the suite.  STRATTON  What the fuck is --  Other agents converge on a man. For a moment, we see an ARM  WITH A GUN being held up in the air.  AGENT  Active shooter... Active shooter...  LEE  Oh God! What?  The agents move like a scrum, pushing them back into...  INT. VIP SUITE, ST. FRANCIS HOTEL. CONTINUOUS.  Hart is pulled into a corner. An agent hovering over him.  AGENT  Redwood is secure.  Yellow Rev. (9/15/17)   5.",
      "characters": [],
      "action_text": "We hear reports coming in over the walkie talkies as the team  shares looks with each other. Stunned.  LEE  Gary....   Gary ?!  They all look over at Hart. The secret service agent steps  away to reveal him doubled over, clutching his side.  SHORE  Senator?!  AGENT  We need a paramedic in the suite.  Lee gets down on her knees to help, but Hart rears up  LAUGHING hysterically, barely able to breathe.  LEE  Gary !!  But he can’t stop laughing. After a long beat...  HART  Who shoots the loser?  INT. TRADER VICS, SAN FRANCISCO - MIDDLE OF THE NIGHT  Hart, tie loosened, still laughing. In an image unfamiliar  for anyone today, Hart is drinking with his PRESS BUDDIES.  JACK GERMOND (The Sun) DAVID BRODER (The Post) IRA WYMAN.  BRODER  Maybe he didn’t like your jobs  plan, either.  HART  We’ve been through that. It’s a  good plan... It   was   a good plan.  Reveal we are watching from another table, over the shoulders  of a younger generation of reporters.  HART (CONT’D)  Did anyone find out this guy’s  reasons?  WYMAN  Yeah, they found a photo of you in  his wife’s purse.  Off laughter, we move to the Kids Table. ALAN WEINBERG, ANN  MCDANIEL, DAVID AXELROD drinking cheap beer.  Yellow Rev. (9/15/17)   6. MCDANIEL  You really want to follow Mondale  around for another six months?  WEINBERG  My apartment is grim. I’ll take the  free meals.  MCDANIEL  Yeah, that’s how I feel about my  boyfriend.  BOB WOODWARD stops by the big boys table.  AXELROD  Holy shit, look, it’s Woodward.  MCDANIEL  Think he still comes into the  newsroom?  WEINBERG  I heard he doesn’t take a salary.  MCDANIEL  Doesn’t need to. Have you seen his  house?  WEINBERG  Have you?  We find Hart and Woodward now at the bar sharing whiskeys.  WOODWARD  ... She’d have won you New Jersey  if you hadn’t made that dumbass  crack about the water.  HART  No one’s got a sense of humor  anymore.  WOODWARD  Fuck ’em if they can’t take a joke.  (beat while he drinks)  How’s Lee doing?  HART  She needs a rest.  WOODWARD",
      "dialogue_count": 0,
      "word_count": 8867
    },
    {
      "scene_number": 2,
      "slugline": "INT. TRUCK STOP, NORTHEAST - DAY  Hart in an apron, poses with the RESTAURANT STAFF for a few  photos. He flips burgers. Parker watches from nearby.  Moments later, Hart is at a table facing Parker.   A tape  recorder sits between them on the table.  HART  (to Parker)  We almost done?  PARKER  Just about.  HART  You read the book yet?  PARKER  Just about. It’s Tolstoy.  Parker looks down at his notepad. A series of questions have  been crossed off. One word remains - “Marriage”.  PARKER (CONT’D)  (visibly uncomfortable)  Can we talk about your separation.  Sweeney looks up.  HART  It’s a fairly common occurrence.  I’d avoid it if you can.  PARKER  I’m not having fun asking about  this. In case you were wondering.  HART  I wasn’t.  SWEENEY  AJ...   PARKER  Look --  HART (CONT’D)  Why should anyone care? How is it  relevant?  PARKER  People feel like it’s hard to  know you. I’m trying to help  elucidate --  SWEENEY  Senator...  Yellow Rev. (9/15/17)   55.",
      "characters": [],
      "action_text": "HART (CONT’D)  People. Who are these ‘people’  everyone keeps telling me about?  PARKER  Fine, maybe   we   feel that way.  HART  So, reporters.  PARKER  Some of us.   SWEENEY  AJ, either ask something  else...  HART (CONT’D)  Some of you   who were in high school  when I ran McGovern’s campaign.  It’s not my fault you’re just  arriving at the party.  PARKER  OK, so around that time, you told  Gail Sheehy you believed in “reform  marriage.” What did that mean?  HART  For crying out loud. I was young  and tired and living across the  country from my wife, and I made a  stupid joke. You know, this is why  people don’t want to be in public  life. Because someone will dredge  up something you said in a moment  15 years ago and act like it  somehow encapsulates your life.  PARKER  It’s just --  HART  I’m going to answer one more of  these, and then I’m not going to  sit here anymore. We’ve covered all  the stuff that matters. Did anyone  ask Reagan about his marriage?  PARKER  I don’t think --   SWEENEY  Let’s wrap this up...  HART (CONT’D)  Did you ask Carter these questions?  PARKER  There’ve been rumors --  Yellow Rev. (9/15/17)   56. HART  Oh for God sake, AJ. Ask whatever  it is you came here to ask.  PARKER  OK. Do you think you have... A  traditional marriage?  HART  (disbelief)  A trad --  SWEENEY  OK. That’s enough. We’re done  here--  HART  You want to know what I’m doing in  my spare time? Is that it, AJ?  Follow me around then. Put a tail  on me. I mean it. You’d be very  bored.  Parker scribbles, head down as Sweeney escorts Hart away.  INT. MIAMI INTERNATIONAL AIRPORT. FRIDAY AFTERNOON.  We’re watching the ESCALATORS, over the shoulders of Fiedler  and Murphy. Mostly tourists and businessmen. Fiedler is  flipping through a magazine nervously. He’s so nervous, it’s  comical. Murphy is trying to keep it cool.  MURPHY  Just calm down.  FIEDLER  What am I supposed to do?  MURPHY  Act bored. Most people usually look  bored. What does she look like?  FIEDLER  Att",
      "dialogue_count": 0,
      "word_count": 547
    },
    {
      "scene_number": 3,
      "slugline": "INT. BOEING 737 TO DC - EVENING  Fiedler and Murphy sit deep in coach. Fiedler leans into the  aisle to get a look at Donna who’s reading a book a few rows  down. He leans a little further and is suddenly hit by the  BEVERAGE CART, making a bit of a mess. He flinches back.  INT. NATIONAL AIRPORT TERMINAL, DC - NIGHT  Fiedler and Murphy walk 15 feet behind Donna and Armandt,  trying to play it cool.  EXT. NATIONAL AIRPORT TAXI LINE - NIGHT  Donna and Armandt are shown into a waiting cab.  Several people back in the line, Fiedler and Murphy watch  anxiously as their marks pull away.  MURPHY  Do we know where they’re going?  FIEDLER  I fucking hope so.  EXT. HART’S TOWNHOUSE, CAPITOL HILL. FRIDAY NIGHT.  Fiedler’s TAXI comes up on a stately, two-story row house.  Lights shine in the windows and illuminate the sidewalk.  No one’s visible inside or out.  Fiedler and Murphy fight for the driver’s side window.  FIEDLER  This one here on the left.  CAB DRIVER  You want me to pull over?  FIEDLER  Just hang a second.  MURPHY  No security? Nothing? You sure this  is right?  FIEDLER  It’s his place.  Yellow Rev. (9/15/17)   58.",
      "characters": [],
      "action_text": "MCGEE  (looking at the house)  Doesn’t feel right.  CAB DRIVER  You guys getting out?  FIEDLER (CONT’D)  Just give us a second.  Fiedler looks at the windows, hoping for an answer.  MURPHY  No secret service?  FIEDLER  He isn’t the nominee yet.  CAB DRIVER  Look, I’m not sure what you guys  are up to...  MURPHY  (to Fiedler)  I think you got taken buddy.  FIEDLER  We’ve been here all of two fucking  seconds...  CAB DRIVER  This isn’t a peep show, one of you  has to pay me...!  MURPHY  New destination, we need a hotel...  FIEDLER  Hold on!  Suddenly, the lights turn off inside the house.  Fiedler and Murphy go silent.  CAB DRIVER  Which one of you is going to...?  FIEDLER  (quietly)  Pull over there.  The cab pulls over. Inside, they all hold still, waiting to  see what will happen next.  We SEE the front door open. A man’s arm holds it open.  Hart and Donna come out onto the stoop.  Yellow Rev. (9/15/17)   59. MURPHY  Fuck me.  Broadhurst and Armandt follow. They walk down to Hart’s  SEDAN, all get in and drive off.  BACK TO Fiedler, suddenly vibrating with mixed energy.  MURPHY (CONT’D)  We’re gonna need a photographer.  CUT TO:  THE BACK OF AN SLR CAMERA BEING LOADED WITH FILM  EXT. STREET OUTSIDE HART’S TOWNHOUSE, CAPITOL HILL. DAWN.  Murphy sit in a rental car outside the house, as the sun  appears on the horizon. He does a crossword. In the back seat  with the camera is ROY VALENTINE, a photographer.  ROY  You’re sure they’re in there?  MURPHY  Yep. Have you staked out before?  ROY  (scoffs)  I mean, I’m not a paparazzi. Are we  even allowed to do this?  MURPHY  A few years ago, I figured out most  of the planes carrying kilos of  coke into the US weren’t coming  from Colombia. They’re actually  coming from the fucking Bahamas. So  I dig a little deeper. Turns out,  the prime minister is taking pay  offs from Miami lawyers to leave  beach front runways unguarded.  ROY  Wo.  MURPHY  Yeah, “Wo”. Sometimes you need to  catch someone in the act. I mean,  fuck, have",
      "dialogue_count": 0,
      "word_count": 765
    },
    {
      "scene_number": 4,
      "slugline": "EXT. STREET OUTSIDE HART’S TOWNHOUSE - DAY  It’s RAINING. The rental car sits there. Three silhouettes  behind the windshield.  Inside, they’re eating individual cartons of Chinese. Just  watching and waiting for something to happen.  EXT. STREET OUTSIDE HART’S TOWNHOUSE - AFTERNOON  The car parked in the same spot. Murphy and Roy asleep.  Fiedler looks up from his newspaper.  He SEES a WOMAN WITH A BABY CARRIAGE, and then a JOGGER.  Then, WILSON (policy aide) approaching the front door.  Murphy sits up for a better look. He lowers the window an  inch, hoping to hear. We barely hear the DOORBELL.  A moment later, the townhouse door opens revealing Hart,  wearing a white hoodie and jeans.  Wilson hands Hart a thick envelope. We barely make out what  they’re saying.  HART  Thanks.  WILSON  Hopefully this is the last draft.  HART  Yeah, I’ll give it a look...  And then Hart freezes. He seems to be either lost in thought  or STARING STRAIGHT AT THE RENTAL CAR. Fiedler holds stock  still, not sure whether to go back to his paper or drive off,  when Hart gives a quick goodbye to Wilson and shuts the door.  Fiedler gives Murphy a shove.  MURPHY  What’s happening?  FIEDLER  Wilson, policy guy.  MURPHY  What is that, a speech writer?  FIEDLER  To a certain... He studies the  fluctuations in foreign... and...  Yellow Rev. (9/15/17)   62.  (MORE)",
      "characters": [],
      "action_text": "(Murphy doesn’t care)  Yes, he’s a speech writer.  MURPHY  Did he make you?  FIEDLER  Don’t think so. Need a closer look.  Thinks for a second.  CUT TO:  TAGS BEING RIPPED OFF NEW JOGGING CLOTHES  EXT. HART’S TOWNHOUSE - LATE IN THE DAY  Fiedler, pretending to run in a ridiculous jogging suit,  trots past the rental car, giving Murphy a furtive glance.  He jogs onto the sidewalk and slows down as he passes Hart’s  townhouse. He’s trying to see through the windows but can’t  quite make anything out.  INT./EXT. FIEDLER’S RENTAL CAR - LAST LIGHT  Fiedler finishes his loop and jogs back up to the rental car  and gets back in the passenger seat. He’s sweating... Hard.  MURPHY  Jesus, you ran around the block.  FIEDLER  Fuck off.  (looking for Roy)  Where’s our shooter?  Murphy nods toward the house. We SEE Roy with his CAMERA,  crouching behind a bush, trying to get a good angle.  FIEDLER (CONT’D)  Are you fucking kidding me?  MURPHY  He’s young, excited. What was I  going to say?  FIEDLER  He’s going to get us caught.  We watch from the car as Roy gets closer to the townhouse.  Suddenly one by one, the WINDOW BLINDS SLAM SHUT.  Yellow Rev. (9/15/17)   63.  FIEDLER (CONT'D) FIEDLER (CONT’D)  Fuck.  EXT. HART’S TOWNHOUSE - NIGHT  A beat as they watch the townhouse. The last glow of ambient  daylight disappears into night.  And then the front door of the townhouse opens. Hart comes  down the steps, still wearing his white hoodie.  Hart climbs inside his Chrysler. He’s visibly nervous. A  stark difference from his usual confidence and calm.  Hart checks the mirror as he pulls out slowly onto the  street. We SEE the Herald’s rental car reflected in the  mirror, pulling out to follow him.  Hart puts on his blinker and deliberately takes a right turn  onto a side street. He checks the mirror again, sees the car  following.  His jaw clenches. His breathing grows shallow. We can almost  hear his adrenaline.  He pulls to a slow crawl at a stop sign, waiting for the  Herald car to",
      "dialogue_count": 0,
      "word_count": 725
    },
    {
      "scene_number": 5,
      "slugline": "EXT. SIDE ALLEY BY HART’S TOWNHOUSE - NIGHT  The three Herald guys, Murphy leading the way, head toward an  intersection where a side alley meets a BACK ALLEY.  MURPHY  (hissing)  You were too close.  FIEDLER  (hissing back)  He was already on to us.  As they turn the corner into the back alley --  HART (O.C.)  Good evening, gentlemen.  Standing in front of them, in his white hoodie, is HART.  A long silent beat. The three journalists from the Herald  line up across from Hart. Murphy out front. Fiedler in the  shadows. There’s an eerie High Noon quality to the stand off.  No one knows what to do. No one has ever been here before.  For better or for worse, they’ve breached a historical trust  between candidate and the press... and they must figure out  the next moment on their own.  MURPHY  (nervous)  Good evening, Senator. I’m a  reporter for the Miami Herald. We’d  like to talk to you.  Hart holds his ground, trying to decipher what’s happening.  MURPHY (CONT’D)  Um... We’d like to ask you about  the woman who’s been staying in  your townhouse.  Hart doesn’t move. Composes his thoughts specifically.  HART  ... No one is staying in my  townhouse.  MURPHY  We saw you leave and return with a  woman last night. A blond woman?  HART  I may. I may not have.  Yellow Rev. (9/15/17)   65.",
      "characters": [
        "FIEDLER"
      ],
      "action_text": "MURPHY  We saw you.  HART  I don’t know what you think you  saw...  FLASH - Roy takes a photo. It’s blinding and confusing in the  dark alleyway. It almost feels like a gun shot.  Fiedler steps forward.  FIEDLER  Hello, Senator.  HART  (registering Fiedler)  Tom?  FIEDLER  Yes, sir. I uhh... I wonder if you  could tell us whether this woman  works for the campaign.  (beat)  The one we saw you with.  HART  She is not part of my campaign.  FIEDLER  Okay. Then can you tell us how you  know her?  FLASH - Another photo startles Hart.  HART  Well... I don’t think that’s  relevant.  MURPHY  (scoffing)  Oh, I assure you, Senator, it’s  relevant --  FIEDLER  It’s just that, we saw you leave  and come back with this woman. And  we didn’t see her leave again.  FLASH!  HART  Tom, you can’t be serious. No one  is staying in my home but me.  Yellow Rev. (9/15/17)   66. FIEDLER  I am serious, sir. How long have  you known her?  HART  What kind of questions are these?  FIEDLER  Is she a friend?  HART  I don’t know why I would tell you  that. Tom, I am not --  FLASH!  MURPHY  Can you produce the woman so she  can corroborate what you’re saying?  HART  I don’t have to produce... This has  gone on long enough.  Hart takes a step forward, as if to leave, and Roy snaps two  more photos, blinding Hart momentarily. Hart blinks. The  flashes begin to build now, more and more - Frustrating Hart.  FIEDLER  Senator, we know you’ve made calls  to this woman. You called her from  Kansas. And New Hampshire. We have  the dates.  HART  I make calls every day. I don’t see  how I’d remember, and I don’t see  how you’d --  FLASH, FLASH...  FIEDLER  (stammering)  But... Senator... I was at your  announcement speech. You said...  you said... We must...  FIEDLER (CONT’D)  (from his notebook)  “Hold ourselves to the  highest possible standards of  integrity and ethics.”  HART  ... I know what I said.  Yellow Rev. (9/15/17)   67. The only one putting you in this  alley, Tom, is   you .  Hart moves to the ",
      "dialogue_count": 1,
      "word_count": 1664
    },
    {
      "scene_number": 6,
      "slugline": "INT. HART CAMPAIGN OFFICE, DENVER - NIGHT  Lights flip on as Emerson enters to find Sweeney already  manning a phone at a desk. Nearby, STACKS OF HART POSTERS.  SWEENEY  (into the phone)  Tell Fiedler we can give him an  interview with the girl. Straighten  everything out. Just buy us some  time.  Sweeney opens a bottle of whiskey takes a deep inhale, then  drinks a glass of water. Emerson just swigs the whiskey.  INT. QUALITY INN GUEST ROOM, CAPITOL HILL - NIGHT  The phone rings. Murphy picks up with an informal greeting.  He mutes the receiver under his arm and turns to Fiedler.  MURPHY  They say the girl will talk to us.  FIEDLER  (shakes his head)  They’re stalling.  INT. AIRPLANE, DENVER. MIDNIGHT.  Dixon, Shore and Kelly out of breath as they board a flight.  The last two people aboard.  The flight attendant gives a little look -   You made it -   as  the captain is finishing his pre-flight announcement.  INT. BROADHURST’S KITCHEN, CAPITOL HILL. CONTINUOUS.  Billy B hangs up his phone. He turns to Donna.  DONNA  They don’t want to hear my side of  things?  BROADHURST  They don’t care. Fuckers are going  to print without sources.  DONNA  Can I talk to Gary?  PRELAP: The jarring ring of an old phone...  Yellow Rev. (9/15/17)   75.",
      "characters": [
        "DOLE"
      ],
      "action_text": "EXT. TROUBLESOME GULCH, COLORADO - MIDNIGHT  We hear the phone ringing.  INT. KITCHEN, TROUBLESOME GULCH - MIDNIGHT  We see Andrea shuffle in to pick up the phone.  ANDREA  (groggy)  Hello?  HART  Hey kiddo, I need you to get your  mother for me.  ANDREA  Dad, it’s the middle of the night.  Is everything okay...?  HART  Andrea.  Andrea stops short. Lee enters in night clothes and takes the  phone from her daughter.  LEE  Hello?  There’s a pause and then...  HART (O.S.)  Something’s happened.  LEE  All right. What is it?  INT. HART’S TOWNHOUSE, CAPITOL HILL. CONTINUOUS.  Hart sits at the kitchen island, eyes closed, phone to his  ear. He rolls the glass of VODKA on the counter.  HART  There’s going to be a story.  Tomorrow. About me.  A long beat. Lee sighs.  HART (CONT’D)  What they’re going to write...  shouldn’t ever be written. I can’t  seem to stop them...  Yellow Rev. (9/15/17)   76. LEE  (exasperated)  Oh, just say it, Gary.  HART  I met a woman in Miami. They  followed her. To DC. To our  townhouse in DC.  LEE  I see.  A long beat as Lee absorbs the pain. We see Andrea watching  her mother with anxious curiosity.  LEE (CONT’D)  The one thing I ever really asked  is that you don’t embarrass me.  Hart nods painfully.  HART  I feel so stupid.  LEE  Good. Sounds like you should. Feel  stupid for a while.  And with that, she hangs up.  CUT TO:  EXT. DOORSTEP, CAPITAL HILL - MORNING  A hand grabs the POST, still inside the wet newspaper bag.  INT. BROADHURST’S LIVING ROOM, CAPITOL HILL - MORNING  Broadhurst enters, opening up the paper. He finds Dixon  watching Donna from the kitchen. She sits on a sofa with a  lost gaze. There’s a nod between both men before Dixon leaves  to find a seat across from Donna, watching her like an  investigative journalist.  DIXON  What are you doing here, Donna?  DONNA  I don’t know. I just want to go  home. Can I go home now?  Yellow Rev. (9/15/17)   77. DIXON  Sure, of course. Soon. I know you  want to get home.  Broadhurst walks th",
      "dialogue_count": 1,
      "word_count": 5499
    },
    {
      "scene_number": 7,
      "slugline": "EXT. HIGHWAY TO NEW HAMPSHIRE - DAY  The HART CAMPAIGN BUS works its way up a hill.  INT. HART CAMPAIGN BUS - DAY  Hart, Shore, and Sweeney huddle around a table as staffers  work furiously around them.  A staffer is passing out sandwiches to the men. There’s a bit  of ad-libbed confusion over who ordered what.  SHORE  Back to New Hampshire.  WILSON  Live free or die.  EMERSON  Wonder how many people pick “die”?  HART  I can’t keep answering these  questions.  SWEENEY  One more presser. We let them ask  whatever they want and we put it to  bed. Get back to big ideas.  TED KOPPEL (PRELAP)  Well, you have conceded that you  weren’t able to watch the back of  his townhouse...  CUT TO:  A BROADCAST OF NIGHTLINE  Footage of Ted Koppel interviewing Tom Fiedler.  TED KOPPEL  ... And that, therefore, the lady  in question may have left when you  thought she was still there.  FIEDLER  (sweating and stammering)  Well, that’s, um... That’s... I  mean, Mr. Koppel... Ted...  Yellow Rev. (9/15/17)   105.  (MORE)",
      "characters": [],
      "action_text": "If we’re conceding that we’re not  as good as the FBI at conducting  surveillance, then I think we have  no problem agreeing to that. But --  TED KOPPEL  Hold on. That’s cute, but that’s  not the point. Did she spend the  night with him or didn’t she spend  the night with him?  FIEDLER  Right. Well, not right. I mean, the  basis of our report was that  Senator Hart had this ongoing  relationship with this woman who,  again, was not his wife. A single  woman...  TED KOPPEL  You have spoken several times, Mr.  Fiedler, about the relationship.  And of course,   relationship   is one  of those loaded words that suggests  that somehow there’s been a tryst  going on.  FIEDLER  No. No, I...I...I haven’t  suggested, you know --  TED KOPPEL  Well you’ve suggested it. You  haven’t said it, but you’ve  certainly suggested it.  FIEDLER  (flailing)  I think a relationship simply means  there were, you know, dealings  between two people. There were --  TED KOPPEL  Well you’re not suggesting a  professional relationship. You were  suggesting a romantic relationship.  REVEAL:  Yellow Rev. (9/15/17)   106.  FIEDLER (CONT'D) SONY TRINITRON TV - SHOWING “NIGHTLINE”  FIEDLER  Well. No. I, uh, I guess we mean a,  you know, non-political  relationship.  Koppel is not impressed.  TED KOPPEL  I can imagine what it’s like,  because I’m a reporter too and I’ve  been in similar situations. Let me  put to you an alternative question.  This wasn’t a competitive story.  Nobody was breathing down your  neck. You could have waited twenty  fours hours... and got it right.  FIEDLER  (dumbfounded)  I believe we did get it right.  TED KOPPEL  Is this a story that the Miami  Herald drops now?  Fiedler looks at Koppel. Doesn’t feel like Watergate. REVEAL:  INT. BEN BRADLEE’S OFFICE, WASHINGTON POST. EVENING.  The sound from the TV fades into the BG. Parker is watching  with a big grin, when he notices the rest of the office has  focused on something else.  Bradlee is leafing through photos from the PADD",
      "dialogue_count": 0,
      "word_count": 2386
    },
    {
      "scene_number": 8,
      "slugline": "INT. PARKER’S CUBICLE, WASHINGTON POST - EVENING  Bradlee walks by Parker’s desk. He drops the ENVELOPE OF  PHOTOS with a meaningful look.  BRADLEE  You have a train to catch.  Puts his hand on Parker’s shoulder and keeps moving.  EXT. DARTMOUTH INN, HANOVER, NH - NEXT MORNING  The news vans have assembled. It’s as bad as we’ve seen it.  INT. DARTMOUTH INN RESTAURANT - MORNING  Shore walks up the staircase to the second floor dining area.  The place buzzes with anticipation. We find Parker at a table  with a NOTEPAD and coffee.  At another table, McDaniel, Weinberg, and Shanahan watch  Parker with mixed envy.  SHANAHAN  Follow me.  WEINBERG  Can you believe that? He just  stumbled into a Pulitzer.  MCDANIEL  I don’t know.  SHANAHAN  What don’t you know?  MCDANIEL  I want my president to be smarter  than me, not trying to outsmart me.  Broder sits with the older crew - Germond, Broder, Wynman.  Shore comes walking through and Germond grabs his attention.  WYMAN  Let Gary know we’re around if he  wants a drink? With old friends?  SHORE  The senator is unavailable.  Yellow Rev. (9/15/17)   118.",
      "characters": [],
      "action_text": "Shore keeps walking. Germond takes in the moment. The others  at the table weigh the feeling of being shut out. Broder  stands up and walks over to AJ Parker.  BRODER  You know you don’t have to do this.  Parker looks up in question.  BRODER (CONT’D)  You think you’re the first guy he  asked?  Off Parker’s look, Broder keeps walking. Parker nods.  INT. HART’S HOTEL ROOM - MORNING  Evidence of Hart having slept on the sofa. Gary and Lee get  ready in silence. There’s a distance though they are  preparing for battle together. Lee gives her husband a look.  She fixes his tie. NEWS about Hart plays on the TV.  PRELAP of the press conference - A dozen cameras firing away.  HART (O.S.)  Yes, over there, Ann.  INT. DARTMOUTH INN BANQUET ROOM, HANOVER, NH, AFTERNOON  We’re in a tight room with no raised platform or podium. Hart  stands surrounded by over one hundred sitting journalists and  photographers. Close enough to bite him. His team leans  against the wall along with Lee who stands by Irene Kelly.  MCDANIEL  Doesn’t this episode call your  judgment as a leader into question?  HART  Yes, I suppose I made some  mistakes. But I think judgment,  like character, has to be measured  in the full context of a career. I  think what I’ve undertaken in the  Senate, the plans I’ve outlined for  the nation, speak to my judgment.  I’m not aware of anyone having  questioned my integrity as a public  servant.  VARIOUS REPORTERS  Senator Hart! Senator! Over here!  Yellow Rev. (9/15/17)   119. We see Stratton, on all fours, trying to body-block the crowd  of reporters from Hart.  A quick look at Lee. Smiling and composed. Then we see Parker  watching her.  HART  Yes.  GERMOND  You were quoted once as saying you  love danger. Is that why you think  you put yourself in this position?  HART  (smiling)  I don’t love it   that   much, Jack.  LAUGHTER among the press corps. A releasing of tension.  Angle on Shore, Sweeney, Wilson exchanging a relieved glance.  SHANAHAN  You said there’s no ",
      "dialogue_count": 0,
      "word_count": 2313
    }
  ]
}