{
  "slug": "the-boy-2016",
  "title": "the boy",
  "genre": "drama",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 1,
  "characters": [
    "COLE PERKINS"
  ],
  "total_words": 18426,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. GERTI’S ROOM - DAY Chaotic unpacking.   Clothes and magazines everywhere. Gerti grabs an armful of shirts, jeans and socks out of her suitcase and crams them into a drawer. She turns back to the suitcase and sees A WELL-WORN PICTURE It’s her, a bit younger, and a MAN holding hands and smiling at the camera.   We don’t know it yet, but this is COLE, the man that Gerti’s sister mentioned. Gerti takes the picture and shoves it in a drawer underneath a heap of underwear and socks. LIVING ROOM - LATER Some British comedy flickers on the TV.   Gerti eats a PB & J and drinks a glass of wine - the dinner of champions. She takes a quick, almost guilty glance at Brahms, still covered in the blanket, still sitting on the chair where she left him. A LAUGH TRACK on the TV pulls her attention back to the show.   Gerti giggles along and pours herself another glass of wine... GERTI’S BEDROOM - NIGHT Time for bed.   Gerti, in pajamas, crawls into bed and then reaches over and flicks off her lamp. A beat. The room is almost completely back.   And then we hear Gerti stirring.   The lamp flicks back on and Gerti gets out of the bed and heads to-- LIVING ROOM She pulls the blanket off Brahms.   Picks him up. BRAHMS’ ROOM Gerti tosses Brahms on to the bed.   Brahms lays there, his limbs akimbo, looking like a broken toy.  26.",
      "characters": [],
      "action_text": "Gerti pauses, mulling something over. Finally she walks back over to Brahms and lays him out flat.   Puts his hands on his chest like a corpse, thinks better of it and then puts them at his side. Finally satisfied she flicks off the light and walks out of the room. We hold on Brahms. A beat.   Then another.   We’re waiting for something, maybe waiting for him to move, to stand up and follow Gerti out of the room... Outside RAIN starts to fall, building from a few gentle beats to a DULL ROAR that carries over to... GERTI’S ROOM - MORNING Gerti stirs and then opens her eyes.   Lifts her head just enough to look around the room - as if she’s remembering where she is-- Gerti lets her head fall back onto the pillow, ready to go back to sleep when she hears something that makes her sit back up. A CHILD CRYING. Big painful SOBS that are just barely audible above the rain outside.   Gerti throws the covers off-- HALLWAY Gerti steps out into the hallway and pauses - listening. MORE CRYING, even louder now.   She follows the sound to-- THE STAIRS Tiptoes quickly down the stairs, closer and closer to the sounds of the crying child until she reaches-- THE FAMILY PORTRAIT The crying stops.   Gerti looks around.   The house is completely still and silent, save for the ever growing rumble of the rain outside. She studies the painting of the Heelshire family. Something seems different.   The rip is missing and Brahms looks almost life-like now.   There’s color in his skin and his eyes look as though they might blink any second.  27. Gerti can’t help but reach out towards the painting, towards Brahms’ life-like cheek.   The sound of the rain becomes a ROAR, until it’s almost deafening. Gerti is about to touch Brahms’ cheek when-- WOOSH! Brahms reaches out of the painting!   Grabs Gerti.   His eyes go black.   His skin goes white as porcelain. Gerti SCREAMS! Tries to jerk away, but Brahms hangs on, pulling her into the painting, her own skin going porcelain white, her eyes going comp",
      "dialogue_count": 0,
      "word_count": 942
    },
    {
      "scene_number": 2,
      "slugline": "INT. LIVING ROOM - DAY Gerti flips through the channels.   News reports. Comedies.   Commercials. She keeps flipping until, finally, she just turns it off. Gerti looks around, completely bored and restless - looking for some new way to distract herself... INT. MR. AND MRS. HEELSHIRE’S ROOM - DAY Gerti tip-toes into their room, as if someone might catch her snooping. Goes to the dresser.   Opens it slowly, quietly.   Full of underwear.   Opens another.   Full of shirts.   The next one.   Pants.   If these people took anything, it doesn’t look like it. Next to the dresser is a LONG POLE with a hook on the end of it.   Gerti holds it, not sure what to make of it. Puts it down again. She goes to the night stand by the bed.   Picks up an old looking PICTURE FRAME.   The kind that might hold a family photo, but this one is empty. GERTI Well, at least that’s not weird at all. Opens the drawer in the night stand.   Just one thing.   AN ENVELOPE.   It’s unsealed. A beat.   Gerti looks around the room.   Not sure if she should open it.   She pokes a finger in the envelope, pulls out the contents a little.   “LAST WILL AND TESTAMENT” written at the top-- A FLASH of something - or someone - passes by in the  hallway.   Gerti looks up, a second too late.   But she  feels it - a shiver passes through her.  She looks back down at the will.   Not exactly the kind of  snooping she was hoping for.   Stuffs it back in the  envelope...  HALLWAY Gerti heads toward her room when, for some reason, she looks up. AN ATTIC DOOR  30.",
      "characters": [],
      "action_text": "The type in the ceiling that you pull down.   She backtracks to the Heelshire’s room.   Re-appears with the hooked-pole. She hooks the ring on the door and pulls.   It doesn’t budge.   She rests for a beat, then really tugs on it. This thing isn’t moving. She gives up.   Tosses the hook into Brahms’ room and walks back into her own room. BATHROOM - LATER A bubble bath. Gerti reads a magazine.   Turns the water on with her toes for a second and then turns it off.   She hums some poppy- sounding song and turns the page as... THE SOUND OF A PHONE RINGING on the other side of the line carries over to... INT. GERTI’S ROOM - NIGHT Gerti’s buried under the covers, only her head sticking out, the phone stuck to her ear.   The other line rings and rings and no one picks up.   Finally her sister’s voice-mail kicks in: SANDY(VOICE MAIL) Hey ya’all, this is Sandra.   Leave a message...or don’t. Beep. GERTI Sandra, it’s me again.   I don’t know what time it is.   I still haven’t figured out the whole time difference thing.   Maybe you’re asleep.   Maybe you’re at work... She pauses, thinking of what to say next-- GERTI Call me.   Soon.   I’m lonely.   And this house is creepy.   And send more magazines.   I’ve read all mine. Especially any with Ryan Gosling. A beat.   Gerti doesn’t want to get off the phone--  31. GERTI I want to come home, Sandy. And then she hangs up.   Gerti stares at the phone for a beat.   She picks it up quickly and dials.   It rings and then a MAN’S VOICE answers. MAN’S VOICE Hello?   Hello? Gerti doesn’t say a word. MAN’S VOICE Who is this? A beat.   Then the voice changes, becomes softer, more intimate.   The way you might speak to a girlfriend-- MAN’S VOICE Gerti?   Is that you?   If this is you I just want to say I-- Gerti practically slams the phone down - rushing to hang- up before the Man gets another word out.   She stares at the phone for a beat... EXT. THE HEELSHIRE COTTAGE - DAY Another gray English day. Heavy clouds stacked along the horizon. ",
      "dialogue_count": 0,
      "word_count": 699
    },
    {
      "scene_number": 3,
      "slugline": "INT. KITCHEN - DAY Gerti puts groceries away, mostly canned goods.   Malcolm is just around the corner, pulling the tupperware containers out of the freezer and putting them into a trash bag. Gerti peaks around the corner at him before stuffing yet another can of food in the pantry-- GERTI I was wondering about that freezer. MALCOLM Mrs. Heelshire’s orders.   Everything gets thrown out every two weeks. GERTI So all that food just goes to waste? Malcolm holds up an empty tupperware container-- MALCOLM Not all of it.   Mr. Heelshire eats a few of them.   He’s always been the less strict one about all of this. GERTI You could have warned me, you know. MALCOLM And ruin the surprise? GERTI Thanks. MALCOLM How are the two of you getting along? Gerti holds up a jar of peanut butter and a jar of jelly before shoving them into the cupboard-- GERTI Like peanut butter and jelly. (beat) So, I have to ask-- Malcolm comes around the corner with his garbage bag of tupperware. MALCOLM Yes, I am single.   Believe it or not. Off Gerti’s look--  33.",
      "characters": [],
      "action_text": "MALCOLM What’s up with the doll? GERTI Yeah. MALCOLM Not the happiest story, I’m afraid.   They had a real son once.   A real Brahms.   He died as a child.   They moved here not long after and built this house.   They never went out much - maybe because of the looks they got when they went into town with this doll.   And the last few years - I’m not sure they left the house at all.   It’s all harmless, though, this little world they’ve made.   A way to cope.   I can’t imagine how difficult it must be to lose a child. GERTI How long ago did Brahms - the real Brahms - die? MALCOLM He’d be older than me now, I suppose.   30 or so years ago? GERTI They’ve lived like this for 30 years? Malcolm nods-- MALCOLM And they’ve been looking for a nanny for the last seven.   You must be a special lady, Gertrude Evans. Gerti smiles - something about the way he says her name. She looks at him, really looks at him for the first time. Not a bad looking guy-- GERTI Nobody calls me Gertrude. Malcolm smiles - sees his chance. MALCOLM You’re probably going mad in this house, yeah?   It might be good to get out.   I could take you to town, if you’d like. Show you the world-famous Norwich nightlife.  34. GERTI I don’t know.   I just got out of a...a thing. MALCOLM Well, this is not a thing.   I can assure you of that.   This is a professional courtesy seeing as we’re employed by the same people.   It’s a duty is what it is. I’ll take no pleasure in it whatsoever, I promise. Gerti LAUGHS. GERTI Okay. MALCOLM Yeah? GERTI Yeah. INT. BRAHM’S ROOM - NIGHT Light spills in from the hallway. On the bed is a pot filled with water from the leak.   The rain has let up, but the leak continues. DRIP.   DRIP. Pushed unceremoniously aside is Brahms, turned on his side so he’s facing toward us. In the shadows of the room his knowing smile has taken on a sort of demonic air. We can hear Gerti in the next room TALKING ON THE PHONE. She laughs, walks across the room with light, happy steps, as we-- Begin to ",
      "dialogue_count": 0,
      "word_count": 2030
    },
    {
      "scene_number": 4,
      "slugline": "INT. THE ATTIC - MORNING Light spills through the windows, catching the dust that twists and turns like spirits.   The attic is filled with fire-damaged furniture.   Blackened wood chairs.   A half- burnt painting.   A fire-melted lamp. Something stirs in a corner. GERTI Opens her eyes.   Reaches a hand up and touches a big bump on her head.   She grimaces in pain, sits up with a GROAN. Next to her is the FIGURE she ran into in the dark.   A DRESSING MANNEQUIN knocked on its side.   This too, blackened by some past fire. Behind the mannequin is a LARGE PAINTING, just like the one downstairs with Mr. and Mrs. Heelshire - but in this one it’s not a doll they are posing with, it’s a real boy.   The real Brahms. Just beyond the painting a box has been overturned, spilling its contents across the floor.   Various baby and toddler clothes, a pair of very small shoes and A PHOTO ALBUM Gerti opens the first page.   Various pictures of a BABY, Brahms, and the Heelshires in much happier, much more normal times. Turns the page. Brahms as a toddler, holding the doll Brahms.   The same one that Gerti now cares for.   Gerti looks through more pictures.   Brahms smiling at the camera.   Brahms opening birthday presents.   Brahms showing a missing tooth.   All normal pictures, except in each one the doll is there. Gerti turns another page. Brahms as a young boy.   Maybe eight.   The smile is gone.  A pale, unhappy boy stares at the camera.   In most of the  pictures he holds the doll over his face.  Gerti turns the page again.   Only one picture.   The only  one without the doll.   A LITTLE GIRL (8) looks unhappily  at the camera while Brahms stares at her.  The little girl has blond hair.   Freckles.   Could easily  pass as Gerti’s daughter - or maybe a picture of Gerti as  a little girl.  43.",
      "characters": [],
      "action_text": "Gerti flips through the rest of the book.   Empty.   It  stops there.   That’s when Gerti notices--  THE ATTIC DOOR It’s open. Gerti peers down the steps. Puts a foot on the top-most rung and then quickly pulls it back up. GERTI (to herself) Now you’re scared? A beat. Gerti thinks of something, moves through the attic. Picks up the broken chair leg.   The only weapon she can find. She stands back at the top of the stairs, holding the leg of the chair.   Adjusts the sheet she’s wearing. GERTI I’m coming down! I’m warning you I’m armed! She summons her courage.   Slowly, slowly, steps.   One step.   The next.   Then one more, all just as slowly as the first, until she reaches the floor. And there, waiting for her, is a PILE OF HER CLOTHES. INT. HALLWAY - LATER The attic stairs are still down. Malcolm walks around them, examining.   Gives them a tap with a broom handle.   Gerti, clothed now, stands back a few feet and watches. Malcolm gives the stairs another tap.   This one a bit harder.   Then again and-- WOOSH!   SLAM! The attic stairs slam closed like the spring on a rat trap.   Malcolm looks at Gerti-- MALCOLM Well, that’s one mystery solved. CUT TO:  44. HALLWAY - LATER Gerti waits nervously in the hallway.   Arms crossed, maybe because of the cold, maybe out of fright.   We can hear Malcolm in the room, moving things around-- MALCOLM (O.S.) Nothing under the bed...bars on the window are still solid... Gerti gives a quick glance down the hallway to BRAHMS Sitting up now.   Hands in his lap like a real, little boy.   He’s staring directly at Gerti, almost as if he’s watching her-- Malcolm says something from in the room-- GERTI Turns her attention back to the room.   Just as she turns her head, she catches sight of Brahms out of the corner of her eye as he BLINKS. Or at least it looks like he does. Gerti does a double-take.   Brahms sits there, motionless, inert, harmless - staring back at her with big, black, lifeless eyes... MALCOLM (O.S.) ...closet’s clear... M",
      "dialogue_count": 0,
      "word_count": 931
    },
    {
      "scene_number": 5,
      "slugline": "INT. DINING ROOM - LATER Gerti sits at the table - a plate and fork in front of her.   Malcolm bursts out of the kitchen holding a baking dish full of steaming food. MALCOLM Ta-da! He sets the baking-dish down revealing what looks like hot-dogs placed in a kind of uncooked dough.   Not exactly appetizing. MALCOLM Toad-in-the-hole.   Just like my mother used to make it. GERTI Toad? Malcolm scoops some out and puts it on Gerti’s plate. MALCOLM Not to worry.   Just a name. Our food’s so bland, we’ve been forced to give it exotic sounding names to make it more exciting.   If we’d invented the hamburger we’d have called it “The Gleaming Jewel of Ipswich Sandwich” or something. He sits down and watches Gerti take her first bite. Gerti takes a bite and chews cautiously-- MALCOLM And...? Gerti looks a little surprised-- GERTI Not bad. MALCOLM “Not bad”.   The highest compliment a British chef can receive. KITCHEN - LATER Gerti scrapes the remaining food into a big tupperware dish.   It’s the one rule handed down from the Heelshires she actually follows. She hands the scraped dishes to Malcolm who washes them in the sink.  47.",
      "characters": [],
      "action_text": "GERTI You really don’t have to do that. MALCOLM It’s no trouble.   You will owe me, of course. GERTI Owe you one?   How about a high-five and I tell you your frog-in-the-cave was delicious. MALCOLM Toad-in-the-hole.   And I’m afraid a high- five’s not going to cover it.   I believe you still owe me a night on the town. Gerti’s about to reply when - from somewhere upstairs-- TWO LOUD CREAKS like steps.   The kind we dismiss as a house “settling”. Both Gerti and Malcolm look up at the ceiling and then at each other, eyes big. MALCOLM Well, I’m glad this isn’t a big, empty creepy house or that would have been a little spooky, yeah? Gerti smiles-- GERTI Yeah. They both return to cleaning up-- MALCOLM So about this night on the town... GERTI I’ll make you a deal?   I go out on the town with you in exchange for a little information. MALCOLM Sounds easy enough. GERTI Tell me more about Brahms. A shift in Malcolm’s face - obviously not a subject he wants to talk about.  48. MALCOLM I told you about all I know. GERTI Wow. MALCOLM What? GERTI That was truly a terrible poker face. Like one of the worst ever. Malcolm smiles - a serious kind of smile, as if he knows he’s been caught and doesn’t like what’s coming next. MALCOLM Okay.   What do you want to know? GERTI How did he die? Malcolm lets a dish settle underneath the soapy water. Dries his hands, giving full attention to Gerti. MALCOLM First, you need to know that Norwich tends to have two kinds of talk.   Polite talk and pub talk.   And the truth is usually somewhere in between. GERTI So what’s the polite talk? MALCOLM That it’s no one’s business but the Heelshire’s. GERTI And the pub talk? MALCOLM That there was a car crash.   Or that Brahms was sick.   I’ve even heard people say that the Heelshire’s killed him. Which is rubbish.   I’ve known them most of my life and there’s no gentler, kinder, more decent people in all of England. A beat.   Gerti isn’t exactly sure she wants to keep going anymore.  49. GERTI And the tru",
      "dialogue_count": 0,
      "word_count": 1594
    },
    {
      "scene_number": 6,
      "slugline": "INT. GERTI’S BEDROOM - NIGHT ...and Gerti is still in the same place.   Waiting.   Eyes still on the door.   Without making a sound she raises the phone to her ear again, listens. Still dead. At the door-- TAP.   TAP. Like little porcelain fingers tapping on the door. GERTI Malcolm? No answer. GERTI Hello? Gerti quietly moves to the door, still blocked by the dresser.   She listens again.   Silence. She slowly, quietly slides the dresser aside.   Gets down on all fours and peers UNDERNEATH THE DOOR There’s something there, it’s hard to tell what it is. GERTI stands, unlocks the door.   Carefully, silently opens it and peeks-- HALLWAY A peanut-butter and jelly sandwich sits just outside the door.   A glass of wine beside it.   The papers, rules and schedule, underneath it. GERTI Closes the door again.   Locks it.   She’s breathing hard now.   Scared.   Tired.   Hungry. She has that look on her face.   What do I do?  55.",
      "characters": [],
      "action_text": "HALLWAY The door opens.   Gerti peeks out.   Then takes a step out. She picks up the sandwich.   Smells it.   Opens it up. Just peanut butter and jelly. She picks up the papers stacked neatly underneath the plate... INT. BRAHMS ROOM - CONTINUOUS Gerti stands over Brahms. He lays there, the little smile on his face.   Gerti looks at him and then the papers.   She notices something on the list:   bath time . Gerti looks at Brahms again.   Dirt smudges on his porcelain face.   Comes to some decision-- GERTI Okay, Brahms... CUT TO: INT. BATHROOM - DAY Brahms sits in the bath while Gerti gently wipes the dust and dirt off of his little porcelain face and hands. DINING ROOM - LATER Brahms and Gerti sit directly across from each other. Plates of food in front of them.   Gerti eats, never taking her eyes off of Brahms. Almost in a whisper-- GERTI Brahms? Silence. GERTI Are you there?   Can you hear me? She waves her hand in front of his face.   Nothing.  56. GERTI Just give me some kind of sign.   A blink. Or move or whatever you do, just let me know that you can hear me. Gerti looks up at the ceiling - calls out in her best spirit medium voice-- GERTI If there is a spirit in this house... um...let your presence be known. Beat.   Same voice-- GERTI Spirit come forth into the land of the living.   Give, uh, upon me a sign. A long, silent beat.   Brahms remains perfectly still, the same half-smiling look on his face. Finally Gerti stands up.   She takes her dish.   Walks around the table and picks up Brahms’s untouched plate. Pauses behind Brahms. GERTI RAAAAH! She screams directly into Brahms ear.   He doesn’t flinch. Doesn’t move. Gerti stands there, embarrassed.   Looks around as if someone might be watching and then gathers herself and continues into the kitchen as if nothing happened... LIVING ROOM Classical music is BLASTING. Gerti and Brahms sit side by side on the couch.   The music is so loud Gerti has her fingers in her ears.   She takes one finger out just long eno",
      "dialogue_count": 0,
      "word_count": 1936
    },
    {
      "scene_number": 7,
      "slugline": "INT. GERTI’S BEDROOM - NIGHT Gerti lays on her bed, talking on the phone.   Brahms is propped next to her-- SANDY I’ve been trying to call you all week.   I was about to call the boobies. GERTI The boobies? SANDY The British police.   You’re lucky Rick talked me out of it. GERTI It’s Bobbies, Sandy. SANDY I don’t care what they’re called.   You can’t just stop answering your phone.   I worry about you. GERTI I’m sorry, there was a, uh...a problem with the phone. SANDY Is it fixed now?   You can’t be out there with no phone. Gerti looks at Brahms-- GERTI Yeah, everything’s fine now. SANDY Are you sure you’re okay?   You sound, I don’t know.   You just sound different. As if realizing it for the first time-- GERTI Yeah.   I’m good. A SIGH on the other end of the line - as if Sandy doesn’t quite buy it-- SANDY Well, in two months you’ll be back here and everything will be back to normal. Gerti looks less than happy about it--  64.",
      "characters": [],
      "action_text": "GERTI Yeah... INT. DINING ROOM - DAY Lunchtime.   Brahms sits at the table alone. We PUSH IN on Brahms’ face.   It almost looks like his expression is changing - ever so slightly - from that mysterious half-smile to something darker and more sinister... GERTI (O.S.) I don’t know what kind of food you like, but until you say otherwise it’s sandwich city for you. Gerti emerges from the kitchen with a sandwich and a glass of milk.   She’s smiling, happy - at home. Gerti sets the plate down in front of Brahms. GERTI So what do you feel like doing today? How about we forget the schedule and do something fun?   Hide-and-seek?   Play some checkers?   Maybe go for a walk outside? A beat.   Gerti waits. GERTI No?   Okay.   Well, we’ll stick to the schedule then. We FOLLOW GERTI as she walks back into -- THE KITCHEN She starts making another sandwich for herself. GERTI I gotta be honest with you, Brahms.   This schedule thing is getting to me.   I don’t see how you do it.   Same thing every day. Not leaving this house.   I’m a girl that needs a little spontaneity.   I just can’t do the same thing everyday.   I need adventure.   I need surprises.   I might need to get out of the house for a couple of days here... We FOLLOW GERTI back into the  65. DINING ROOM Gerti freezes, her mouth hanging open.   Brahms is gone. The chair pushed back and away from the table. Gerti looks around the room-- GERTI Brahms? EXT. HEELSHIRE MANOR - DAY Truck tires come to a skidding stop in the gravel driveway. MALCOLM Jumps out of the truck.   Practically runs up to the front door.   The door swings open and there’s Gerti, wild-eyed and half-crazy looking. GERTI I...uh...I.   He.   Brahms.   He just. Gerti starts LAUGHING - somewhere in between hysterical and joyous.   Gathers herself-- GERTI You’re not going to believe this. INT. HEELSHIRE MANOR - STAIRS Gerti races up the stairs, Malcolm struggles to keep up-- GERTI I needed someone to see it too.   So I’d know I wasn’t crazy. MALCOLM To see wha",
      "dialogue_count": 0,
      "word_count": 2378
    },
    {
      "scene_number": 8,
      "slugline": "INT. BRAHMS’ ROOM - NIGHT Gerti tucks Brahms in.   She leans down and kisses him on the cheek. GERTI I promise I’ll never leave you. She switches the light off and the room goes black. We follow Gerti as she walks out into the HALLWAY and then to her BEDROOM - CONTINUOUS Gerti walks into a dark room.   A figure sitting on the bed stands up.   Malcolm.   Gerti moves toward him and the two of them stand there awkwardly for a beat. The two of them are drunk, but not quite drunk enough to keep from feeling a little shy-- MALCOLM So... Gerti steps in close toward him, close enough to kiss him.   But she keeps her head down, staring at his chest shyly. GERTI This is a nice shirt. MALCOLM My mum bought it for me. Gerti undoes the top button-- GERTI She has good taste. MALCOLM I’ll let her know... And with that Malcolm tips Gerti’s chin upwards and kisses her, softly and then harder, pulling her back onto the bed. We PULL BACK...out of the room and into the hallway where we can see into both Gerti and Brahms’ room.   Something MOVES in Brahms room as we... FADE OUT...  76.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 9,
      "slugline": "INT. GERTI’S BEDROOM - MORNING Early morning. Gerti and Malcolm are tangled in the sheets, asleep.   We hold on them as-- STEPS.   Soft as a doll’s footsteps. ON THE FLOOR A pile of Malcom’s clothes.   Something - or someone - just out of view, drags Malcolm’s shirt from the pile. It’s the same one Gerti complimented. More STEPS. We turn just as-- THE BEDROOM DOOR CLOSES quietly.   Someone sneaking out. A silent beat and then-- BOOM!   BOOM!   BOOM! Something pounding at the door.   Gerti and Malcolm bolt up in bed. MALCOLM What in the-- Panic. Malcolm scrambles out of bed, tripping over the sheets and landing with a THUD.   He gets back up, heads to the door-- GERTI Malcolm, no-- More POUNDING on the door.   Not the kind of noise a doll could make.   Malcolm looks at Gerti and then-- WHIPS THE DOOR OPEN REVEALING The doll.   Sitting there in front of him.   Malcolm sticks his head out into the hallway.   Empty. INT. DINING ROOM - MORNING Breakfast. Gerti, Malcolm and Brahms at the table.   Malcolm wears one of Gerti’s t-shirts - a too-tight “Hook ‘em Horns” Texas shirt.   He doesn’t look too happy about it.  77.",
      "characters": [
        "COLE PERKINS"
      ],
      "action_text": "GERTI He likes to play little tricks on people. It means he likes you. To Brahms-- MALCOLM Very funny.   You know what would be even funnier?   If you gave my shirt back. Gerti can’t help but LAUGH. EXT. HEELSHIRE MANOR - MORNING  Gerti walks Malcolm to his truck.   They stop before it -  smile at each other awkwardly.   Malcolm looks back at the  house nervously.   Something’s on his mind--  MALCOLM  I was thinking, why don’t you come in  town for a few days?   Get out of this  house for a bit.  GERTI  I admire your persistence, but I don’t  think I should.   Brahms needs me here.  Malcolm shifts uncomfortably--  MALCOLM  What happened this morning.   With the  door.   That was--  GERTI  It was a tantrum.   Children have  tantrums.   I shouldn’t have--  Gerti stops, blushing.  GERTI  I’m not supposed to have guests.   This is  his house.  MALCOLM  One night away.   To get some perspective  and we can figure out what all this is.  GERTI  You know I can’t leave.   I promised the  Heelshires I’d take care of Brahms.  78. MALCOLM  Under the circumstances I think the  Heelshire’s would understand.   When they  get back--  GERTI  They aren’t coming back.  It just slipped out.   But Gerti knows it’s true--  MALCOLM  What?  GERTI  I found a will.   My name was in it.  That’s why they looked for so long.   They  had to find the right person to take over  for them.   They were waiting for me.   I’m  the only person Brahms has now.  MALCOLM  Whatever you saw, I’m sure it’s just some  kind of emergency plan or something.   You  don’t really think that they went off  and...  The look on Gerti’s face: Yes, she does.  MALCOLM  If you really believe that, it’s even  more reason to step back.   To look at  this with clear eyes--  GERTI  I’m not leaving.   Not for a day.   Not for  an hour.  For the first time Malcolm looks truly shook up.   He rubs  his face hard with his hand--  MALCOLM  There’s something I need to tell you.  About Brahms.   I should have told you  before, but I d",
      "dialogue_count": 1,
      "word_count": 2358
    },
    {
      "scene_number": 10,
      "slugline": "INT. HEELSHIRE MANOR - SAME BRAHMS’ POV: Moving through the upstairs hallway.   We pause at Gerti’s closed bedroom door and continue to... THE STAIRS Moving slowly, purposely.   CREAK.   CREAK.   CREAK. LIVING ROOM We’re standing over Cole.   He’s sleeping, curled up on the too-small couch. A DROP OF BLOOD falls on his face, dropped from somewhere just out of frame.   Then another drop.   And another.   Cole stirs, wipes at it with his hand, smearing it, but he doesn’t wake up... EXT. HEELSHIRE MANOR - MORNING The sun peaks up behind the hillside.   Fog lifts from dew- spangled earth... INT. GERTI’S BEDROOM - MORNING Gerti stirs.   Wakes.   She looks tired, broken.   Pulls herself out of bed... INT. BRAHMS ROOM - DAY Dresses Brahms.   Talking to him softly as she does-- GERTI Everything will be okay.   He’ll leave and we’ll go back to the way things were... Rumblings from downstairs.   Like someone talking to themselves.   Then an angry SHOUT-- COLE (O.S.) Gerti!   GERTI! A flash of fear on Gerti’s face.   She picks up Brahms, holding him close.   The storm is coming...  89.",
      "characters": [],
      "action_text": "LIVING ROOM Gerti stops in the doorway, afraid to enter.   Cole doesn’t notice her at first.   Scrubs his face with his t- shirt.   Finally he turns and sees her, his face smeared with blood-- COLE Get in here! Gerti doesn’t move.   Cole’s eyes are wild - filled with rage.   The eyes of some animal-- GERTI What happened? COLE Get in here! Gerti takes a hesitant step in the room.   Cole violently grabs her by the arm and drags her to face the wall. LEAVE Written in blood.   Below it are two dead rats lying in a small pool of blood. COLE What is this? GERTI I didn’t-- Cole jerks her violently-- COLE Don’t pull this shit on me, Gerti... GERTI It wasn’t me. She looks down at Brahms. COLE The doll?   The doll wrote this? Gerti doesn’t say anything.   She’s terrified. COLE Fine.   Okay.   It wasn’t you.   It was the doll.   Give it to me. Gerti backs away.  90. COLE Hand him over. GERTI No.   Please... COLE Don’t play around with me.   I’ve had as much as I can take with you. GERTI I did it.   You were right. COLE It’s too late for that.   I gave you a chance to come clean.   Give me that doll. Now.   I’m not joking around. He lunges at Gerti, grabs her.   The two struggle, but Gerti’s no match for Cole.   He rips the doll out of her arms with one hand and pushes her down to the floor with the other. GERTI No! In a flash Gerti is back on her feet.   She lunges at Cole who holds her back with one hand.   Lifts the doll over his head with the other. He’s about to smash the doll on the floor when-- MALCOLM (O.S.) Stop! Cole looks over to Malcolm, standing in the Entrance-way. MALCOLM Get your things.   Get out. Cole pulls away from Gerti, still holding Brahms.   Cole motions to the wall. COLE Everyone seems to be in a big hurry for me to leave.   Maybe you’re the one that left me this little message.   Or are you going to say it was the doll too? Malcolm doesn’t answer.  91. GERTI Cole, you don’t understand.   He’s real. He’s just a little boy.   Please, let him go, please..",
      "dialogue_count": 0,
      "word_count": 5006
    },
    {
      "scene_number": 11,
      "slugline": "INT. MALCOLM’S TRUCK - NIGHT Gerti turns on the ignition.   Let’s out a sigh - thank god it works.   She puts it in reverse.   Turns to look behind her when-- MALCOLM (terrified) Gerti! Gerti turns back around just in time to see-- BRAHMS Leap onto the hood of the car.   He has the screwdriver in his hand, slams it into the windshield, shattering it. Gerti doesn’t blink-- Gerti looks right into his eyes, shifts the car into drive and SLAMS ON THE GAS-- The truck Speeds forward, directly towards the front door of the house-- BRAHMS Turns around, just in time to see CRASH The truck SLAMS through the front of the house.   Brahms slams into the stair case - falling on the splintered railing - a piece of wood going right through his chest. Gerti puts the truck in reverse, pulling out through the debris.   Then slams the truck into drive again, right at Brahms-- MALCOLM Gerti...? She slams on the gas. WHAM! Nails Brahms, crushing him between the car and house. This time he won’t be getting back up... CUT TO:  114.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 185
    },
    {
      "scene_number": 12,
      "slugline": "INT. MALCOLM’S TRUCK - DAWN The truck bumps along violently, the horrible sounds of metal on pavement. They’re traveling some deserted country road, getting further and further away from the nightmare they just experienced... Malcolm slides down, putting his head on Gerti’s lap as she drives.   She puts an arm over him, protecting him-- Gerti looks at him, smiles - a real honest to goodness smile despite everything that’s happened-- EXT. COUNTRY ROAD - SAME The tires are gone.   They’re down to the metal wheels. The truck rumbles along, sparks in its wake where the rims meet the pavement. WE PULL OUT Further and further leaving the truck behind, focusing instead on the sun rising above the impossibly green pastures and the morning fog lifting from the land... ...and then even further out, until the world looks peaceful and still and it’s impossible to tell if we’re looking at the real world anymore or some too-perfect painting of the English countryside...  115.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 163
    }
  ]
}