{
  "slug": "the-neon-demon-2016",
  "title": "the neon demon",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 0,
  "characters": [],
  "total_words": 17619,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. STUDIO - DAY 1   1  CLOSE ON JESSE’S face, eyes closed, angelic, beautiful. Slowly, the CAMERA PULLS BACK and her twisted, bleeding body is revealed, tangled in a tattered dress.   It appears a violent crime has just taken place. CLOSE ON a man's face.   It is DEAN, handsome, slightly awkward.   He stares at the scene, entranced by Jesse’s figure. He raises a still camera.   Jesse’s image is reflected in miniature in the glass lens.   He takes a photo, and the black shutter closes and opens on Jesse’s body, the mechanical sound a startling contrast to the eerie quiet of the room. The CAMERA PULLS BACK again, revealing that the crime scene is actually a fashion photo shoot. The clicks of Dean’s camera, uneven at first, grow rapid and regular.   A frenetic, percussive score.   With every shot, a new image of Jesse appears on the nearby computer screen. As though waking from a dream, Jesse’s eyes open... INT. MAKE-UP ROOM - DAY 2   2  She is seated in front of a mirror, staring at her reflection with wide eyes.   Her face still appears bloody and battered from the shoot. She begins taking off the make-up. From across the room, RUBY, 27, simultaneously iron-willed and fragile, watches her every move.   Jesse senses her gaze. RUBY Am I staring? JESSE I don’t mind. RUBY Sorry.   Occupational hazard. Ruby waves a fist full of make-up brushes. JESSE (a revelation)  You did my make-up.",
      "characters": [],
      "action_text": "RUBY Yeah.   Like an hour ago.   You don’t remember? JESSE Sorry - RUBY What, did you have a stroke between then and now? JESSE I thought you were in the next shoot. Ruby laughs.   Jesse doesn’t understand the joke. RUBY (touched) Oh, you’re serious. JESSE Yeah. RUBY Well, here, let me help you. Ruby rushes over and begins wiping away some bloody make-up out of reach behind Jesse’s ear. RUBY (CONT’D) I’m Ruby, by the way. JESSE I’m - RUBY Jesse.   You told me earlier. You’re a little bit deer-in-the- headlights. JESSE I just moved here.   Six weeks ago. RUBY Please don’t be from New York. Last thing we need is another pretty bitch without a soul. JESSE I’m from Ridgecrest. RUBY Where’s that?  2. JESSE Near Death Valley. RUBY Spooky.   What’s in Death Valley? JESSE Nothing worth sticking around for. Ruby smiles, a genuine understanding. RUBY Your skin is perfect.   Look at you. She leans in, examining Jesse in the mirror, their faces nearly touching. RUBY (CONT’D) I don’t think you’re even human. (whispering) If I killed you, would you die? Ruby playfully holds up her hands, covered in bloody make-up. RUBY (CONT’D) I swear I didn’t do it! She begins cleaning her hands with a small cloth. RUBY (CONT’D) Shit, what time is it?   I promised Dee and Dum over there a ride. Ruby nods toward two ULTRA-THIN MODELS leaning against each other in the corner of the room.   They are totally bored.   It looks like it takes every bit of effort to hold themselves upright. RUBY (CONT’D) You think they’ve ever had lunch? Probably don’t even know what it is.   ‘Wanna go to   lunch ?’   Probably think it’s a day-spa. (to Jesse) Hey, you wanna come?   We’re going to this club in West Hollywood. Please.   You’ll be saving me from a thirty minute ride with the world’s only living exoskeletons. One of the thin girls sighs deeply. JESSE Do I get shotgun?  3. RUBY Deal. Ruby tosses the blood-covered cloth on the make-up table. She claps loudly, startling the thin girls to life. RUBY (CONT’D) A",
      "dialogue_count": 0,
      "word_count": 786
    },
    {
      "scene_number": 2,
      "slugline": "INT. RUBY’S CAR - DUSK 8   8  Ruby drives, the two thin models slumped in the backseat. Jesse stares out the passenger seat window, mesmerized by the neon lights of Los Angeles. Ruby pays dangerously little attention to the road in an effort to sneak looks at Jesse. One of the thin models springs to life. THIN GIRL You missed your exit. RUBY Oh, it speaks. The thin girl hisses at her. RUBY (CONT’D) Back in your cage. Ruby makes a risky maneuver on the highway and Jesse grips the car door, white-knuckled. RUBY (CONT’D) I won’t really kill you, I promise. EXT. HIGHWAY - NIGHT 9   9  The car exits the highway and drives into West Hollywood. EXT. RUBY’S CAR - NIGHT 10   10  It pulls up to the curb and screeches to a sharp halt. INT. RUBY’S CAR - NIGHT 11   11  Jesse releases the car door, stretching her cramped hand. EXT. STREET - NIGHT 12   12  All four girls exit the car.   We watch them disappear down the street, headed to the club. INT. WEST HOLLYWOOD CLUB - NIGHT 13   13  Jesse and Ruby stand inside the entrance.  5.",
      "characters": [],
      "action_text": "MUSIC BLASTS at a deafening level.   The tremendous main room is completely congested with sweaty dancers.   The walls, lined with floor-to-ceiling mirrors, reflect a galaxy of pretty, bouncing lights. Someone waves to Ruby across the room.   She turns to Jesse and shouts over the music. RUBY Be right back! JESSE What? RUBY Don’t go anywhere.   Promise? JESSE I can’t hear you. Ruby disappears into the crowd. Jesse walks around the perimeter of the room, watching the reflections of the club in the mirrored walls. She spots a pair of eyes watching her.   They belong to JACK, 37, leaning casually against a pillar in a shadowed corner of the room.   He is striking, fashionable, and holds himself with unintentional arrogance.   When their eyes connect, it is unclear how long he has been looking at her. SARAH, 24, plenty of eyeliner, flirts with him, but fails to hold his attention. Jack makes his thumbs and forefingers into a square, holds them up, and squints. JACK’S POV:   Jesse gazes back at him, captured within the frame. Sarah sees the gesture and looks across the room for the recipient.   Jesse is identified. She whips around and crashes head-first into DEAN.   He smiles at her. DEAN I was hoping you would be here. Jesse cannot hear him. JESSE I’m looking for my friend.  6. He leans closer. JESSE (CONT’D) (louder) Ruby?   Do you know Ruby? He nods in acknowledgment and gestures for Jesse to follow him.   They start across the room, searching for Ruby. Dean glances over his shoulder and sees Jesse struggling to make her way through the crowd.   He reaches out. Their hands lock. EXT. CLUB ALCOVE - NIGHT 14   14  Dean and Jesse push through a back door into a small, dark alcove.   The MUSIC, still pulsing, is muffled. They both exhale, relieved to be away from the crowd. A LONELY SMOKER dressed in black leans against the brick wall while two GAY MEN kiss hungrily across from her.   The smoker watches them, sucking her Marlboro, unmoved. Jesse and Dean smile at the sce",
      "dialogue_count": 0,
      "word_count": 1450
    },
    {
      "scene_number": 3,
      "slugline": "INT. DEAN’S CAR - NIGHT 18   18  Jesse stares at her reflection in the window of the car.   She looks past herself and sees Dean’s reflection, driving steadily. She leans her head against the window next to his image.   Her eyes begin to close. JESSE’S DREAM 19   19  A fuzzy, pink surface.   An image out of focus.   After a while, the image becomes clear, and we realize we are looking at skin.   We see an arm.   A pair of shoulder blades.   A collarbone.   An elbow.   A mouth.   Odd angles of seemingly dismembered portions of a WOMAN’S BEAUTIFUL BODY. INT. DEAN’S CAR/JERRY’S MOTEL - NIGHT 20   20  CLOSE ON Dean’s face.   The CAMERA PULLS BACK and we see that he is watching Jesse sleep in the passenger seat.   After a few moments, her eyes open, and she looks around, disoriented. JESSE Where are we? She glances out the window.   The motel is run-down, depressing, cheap.   She is a little embarrassed. JESSE (CONT’D) Oh.   How long was I asleep? DEAN Not long. She rubs her eyes and gathers her things. JESSE Thanks for the ride. EXT. JERRY’S MOTEL - NIGHT 21   21  Jesse climbs up the rusty outdoor stairs to her motel door. EXT. MOTEL ROOM - NIGHT - CONTINUOUS 22   22  She pulls a set of keys from her bag and is about to open the door when...  14.",
      "characters": [],
      "action_text": "DEAN (O.S.) Hey. She turns and leans on the balcony rail, looking down over Dean. DEAN (CONT’D) What did one dead guy say to the other? JESSE What? DEAN Nothing.   He’s dead. Dean smiles.   Jesse smiles. DEAN (CONT’D) I want to see you again. JESSE Okay. DEAN Tomorrow. She nods. Dean points up, and she turns her head to the sky.   The full moon is perfectly luminous.   She gazes at it in awe as Dean’s car springs to life and drives away. She turns to her motel room.   One number hangs on the door, the other has long gone missing.   The color has chipped away revealing multiple coats of hideous paint.   The lock takes a bit of effort with the key, but it finally clicks. INT. MOTEL ROOM - NIGHT 23   23  Jesse steps into the room, leaving the front door half open. She flips the light switch a few times, but it doesn’t work. Aside from the ambient moonlight shining through the window, the room is dark and eerie. Jesse tries to see into the space.   Her skin prickles as she senses that something or someone is in the room.   She makes out a shape in the dark which starts to approach her.   She quickly steps out of the room, slamming the door shut.  15.",
      "dialogue_count": 0,
      "word_count": 445
    },
    {
      "scene_number": 4,
      "slugline": "EXT. MOTEL ROOM - NIGHT - CONTINUOUS 24   24  Jesse stares at the door, unsure of her next move.   The drapes inside the room move slightly, as if someone brushed past them. She glances around her, but the parking lot is deserted.   The only sounds come from televisions in neighboring rooms and the muffled roar of the distant highway. She turns to the door again and takes a deep breath.   She is about to slip her key in the lock when a loud bang hits the door from the inside.   She drops the keys and walks away. INT. JERRY’S MOTEL MANAGEMENT - NIGHT 25   25  A LITTLE BELL JINGLES as Jesse runs through the door and hurriedly approaches the Night Manager, HANK.   He is a fake- tanned, hair-straightened, middle-aged, failed actor.   He was obviously once very good looking, but now borders on the grotesque. Hank sits at the front desk, feet up, cutting his nails with a small switchblade. JESSE Someone is in my room. Unimpressed, he does not look up from his work. HANK What do you mean someone is in your room? JESSE I went to let myself in, and I heard someone. Hank takes her in. HANK Are you high? Jesse takes out her cell phone and starts to dial. HANK (CONT’D) What are you doing? JESSE I’m calling the police. HANK Whoa.   Relax, okay?  16.",
      "characters": [],
      "action_text": "He snaps the blade shut and whistles to the back room. MIKEY, a skinny, grungy biker kid appears. HANK (CONT’D) Mikey? MIKEY Yeah? HANK This lady has an unwanted guest. Mikey looks at both of them.   He picks up a baseball bat. EXT. JERRY’S MOTEL - NIGHT 26   26  The threesome climb the stairs.   Hank, following at the rear, looks at Jesse’s ass and grunts, impressed.   She turns around and he winks. EXT. MOTEL ROOM - NIGHT 27   27  Jesse struggles to make her key work in the lock.   Hank sighs impatiently. HANK Mikey, go get the spare.   Uh - JESSE Jesse. HANK (suggestively) Jesse and I will wait here. Mikey scrutinizes the door, makes a decision, and kicks it open. INT. MOTEL ROOM - NIGHT - CONTINUOUS 28   28  Hank shines his flashlight in the room, which we now see has been torn to pieces.   Jesse’s clothes are scattered everywhere. HANK What the fuck?   You’re going to have to pay for this. JESSE I didn’t do it.   It wasn’t me.  17. HANK Nice try, sweetheart.   We don’t foot the bill for your pissed off boyfriends. JESSE I’m telling you, it wasn’t me! Mikey, meanwhile, is investigating the room.   He shines a flashlight across the back wall, revealing that the window is open. He moves the light down and stops on a crouched figure.   It is a WILDCAT eating into the cheek of another dead animal on the floor.   The wildcat slowly glances up and stares into the light for a moment before returning to his meal. MIKEY There’s your visitor. INT. ELEVATOR - THE NEXT DAY 29   29  The SOUND OF A DING. Stainless steel elevator doors close on Jesse’s reflection. She grazes her fingers across her cheek, thinking about the wildcat from the night before. INT. OFFICE BUILDING HALLWAY - DAY 30   30  Jesse walks down a long, stark white hallway of doors. INT. CASTING WAITING ROOM - DAY - CONTINUOUS 31   31  She opens the door to a room crowded with plastic folding chairs.   FIFTY MODELS, all variations of the same girl, sit anxiously, quietly waiting.   Every head snaps to Jesse a",
      "dialogue_count": 0,
      "word_count": 2064
    },
    {
      "scene_number": 5,
      "slugline": "INT. ELEVATOR - DAY 38   38  Jesse scrambles to the elevator and slams her hand onto the button, leaving a streak of blood.   She looks toward the bathroom. INT. WOMEN’S RESTROOM - DAY 39   39  Sarah looks in the cracked mirror.   Her eyes are black.   Her mouth is covered in blood.   She looks like a monster. The anger begins to rise inside of her, and she sweeps her arms across the sink, sending shards of mirror whirling across the room. SARAH Jesse! INT. HALLWAY/ELEVATOR - DAY 40   40  We ZOOM quickly down the hall toward Jesse as she hears her name called out.   She presses the button over and over. Finally, the ELEVATOR DINGS.   She rushes on and hits the button for the ground floor. The doors close on Sarah who just misses the ride.   Jesse backs as far away as she can. EXT. TAXI - DUSK 41   41  A cloud of gray smoke coughs out of the taxi’s tailpipe. INT./EXT. TAXI/JERRY’S MOTEL - DUSK 42   42  Jesse pulls a few crumpled bills from her wallet and hands them to the TAXI DRIVER.   He notices blood on the money. She looks for something out the window. TAXI DRIVER Miss? HANK stands outside, an unlit cigarette in his mouth.   He struggles to make the plastic Bic lighter catch, gives up, throws it across the parking lot, and enters the office. TAXI DRIVER (CONT’D) Are you alright?  26.",
      "characters": [],
      "action_text": "She slides out of the taxi. EXT. JERRY’S MOTEL - DUSK 43   43  Jesse sprints up the outdoor stairs. EXT. MOTEL ROOM - DUSK 44   44  She struggles one-handed with the key and lock.   The doorjamb has been rigged with duct tape, making it stick. JESSE Come on. She looks over her shoulder and sees Hank step back out with a working lighter.   She slams her weight against the door. It budges slightly.   She tries again and the door swings open. Hank looks her way just as she slips inside. INT. MOTEL ROOM - DUSK 45   45  Jesse slams the door and does the chain.   She peeks behind the curtains to see if she was spotted. INT. MOTEL BATHROOM - DUSK 46   46  Jesse’s reflection in the medicine cabinet is deathly pale. She opens the cabinet and examines the meager contents: toothpaste, deodorant, a bottle of peroxide.   She grabs the peroxide and shuts the cabinet. She opens the bottle and pours a healthy amount over the wound on her hand, now caked in dried blood.   The wound bubbles up, and the pain is almost unbearable.   Jesse makes a sharp sound and sinks to the ground, clutching her hand to her chest. A KNOCK at the door. MALE VOICE (O.S.) Jesse? Still reeling in pain, she braces herself on the door frame with her good hand and stands, shaky on her feet.  27. INT./EXT. MOTEL ROOM - DUSK - CONTINUOUS 47   47  ANOTHER KNOCK. There is a deep purple bloodstain on the carpet from the wildcat.   Jesse stumbles a little, dizzy. She peeks out the window.   It is DEAN, shifting nervously. She opens the door and he presents a bouquet of red flowers. She takes them. JESSE Pretty. Dean peers into the motel room. DEAN What happened in here? She starts to lose her balance. DEAN (CONT’D) Jesse! He tries to catch her, but she falls to the floor, fainting. The flowers hit the ground and petals scatter everywhere. INT. MOTEL ROOM - DUSK - MOMENTS LATER 48   48  Jesse’s eyes blink open.   Dean is crouching over her.   He holds up a hand with five fingers spread wide apart. DEAN How many fin",
      "dialogue_count": 0,
      "word_count": 1334
    },
    {
      "scene_number": 6,
      "slugline": "INT. MOTEL ROOM - DUSK 51   51  We ZOOM in slowly on Jesse’s body, lying motionless on the bed.   She appears to be asleep until we see her eyes, open wide.   She stares at a patch of wall covered in deep gashes from the wildcat. IMAGES FLASH through her mind: The wildcat’s yellow eyes. The models looking her up and down. Sarah’s bloody mouth. Suddenly, Dean shoves the door open with some force and stumbles inside.   He carries a plastic sack from the drugstore. DEAN (re: the door) They’ll fix that soon. Jesse runs to him and wraps her arms around his waist. Surprised by this sudden gesture of intimacy, he runs a gentle hand through her hair, curling the soft waterfall of strands through his fingers. INT. MOTEL BATHROOM - DUSK 52   52  Jesse sits on the toilet seat, knees to her chest like a child.   Dean kneels beside her, picking a small shard of mirror from the cut with a pair of tweezers. She winces.   He hesitates. JESSE It doesn’t hurt. He dabs a damp piece of tissue around the wound, places a large Band-Aid over the cut, and wraps it tightly in an ace bandage. DEAN Best I can do. JESSE Thank you. DEAN You’re welcome. He thinks about kissing her, but instead starts to clean up.  34.",
      "characters": [],
      "action_text": "JESSE (sincere) I’m having a really good time. He looks up, smiles, completely charmed. DEAN Anything else need fixing? INT./EXT. JESSE’S BUICK/JERRY’S MOTEL - DUSK 53   53  The crunchy, metal SOUND OF A MOTOR attempting to rev to life. Dean tries to start Jesse’s car, a run-down Buick past its prime.   He has been working at it for some time, and sweat beads cover his brow. Jesse sits on the back bumper watching. Frustrated, Dean powers through one last attempt.   We see the motor of the car as it springs to life.   He slams the hood and wipes his greasy hands. Behind him, the sun sets in brilliant red and orange. INT. AGENCY OFFICE/HALLWAY - THE NEXT DAY 54   54  The relentless, high-pitched RING OF A TELEPHONE. Sitting rigid at a desk is JAN CAMPBELL-COOPER, a ferociously attractive thirty-something sporting a tight-lipped smile and a power suit with a plunging neckline.   Every word from her mouth drips with sing-song saccharine despite her dying patience. A framed magazine cover bearing a photo of Jan as a model in her earlier days hangs askew behind the desk. Jesse sits in a shabby upholstered chair, pulling at a loose thread as they wait in silence for the phone to desist. JAN Cara, sweetie, would you like to answer the phone today? Through the door, we see Jan’s twiggy, perky, blonde assistant CARA gabbing with the MAIL CLERK, unaware of the phone’s insistence.  35. JAN (CONT’D) (a little too harsh) CARA! Cara jumps.   She picks up the receiver. CARA Jan Campbell-Cooper’s Office.   Oh, hi, Brad! (whispering) It’s your ex-husband. Jan closes the office door with force. JAN Next time, remind me to hire someone with a hump or a skin disease. She sits on the corner of the desk.   Smiles again.   Poised. JAN (CONT’D) I want to talk about your future. JESSE Okay. JAN You’ve been getting a lot of attention lately. JESSE I have? JAN The [DESIGNER NAME] people called this morning.   They said you were absolutely perfect.   I’m not surprised. Jan sucks down half a can",
      "dialogue_count": 0,
      "word_count": 907
    },
    {
      "scene_number": 7,
      "slugline": "INT. AGENCY HALLWAY - DAY 55   55  Jan marches up to Cara. JAN I need a parental consent for a minor.   International. Cara rummages through her desk which is in total disarray. Jan looks over at three other HOPEFUL MODELS sitting in a row of chairs.   She shoots them a half smile.   She speaks to Cara through clenched teeth. JAN (CONT’D) I thought I told you to keep the others in reception. CARA I thought this would be better. JAN Oh, you thought it would be better. CARA (confused) That’s what I just said. Jan rips the paperwork out of Cara’s hand and storms back into the office. INT. AGENCY OFFICE - DAY - CONTINUOUS 56   56  Jan hands a stack of forms to Jesse. JAN Here we go. JESSE What’s this? JAN All we need is a signature giving parental consent.   Just one little signature, right there, and off you go. Jesse takes the papers, looking closely at the line reading ‘Parent or Guardian.” JAN (CONT’D) Is that a problem?  39.",
      "characters": [],
      "action_text": "Jesse shakes her head. JAN (CONT’D) Good.   Now, we need to work on your book before you go, so I’ve arranged for a test shoot.   It’s thirteen-hundred, which I know sounds astronomical, but again, we’ll cover it.   A small price to pay for all the work you’ll get later, right?   This guy is the best in the business.   Real Jackson- Pollock-meets-Marlon-Brando type. And his photos are good, too.   So my advice is... Don’t mess it up, honey. She hands Jesse a slip of paper with an address. JAN (CONT’D) You can meet him at one. INT. JACK’S STUDIO - DAY 57   57  Elevator doors close shut behind a frozen Jesse.   On the other side of the studio is JACK.   A silent moment passes between them.   Jesse is acutely aware that they are alone. JACK Come closer. Jesse walks to him. JACK (CONT’D) Take off your clothes. She looks around for a place to change.   The studio is modest, minimal, clean.   Brick walls and large windows. Various lighting instruments and a small desk in the corner. JACK (CONT’D) Something wrong? JESSE No. She tosses her bag on the ground and strips to her underwear. She stands tall, awaiting instruction. JACK All the way.  40. Jesse swallows hard.   She slips her underwear down her legs, brushing them to the side with a foot.   She unhooks her bra and drops it to the ground. He stares at her for a long time.   It is not sexual, rather the look of a sculptor sizing up an untouched ivory block. JACK (CONT’D) Pull your hair up and turn. She does. The idea comes to him.   He walks out of the room, and Jesse is left alone.   Shivering, she attempts to cover her body with her arms.   The rays of sunlight shooting through the window shine down on her like a spotlight. He returns carrying a large metal box and a bundled plastic tarp.   He stretches the tarp out in the corner of the room, smoothing every corner with great care and deliberation. He motions for Jesse to come. He opens the box and examines the contents, making his selection.   Curious, Jesse tries t",
      "dialogue_count": 0,
      "word_count": 3338
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MOTEL ROOM - NIGHT - CONTINUOUS 82   82  The feet stop in front of Jesse’s door. INT. MOTEL ROOM - NIGHT - CONTINUOUS 83   83  The door slowly opens.   The feet creep to Jesse’s bedside. Fingers rub greedily against sweaty palms.   We see that they belong to HANK.   He looks down on Jesse, sleeping quietly, his expression full of longing. He reaches into his pocket and pulls out the switchblade. Opens it.   He sticks the blade between her slightly open lips.   Between her teeth.   Down into the soft hollow of her mouth. Jesse wakes.   She sees the knife and freezes, fearful of slicing her tongue on the blade.   She locks eyes with HANK who is panting hard. HANK Wider. After a beat, Jesse opens her mouth wider. HANK (CONT’D) WIDER. She opens wider still, the skin of her mouth stretched taut at the corners.   He sticks the blade down into her throat. She begins to gag... INT. MOTEL ROOM - NIGHT - LATER 84   84  Jesse sits upright in bed.   She flips on the light and looks around the room for Hank, but she is alone.   She holds a hand to her mouth, realizing it was all a dream. INT. MOTEL BATHROOM - NIGHT 85   85  Cool water runs in the sink as Jesse splashes her face.   She has not removed her make-up, and it is smudged across her face. INT. MOTEL ROOM - NIGHT 86   86  Jesse lies back on the bed and curls into the fetal position. She picks up her phone from the nightstand and sees that she has two missed calls.   She ignores them, and clicks the light off again.  58.",
      "characters": [],
      "action_text": "While attempting to drift back to sleep, the SOUND OF FOOTSTEPS startles her.   A man’s shadow looms outside her window.   She rushes to do the chain-lock, backing into the dark corner.   She watches the shadow pass under her door to the neighboring room. Jesse puts an ear to the wall.   The faint whispers of a YOUNG GIRL’S VOICE, startled by the unexpected company.   Her eyes widen as the whispers become FEARFUL CRIES.   Some awful violence is taking place in the room next door. CUT TO: Behind the wall. Jesse is silhouetted as the CAMERA TRACKS BACKWARD creating a tunnel effect. INT./EXT. HILLS HOUSE - NIGHT - CONTINUOUS 87   87  RUBY opens the front door.   JESSE clutches a suitcase. RUBY You look terrible. INT. HILLS HOUSE SHOWER - NIGHT 88   88  Jesse stands naked in a hot shower, her face lifted to the showerhead.   Black makeup runs down her neck and chest. INT. HILLS HOUSE BATHROOM - NIGHT 89   89  Wrapped in a white towel, she draws the large outline of a heart with her finger on the foggy mirror in front of her. She stares at the heart before wiping it away, revealing her image. For the first time, we see her without any make-up or glamour.   She looks incredibly young, a girl of sixteen. INT. HILLS HOUSE GUEST BEDROOM - NIGHT 90   90  The room is luxurious, clean, comfortable - the complete opposite of Jerry’s Motel.   She towel-dries her hair as she walks around, examining things. A reflection appears in the window.   Jesse whips around, startled by Ruby standing in the doorway.   She attempts to cover her nude body with the towel. RUBY I brought you something. She holds up a small bottle.  59. JESSE What is it? She points to Jesse’s hand. RUBY Helps it heal. Jesse sits on the bed.   Ruby carefully unwinds the bandage and doctor’s her injured hand. RUBY (CONT’D) There. JESSE Thank you. Ruby looks down at her exposed body. RUBY You have such beautiful skin. Jesse swallows hard.   Ruby touches her ankle, up her leg, over her knee, to the inside of her thigh",
      "dialogue_count": 0,
      "word_count": 2056
    },
    {
      "scene_number": 9,
      "slugline": "EXT. HILLS HOUSE - NIGHT - CONTINUOUS 112   112  Jesse opens the front door and runs a few steps outside, but Sarah catches her.   She clamps a hand over Jesse’s mouth, dragging her back inside, ripping her bare feet on the hard concrete. INT. HILLS HOUSE ENTRYWAY - NIGHT - CONTINUOUS 113   113  Jesse grabs the door frame and struggles wildly.   Sarah slams the door and it closes hard on Jesse’s wounded hand.   Once. Twice.   Three times. Jesse cries out and finally releases the door, sinking to the ground and clutching her hand.   Sarah takes this moment to do the lock. Jesse crawls across the broken bottle and scrambles to her feet, barely getting away. She runs. INT. HILLS HOUSE LIVING ROOM - NIGHT - CONTINUOUS 114   114  We see Jesse’s reflection run through the room, Sarah’s in hot pursuit. INT. HILLS HOUSE STAIRWAY - NIGHT - CONTINUOUS 115   115  Jesse scrambles up the stairs.   She stumbles, and Sarah grabs her foot.   Jesse kicks her in the face.   Sarah’s nose drips with blood.   Jesse crawls away. INT. HILLS HOUSE HALLWAY - NIGHT - CONTINUOUS 116   116  Jesse runs down the hall and ducks into the first room she sees. INT. HILLS HOUSE CHILD’S ROOM - NIGHT - CONTINUOUS 117   117  Jesse shuts the door and flips off the lights.   She turns around.   The walls and ceiling are covered in glow-in-the- dark planets and constellations, a magnificent replica of outerspace.   Jesse is stopped in awe. She is brought back to earth when she hears FOOTSTEPS in the hall.   She ducks into the closet and shuts the door.  67.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 268
    },
    {
      "scene_number": 10,
      "slugline": "INT. HILLS HOUSE CLOSET - NIGHT - CONTINUOUS 118   118  Jesse pulls her knees to her chest and holds her breath. The sound of the DOOR OPENING.   Light pours in the crack under the closet door.   Jesse puts her own hand over her mouth to quiet her breathing. FEMALE VOICE (O.S.) (whispered) Jesse? Jesse backs farther into the closet and bumps into a child’s spaceship toy.   The toy lights up wildly, making ‘BLAST-OFF’ NOISES.   She panics. The closet door swings open.   It is RUBY. INT. HILLS HOUSE CHILD’S ROOM - NIGHT - CONTINUOUS 119   119  Jesse flies out of the closet and clings to Ruby.   Ruby puts a finger to her lips. RUBY (whispering) We’ll go out the back. She grabs Jesse’s hand and peeks out the door. INT. HILLS HOUSE HALLWAY - NIGHT - CONTINUOUS 120   120  Jesse and Ruby walk hand-in-hand toward the stairs. INT. HILLS HOUSE STAIRWAY - NIGHT - CONTINUOUS 121   121  The pair runs down quickly. INT. HILLS HOUSE BACK DOOR - NIGHT - CONTINUOUS 122   122  They make it to the back door, and Ruby opens it.   Jesse runs out ahead of her. EXT. POOL - NIGHT - CONTINUOUS 123   123  SARAH is standing motionless beside the pool holding a hand to her bloody nose.   Jesse quickly turns back to Ruby, who shuts the door firmly behind her.   Ruby looks down, refusing to meet her gaze.   Jesse’s eyes widen as she realizes that Ruby is part of whatever is going on.  68.",
      "characters": [],
      "action_text": "Jesse backs away from both of them.   GIGI steps out of the shadows behind her.   She pushes Jesse in the pool. TIME SLOWS as she falls. A CRUNCH as she hits the hard, cement bottom.   She grimaces in pain and grabs her now broken leg. We see Jesse from above, lying on her back, twisted in the rectangular grave. JESSE’S POV: The full moon shines bright in the sky above her. INT. HILLS HOUSE SHOWER - NIGHT - LATER 124   124  The sound of RUNNING WATER as a showerhead springs to life. Ruby, Sarah, and Gigi are naked in the shower, covered head to toe in blood.   They vigorously scrub their bodies, very focused.   Ruby washes her hands.   Sarah lets water run into her mouth.   Gigi pulls a thick substance from her hair. Thin, red water circles down the drain. INT. HILLS HOUSE BATHROOM - NIGHT 125   125  The three girls dry off, making little eye contact. Gigi wraps a white towel around her body.   In the foggy mirror, she sees the faint outline of a heart. She clutches her stomach, suddenly nauseated.   She falls to all fours and vomits.   A human eye is in the vomit.   It seems to look directly at her. Without missing a beat, Sarah picks up the eye and puts it in her mouth, popping it with her teeth. EXT. HILLS HOUSE - THE NEXT DAY 126   126  Sprinklers pop up in the front yard. EXT. POOL - DAY 127   127  The sound of a SQUEAKY SPIGOT turning. Water sprays through a garden hose across pretty red rose bushes lining the fence.   Ruby walks around the perimeter of the backyard watering the plants, her house-sitting duty.  69. When she is finished, she hesitantly walks to the edge of the pool and looks down into it.   We only see her face as she grimaces. She sprays the hose into the pool.   The SOUND OF WATER takes us to... INT. HILLS HOUSE KITCHEN - DAY 128   128  Ruby scrubbing her hands aggressively in the kitchen sink. She flips off the sink, examines them, turning them over. They are red, rubbed raw.   Satisfied, she dries them on a dishtowel. She frowns at the stov",
      "dialogue_count": 0,
      "word_count": 1462
    },
    {
      "scene_number": 11,
      "slugline": "INT. HILLS HOUSE DINING ROOM - DAY 131   131  Gigi is on her hands and knees scrubbing the dining room floor.   Her sponge is so blood-soaked that nothing is really being cleaned. Sarah rushes in. SARAH We have to go now. Gigi looks at Ruby’s body.   She starts to cry. SARAH (CONT’D) What? GIGI We can’t just leave her. SARAH Look at me.   The neighbors are bringing casserole.   I have to learn how to jump a car.   There’s no time to be sentimental! Sarah heads to the kitchen with the dish. Gigi looks around, helpless.   The room is in complete disarray and cleaning up suddenly seems like an impossible task.   She drops the sponge. INT. JESSE’S BUICK - DAY - CONTINUOUS 132   132  The RADIO BLASTS as Sarah speeds down the highway.   The car lighter pops out, red hot, and she lights a cigarette, nodding her head to the beat. INT. GIGI’S CAR - DAY - CONTINUOUS 133   133  Gigi drives in total silence, her hands at a perfect ten-and- two. INT. JESSE’S BUICK - DAY - CONTINUOUS 134   134  Sarah catches her reflection in the rearview mirror.   She turns the mirror away from her and CRANKS UP THE MUSIC. INT. GIGI’S CAR - DAY - CONTINUOUS 135   135  QUIET again as Gigi drives, tears in her eyes.  76.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 220
    },
    {
      "scene_number": 12,
      "slugline": "EXT. JESSE’S BUICK/MAGIC MOUNTAIN - DAY 136   136  The car zips by the rides and rollercoasters on its way to the amusement parking lot.   Gigi’s car follows behind. Sarah parks and gets out.   She throws the keys as far as she can and walks away from the car. INT. GIGI’S CAR - DAY 137   137  Gigi looks straight ahead as Sarah climbs in the passenger seat. EXT. GIGI’S CAR/JESSE’S BUICK - DAY 138   138  Gigi’s car drives out of frame, and we are left for a moment with the abandoned Buick. INT. GIGI’S CAR - DAY 139   139  Sarah and Gigi drive in silence for a long while. SARAH You okay? Gigi does not respond. SARAH (CONT’D) Wanna talk about it? No response.   Sarah resorts to an old tactic. SARAH (CONT’D) If you could be like anyone in the world - GIGI (interrupting) Grace Kelly. SARAH And why? GIGI (dreamy) Because she’s perfect. Gigi exhales deeply. SARAH Better?  77.",
      "characters": [],
      "action_text": "Gigi nods.   They drive on. INT. SARAH’S LIVING ROOM - DAY - LATER 140   140  We see a shadowy-gray rectangular shape on the wall behind the sofa where something used to hang. INT. SARAH’S KITCHEN - DAY - CONTINUOUS 141   141  Newspaper is duct-taped to the front of the stainless steel refrigerator. INT. SARAH’S BEDROOM - DAY - CONTINUOUS 142   142  A sheet hangs over the mirror attached to the chest-of- drawers.   A cracked, full-length mirror is stuffed behind the door.   A decorative, mirrored wall-hang lined with purses and scarves is scribbled-in with black marker. INT. SARAH’S BATHROOM - DAY - CONTINUOUS 143   143  We slowly ZOOM IN on Sarah through the bathroom door.   She is standing in front of the sink, carefully applying make-up: lining her eyes, powdering her nose, curling her lashes.   Her movements are robotic, as though she has done this routine a thousand times. She zips her make-up bag and exits the bathroom as we move inside.   We see that she has been standing in front of a blank wall, two round holes in the sheetrock where the mirror has been ripped out. EXT. MAKE-UP TENT - DAY 144   144  Gigi rushes to an outdoor tent set up as a make-up room.   She slips into a chair and the male MAKE-UP ARTIST begins doing her hair. MAKE-UP ARTIST You’re late. GIGI Did anyone see me come in? MAKE-UP ARTIST They’re all over there. He touches her hair.  78. MAKE-UP ARTIST (CONT’D) Did you wash this?   I told you not to do that. Gigi sees a group of people outside the tent.   A PHOTOGRAPHER gestures wildly with a camera and storms away. GIGI What’s going on? MAKE-UP ARTIST Some drama.   It’s supposed to rain, they’re gonna miss the light, Ruby didn’t show, blah blah...   Do you know where she is? GIGI Why would I? MAKE-UP ARTIST Just tell her she owes me for covering. Gigi touches her face in the mirror. GIGI Do I look different today? MAKE-UP ARTIST What is in your hair? He holds up a bloody lock of Gigi’s blonde hair. The wind whips the corner of the tent in a ",
      "dialogue_count": 0,
      "word_count": 1557
    },
    {
      "scene_number": 13,
      "slugline": "INT. STUDIO BATHROOM - DAY 158   158  Sarah bangs relentlessly on the bathroom door. She sees herself in the mirror and starts to panic.   She is trapped. SARAH Hello?   Can anyone hear me? INT. JACK’S STUDIO - DAY 159   159  The MUSIC continues to blast.   Jack sits at the computer, editing the photos of Jesse, unaware of Sarah’s cries. INT. STUDIO BATHROOM - DAY 160   160  Sarah claws at the door, desperate to be free. SARAH Someone let me out! She goes to the bathroom mirror.   She tries with all her might to pull it from the wall, but it will not budge.   She hits it with her fists, but it will not break. She looks fully at her reflection and screams hysterically. INT. DOCTOR’S WAITING ROOM - DAY 161   161  Gigi is damp and covered in sand.   Mascara is smeared beneath her eyes.   She is arguing with the RECEPTIONIST, a conversation which has gone on for some time. RECEPTIONIST I’ve already told you - GIGI Yes, but I’ve been waiting for an hour. RECEPTIONIST Like I said before, ma’am, you don’t have an appointment. GIGI (an insult) Are you new? RECEPTIONIST There’s no need for that tone.  85.",
      "characters": [],
      "action_text": "GIGI Please tell him I’m here. Gigi slumps back into a chair.   She puts her head in her hands. A woman exits through the door beside reception.   Gigi sees her chance and runs through it. RECEPTIONIST Excuse me!   Excuse me, what are you doing? INT. DOCTOR’S HALLWAY/PATIENT ROOM - DAY 162   162  Bright white doors to various patient rooms line the hallway. Gigi flings them all open, searching desperately for something. She opens the door to one room and a naked woman turns around.   Hideous black tick marks cover her body, prepped for surgery. Gigi back away.   She slams into a doctor in a handsome tie standing in the doorway.   It is DR. ANDREW, 43, charming, perfect smile.   The fluorescent light from the hallway shines down on him, and he looks like an angel. Gigi throws her arms around his waist.   He brushes some sand from her hair. DR. ANDREW Were you building a sandcastle? The Receptionist rounds the corner in hot pursuit. RECEPTIONIST I’m sorry - I tried to stop her. DR. ANDREW Annie - RECEPTIONIST (annoyed) It’s Anna. DR. ANDREW Anna, please find a room.   This is my best patient. Gigi beams at him.  86.",
      "dialogue_count": 0,
      "word_count": 397
    },
    {
      "scene_number": 14,
      "slugline": "INT. PATIENT ROOM - DUSK 163   163  The room is almost luxurious.   Gigi sits on a table in a robe while Dr. Andrew presses the skin around her nose. DR. ANDREW It’s healing nicely.   Looks good. Open up. Gigi opens her robe and Dr. Andrew feels her breasts.   For the first time we see small scars from her implants. DR. ANDREW (CONT’D) Does this hurt? Gigi shakes her head. DR. ANDREW (CONT’D) And I gave you a prescription for Vicodin, just in case? GIGI And Xanax. DR. ANDREW Turn for me. Gigi turns to the side. DR. ANDREW (CONT’D) Everything looks fine.   You’re good to go. He snaps off a pair of rubber gloves and tosses them in a big metal can. GIGI Please - I need you to do something. Dr. Andrew sighs. DR. ANDREW I told you, kiddo, four in one year is all I’ll do.   If you want to talk about a fifth this soon you’ll have to wait or go find somebody else, but I cannot give you my blessing.   Your body can’t go through that kind of trauma - GIGI I need you to take it out.  87.",
      "characters": [],
      "action_text": "DR. ANDREW Take what out? GIGI All of it. Gigi begins to cry.   Dr. Andrew pats her hand, gently.   He sits beside her and she melts into him. GIGI (CONT’D) I did something...   I think - I can feel it inside me.   I need you to take it out, okay?   Can you just - can you just take it out?   Please? Please?   I can’t go home.   I can’t leave until you do. DR. ANDREW Hey, hey.   It’s okay.   Look it isn’t uncommon.   After something like this.   You’ve put a foreign object into your body...   Plenty of women feel this way.   Plenty of women experience some sadness, discomfort, even depression...   We talked about all of this, remember? Gigi nods. DR. ANDREW (CONT’D) You’ll be fine.   If you want a mild anti-depressant call me and we can figure it out, okay? He starts to leave, but she clutches his hand so desperately that one of her nails breaks his skin. DR. ANDREW (CONT’D) Ow.   Jesus. He looks at her, frightened and concerned. DR. ANDREW (CONT’D) Wait right here.   Okay?   Don’t go anywhere. Dr. Andrew leaves.   Gigi gasps for breath, half smiles, simultaneously relieved and at a loss. She sees Dr. Andrew whispering to a NURSE in the hall.   The Nurse peers in the room, furrows her brow.  88. Gigi backs away from the door, realizing he is not going to help her.   She looks around the room, desperate.   What to do now? She sees her reflection in a metal cabinet, walks up to it. Touches it. GIGI (whispers) Jesse? Suddenly, the outrageously loud BEAT OF A HEART.   Gigi covers her ears, as though someone had blasted music through headphones. She stumbles around the room, throwing drawers open.   She spots something in one, reaches in... Dr. Andrew enters the room.   Gigi’s back is to him as he steps inside. DR. ANDREW Gigi?   Honey?   Someone is on their way over here to talk to you, okay? Help you out.   Okay?   Kiddo?   Can you hear me? Gigi turns to face him.   She is holding a scalpel. DR. ANDREW (CONT’D) What are you doing? Gigi slices across both of her breasts.",
      "dialogue_count": 0,
      "word_count": 650
    },
    {
      "scene_number": 15,
      "slugline": "INT. STUDIO BATHROOM - DAY - LATER 164   164  Sarah sits in the corner of the bathroom, knees pulled to her chest.   Her face is red and hot from crying, but now she is still, calm. A NOISE from the opposite side of the door draws her attention up.   The door opens, and light from the make-up room pours in. Jack appears in the doorway. JACK How long have you been in here? Sarah shrugs. He looks down at her, his expression pitiful.   He sits on the floor in front of her.   She smiles a little at this unexpected gesture of kindness. JACK (CONT’D) You have to stop this. SARAH Stop what? JACK This.   Coming around all the time. Showing up wherever I am. SARAH I thought you’d be happy to see me. She places a hand on his knee. He sighs.   He puts his hand on hers and pats it lovingly before removing it. SARAH (CONT’D) (confused) We slept together. JACK Three years ago. SARAH You make it sound like I’m crazy. JACK Well - Jack holds two fingers close together as if to say ‘just a little crazy.’  90.",
      "characters": [],
      "action_text": "Sarah smiles at this.   They share a small laugh.   Her laughter ceases as a wave of realization passes over her face. SARAH You’re never going to love me. He does not respond. SARAH (CONT’D) Are you? JACK Sarah - SARAH Why?   Why won’t you love me? He looks to the ground, does not respond. We ZOOM IN slowly on her face as she speaks. SARAH (CONT’D) (a realization) I thought I could make you love me. I thought - But it’s too hard.   All of it.   All of it.   Be young.   Be thin.   Be perfect.   It’s too hard. (pointed) You have no idea what I’ve done. All for you.   It was all for you. JACK (O.S.) What did you do? The camera stops.   Time seems to stand still. SARAH I ate a young virgin because I thought it would make me beautiful. Jack freezes, his mouth gaping.   For a minute he thinks she must be serious.   Then his mouth begins to curl into a smile. He starts to laugh. SARAH (CONT’D) I’m serious.   It’s not a joke. He laughs harder. JACK What’s with you today?  91. SARAH What do you mean? JACK I don’t know.   Something’s - SARAH What? JACK Different. He looks at her for a long time.   He smiles. JACK (CONT’D) Okay. He holds up one finger. JACK (CONT’D) One drink.   One. Sarah can hardly believe it.   She holds up one finger to match his. SARAH One. JACK Just one. SARAH I’ll meet you after work.   We can go wherever you want. JACK Okay. SARAH Just one, I swear. He starts to leave, changes his mind. JACK You do have beautiful eyes. He goes. Sarah is very still for a moment.   She tries to control her breathing, but she is overcome.   She holds a hand to her heart and closes her eyes.   Fat tears roll down her face. She weeps, convulsing, for a very long time.   Deep, sharp exhales.   Years of longing met in a moment.  92. She is suddenly still.   A look of disbelief crosses her face. Did she really get away with it?   Did it really work? She scrambles off the floor and looks into the mirror. Tentative at first, she wipes away the tears and takes a moment to truly ",
      "dialogue_count": 0,
      "word_count": 685
    }
  ]
}