{
  "slug": "the-martian-2015",
  "title": "the martian",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 25,
  "characters_count": 10,
  "characters": [
    "VOICE",
    "MARK",
    "MARTINEZ",
    "MINDY",
    "TEDDY",
    "VINCENT",
    "MITCH",
    "BECK",
    "LEWIS",
    "ANNIE"
  ],
  "total_words": 24686,
  "total_dialogue": 17,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SPACE - MARS - TO ESTABLISH  THE RED PLANET momentarily eclipses the Sun.   As sunlight  breaks across the edge, warming the surface...  EXT. MARS - DAY  We’re MOVING THROUGH the channels of Acidalia Planitia to  find the ARES 3 HAB SITE.  LEWIS (OVER RADIO)  All right, team.   Stay in sight of each  other.   Let’s make NASA proud...  TITLE:   SOL 18  EXT. MARS - DAY  CLOSE ON ASTRONAUT MARK WATNEY.   He’s in the middle of an EVA  experiment.   He chips at a section of rocks and records his  observations on his ARM COMPUTER.  Bright-eyed and optimistic.   Another day at the office.  MARK  In grid section fourteen twenty-eight,  the particles appear predominantly  “coarse,” but as we move to twenty-nine,  the particles are much finer, and should  be ideal for chem analysis.  VOICE (OVER RADIO)  Hear that, everyone?  And we FIND RICK MARTINEZ inspecting the MARS ASCENT VEHICLE  (a.k.a “The MAV”) on the launch pad.   They speak over radios.  MARTINEZ  Mark just discovered “dirt.”   Alert the  media.  MARK  What’s your job today, Martinez?  Confirming the MAV is still upright?  MARTINEZ  Visual inspection of equipment is  imperative to mission success.  Martinez studies the MAV for a moment, then speaks  thoughtfully into his arm computer:  MARTINEZ (CONT’D)  “The MAV is still upright.”  The Martian   Shooting Script   1.  (CONTINUED)",
      "characters": [
        "VOICE",
        "MARK",
        "MARTINEZ"
      ],
      "action_text": "LEWIS  Shut ‘em off.  Click.   Mark and Martinez’ radios go SILENT.  As Lewis works, we see Mark throwing up his arms in the  background, like “ Hey!   C’mon! ”  LEWIS (CONT’D)  I apologize for my countrymen, Vogel.  ALEX VOGEL wears the EUROPEAN UNION patch on his shoulder.  ALEX  Accepted.   How many samples do we need,  Commander?  LEWIS  Seven.   One hundred grams each.   Drill at  least thirty centimeters down.  While the two of them use a SPECIMEN DRILL to bore holes in  the ground, we see Mark waving his arms in the background:  C’mon, turn my radio back on...  INT. HAB - DAY  Johanssen frowns as she receives a MISSION UPDATE from  Houston.   Her face goes PALE...  JOHANSSEN  Um... Commander?   You should come  inside...  EXT. HAB - DAY  JOHANSSEN (OVER RADIO)  You’re gonna want to see this.  Lewis reads the tension in Johanssen’s voice.  LEWIS  What is it?  JOHANSSEN  We got a mission update.   Storm warning.  LEWIS  I saw the warning in the morning  briefing.   We’ll be inside long before it  hits.  The Martian   Shooting Script   3.  CONTINUED:  (CONTINUED) JOHANSSEN  They’ve upgraded their estimate.  (beat)  The storm’s gonna be worse.  LEWIS looks to the skies.   IN THE DISTANCE: a STORM darkens  the horizon.  Angle MARK: as the dirt in front of him starts to blow in the  incoming WIND...  INT. HAB - DAY  Lewis reads the update.   Everyone else is inside as well.  Mood is grim -- this is not good news.  LEWIS  “...twelve-hundred kilometers in  diameter, bearing 24.41 degrees...”  JOHANSSEN  That’s tracking right towards us.  LEWIS  “...based on current escalation, estimate  a force of...  (shit)  “Eighty-six hundred Newtons.”  MARK  What’s the Abort Force?  BECK  Seventy-five hundred.  MARTINEZ  Anything above that and the MAV could  tip.  VOGEL  We’re scrubbed?  LEWIS  (reading)  “Begin abort procedures.”  Everyone tries to hide their crushing disappointment.  MARTINEZ  Maybe it won’t be as bad as they say.  VOGEL  They’re estimating with a margin of  e",
      "dialogue_count": 3,
      "word_count": 1798
    },
    {
      "scene_number": 2,
      "slugline": "INT. MAV - CONTINUOUS - DAY  Martinez fights the controls.   Beck and Johanssen share  nervous glances.   Finally:  LEWIS (OVER RADIO)  Copy.   On my way.  JOHANSSEN  11.6... 11.5... holding at 11.5...  INT. MAV - AIRLOCK - CONTINUOUS - DAY  WHOOSH.   Down below, Lewis slams the airlock door shut.   She  tears off her suit.   Makes her way to the flight cabin.  She doesn’t say a word as she straps herself in to her couch.  For a moment, nobody speaks.   Then:  MARTINEZ  Still at pilot release.   Ready for  launch.  Lewis closes her eyes.   Nods.  MARTINEZ (CONT’D)  I’m sorry, Commander.   You need to  verbally --  LEWIS  Launch.  Martinez nods.   Activates the sequence.   The pyros FIRE.   The  main engines IGNITE...  CLOSE ON LEWIS.   Just as the MAV LURCHES UPWARD, we --  CUT TO:  INT. NASA - PRESS ROOM - DAY  THEODORE “TEDDY” SANDERS, Director of NASA, steels himself  before he steps to the podium.   Normally, he leaves these  briefings to his press secretary.  Today is different.   He opens a RED FOLDER.  TEDDY  At around 4:30 a.m., central standard  time, our satellites detected a storm  approaching the Ares 3 mission site on  Mars.  The Martian   Shooting Script   11.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "By 6:45, the storm had escalated to  “severe,” and we had no choice but to  abort the mission.   Thanks to the quick  action of Commander Lewis, astronauts  Beck, Johanssen, Martinez, and Vogel were  all able to reach the Mars Ascent Vehicle  and perform an emergency launch at 7:28  central time.  (then)  Unfortunately, during the evacuation,  Astronaut Mark Watney was struck by  debris and killed.   Commander Lewis and  the rest of her team were able to  intercept safely with the   Hermes   and are  now heading home...  (wavers, then)  But Mark Watney is dead.  As the CACOPHONY of questions erupts from the press --  EXT. MARS - DAY  Clear skies above the surface of Mars once again.   PRELAP the  sound of an ALARM:   ARRR... ARRR... ARRR...  A BODY lies facedown, half-covered in red sand at the base of  a hill.   We catch a glimpse of the nametag on the spacesuit:  “Watney.”  The OXYGEN ALARM inside the helmet continues to BLARE.   And  just as it builds to crescendo...  Mark Watney gasps for air.  He jerks back into consciousness.   He’s disoriented, alarms  BLARING inside his helmet.   As he struggles to move...  He screams in pain.   Glances down.   Sees:  A JAGGED LENGTH OF ANTENNA has pierced his spacesuit and  stabbed straight into his abdomen.   CAKED BLOOD all around  the wound.  Mark’s training kicks in --   the suit is breached   -- he  struggles to his knees -- gasping in pain -- he reaches to  the side of his helmet for the BREACH KIT -- pulls the valve  free -- grabs hold of the antenna... grits his teeth...  AND YANKS the antenna out of his side .   The antenna SNAPS  FREE -- the suit is exposed to atmosphere -- the pressure  inside DROPS -- Mark CRIES OUT, goes woozy --  But stays conscious.  The Martian   Shooting Script   12.  CONTINUED:   TEDDY (CONT'D)  (CONTINUED) He slams the breach kit over the hole.   Seals it.   Checks his  arm readout.   The oxygen stabilizes.   He’s still alive.  For now.  He struggles to his feet.   Picks up the length of ",
      "dialogue_count": 0,
      "word_count": 1343
    },
    {
      "scene_number": 3,
      "slugline": "INT. HAB - NIGHT  Mark sits in his bunk.   Drumming his fingers on the wall.  Thinking.  EXT. MARS - DAWN  The first slivers of sunlight start to creep over the  horizon.  TITLE:   Sol 21  INT. HAB - DAY  Mark flushes the toilet, which begins the procedure of vacuum-  drying the waste.   Mark glances back at the system.   Hmmm...  The system finishes its process, sealing the waste into --  A SILVER BAG.  Mark studies the bag.   Idea forming.  INT. HAB - DAY  Inventory.   Mark removes all of the ration packs, stacking  them in orderly piles as he catalogues their contents.   One  case in particular catches his attention.  Label: “DO NOT OPEN UNTIL THANKSGIVING.”  INT. HAB - DAWN  Mark sits in the darkness.   We get the sense he hasn’t moved  much in the night.   He stares into the middle distance.  Then.  He makes the decision.   Get up, Mark.   He gets to his feet.  Moves with purpose as he rummages through the hab.   Looking  for something.   Where is it?   There...  A pencil.  He pulls a notecard free from one of his manuals.   Paper.  Back to basics.   He sits at the table.   And begins writing  math equations.  MARK (PRELAP)  Let’s do the math...  CUT TO:  The Martian   Shooting Script   16.  (CONTINUED)",
      "characters": [],
      "action_text": "Mark addresses camera.   He looks a little less-terrible than  he did before.  MARK (CONT’D)  Our surface mission here was supposed to  take thirty-one days.   For redundancy,  they sent enough food to last for sixty-  eight days.   For six people.   So for just  me, it’ll last three-hundred days.   And I  figure I can stretch that to four hundred  if I ration.   So... I’ve still gotta  figure out how to grow three years worth  of food.   Here.   On a planet where  nothing grows.   Luckily, I’m the  botanist.  Mark holds up one of his mission briefs.   Points to the word  “Botanist” under “Watney.”   Looks at us like,   impressed?  MARK (CONT’D)  Mars will come to fear my botany powers.  EXT. HAB - DAY  Mark collects the pile of silver bags.   Carries them inside.  INT. HAB - DAY  Mark stands in the kitchen, surrounded by silver bags.   He  fills a large container with water from the Reclaimer.   He  dumps in the contents of the compost bin.  Then he stares at the bags.   He does not look happy.  He tears open a bag.   Dumps the contents into the bin.   Tears  open another bag.   As he does so, he starts to GAG --  TITLE:   Sol 24  EXT. MARS - HAB - DAY  Mark scoops Martian dirt into a container with a small  shovel.   He carries the container to the airlock --  INT. HAB - DAY  Mark enters the Hab, dumps his container of dirt into a  corner where he’s cleared an empty area.  TITLE:   Sol 25  The Martian   Shooting Script   17.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 463
    },
    {
      "scene_number": 4,
      "slugline": "INT. HAB - DAY  Same shot.   Mark enters with another container.   We follow to  reveal... there’s now a HUGE PILE of dirt in the corner.  TITLE:   Sol 28  INT. HAB - DAY  Mark has spread the dirt over a third of the Hab floor.   He  stares at the compost bin.   Eyes it like it’s his nemesis.  Then he takes a deep breath.   Opens the bin.   Begins dumping  it over the Martian dirt.  He can’t hold his breath forever.   He breathes eventually.  Oh god, that’s horrible.  TITLE:   Sol 31  INT. HAB - DAY  Mark cuts each potato into four quarters, making sure each  quarter has at least two eyes.  He begins planting each potato quarter in nice, orderly rows.  As he works, we slowly WIDEN OUT to reveal --  The ENTIRE HAB is now covered in SOIL.   Not just the floor --  Mark has cleared every available surface -- bunks,  countertops, table -- and covered it with his dirt.  INT. HAB - DAY  Mark packs soil on top of one of the crew member’s bunks.   As  he moves the personal items aside, he finds a DATA-STICK.   He  holds it up and looks at it:   hmmmm.   CUT TO:  Mark has plugged the data-stick into the computer and is now  viewing its contents: old episodes of seventies television.  Mark just sits there.   Watching HAPPY DAYS.  TITLE:   Sol 36  MARK (PRELAP)  The problem is water...  INT./EXT - ROVER - DAY  Mark trudges out to the Mars Descent Vehicle (MDV) -- the  lander that brought the six of them to Mars.   He delicately  begins to remove the Hydrazine tank from the undercarriage...  The Martian   Shooting Script   18.  (CONTINUED)",
      "characters": [
        "MARK",
        "MINDY",
        "TEDDY"
      ],
      "action_text": "Mark just stares at the camera.   Then continues.  MARK (CONT’D)  Believe it or not, the challenge has been  finding something that will hold a flame.  NASA hates fire.   Because of the whole  “fire makes everyone die in space” thing.  So everything we brought with us is flame  retardant.   With the notable exception  of... Martinez’ personal items.  He holds up Martinez’ pack.   Removes a small wooden cross.  MARK (CONT’D)  Sorry, Martinez.   If you didn’t want me  to go through your stuff, you shouldn’t  have left me for dead on a desolate  planet.  He starts shaving the cross down with a knife.  MARK (CONT’D)  I figure God won’t mind, considering the  situation.  INT. HAB - DAY  Mark’s still at it.   He looks exhausted.   He goes through the  procedure once again.   Glances at the atmospheric analyzer.  Hm.   Is that right?   Doesn’t give it a second thought.  He strikes the torch again...  BOOM!  The explosion is LOUD, FAST, and CONTAINED.   It blasts Mark  clear across the room.   He hits the ground like a wet rag.  INT. HAB - DAY  Mark talks to camera.   His clothes are somewhat scorched.  His hair is singed in patches.  MARK  So.   Yes.   I blew myself up.  (then)  Best guess?   I forgot to account for the  excess oxygen I’ve been exhaling when I  did my calculations.   Because I’m stupid.  He’s still dazed.   A little out of it.  The Martian   Shooting Script   20.  CONTINUED:  (CONTINUED) Mark sleeps -- Mark puts on his spacesuit -- Mark exits the  Hab -- Mark brings in more dirt -- Mark vents Hydrazine --  Mark eats -- Mark sleeps --  While the days FLY BY, we’re slowly ANGLING towards the back  of the room...  -- Mark works Mark eats Mark sleeps Mark works --  Towards a small patch of SOIL in the corner.   We land in  CLOSEUP: soil filling the frame.   We HOLD.  And after a beat...  A single, green SPROUT breaks through the soil .  TITLE:   Sol 54  CUT TO BLACK.  EXT. SPACE  And FROM BLACK, we FIND EARTH.   The calming blue-greens a  welcome reprieve from",
      "dialogue_count": 5,
      "word_count": 4192
    },
    {
      "scene_number": 5,
      "slugline": "INT. HAB - NIGHT  The Hab has been TRANSFORMED into a makeshift GREENHOUSE.  Plants sprout everywhere.   Mark uproots some of the potatoes,  cuts them in pieces.   Replants them.  TITLE:   Sol 79  MARK (V.O.)  It’s been 48 sols since I planted the  potatoes, so now its time to reap and re-  sow.   They grew even better than I  expected.   I now have 400 healthy potato  plants.   The smaller ones I’ll re-seed.  The larger ones are my food supply.   All  natural, organic, Martian-grown potatoes.  You don’t hear that every day, do you?  (then)  But, by the way, none of this matters, at  all, if I don’t figure out how to make  contact with NASA...  INT. HAB - NIGHT  Back to work.   Mark sits at the table, studies his maps.   He  can’t crack the problem.   C’mon, Mark, think...  Then it hits him.   He zooms in on the map.   We catch a  glimpse of two words: “Chryse Planitia.”   Mark leaps from his  chair.   Studies the map up close.  He nods.   Whispers to himself.   Okay...  MARK  I know what I’m gonna do.  INT. NASA - MISSION CONTROL - NIGHT  SATELLITE VIEW: Mark’s Rover 2 cuts through Mars.  MINDY  He’s on the move again --  Vincent huddles over Mindy’s screen.  VINCENT  Where the hell is he going?   He hasn’t  changed course in thirteen days.   And  he’s nowhere near course for Ares 4...  MINDY  Unless he’s not taking a direct route.  Maybe he’s trying to avoid some  obstacle...  The Martian   Shooting Script   36.  (CONTINUED)",
      "characters": [],
      "action_text": "VINCENT  What obstacle?   It’s Acidalia Planitia.  There’s nothing out there but --  Vincent stops short.   Mindy looks at him: what?  VINCENT (CONT’D)  I need a map.  Vincent bolts away.   Mindy follows.  INT. NASA - BREAKROOM - NIGHT  Vincent hurries into the employee break room.   A lone  TECHNICIAN sits, sipping coffee.   ON THE BACK WALL: a large  poster of Mars (the type they sell in gift shops.)  Vincent rips the poster off the wall.  TECHNICIAN  Hey -- c’mon --  VINCENT  I’ll buy you a new one.  (to Mindy)  What’s the Hab’s location?  MINDY  31.2 degrees north, 28.5 degrees west.  Vincent marks it off on the map with a sharpie.   Draws Mark’s  location.   He needs a ruler.   Looks around, grabs the  Technician’s notebook out of his hands.   Uses the spine to  connect the dots.   Studies it.   Grins.  VINCENT  I know where he’s going.  Vincent, lost in his own world now, bolts for his office.   As  he hurries away (leaving Mindy and the Technician behind):  VINCENT (CONT’D)  I need to get on an airplane!  TECHNICIAN  Who’s he talking to?  MINDY  I’m honestly not sure.  EXT. MARS - DAY  Mark’s Rover 2 crests a hill, approaching HIS DESTINATION:  The Martian   Shooting Script   37.  CONTINUED:  (CONTINUED) There , buried in a mound of Martian sand, we catch a glint of  metal in the sunlight.  As Mark drives towards it...  INT. JPL LOBBY - DAY  Bruce waits in the lobby as Vincent walks through the front  doors.  TITLE: Jet Propulsion Laboratory, Pasadena, California  They shake hands.  INT/EXT. JPL STORAGE - DAY  Bruce and Vincent hurry across the JPL campus.   In the  background, deer frolic.   (NOTE: This is real.   Deer frolic  out in the open on the JPL grounds.   NOTE: It’s awesome.)  VINCENT  What are the odds Mark can get it working  again?  BRUCE  Hard to say.   We lost contact in ‘97.   We  think it was battery failure.  (then)  Though I’d like to point out it lasted  three times longer than expected in any  scenario.  VINCENT  Nobody’s criticizing JPL’",
      "dialogue_count": 0,
      "word_count": 867
    },
    {
      "scene_number": 6,
      "slugline": "INT. JPL GARAGE - DAY  Vincent, Bruce, and the JPL team see the words come up on the  main screen.   The room begins to BUZZ...  EXT. HAB - DAY  Mark stares at the high gain antenna on the Lander.   It  starts to MOVE... angling towards Earth.  Mark begins to dance.  INT. JPL GARAGE - DAY  Vincent and Bruce cluster around the station of TIM GRIMES.  TIM  As soon as I received the high-gain  response, I directed Pathfinder to take a  panoramic image.  VINCENT  Have you received it yet?  TIM  Yes, but I thought we would all rather  look at this black screen instead of a  vibrant red planet.  BRUCE  (off Vincent’s look)  Tim is our finest comm tech, and we all  appreciate his acerbic wit.  Bruce mouths “I will fire you” to Tim.  TIM  Incoming.  ON THE SCREENS: the panoramic starts to appear, one vertical  stripe at a time.  VINCENT  Martian surface... more surface...  BRUCE  There’s the Hab!  VINCENT  What’s that?  The image reveals a handwritten note, posted on a metal rod.  The Martian   Shooting Script   40.  (CONTINUED)",
      "characters": [
        "VINCENT",
        "MARK"
      ],
      "action_text": "Mark waits patiently at the computer.  Text pops up on Mark’s screen.   As he reads:  VENKAT (V.O.)  “Mark, this is Vincent Kapoor...  INT. JPL - GARAGE - NIGHT  Vincent and Bruce huddle around Tim’s console while Vincent  dictates and Tim types.  VINCENT  We’ve been watching you since Sol 54...  INT. NASA - MISSION CONTROL - NIGHT  Teddy, Mitch, Annie, and the rest of the team watch Vincent’s  text cross the screen.  VINCENT (V.O.)  “The whole world is rooting for you.  Amazing job, getting Pathfinder. We’re  working on rescue plans.   Meantime...”  INT. ROVER - NIGHT  Mark reads the text.   His first human contact in quite some  time.  VINCENT (V.O.)  “We’re putting together a supply mission  to keep you fed until Ares 4 arrives.”  INT. JPL GARAGE - NIGHT  Vincent and Bruce huddle around Tim’s console.  TIM  (reading)  “Glad to hear it.   Really looking forward  to not dying.”  Everyone laughs, cheers.   Tim notices   there’s more...  TIM (CONT’D)  “How’s the crew?   What did they say when  they found out I was alive?”  Vincent and Bruce share a glance.   Vincent thinks about it.  BRUCE  Tell him.   Hm.   Tell him...  The Martian   Shooting Script   43.  CONTINUED:",
      "dialogue_count": 2,
      "word_count": 789
    },
    {
      "scene_number": 7,
      "slugline": "INT. ROVER - NIGHT  Mark watches the text pop up onscreen:  VINCENT (V.O.)  “We haven’t told the crew you’re alive  yet.   We need them to concentrate on the  mission.”  INT. JPL GARAGE - NIGHT  The whole room waits patiently.   Tim reads the response.  TIM  He says... “They don’t know I’m alive?  What the--”  (hesitates)  “What the... f-word... f-word in gerund  form... f-word again... is wrong with  you... f-words.”  VINCENT  Mark, please watch your language...  INT. ROVER - NIGHT  Mark reads the response.  VINCENT (V.O.)  Everything you type is being broadcast  live all over the world.  Mark’s eyes narrow as he types his response.   Hits ENTER.  INT. JPL GARAGE - NIGHT  The group reads Mark’s response.   They go PALE.   Oh, Jesus.  Vincent hangs his head.   Tim tries not to smile and fails.  INT. NASA - TEDDY’S OFFICE - NIGHT  Teddy is on the phone as Mitch approaches.  TEDDY (INTO PHONE)  Yes sir... he’s under a tremendous amount  of stress... I understand.   We’re working  on it.   Thank you, sir.  Teddy hangs up.   Glances at Mitch.  TEDDY (CONT’D)  I just had to explain to the President of  the United States what a “bureaucratic  felcher” is.  The Martian   Shooting Script   44.  (CONTINUED)",
      "characters": [],
      "action_text": "MITCH  I made the mistake of typing it into  Google.  (off Teddy’s look)  Don’t.  (then)  Problem is, Mark’s right.   This is only  gonna get worse the longer we wait.   We  need to tell the crew.  TEDDY  You’re bringing this up while Vincent’s  in Pasadena so he can’t argue the other  side.  MITCH  I shouldn’t have to clear this with you  or Vincent or anyone else.  (then)  It’s time, Teddy.  Teddy thinks about it.  EXT. HERMES - PRESENT - SPACE  THE HERMES: the massive spacecraft makes its way through  space on its long journey back to Earth.  TITLE: Four Months Since Mars Departure  We ANGLE towards one of the windows to FIND COMMANDER LEWIS  staring out at the starfield...  JOHANSSEN (O.S.)  Commander Lewis...  INT. HERMES - FLIGHT DECK - SPACE  Lewis is alone, in a secluded section of the ship.   She keys  the console.  LEWIS  Go ahead.  JOHANSSEN (OVER RADIO)  Data dump is almost complete.  LEWIS  Copy.   Coming to you.  INT. HERMES - CORRIDOR - SPACE  Lewis floats towards the Semicone-A ladder.   MARTINEZ beats  her there.   As he floats up the ladder...  The Martian   Shooting Script   45.  CONTINUED:  (CONTINUED) LEWIS  You’re in a hurry.  MARTINEZ  My son turned three yesterday.   Should be  some pics of the party.  As they make their way down the ladder, the centripetal force  from the rotating craft creates artificial gravity.   Halfway  down, they have to use their hands on the ladder...  INT. HERMES - REC ROOM - SPACE  Lewis and Martinez enter the Rec Room.   The others are  already there -- the data dump is the highlight of the day.  JOHANSSEN  All right, we’ve got a batch of  personals.   Dispatching them to your  laptops... I don’t need to read Vogel’s  weird German fetish emails...  VOGEL  They are telemetry updates.  JOHANSSEN  Whatever does it for you.   We’ve got a  system update, I’ll take care of that,  and... huh.   There’s a voice message.  Addressed to the whole crew.  LEWIS  (shrugs)  Play it.  Johanssen opens the message.   Hits play.  MI",
      "dialogue_count": 0,
      "word_count": 1056
    },
    {
      "scene_number": 8,
      "slugline": "EXT. HAB - DAY  -- Mark stands outside in his suit.   Positions himself in  front of the camera.   Holds up a notecard.   We’re behind him,  we don’t see what the notecard says.   As he poses --  CUT TO:  INT. NASA - CONFERENCE ROOM - DAY  Annie tosses a photo on the conference room table:  Mark, in his spacesuit, gives the camera a big thumbs-up.   He  holds up a note that says, “Ayyyyyyy!”  ANNIE  I ask for a picture and I get the goddamn  Fonz?  Vincent and Bruce are both on monitors from JPL.  VINCENT (ONSCREEN)  Just be grateful you got something,  Annie.  ANNIE  It’s not gonna work.   I need something  with less-Happy-Days and more... Mark’s  face.  VINCENT (ONSCREEN)  I could tell him to take his helmet off,  but then he’d, you know, die.  TEDDY  Let’s release the photo when we detail  the rescue operation.   I want to announce  we’re launching some supplies to him next  year during the Hohmann Transfer window.  VINCENT (ONSCREEN)  I’m on a plane to you this afternoon.  We’ll have the release ready.  TEDDY  Good, but Annie will handle camera  appearances.  Vincent gives a look that says “Et tu, Teddy?”  TEDDY (CONT’D)  Bruce, is your team still on schedule?  The Martian   Shooting Script   49.  (CONTINUED)",
      "characters": [],
      "action_text": "BRUCE (ONSCREEN)  It’ll be tight.   But we’ll make it.  TEDDY  Nine-month travel time, that puts the  probe to Mars on Sol 868.   Did we get the  Botany Team’s analysis?  VINCENT (ONSCREEN)  They estimate Mark’s crops will last him  until Sol 912.   They grudgingly admit  Mark is doing great work.  MITCH  Grudgingly?  VINCENT (ONSCREEN)  Mark has a tendency to tell them to have  sex with themselves whenever they  question one of his decisions.  TEDDY  Get him in line, Vincent.   We can’t  afford any miscommunication.   I hate this  margin.   912 sols worth of food.   We get  there on 868.   And that’s assuming  nothing goes wrong...  EXT/ INT. HAB AIRLOCK - DUSK  Mark finishes putting on his spacesuit.   Snaps his helmet  into place.   Grabs his toolkit.  Mark steps into the airlock.   Closes the door behind him.   As  he does, we begin ANGLING towards the carbon-thread canvas  lining the side of the airlock.  As the depressurization process begins, the canvas starts to  STRETCH...  And the sheet RIPS.  The Hab   breaches .   In one-tenth of a second,   the tear travels  the length of the airlock   --  The full force of the Hab’s atmosphere rushes through the  breach...  KAAAA-BOOOOM!  The airlock (with Mark in it) is LAUNCHED LIKE A CANNONBALL.  It flies forty meters through the air --  The Martian   Shooting Script   50.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 427
    },
    {
      "scene_number": 9,
      "slugline": "INT. HAB - DUSK  QUICK SLO-MO SHOT as the crops inside the HAB are DESTROYED  in the depressurization.  INT/EXT. AIRLOCK - DUSK  RAMP to regular speed --  WHAM!   The airlock hits the hillside -- Mark’s body SLAMS  into the wall -- his faceplate SHATTERS -- the airlock FLIPS  and TUMBLES down the hill.   Mark is tossed around inside like  a ragdoll in a washing machine.  The airlock rolls another fifteen meters...  And comes to a stop.  INT. AIRLOCK - DUSK  Panicked breaths.   Ringing ears.  Mark struggles to stay conscious.   His head bleeding.   Jesus  Christ.   What just happened?  He looks through the window.   Sees the collapsed Hab.   The  debris of ruined equipment scattering the field between them.  Psssssshhhhhhhh...  Mark wipes the blood from his brow, rolls to his knees.  Struggles out of his suit.   Checks his wounds.   He’s alive.  Psssssshhhhhhhh...  What the hell is that sound?  Air.  The airlock is leaking.  Mark’s heart starts to pound.   He searches frantically for  the leak, checking every seam, every inch of fabric...  Psssssshhhhhhhh...  Mark checks his arm computer.   Oxygen flow steady.   This will  keep him alive.   For now.   But he has to find that leak ...  Think, Watney.   How do you find an invisible leak?  He does an inventory.   He has his toolkit.   He has the patch  kit from his suit.   Think, Watney...  The Martian   Shooting Script   51.  (CONTINUED)",
      "characters": [],
      "action_text": "It hits him.  He pulls the knife out of the toolkit...  And cuts his own hair.  He hacks a chunk clean out of it.   Holds the loose hair  tight.   Then he goes back to the arm computer.   BOOSTS the  oxygen flow.   Now, all I need is a spark...  Yanks the WIRES from the power generator free.   Strips the  casing.   Here goes nothing...  He holds the wires in the oxygen flow, rubs them together to  create a SPARK.   WHOOSH.   He lights the hair on fire,  creating the key to his plan:  SMOKE.  Mark holds his breath.   Watches the smoke wisp and curl  towards the floor...  Heading right through the microscopic TEAR in the fabric.  Mark grins.   I’ve got you.   Goes back to the toolkit.   Finds  that old stalwart of every NASA space mission:   Duct tape.  He tears a piece free.   Seals the hole.   The hissing stops.  Mark breathes.   Okay...  Now what?  CUT TO:  Mark cuts off one of the arms from his EVA suit.   Cuts it  into one square piece.   Opens the patch kit.   Works fast to  glue the square over the area where the faceplate used to be.  Then glues the arm-hole shut.  CUT TO:  WHAM!   Mark slams his back into the airlock wall, hitting it  with enough force so that...  The airlock ROLLS.  It’s clumsy -- like rolling a phone booth from inside -- but  it works.   The airlock rolls a little less than a meter.  Mark takes a breath.   Girds himself to do it again...  The Martian   Shooting Script   52.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 479
    },
    {
      "scene_number": 10,
      "slugline": "INT/EXT. AIRLOCK/HAB - NIGHT  The airlock has traveled the fifty meters so that it’s now  close to the Hab.  Mark exits the airlock.   He’s wearing the patched-up suit.  Which means his faceplate is completely covered with fabric,  and he only has one arm free.  He points the free arm in front of him and begins to walk.  INSIDE THE SUIT:  Mark is using the camera in his arm computer to navigate.  The camera projects an image onto the inside of the  faceplate.   Which is now fabric.   It’s crude, but it’ll work.  MARK’S POV: Mark hurries through the rip in the airlock.  Stumbles through the deflated Hab, past the mess of debris,  heading for the bunk.   Finds what he’s looking for...  Martinez’ SUIT.  INT. HAB - NIGHT  Mark stands in the center of the Hab.   We finally get a good  look at it.   And it’s A MESS.   Equipment overturned, debris  everywhere.   But the worst part?  Mark’s crops are RUINED.  Mark stares at the disaster of frozen soil and uprooted  plants.   All his work.   His   lifeline .   Destroyed.  He stares at the mess for a long time.  Then he begins to clean it up.  INT. ROVER - NIGHT  Mark sits at the keypad.   Takes a moment to compose his  words.   God, how do I explain this?   As he begins to type...  VINCENT (PRELAP)  The crops are dead...  INT. NASA - CONFERENCE ROOM - NIGHT  Vincent, Teddy, Annie and a team of others study the analysis  reports.   Mood is somber.  VINCENT  Complete loss of pressure boiled off most  of the water.  The Martian   Shooting Script   53.  (MORE)   (CONTINUED)",
      "characters": [],
      "action_text": "Any bacteria that survived, died in the  sub-zero temperatures when exposed to  Mars’ atmosphere.  ANNIE  How long does he have?  VINCENT  He can still eat the potatoes he has, he  just can’t grow any more.   We estimate  they’ll give him about 200 sols.  TEDDY  And rations get him to what?   Sol 409?  VINCENT  (nods)  So with potatoes he can stretch to 609.  ANNIE  By Sol 868 he’ll be long dead.  TEDDY  We’re gonna have to launch as soon as  possible.   Which changes our travel time.  MITCH  We’re working on it.   Prelim estimates  call for a four-hundred fourteen day  trip.  TEDDY  (does math)  It’s Sol 135 now.   We need thirteen days  to mount the boosters and perform  inspections.   Which gives Bruce and his  team...  (fuck)  Forty-seven days to make this probe.  ANNIE  How long does it normally take?  VINCENT  Six months.   Minimum.  TEDDY  I’m gonna let you call Bruce and give him  the news.  INT. JPL BULLPEN - NIGHT  Bruce and his team sit around a speakerphone.   They’ve just  hung up with Vincent.   Everyone looks suitably SHELLSHOCKED.  The Martian   Shooting Script   54.  CONTINUED:   VINCENT (CONT'D)  (CONTINUED) BRUCE  Okay.  (long pause)  Okay.  Everyone is at a loss for words.   You might as well have told  this team they have to build a unicorn.  BRUCE (CONT’D)  I’m, uh... I’m gonna need a change of  clothes.   We’re all gonna need a change  of clothes.  EXT. HERMES - SPACE  The Hermes continues on its course back to Earth.  TITLE:   Sol 136  MARTINEZ (PRELAP)  “Dear Mark...”  INT. HERMES REC ROOM - SPACE  Martinez types at his terminal.  MARTINEZ (V.O.)  “Apparently, NASA’s letting us talk to  you now, and I drew the short straw.  Sorry we left you behind on Mars, but we  don’t like you.”  INT. ROVER - NIGHT  Mark reads his email.  MARTINEZ (V.O.)  “Also, it’s a lot roomier on the   Hermes  without you.   We have to take turns doing  your tasks, but it’s only botany (not  real science.)   How’s Mars?”  Mark types his response.  MARK (V.O.)  “Dear M",
      "dialogue_count": 0,
      "word_count": 1046
    },
    {
      "scene_number": 11,
      "slugline": "INT. NASA - MISSION CONTROL - DAY  Vincent dictates a message to Mark.   Mindy types while he  talks.  VINCENT  “...the probe will take 414 days to reach  you, and will deliver enough food to last  you to Ares 4.”  MINDY  Tell him about the name.  VINCENT  “We’ve officially named the probe  ‘Iris’...”  INT. ROVER - DAY  Mark reads the message in the Rover.  VINCENT (V.O.)  “After the Greek goddess who traveled the  heavens with the speed of wind.   Among  other things, she’s also the goddess of  rainbows.”  Mark types his response...  INT. NASA - MISSION CONTROL - DAY  Mindy reads Mark’s response on his screen as Vincent waits.  Mindy suppresses a smile, throws it up on the main screens:  “Gay probe coming to save me.   Got it.”  INT. NASA - CONFERENCE ROOM - DAY  Teddy addresses the group from the head of the table.  TEDDY  Okay, let’s ask the...  (consults his files)  Two hundred million dollar... sorry, five  hundred... That’s a “five?”  (off their looks)  Let’s ask the very, very expensive  question: is this probe gonna be ready on  time?  Bruce looks noticeably more exhausted than everyone else.  BRUCE  We’re behind.  The Martian   Shooting Script   58.  (CONTINUED)",
      "characters": [],
      "action_text": "TEDDY  Give me a number.  BRUCE  Fifteen days.   If I had another fifteen  days, I could get it done.  TEDDY  All right, let’s create fifteen days.  Thirteen days to mount the probe.   Can we  reduce?  VINCENT  It... actually only takes three days to  mount it.   We can get that down to two.  But the other ten are for testing and  inspections.  TEDDY  How often do those inspections reveal a  problem?  The room goes silent.   Everyone trades nervous glances.  MITCH  Are you suggesting we don’t do the  inspections?  TEDDY  Right now I’m asking how often they  reveal a problem.  VINCENT  About one in twenty launches.   But that’s  grounds for a countdown halt.   We can’t  take that chance.  TEDDY  Anyone else know a safer way to buy more  time?  Nobody does.  TEDDY (CONT’D)  Tell Dr. Keller to stretch Watney’s  rations four more days.   She won’t like  it, but that’ll get us to fifteen.   And  we’ll cancel the inspections.  VINCENT  Teddy...  The Martian   Shooting Script   59.  CONTINUED:  (CONTINUED) TEDDY  It’s on me, Vincent.  (to Bruce)  You’ve got your two weeks.   Get it done.  INT. HAB - DAY  Mark sits at the table.   A ration pack and two potatoes in  front of him.   He talks to camera.   He looks depressed.  TITLE:   Sol 154  MARK  So.   I have to hold out until the probe  gets here with more food.   And this is  what “minimal calorie count” looks like.  (holds up the pack)  Standard issue ration.   But instead of  three every one day, I’m now eating one  every three days.  (opens pack)  Oh good.   Meatloaf.  He divides the meatloaf into thirds.   Sets the majority  aside.   Focuses on what’s left.   Which is pathetic.  MARK (CONT’D)  This is today’s allotment.   Which I will  supplement with potatoes.   Which I am  beginning to hate with the fiery passion  of a thousand suns.   And now I’ve been  told to do this.  Mark hacks off even more of the meager ration and half of a  potato and sets   that   aside.   There’s barely anything left.  MARK (CONT’D)  The p",
      "dialogue_count": 0,
      "word_count": 609
    },
    {
      "scene_number": 12,
      "slugline": "INT. NASA - MISSION CONTROL - DAY  Full house.   Mitch presides over the room, in his element.  MITCH  Do you believe in God, Vincent?  VINCENT  Several.   My mother’s Catholic and my  father’s Hindu.  MITCH  We’ll take all the help we can get.  Mitch puts on his headset.  MITCH (CONT’D)  This is the Flight Director.   Begin  Launch Status Check.  LAUNCH CONTROL (OVER COMMS)  Roger that, Houston...  And as Mitch runs through the status check...  INT. NASA - MISSION CONTROL - DAY  Teddy watches the countdown clock from the observation room.  He looks over what appears to be a SPEECH.   We catch a few  words, including, “ ...successful launch... ”  Teddy closes the speech in a BLUE FOLDER.   As the clock  approaches 00:00:15....  MITCH (ON THE FLOOR)  This is Flight.   We are go for launch on  schedule.  TIMER CONTROLLER (V.O.)  10...9...  ON THE FLOOR: Vincent leans against the wall.   Deep breath.  TIMER CONTROLLER (V.O.)  8...  INT. NASA - MISSION CONTROL - DAY  ANNIE paces in front of the NINE TELEVISIONS in her office.  TIMER CONTROLLER (V.O.)  7...6...  The Martian   Shooting Script   61.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 181
    },
    {
      "scene_number": 13,
      "slugline": "INT. JPL -   CONTROL ROOM - DAY  BRUCE sits with his engineers, all in rapt attention.  TIMER CONTROLLER (V.O.)  5...4...  INT. JPL - RICH’S OFFICE - DAY  RICH PURNELL works on orbital calculations at his computer.  Isn’t paying attention to the launch at all.  TIMER CONTROLLER (V.O.)  3... 2...  EXT. CAPE CANAVERAL LAUNCHPAD - DAY  TIMER CONTROLLER (V.O.)  1...  LIFTOFF.   Clamps RELEASE, the booster FIRES --  INT. NASA - MISSION CONTROL - DAY  TIMER CONTROLLER (V.O.)  ...and liftoff of the Iris Supply Probe.  CHEERS course through the room.  While team members congratulate one another, the LAUNCHER  INTERFACE frowns at his station.  LAUNCHER INTERFACE  Getting a little shimmy, Flight.  MITCH  Say again?  INT. HULL - DAY  A VIOLENT SHIMMY rattles the payload as the craft  ACCELERATES.   The bolt at the forefront CRACKS --  EXT. IRIS CRAFT - DAY  As the first stage depletes its fuel, it JETTISONS the stage-  clamps.   As the stage begins to fall away from the shimmying  craft, it CATCHES HOLD, swinging unnaturally to the side.  The second stage engines IGNITE --  The Martian   Shooting Script   62.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 180
    },
    {
      "scene_number": 14,
      "slugline": "INT. HULL - DAY  WHOOSH -- the acceleration SHAKES the craft.   The BOLT SHEARS  CLEAN OFF   -- the payload ROCKS -- THE OTHER FOUR BOLTS SNAP --  Iris slips from its supports, and SLAMS INTO THE HULL --  INT. NASA - CONTROL ROOM - DAY  ALARMS and LIGHTS flash across the consoles.   A cacophony of  urgent voices from the floor:  LAUNCHER INTERFACE  Whoa!   Flight, we’re getting a large  precession!  GUIDANCE  Force on Iris at 7 G’s.   TELEMETRY  Intermittent signal loss.  MITCH  Launch, what’s happening?  LAUNCHER INTERFACE  It’s spinning on the long axis with a 17  degree precession.  COMMS  We’ve lost readings on the probe, Flight.  MITCH  (goes cold)  Shit.   It shook loose in the bay.  LAUNCHER INTERFACE  Loss of signal, Flight.  GUIDANCE  L.O.S. here, too.   TELEMETRY  Same here.  The voices go SILENT.   The alarms BLARE.   Then:  MITCH  SatCon?  SATCON  No satellite acquisition of signal.  Mitch looks to the main screen.   It GOES BLACK, with LARGE  WHITE LETTERS reading: “ L.O.S. ”  CAPCOM  Flight, US Destroyer Stockton reports  debris falling from sky.  The Martian   Shooting Script   63.  (CONTINUED)",
      "characters": [],
      "action_text": "ON THE SCREENS: cameras catch glimpses of debris trails  falling from the sky.  Mitch puts his head in his hands.  MITCH  Roger.  Then Mitch Henderson says the words every Flight Director  hopes he never has to say:  MITCH (CONT’D)  GC, Flight.   Lock the doors.  INT. NASA - VINCENT’S OFFICE - NIGHT  Vincent sits in his office.   NASA is eerily silent now.   It’s  night.   Vincent stares into space.  Click.   He’s been motionless so long, the sensors think the  office is empty and shut off the lights.  Vincent shifts.   The lights click back on.  A chime RINGS OUT on his computer.   Vincent glances at the  screen, sees a relayed message from Pathfinder:  “WATNEY: How’d the launch go?”  EXT. SPACE - TO ESTABLISH  The SOMBER REDS of MARS blaze against the spacescape.  TITLE:   Sol 186  EXT. MARS - DAWN  Mark stands outside.   The horizon reflects off his faceplate.  MARK (V.O.)  So, um.   Commander Lewis.   I need you to  do something for me.   If I die.   I need  you to check on my parents.   They’ll want  to hear about our time on Mars first-  hand.   I’ll need you to do that.   It  won’t be easy talking to a couple about  their dead son.   It’s a lot to ask;  that’s why I’m asking you.   I’m not  giving up.   Just planning for every  outcome.   Please tell them I love what I  do.   And I’m really good at it.   And I’m  dying for something big and beautiful.  And greater than me.  The Martian   Shooting Script   64.  CONTINUED:  (MORE)  (CONTINUED) (then)  Tell them I said I can live with that.  EXT. CNSA - TO ESTABLISH - DAY  An impressive headquarters in the heart of Beijing.  TITLE: CHINA NATIONAL SPACE ADMINISTRATION  INT. CNSA - DAY  ONSCREEN: Teddy and Vincent answer questions from reporters.  VINCENT (ONSCREEN)  ...we substituted protein cubes for the  standard rations.   The thrust of the  launch, combined with the simultaneous  lateral vibration, liquefied the cubes  and created an unbalanced load.  REPORTER 4(ONSCREEN)  Why wasn’t this accounted for in the",
      "dialogue_count": 0,
      "word_count": 816
    },
    {
      "scene_number": 15,
      "slugline": "INT. NASA - SUPER COMPUTER ROOM - DAY  Rich Purnell stares at the calculations on the screen.   Can  these be right?   He runs the numbers again.   As he sees the  readout on his screen, he grins:   holy shit, I’m right.  INT. NASA - HALLWAYS - DAY  Rich hurries through the halls.  INT. NASA - VINCENT’S OFFICE - DAY  Vincent’s on the phone.  VINCENT  We’re jettisoning any sort of landing  system -- the idea is we’re only sending  rations, so they can crash land on  Mars...  SECRETARY  Wait --  Rich barges into to Vincent’s office.  RICH  You should hang up the phone.  VINCENT  I’m sorry -- who are you?  RICH  My name is Rich Purnell and I work in  astrodynamics and you should hang up the  phone right now.  VINCENT  (into phone)  I’ll call you back.  Rich hands Vincent his summary.  INT. NASA - CONFERENCE ROOM - DAY  We’re FOLLOWING ANNIE as she hurries into the briefing room.  Vincent, Rich, Bruce, and Mitch are already there.   Annie’s  reading the email on her phone.  ANNIE  What the hell is “Project Elrond?”  VINCENT  I had to make something up.  The Martian   Shooting Script   67.  (CONTINUED)",
      "characters": [
        "MITCH"
      ],
      "action_text": "ANNIE  “Elrond?”  MITCH  (realizing)  Because it’s a secret meeting.  ANNIE  How do you know that?   Why does “Elrond”  mean “secret meeting?”  BRUCE  The Council of Elrond.   From Lord of the  Rings.   It’s the meeting where they  decide to destroy the One Ring.  ANNIE  I so quit right now.  TEDDY  (entering)  If we’re calling something Project  Elrond, I would like my codename to be  “Glorfindel.”  ANNIE  Oh my god I hate every one of you.  MITCH  Teddy   doesn’t even know what this is  about?  VINCENT  Tell them exactly what you told me.  RICH  I can get the   Hermes   back to Mars by Sol  561.  Wait... what?   Jesus.   It’s as though Rich just dropped a  bomb in this room.  MITCH  What?  TEDDY  How?  Rich looks around.   Grabs items off the table to demonstrate.  RICH  Okay... let’s pretend this stapler is the  Hermes .   And you are... I’m sorry, what’s  your name again?  The Martian   Shooting Script   68.  CONTINUED:  (CONTINUED) TEDDY  Teddy.  (then)  I’m the Director of NASA.  RICH  Okay, Teddy, you’re Earth.   And right now  the   Hermes   is heading towards you and is  about to start its month-long  deceleration to intercept.   But, instead,  I’m proposing...  (demonstrates)  We start   accelerating   immediately, to  preserve velocity and gain even more.   We  don’t intercept Earth at all, but we come  close enough to use a gravity assist to  adjust course.   While we’re doing that...  He grabs the pen out of Teddy’s pocket.  RICH (CONT’D)  We resupply with the probe --  VINCENT  The Taiyeng Shen.  RICH  Pick up whatever provisions we need...  and then we’re accelerating towards Mars.  (to Annie)  You’re Mars.   And we’re going too fast  at this point to fall into orbit, so it’s  a flyby.  BRUCE  What good is a flyby if we can’t get  Watney off the surface?  VINCENT  Watney would have to intercept using the  MAV.  Vincent demonstrates, blasting his pen off of Annie’s  shoulder.   Rich catches it, and points everything back  towards Teddy...  RICH  And we",
      "dialogue_count": 2,
      "word_count": 3054
    },
    {
      "scene_number": 16,
      "slugline": "INT. HERMES - VIDEO BOOTH - REC ROOM - SPACE - MONTAGE  Martinez talks to his wife, MARISSA, on a screen in the video  booth.   She’s upset with him.  MARISSA  Five hundred and thirty-three days  longer?   And you said yes to this?  MARTINEZ  I did.   He would have done the same for  me.   You know that.  MARISSA  And you think I’m gonna forgive you?  MARTINEZ  I do.  Goddamn it, he’s right.   After a moment, she holds her hand  up to the screen.   He does the same.  INT. JPL - WHITE ROOM - DAY - MONTAGE  Bruce and his team oversee the Iris 2 Probe as it’s loaded  into shipping containers.  A few Chinese members of the CNSA (dressed in protective  gear) watch as well.  INT. HERMES - VIDEO BOOTH - REC ROOM - SPACE - MONTAGE  Lewis, floating now due to the lack of centripetal gravity,  talks on the computer to her husband, ROBERT.   It’s clear  they love each other.  ROBERT (ONSCREEN)  I found it at the flea market.   Original.  Pressing.  Robert holds up a vintage 1973 copy   Abba’s Greatest Hits  album.  Lewis squeals when she sees it.   Claps with delight.  EXT. LAUNCH PAD - CHINA - DAY - MONTAGE  The Iris 2 Probe is attached to the booster.  INT. CNSA - DAY - MONTAGE  Mitch engages in a heated argument with the Chinese Flight  Director.  The Martian   Shooting Script   82.  (CONTINUED)",
      "characters": [],
      "action_text": "MITCH  All due respect to your CNSA protocol, we  haven’t done things that way since Apollo  9 --  The translator tries to translate his words.   Zhu raises his  eyebrows, glances at Teddy --   is this guy for real?  Teddy shakes his head,   Don’t look at me, man.  EXT. HAB - DAY - MONTAGE  Mark seals the tent to the roof of Rover 2, then pressurizes  it.   Checking for leaks.   It’s like a hot-air balloon.  INT. NASA - WORK ROOM - MONTAGE  Vincent and his engineers are doing the exact same thing --  they have a mirrored set of Mark’s equipment.   They try to  figure out how to fit the Oxygenator into the pop tent.  INT. HERMES FLIGHT DECK - SPACE - MONTAGE  Vogel entertains his WIFE and their young CHILDREN.   He flips  from a low-G area into a non-G area.   ON THE SCREEN: The kids  laugh and laugh.  INT. CNSA - DAY - MONTAGE  The Taiyang Shen LAUNCHES.   Mitch, Teddy, and the Chinese  scientists all clap, shake hands.  EXT. MARS - DAY - MONTAGE  “He told us not to blow it ‘Cause he knows it’s all  worthwhile...”  Mark, bops his head to the music as he drives Rover 2 across  the dunes.  EXT. IRIS 2 PROBE - DAY (STOCK)  The Iris 2 probe separates from its booster rocket.  INT. HERMES FLIGHT DECK - MONTAGE  Martinez takes control of the probe.   He pilots it towards  the Hermes...  EXT. HERMES - SPACE - MONTAGE  The probe approaches the Hermes as the docking procedure  begins...  The Martian   Shooting Script   83.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 491
    },
    {
      "scene_number": 17,
      "slugline": "INT. HERMES - AIRLOCK 3 - SPACE - MONTAGE  Beck, geared up in his EVA suit, tethered to the wall, guides  the probe to the docking port.  INT./EXT HERMES - REC ROOM - SPACE - MONTAGE  Johannsen watches anxiously through the window port as Beck  secures the docking.  INT. HERMES - AIRLOCK 3 - SPACE - MONTAGE  Beck, geared up in his EVA suit, tethered to the wall, guides  the probe to the docking port.  EXT. HERMES - SPACE - END MONTAGE  “Let the children lose it, let the children use it, let all  the children boogie...”  The Hermes, rotating once again, soars through space on its  return journey to Mars.   It leaves the Earth behind...  And the music slowly FADES OUT.  EXT. MARS  As we hold in silence on the Red Planet, the title takes a  little longer than usual to appear onscreen....  TITLE:   Sol 461  MARK (PRELAP)  I’ve been thinking about laws on Mars...  EXT. HAB - DAY  And it’s OVER SIX MONTHS LATER, so a lot has changed .  MARK (PRELAP)  There’s an international treaty saying no  country can lay claim to anything that’s  not on Earth.  Both Rovers are now hitched together.   Pathfinder rides on  top of Rover 1 like Granny Clampett.   Rover 2 houses all the  equipment.   The whole thing looks like a Gypsy caravan made  of billion dollar NASA equipment.  MARK (PRELAP) (CONT’D)  And by another treaty, if you’re not in  any country’s territory, maritime law  applies.   So Mars is “international  waters.”  The Martian   Shooting Script   84.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 254
    },
    {
      "scene_number": 18,
      "slugline": "INT. HAB - DAY  The Hab is similarly transformed.   All the major equipment  has been stripped for parts. Sections of the canvas have been  cut down, re-glued, making the tent lopsided in places.  MARK (PRELAP)  NASA is an American non-military  organization, and it owns the Hab.   So,  as soon as I step outside, I’m in  international waters.  INT. HAB - DAY  Mark talks directly to camera.   The six months have  transformed him as well.   He’s GAUNT.   His hair is longer.  His impressive beard shapes his face.  MARK  Here’s the cool part.   I leave this  morning for the Schiaparelli crater,  where I will commandeer the Ares 4  lander.   Nobody explicitly gave me  permission to do this, and they can’t  until I’m aboard the Ares 4.   So I will  take control of a craft in international  waters without permission.   Which, by  definition, makes me a pirate.  (then)  Mark Watney, Space Pirate.  It’s better than winning the Nobel Prize.  INT. HAB - DAY  Last day in the Hab.   Mark shaves his beard.   CUT TO:  Mark organizes the boxes and boxes of experiments he was  keeping alive during his time in the Hab.   Among the labels  we see   “Das Soil Samples.”   CUT TO:  Mark pulls on his suit.   Performs final shutdown.   All the  computers, lights, heaters go DARK.   Silence.  EXT. HAB - DAY  Mark depressurizes the Hab.   Stares at it for a moment.  Thank you for keeping me alive.  EXT. ROVER - DAY  Mark opens Rover 2.   We catch a glimpse inside: it’s filled  with frozen potatoes and scavenged equipment.  The Martian   Shooting Script   85.  (CONTINUED)",
      "characters": [
        "VINCENT"
      ],
      "action_text": "Mark tosses the box of remaining rations inside.   We catch a  glimpse of   one of the labels:   “Goodbye, Mars.”  INT. ROVER - DAY  Mark climbs into Rover 1.   Powers up the system.   Here we go.  EXT. ROVER - DAY  Mark rolls out of the Hab site.   Heading towards the horizon.  EXT. MARS - VARIOUS - DAY  MARK (V.O.)  Everywhere I go, I’m the first.   It’s a  strange feeling.  Mark leaves FOOTPRINTS in the red dirt as he walks.  MARK (V.O.)  Step outside the rover?   First guy to be  there.   Climb that hill?   First guy to do  that.  Mark takes careful note of one of the Martian moons (PHOBOS)  in the sky.   Finds his course.  MARK (V.O.)  Four and a half billion years... nobody  here.   And now... me.  (then)  I’m the first person to be alone on an  entire planet.  EXT. MARS - DAY  Mark sits outside the rover in his MAV suit while he waits  for the solar panels to charge.  He takes in the view.   Phobos arcs through the sky.  It’s beautiful.  INT. NASA - MISSION CONTROL - DAY  SATELLITE VIEW: Mark’s caravan makes its way around the  impressive Marth Crater.  Mindy watches at her station.   Vincent approaches.  VINCENT  How’s our boy doing?  The Martian   Shooting Script   86.  CONTINUED:  (CONTINUED) MINDY  So far, so good.   He’s sticking to  schedule.   Drives for four hours before  noon.   Then sets the solar panels.   And  waits thirteen hours while they recharge.  Sleeps somewhere in there.   Then starts  again.  VINCENT  How’s his morale?  MINDY  He’s asked us to call him “Captain  Blondebeard.”  VINCENT  (thinks about that... huh)  Mars   would   be governed by maritime law,  so technically --  MINDY  Yeah, he explained it to us.  EXT. MARS - DAY  The ROVER cuts across Mars.   No music.   Just quiet.   Wheels  turning in the rust-colored dirt.  TITLE:   Sol 494  The Rover has a max speed of 25 kph, so it’s slow going. But  hypnotic.   Right now, it’s the only thing moving on the  entire planet.  EXT. MARS - DAY  ANGLE MARK.   Watching the horizon.  INT. NAS",
      "dialogue_count": 1,
      "word_count": 1500
    },
    {
      "scene_number": 19,
      "slugline": "INT. MAV COCKPIT - DAY  Mark waits in the airlock with a mess of stripped equipment.  EXT. MAV - DAY  The outside of the MAV now looks like the set of Sanford and  Son.   Mark wrenches one of the MAV’s hull panels free.  EXT. MAV - DAY  UP ABOVE: The nose airlock breaks free, and tumbles down  towards camera, BLACKING OUT FRAME.  EXT. MAV - DUSK  FROM BLACK, we FIND MARK.   He’s sitting on a hill slope,  surveying his handiwork.  The MAV has been TRANSFORMED.   The whole front has been torn  off.   Hab canvas now covers it.   Equipment litters the area  all around us.   Junkyard on Mars.  “Finally facing my Waterloo...”  Mark just sits.   Exhausted.  The music FADES.  EXT. HERMES - SPACE  The Hermes halts rotation as it approaches Mars.  TITLE:   Sol 560  LEWIS(PRELAP)  Here’s the plan...  INT. HERMES REC ROOM - SPACE  The whole crew is present for the state of the union.  LEWIS  Martinez will fly the MAV.   Johanssen  will sysop the ascent.   Beck and Vogel, I  want you in Airlock 2 with the outer door  open before the MAV even launches.   Once  we reach intercept, it’ll be Beck’s job  to get Watney.  The Martian   Shooting Script   92.  (CONTINUED)",
      "characters": [],
      "action_text": "BECK  He might be in bad shape.   The stripped  down MAV will get up to 12 g’s during the  launch.   He could be knocked unconscious  and may have internal bleeding.  LEWIS  Well, then it’s a good thing you’re our  doctor.   What’s the intercept plan?  BECK  We finished attaching the tethers into  one long line.   It’s 214 meters long.  I’ll have the MMU, so moving around  should be easy.  LEWIS  How fast a relative velocity can you  handle?  BECK  Once I get to Mark?   I can grab the MAV  at 5 meters per second.   10 is like  jumping onto a moving train.   Any more  than that and I might miss.  LEWIS  We’ve got some leeway.   The launch will  be 52 minutes before the intercept and it  takes 12 minutes.   As soon as Mark’s  engine cuts out we’ll know our intercept  point and velocity.  BECK  Good.   And 214 meters isn’t a hard limit,  per se.  LEWIS  Yes.   It is.  BECK  I take off the tether, I could get way  out to --  LEWIS  Not an option.   Vogel, you’re Beck’s  backup.   All goes well, you’re pulling  them back aboard with the tether.   If  things go wrong, you’re going out after  them.  VOGEL  Ja.  The Martian   Shooting Script   93.  CONTINUED:  (CONTINUED) LEWIS  All right.   Let’s go get our boy.  INT. POP UP TENT - DAY  Mark sits inside the makeshift pressurized tent.   He tears  open his last remaining ration pack:  “Goodbye, Mars”  He eats in silence.  TITLE:   Sol 561  EXT. NASA - NIGHT  It’s a mob scene at NASA.   Networks from all across the globe  have sent teams to cover the event.   Campers, crews, and  chaos all around as everyone fights for real estate in the  biggest story of the century.  EXT. TIMES SQUARE - NIGHT  New-Years-Eve-Level crowds gather in Times Square.   On the  Jumbotron, news reports announce the   “Watney Rescue.”  INT. MISSION CONTROL -   NIGHT  Teddy, Vincent, and Annie watch from an observation area.  ANNIE  If something goes wrong, what can Mission  Control do?  VINCENT  Not a damned thing.  (off her look)  It’s all happenin",
      "dialogue_count": 0,
      "word_count": 925
    },
    {
      "scene_number": 20,
      "slugline": "EXT. VARIOUS - DAY/NIGHT  ALL AROUND THE WORLD -- the CROWDS ERUPT IN CHEERS as they  hear Mark’s voice.  INT. NASA - MISSION CONTROL - NIGHT  LEWIS (OVER COMMS)  Mission control, this is Hermes actual.  We are go for launch, and will proceed on  schedule.   10 seconds to launch... mark.  INT. HERMES - FLIGHT DECK - SPACE  MARTINEZ  Main engines start.  JOHANSSEN  8... 7...   mooring clamps released...  LEWIS  About five seconds, Watney.   Hang on.  INT. MAV - DAY  Mark tenses in anticipation.  MARK  See you in a few, Commander.  JOHANSSEN (OVER COMMS)  4... 3... 2... 1...  LIFTOFF.  Mark is SLAMMED back into his acceleration couch --  EXT. LAUNCHSITE - DAY  SFX: the MAV launches upward with incredible force.   And yes,  as discussed,   in the history of space travel,   no manned ship  has ever accelerated with more force.  INT. MAV - DAY  Mark can’t even GASP -- the wind knocked out of him -- He  struggles to remain conscious as the ship shakes VIOLENTLY --  MARK’S POV: staring forward, at the HAB CANVAS (which now  patches where the nosecone used to be.)  As the ship accelerates, the canvas begins to RIP --  The Martian   Shooting Script   97.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 197
    },
    {
      "scene_number": 21,
      "slugline": "INT. HERMES - FLIGHT DECK - SPACE  JOHANSSEN  Velocity 741 meters per second.   Altitude  1350 meters...  LEWIS  That’s   too low   --  MARTINEZ  I know.   It’s fighting me --  JOHANSSEN  Velocity 850, altitude 1843 --  LEWIS  Watney?   Watney, do you read?   Can you  report?  INT. MAV - DAY  But Mark’s barely conscious -- his eyes drifting from  terrified to serene as he fades --  HIS POV -- the canvas RIPS FREE....  Revealing the RED ATMOSPHERE of Mars.   And as it thins -- as  we rocket towards the heavens -- the red gives way to the  black...  And the last thing Mark sees before he drops unconscious --  Are the STARS.  INT. HERMES - FLIGHT DECK - SPACE  JOHANSSEN  He’s well below target altitude.  LEWIS  How far below?  JOHANSSEN  Working on it -- Main shutdown in 3...  2... 1... Shutdown.  MARTINEZ  Back to automatic guidance.   Confirm  shutdown.  LEWIS  Watney?   Do you read?  The Martian   Shooting Script   98.  (CONTINUED)",
      "characters": [
        "BECK"
      ],
      "action_text": "LEWIS  How much do you need?  MARTINEZ  I could get by with maybe 20 percent of  what’s left.  LEWIS  Johanssen --  JOHANSSEN  (already working it)  Use 75.5 percent of remaining attitude  adjust fuel.   That’ll bring the intercept  range to zero.  LEWIS  Do it.  JOHANSSEN  Hang on   -- that gets the range to zero,  but the intercept   velocity   will be 42  meters   per second   --  LEWIS  Then we have 39 minutes to figure out how  to slow down.   Martinez,   burn the jets .  EXT. HERMES - SPACE  WHOOSH.   The attitude thrusters FIRE.   The Hermes changes  course --  INT. MAV - DAY  CLOSE ON MARK as his eyelids flutter.   He winces in pain as  he slowly regains consciousness.  BENEATH HIM -- the orbiting MAV offers an unobstructed view  of Mars.   The great red planet’s horizon stretches out  forever as the wispy atmosphere gives it a fuzzy edge.  It’s breathtaking.   Awe-inspiring.  Mark holds up his middle finger.   Fuck you, Mars.  MARK  MAV to Hermes --  LEWIS (OVER COMMS)  Watney?!  MARK  Affirmative, Commander.  The Martian   Shooting Script   100.  CONTINUED:  (CONTINUED) LEWIS (OVER COMMS)  What’s your status?  MARK  My chest hurts.   I think I broke some  ribs.  (then)  How are you?  LEWIS (OVER COMMS)  We’re working on getting you.   There was  a complication during launch.  MARK  Yeah.   The canvas didn’t hold...  INT. HERMES - FLIGHT DECK - SPACE  MARK (OVER COMMS)  I think it ripped early in the ascent.  LEWIS  That’s consistent with what we saw.  MARK (OVER COMMS)  How bad is it, Commander?  LEWIS  We’ve corrected the intercept range, but  we’ve got a problem with the intercept  velocity.  MARK (OVER COMMS)  How big a problem?  LEWIS  42 meters per second.  INT. MAV - DAY  We’re CLOSE ON MARK as that news lands.  MARK  Well.   Shit.  INT. HERMES - FLIGHT DECK - SPACE  Everyone struggles to find a solution.   Mark’s voice  interrupts the silence:  MARK (OVER COMMS)  Commander?  The Martian   Shooting Script   101.  CONTINUED:",
      "dialogue_count": 1,
      "word_count": 639
    },
    {
      "scene_number": 22,
      "slugline": "INT. MAV - DAY  LEWIS (OVER COMMS)  Go ahead, Mark.  MARK  I could find something sharp in here and  poke a hole in the glove of my EVA suit.  I could use the escaping air as a  thruster and fly my way to you.   Since  the source is on my arm, I could direct  it pretty easy.  INT. HERMES - FLIGHT DECK - SPACE  LEWIS  I can’t see you having any control if you  did that.   You’d be eyeballing the  intercept and using a thrust vector you  can barely control.  MARK (OVER COMMS)  Those are very good points.   But.  Consider this:  INT. MAV - DAY  MARK  I would get to fly around like Iron Man.  INT. HERMES - FLIGHT DECK - SPACE  LEWIS  We should have left him on Mars.  MARK (OVER COMMS)  Iron Man, Commander.   Iron Man.  Lewis rubs her face.   Thinks.   Hmm...  LEWIS  Maybe it’s not the worst idea.  MARTINEZ  No, it actually is.   The worst idea.  Ever.  LEWIS  Not his part.   But using atmosphere as  thrust...  (springs into action)  Martinez, get Vogel’s station up and  running...  The Martian   Shooting Script   102.  (CONTINUED)",
      "characters": [
        "LEWIS"
      ],
      "action_text": "MARTINEZ  It’s up.   What do you need?  LEWIS  I need to know what happens if we blow  the VAL.  Both Martinez and Johanssen straighten up.   What?  MARTINEZ  You want to open the Vehicular Airlock?  LEWIS  It would give us a good kick.  MARTINEZ  Yeah.   And it might blow the nose of the  ship off in the process.  JOHANSSEN  And... all the air would leave.   And we  need air.   To not die.  LEWIS  We’ll seal the bridge and reactor room.  We let everywhere else go vacuo.  MARTINEZ  But we’d still have the same problem as  Watney.   We can’t direct the thrust.  LEWIS  We don’t have to.   The VAL is in the  nose.   We just point the ship at Mark.  MARTINEZ  (reading the numbers)  A breach at the VAL would decelerate us  29 meters per second.  JOHANSSEN  Which gives us a relative velocity of 13  meters per second.  LEWIS  Beck -- you hearing this?  INT. HERMES - FLIGHT DECK - SPACE  MARTINEZ  How do we open the airlock doors?  There’s no way to open them remotely, and  if anyone’s nearby when it blows...  The Martian   Shooting Script   103.  CONTINUED:  (CONTINUED) LEWIS  Right... right...  (thinks)  Vogel?  VOGEL (OVER COMMS)  Go ahead, Commander.  LEWIS  Take your suit off.  (then)  I need you to come back in and make a  bomb.  INT. MAV - DAY  MARK  Did you say “bomb?”   You guys are making  a bomb   without me ?  INT. HERMES - AIRLOCK 2 - SPACE  VOGEL  Um...   Again, please, Commander.  LEWIS (OVER COMMS)  You’re the chemist.   Can you make a bomb  with what we’ve got on board?  VOGEL  Probably.   But... I feel obliged to  mention that setting off an explosive  device on a spacecraft is a terrible,  terrible idea.  LEWIS (OVER COMMS)  Copy that.   Can you do it?  VOGEL  (thinks; then)  Ja.  INT. MISSION CONTROL - NIGHT  Lewis’ voice rings out through the room:  LEWIS (OVER COMMS)  Houston, be advised: we are going to  deliberately breach the VAL to produce  thrust.  CHAOS erupts at Mission Control.   WHAT DID SHE JUST SAY?  The Martian   Shooting Script   104.  CON",
      "dialogue_count": 1,
      "word_count": 1595
    },
    {
      "scene_number": 23,
      "slugline": "EXT. HERMES - SPACE  ANGLE LEWIS -- as she counter-thrusts, fires her MMU.   Trying  to slow as Mark approaches --  JOHANSSEN (OVER COMMS)  11 meters to target...  And finally...  EXT. SPACE  ANGLE MARK.   As he cuts through space.   Free as the  proverbial bird.   The Red Planet silhouetted behind him as he  leaves it behind, once and for all.  As the score SWELLS to CRESCENDO, these two astronauts soar  towards one another, arms outstretched...  JOHANSSEN (OVER COMMS)  6 meters to target...  JUST AS THEY REACH EACH OTHER --  MARK  Contact .  EXT. SPACE - DAY  Mark and Lewis float together, holding tight to one another.  CLOSE ON MARK.   As he stares at Lewis.   The first human he  has seen in ages.   He smiles.  MARK  You have terrible taste in music.  INT. NASA - MISSION CONTROL - NIGHT  Everyone leaps up as Lewis’ voice rings out through mission  control --  LEWIS (OVER COMMS)  I got him .  They ERUPT into CHEERS --  EXT. ST. PETERSBERG - DAY  -- and the CHEERS explode through RUSSIA...  The Martian   Shooting Script   111.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 178
    },
    {
      "scene_number": 24,
      "slugline": "EXT. TIMES SQUARE - NIGHT  ...and NEW YORK as news reports break the story of Mark’s  rescue on the big screens.  EXT. BEIJING - DAY  ...and CHINA...  EXT./INT. AIRLOCK - DAY  LEWIS guides MARK towards the airlock with her MMU.  LEWIS (INTO COMMS)  Beck, prep the sick bay.   We’re bringing  him to you.   Everyone else, meet me in  Airlock Two.  MARTINEZ, JOHANSSEN, and VOGEL race down from the bridge to  meet them.   They’re not in suits -- they have to wait for the  outer airlock to close.   THROUGH THE OBSERVATION WINDOWS:  they see Lewis and Mark touch down in the airlock.  The outer airlock closes -- WHOOSH -- Mark collapses,  exhausted.   The inner airlock opens.   Martinez, Johanssen,  and Vogel race into the room, grab Mark.   Supporting him.  Holding him.  MARK  Hi guys.  Everyone fighting back tears.  JOHANSSEN  Oh, hey Mark.   Haven’t seen you in a  while.  MARTINEZ  Yeah.   What’ve you been up to?  MARK  Oh.   You know.   Same old, same old.  Click.   They help him with his helmet.   As they pull it off,  everyone is suddenly taken aback.   Oh my god...  VOGEL  You smell horrible.  MARK  I haven’t showered in a year and a half.  Cut me some slack.  Johanssen’s eyes are watering.   Good lord, he smells bad.  The Martian   Shooting Script   112.  (CONTINUED)",
      "characters": [
        "MARK",
        "ANNIE"
      ],
      "action_text": "JOHANSSEN  You don’t know what you’re asking us  here.  MARTINEZ  Yeah, captain, we may need to put him  back.  MARK  I missed you guys.  They hold each another.  EXT. EARTH - TO ESTABLISH  Home.   It’s never looked more warm and welcoming.  EXT. PARK - JOHNSON SPACE CENTER - DAY  A man sits by himself on a bench.  ANGLE to reveal it’s MARK WATNEY.   Basking in the warmth of a  beautiful day.  TITLE:   DAY 1  INT. NASA - TEACHING THEATER - DAY  The young, fresh-faced recruits in NASA’s Astronaut Candidate  Program are abuzz as Mark enters the room.   The students  nudge each other --   Look, there he is .  By the time Mark reaches the lectern at the front, he has the  full attention of the class.  MARK  Welcome to the Astronaut Candidate  Program.   Pay attention.   This could save  your life.  (then)  Trust me, I know what I’m talking about.  The class laughs.  MARK (CONT’D)  Okay, let’s see if I can get some of your  questions out of the way up front.   Yes,  I did, indeed, survive on a deserted  planet by farming in my own shit.   It was  even more disgusting than it sounds.  Let’s never speak of it again.  More laughter.   Mark lets it subside.  The Martian   Shooting Script   113.  CONTINUED:  (CONTINUED) But BRUCE NG is awake.   And he still looks as exhausted and  rumpled as ever.   But he’s in a good mood.   He eats breakfast  with his team outside as they watch the news reports  detailing the   “ARES 5 LAUNCH.”  Bruce and his team laugh, make jokes with each other.   One of  them tosses food to the deer.  INT. SUBURBAN HOUSE - DAY  “People all over the world, join in...”  Five BEAUTIFUL BLONDE CHILDREN race through the house,  wearing NASA t-shirts and jumpsuits -- we get the sense this  is the Superbowl for this family.  ALEX VOGEL grabs his youngest daughters as they race past.  He scoops them up in his arms.   They laugh and laugh.  INT. SPACECRAFT - DAY  The Ares 5 astronauts secure themselves into their  acceleration chairs.   We settle on one astronau",
      "dialogue_count": 2,
      "word_count": 1133
    },
    {
      "scene_number": 25,
      "slugline": "INT. SPACECRAFT - DAY  As we hear the TIMER CONTROLLER initiate the COUNTDOWN...  TIMER CONTROLLER (OVER COMMS)  10... 9... 8...  We settle on the final member of the ARES 5 team:  RICK MARTINEZ.   He grins as he feels that all-too-familiar  surge of adrenaline.   Here we go again...  INT. HOUSE - DAY  We’re MOVING DOWN THE HALLWAY of a quaint house.   On the  WALLS: vintage albums and posters...  Donna Summer’s LAST DANCE on 7”...   C’est Chic... A framed  top that looks like something Gloria Gaynor wore...  TIMER CONTROLLER (OVER COMMS)  7... 6...  And mixed in among the glittery paraphernalia:  The NASA Distinguished Service Medal... The Congressional  Medal of Honor...  MELISSA LEWIS is glued to the television.   She doesn’t look  up as her husband brings her a cup of tea.  She’s with the crew in this moment.   Her husband doesn’t take  offense.   He gives her a loving pat and exits.  TIMER CONTROLLER (OVER COMMS) (CONT’D)  5... 4...  INT. NASA - MISSION CONTROL  “People all over the world, ‘round the world y’all, join  hands...”  WIDE ON THE WHOLE ROOM as the team stares back at us in eager  anticipation.  TIMER CONTROLLER (OVER COMMS)  3... 2... 1...  Launch .  The crowd erupts into cheers.   They reach for one another.  We drift up to find...  The Martian   Shooting Script   117.",
      "characters": [],
      "action_text": "EXT. SPACE  Earth.   Blue and beautiful.  Home .  FADE OUT.  THE END  The Martian   Shooting Script   118. BEST PICTURE  Produced by  Simon Kinberg,   p.g.a.   • Ridley Scott,   p.g.a. Michael Schaefer,   p.g.a.   • Aditya Sood • Mark Huffam,   p.g.a. BEST DIRECTOR  Directed by  Ridley Scott BEST ADAPTED SCREENPLAY  Screenplay by Drew Goddard Based upon the novel by Andy Weir  BEST ACTOR  Matt Damon  BEST SUPPORTING ACTOR  Jeff Daniels • Michael Peña Sean Bean • Sebastian Stan Aksel Hennie • Benedict Wong Donald Glover • Eddy Ko Chiwetel Ejiofor  BEST SUPPORTING ACTRESS  Jessica Chastain • Kristen Wiig Kate Mara • Mackenzie Davis Chen Shu  BEST CINEMATOGRAPHY  Director of Photography Dariusz Wolski,   ASC  BEST PRODUCTION DESIGN  Production Designer Arthur Max Set Decorator Celia Bobak  BEST FILM EDITING  Film Editor Pietro Scalia,   ACE  BEST COSTUME DESIGN  Costume Designer Janty Yates  BEST ORIGINAL SCORE  Music by Harry Gregson-Williams  BEST SOUND MIXING  Production Sound Mixer Mac Ruth Re-Recording Mixers Paul Massey • Mark Taylor  BEST SOUND EDITIN G Supervising Sound Editor/Sound Designer Oliver Tarney  BEST MAKEUP AND HAIRSTYLING  Makeup and Hair Designer Tina Earnshaw Key Makeup Artist Jana Carboni Chief Hairstylist Maralyn Sherman  BEST VISUAL EFFECTS  Richard Stammers • Chris Lawrence Anders Langlands • Steven Warner  OUTSTANDING PERFORMANCE BY A CAST IN A MOTION PICTURE  Matt Damon • Jessica Chastain Kristen Wiig • Jeff Daniels • Michael Peña Sean Bean • Kate Mara • Sebastian Stan Aksel Hennie • Mackenzie Davis Benedict Wong • Donald Glover Chen Shu • Eddy Ko and Chiwetel Ejiofor © 2015 Twentieth Century Fox Film Corporation. All rights reserved.",
      "dialogue_count": 0,
      "word_count": 474
    }
  ]
}