{
  "slug": "the-wolverine-2013",
  "title": "the wolverine",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 0,
  "characters": [],
  "total_words": 28518,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. RICE PADDY - DAY  The sky clear, the war over.   Peasants plant rice. VOICE (V.O.) Most clans would find an uneasy peace.   They flourished and grew, planting the seeds of what would one day be Japan. But for some...  EXT. OPEN FIELD - NIGHT  The Red and Black clans clash again.   Flaming arrows fill the air, providing the only light. The fighting is graceful, precise, perfect... VOICE (V.O.) Killing was all they knew. And they refined it to a high art.... Until it was clear to all that neither side would ever defeat the other.  EXT. BAMBOO FOREST - CLEARING - NIGHT  An ominous orange light.   Red and Black Warrior surrounding the cleaning holding torches. VOICE (V.O.) Finally, the Warlords of the rival clans met to end the war. The Red and Black Warlords meet in the center of the clearing, speaking in clipped, firm tones deep into the night, making no progress... VOICE (V.O.) (CONT’D) Both men were wise, but neither could put aside his insatiable hunger for vengeance. They could see only one path to peace... CLOSE ON: A GLOWING IRON ARROW is pulled from a flame and extended between the Warlords. We cannot understand the Red Warlord, but we can see his tone is firmer now. Final. He extends a hand.   The Black Warlord considers, then offers his own hand. VOICE (V.O.) (CONT’D) And on this, the Warlords swore an unbreakable oath.  2.",
      "characters": [],
      "action_text": "The Two Warlords clasp hands around the arrowhead, searing their flesh, unflinching.  EXT. BAMBOO FOREST - CLEARING - NIGHT  As their warriors watch, the Warlords strip to the waist, each man taking a sword. They circle one another, looking for a weakness.   Then they charge. Their men watch the fight with cold, unblinking eyes. VOICE (V.O.) The winner claimed victory in a war as old as time. The Black Warlord stands into frame, a bloody blade in his hand.   The Warriors of the Black Clan silently kneel and bow their heads in salute. VOICE (V.O.) (CONT’D) The loser sealed his clan’s fate. The Warriors of the Red Clan simply drop their torches, turn, and vanish into the night.  EXT. RED CLAN VILLAGE - DAY  A secluded mountain hamlet. Outside a humble bamboo hut, A RED WARRIOR points a blade at his own belly. VOICE (V.O.) The men of the losing clan honored their oath, taking their lives... CLOSE ON: The Red Warrior’s face as he drives the dagger home. The slightest flinch. Then he falls. VOICE (V.O.) (CONT’D) And the lives of their families. ANGLE ON: the floor of the hut behind him. The motionless bare feet of a woman and two children...  EXT. BEACH - DAY  The Black Clan rides by the sea to a coastal village. VOICE (V.O.) The victors went home, uncertain of a future without war... But they would not be uncertain for long.  3.",
      "dialogue_count": 0,
      "word_count": 477
    },
    {
      "scene_number": 2,
      "slugline": "EXT. COASTAL VILLAGE - SUNSET  Huts adorned with whale bone and oyster shells. The Black Warlord rides into frame, his stoic face ashen. His eyes burning. He dismounts and drops to his knees. One by one, his warriors do the same. VOICE (V.O.) Their rivals had honored their oath. But not before one last act of vengeance... Through the door of every hut in the village, we see the bare, motionless feet of women and children...  EXT. COASTAL VILLAGE - NIGHT  A glowing red arrow head. One by one, each warrior of the Clan burns the arrow into the flesh of his palm. VOICE (V.O.) They were no longer men.   They no longer had souls. They would never again walk in the light of day - an army of vengeance with no enemy... Killers with no feeling. Now... they were merely a weapon. AS HIS WARRIORS WATCH, the shamed Black Warlord aims the glowing arrow at his heart and drives it home. VOICE (V.O.) (CONT’D) A weapon... in search of a master.  EXT. BAMBOO FOREST - CLEARING - NIGHT  The ominous orange glow. The Warriors of the Black Clan surround the clearing, torches in hand. TWO PRIMITIVE WARLORDS wearing animal hide step with uncertainty into the clearing, each holding a dagger. VOICE (V.O.) So the two strongest clan lords in the land were chosen. The winner would be Master of the Black Clan. The surviving Warlord stands into frame. The Warriors all around him silently kneel and bow their heads.  4.",
      "characters": [],
      "action_text": "VOICE (V.O.) (CONT’D) It is said he was this true power in Japan. It is said his will determined her fate. The Warlord’s uncertain expression changes to one of eerie clam. He considers his new power and smiles. VOICE (V.O.) (CONT’D) And all who opposed him.. Would meet a swift and shadowy death.  EXT. BAMBOO FOREST - CLEARING - CONTINUOUS  The ominous orange glow. A CHALLENGER steps into the clearing to face the now Aged Master of the Clan. VOICE (V.O.) In time, the Clan became an order, the order became belief. And the contest became ritual... As old as Japan itself. CLOSE ON: The Challenger stands into frame, a bloody sword in his hand. COME AROUND SLOWLY as the Warriors bow.   By the time we come around full circle A NEW CHALLENGER stands in the center of the clearing. HOLD ON THIS as the Challenger morphs over and over again, marking the passing of generations, millennia, each man’s clothes becoming more familiar, more modern - inching toward the twentieth century. VOICE (V.O.) (CONT’D) And the Black Clan, as with any weapon, were as good - or as evil - as the hand wielding it... STOP. THE LAST CHALLENGER we will see - his face hard, his eyes hawkish and hateful. He wears the uniform of A JAPANESE ARMY OFFICER circa 1939... VOICE (V.O.) (CONT’D) ...silencing their master’s enemies, enforcing their master’s will, shaping Japan’s destiny... With cold, unblinking eyes... Silence.   And A BLINDING ORANGE LIGHT. Our eyes adjust, gradually making sense of an atomic blast and the subsequent mushroom cloud a moment before the deafening shock-wave brings:  5. WHITE  The haunting sound of cold wind. Lonely. Isolated. AN EAGLE drifts into frame, eyes sharp, head ticking left, right, center, left again - then diving. We follow and emerge from the clouds TO REVEAL: A brilliant green mountain valley one thousand feet below, snow-capped peaks on either side. We are one with the eagle, adrift on the wind, living only for the hunt. We fly lower, faster - skimming snow, rocks, ev",
      "dialogue_count": 0,
      "word_count": 1212
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CAVE/HILLSIDE - LATER  FIVE YOUNG MOUNTIES slide down the same gravel hillside to join a SQUARE-JAWED MOUNTIE staring in muted shock at something O.S. As they approach, the Young Mounties can’t hide their looks of horror. YOUNG MOUNTIE Is... is that our man-eater? SQUARE JAW Judging by the contents of his stomach... One of the Young Mounties bends out of frame and heaves. Square Jaw sighs, shakes his head. Rookies. YOUNG MOUNTIE Wh... What the hell did that? 2ND MOUNTIE Whatever it was... it was mad. 3RD MOUNTIE Look at how it cut through that tree-stump. SQUARE JAW Part beaver, you figure. (off their confused looks)  Idiots . It was a man. YOUNG MOUNTIE One man did all this? 2ND MOUNTIE Why’d he cut the tree in half? 3RD MOUNTIE Why’d he cut the bear in half? Square Jaw grabs a radio, barks into it. SQUARE JAW 2-6-2, Alpine. VOICE (ON RADIO) Alpine, go. SQUARE JAW It’s the rogue all-right. All butchered up. Send animal control. And the medical examiner. Think we have our missing campers, too.  8.",
      "characters": [],
      "action_text": "VOICE (ON RADIO) Alpine, copy... SQUARE JAW Then get me a description of that hunter Chet was telling you about. Ut it on the wire. I’d like a word with him. 2-6-2 out. He walks, his men follow - past the rock, past the tree; hacked in half as if by rabid beavers. Drag marks and hand prints in the dirt tell a story: A man with three blades in each hand pulled himself toward the nearby river. Then signs of these blades vanish. The drag marks stop and foot-prints appear, telling us this man managed to find his feet. The footprints lead into the river. The story ends. YOUNG MOUNTIE What’s this about a hunter, Sarge? SQUARE JAW Last night a fella comes up to the North Barracks. On   foot . No gear. No gun. Smoking a   cigar , if you can imagine. Heard we had a rogue bear on our hands. Told the dispatcher it would take us weeks to find it. Said he could track it in a day. Dispatch asks him how he figures on finding a half-crazed man-eating bear in the high country all by himself. This character with the cigar says: ‘Cuz I   understand   it.’ And now the Mounties wonder if something worse than a man-eating bear could be out there.  EXT. WOODS - DAY  Logan squats hidden by the trees, watching the Mounties across the river. He shivers, soaking wet, his wounds gone. He pulls a three inch long splinter from his hand, dropping it in a pile of several more. The gash it leaves heals before our very eyes. He picks up an arrow with distinctly colored flights taken from the bear’s spine. The tip is a broad-head with a cruel hollow point, dripping amber liquid. Logan turns the arrow over again and smells the flights. Then he stands and walks into the woods.  9.",
      "dialogue_count": 0,
      "word_count": 493
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ROAD HOUSE - DUSK  Eighteen wheelers roar through cold rain under an angry gray sky. Logan crosses the highway toward a battered road house offering beer and bait in neon. He wanders through the mud-clotted pick-up trucks parked out front, breathing deep and slow through his nose. He stops at a truck with deer antlers in the grill, a wolf’s tail on the antenna. In back he spies a bow and a quiver of arrows, the flights familiar.  INT. ROAD HOUSE - NIGHT  French Canadian country music - if you can imagine such a thing - in a smoky room filled with TRUCKERS, LOGGERS and HUNTERS - forty men al told. None small. On the muted TV we see the RCMP around a redwood cut clean in half, a rock and two white sheets. The scroll tells of five missing campers, a rogue bear and how the Mounties shot the animal dead. Logan, dirty, wet, brooding, walks along the bar, breathing deep and slow through his nose. He pauses behind one man in particular.   A DEEP SWIGGING MEATY CANUCK in a greasy orange hunting cap. Logan drops the arrow on the bar in front of him. Pause. MEATY CANUCK That’s a poison broad-head, mister. They’re illegal. LOGAN Ask me where I found it. MEATY CANUCK Don’t care. LOGAN In a bear. Up the back country. Seems whatever fat slop shot that animal didn’t have the wind or the skill to track it down proper and finish it off. The meaty Canuck glances up at the TV. LOGAN (CONT’D) And instead of dropping a lethal dose, this arrow bled poison into that bear for days. Made him crazy. Killed five people.  10.",
      "characters": [],
      "action_text": "MEATY CANUCK That’s unfortunate. LOGAN That’s murder. Five counts... for the man who shot that arrow. MEATY CANUCK (half turning, glaring) And you think that’s my arrow? LOGAN I   know   it is. And I’m gonna hear you tell it to the Mounties. Logan puts a hand on the Canuck’s shoulder. The Canuck throws a punch - his hand full of beer-mug.  CRUNCH   - Logan staggers back, covering his face. The Canuck spins, ready to fight. He freezes. Confused. Logan’s hand covers what must be a pretty bad wound. But when he wipes off the blood, there’s only a small cut on his face. He rolls tongue n cheek and a piece of glass pops out. The Canuck watches it fall to the floor. When he looks back at Logan, the cut is gone. LOGAN (CONT’D) Let me show you how it works.  WHAM   - Logan drives his right fist into the Canuck’s gut. He doubles over into Logan’s left fist, held anvil-steady. The Canuck collapses, jaw broken. LOGAN (CONT’D) Now heal. (as the Canuck tries to crawl) Yeah, I guess you could read that two ways. What I meant was-  WHACK   - A pool cue hits Logan across the back of the head. He merely winces and turns. A BIG LOGGER, holding a broken cue like this is a joke on him. Logan sighs, calms himself. LOGAN (CONT’D) Now I don’t want any trouble. This is between me and him, not - EVERY MAN IN THE BAR stands. LOGAN (CONT’D) ... All of you.  11. A BIGGER LOGGER steps up, holding up a baseball bat. BIGGER LOGGER Let’s see you break thi-  SCHLICK-SMACK   - Logan’s claws flash through the bat. In the same motion, he punches - his claws retracting an instant before he connects with the Logger’s jaw. CRUNCH - And we’re off. Loggers, Truckers, and Hunters, fueled by liquid courage, rush him in waves. The fight is without grace, without choreography. A close-in 40-to-1 head-busting brawl. Then 30... 20. CLOSE ON: A   MASSIVE   LOGGER by the back door, wisely watching, waiting. He’s fondling an axe. The last man falls. Logan is a bruised and swollen mess - his ability to heal taxed to",
      "dialogue_count": 0,
      "word_count": 1299
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MOUNTIE BARRACKS - PARKING LOT - NIGHT  Logan still reading that paper. We get to see it now:  PROJECT: WOLVERINE  Followed by dense military jargon. Meanwhile, Zen and a mix of ASIAN and WESTERN SUITS shake hands with SQUARE JAW and some MOUNTIE BRASS. Things seem to have been worked out.   They disburse. Zen walks over to Logan. He produces a cigar which Logan accepts. As Zen lights it for him: ZEN Your hunter confessed. The police admit they might never have found him on their own. They are very grateful. Logan looks past Zen to the Mountie Brass, looking this way with suspicion and disdain. ZEN (CONT’D) Begrudgingly so, I admit. But they have dropped all charges. With the understanding that you leave Canada and never return. Logan nods, stung, but used to it. Waving the paper: LOGAN Is there more? ZEN All there is to know. Who you are. Where you come from. What was done to you and why. But I can only tell you what little my master permitted me to read. The rest is in Japan. LOGAN Japa- Did you say your   master ? ZEN He is in Tokyo. A plane is waiting to take us to him now. LOGAN (laughing/turning to leave) Listen. It’s been great. Thanks for bailing me out. Maybe I’ll see’ya’round.  15.",
      "characters": [],
      "action_text": "ZEN We had an agreement. LOGAN You had an agreement ZEN They will arrest you if you stay in Canada. That stops Logan in his tracks. ZEN (CONT’D) And you will have to comply. Or kill to maintain your so-called freedom. You will continue searching in the wrong place for answers to the wrong questions - wasting your gifts on petty acts of justice. A vigilante, living out your days like that bear - a hunted rogue. Like that hunter - an ignorant criminal. And you will  never   find an end to your pain. LOGAN (turning back/glaring) What do you know about pain? ZEN I stand in the presence of History’s Warriors. Witness to centuries of combat, ages of suffering - pursued by enemies he cannot name, grieving for a love he cannot remember. You are the living Prometheus. Compared to you...I’ve never even   felt   pain. Logan’s face tells us Zen is pretty close. ZEN (CONT’D) But I know the answers you seek are not here. And while your body heals quickly, your mind never will. Not until you recover your memories and confront them. Only then will you find peace. A peace I can give you. LOGAN And what do I have to do for you? ZEN Let me take you to my master.  16. LOGAN In Japan. ZEN In Japan. Logan sucks on his cigar, considering this with no small amount of suspicion, then he steals a glance at the glaring Mounties across the way. He shrugs. LOGAN Fine. Take me to your leader. ZEN Master. LOGAN Whatever. AN EXPLOSION OF SOUND, a stream of blue flame.  EXT. SKIES OVER THE PACIFIC - DAWN  And a sleek private jet streaks eastward, away from the rising sun over a dark and uncertain sea. EXT. TOKYO - NIGHT Another explosion - this time one of unearthly color, blinding light. Our eyes adjust to a world of flashing neon and LED on buildings, billboards, even many of the vehicles themselves - this place is one giant, ever changing video screen.   The streets are packed with a steady flow of fast-moving foot traffic, seemingly immune to the overload of surrounding imagery. Everything shin",
      "dialogue_count": 0,
      "word_count": 1121
    },
    {
      "scene_number": 6,
      "slugline": "EXT. JUNGLE - DAY  Logan’s repressed memory. Somewhere in the Pacific of WWII, amidst A HANDFUL OF RETREATING CANADIAN SOLDIERS engaged in a running gun-battle, vastly outnumbered by the pursuing JAPANESE. We find: Logan, machine-gun in hand, WOUNDED SOLDIER over his shoulder. While Logan runs and reloads, the Wounded Soldier shoots and vice versa. Until: A grenade blasts Logan off his feet. He leads in a heap, his partner dead. The dense foliage around him shreds in a hail of bullets. The last of his squad now, Logan runs as far and as fast as he can until: CRASH - The ground under his feet vanishes and he plummets, landing with a sickening crunch. CLOSE ON: Logan’s face twisted in a silent howl of unimaginable pain. PULL BACK TO REVEAL: He has fallen face down into a man-trap filled with dozens of bamboo spears, impaled like an insect, spikes through his out-stretched limbs, his abdomen, his shoulder. He is completely immobilized - unable to free himself. His claws extend unconsciously and we notice they are raw bone - not metal. Useless. He can hear the enemy in the distance, searching. He struggles to pull himself free, adding to his pain. Then a SHADOW looms over him; A YOUNG JAPANESE SOLDIER - handsome, with dark, piercing eyes - rifle in hand. After inspecting Logan’s predicament, the Soldier drops his rifle and draws a sword. He rests the edge of the sharp blade on the back of Logan’s neck, nicking the flesh slightly. He raises the blade high. Logan braces for the end... CLOSE ON: The cut on Logan’s neck healing: CLOSE ON: The Soldier’s eyes widening. The Soldier lowers the blade, cuts Logan’s cheek and watches it heal. A drop of blood runs from Logan’s cheek onto the engraved steel - unmistakably the same blade he will hold in a Tokyo hotel room 70 years hence. The Soldier raises the sword and strikes.  WHACK   - he hacks the bamboo pinning Logan’s right arm. Then he drops the sword in the pit. Confused but grateful, Logan grabs the blade as:  20.",
      "characters": [],
      "action_text": "The Soldier walks a few yards from the pit, listening with a mixture of fear and fascination to the sound of Logan painstakingly cutting himself free. The Soldier slowly draws a secondary short sword from his belt... waiting to face this unique enemy. Then: Logan leaps cat-like out of the pit, sword in hand, pulling the last piece of bamboo from his shoulder, the rest of his wounds already healed. The Soldier shouts in Japanese, demonstrating with his short sword how Logan should defend himself. Uncertain, Logan raises his sword and.  CLANK/CLANG/SMACK   - The Soldier charges, hits Logan’s blade, slaps him with the flat side of his sword and is back in place before Logan can blink. We can’t understand his words, but the Soldier’s attitude says it plain: “No, no. No. Do it like this.”  CLANK/CLANG/SMACK   - He does it again, smiling this time. Now Logan is mad. He raises the sword, ready.  CLANK/CLANG/SMACK   - Logan blocks the last strike, simultaneously extending his bony claws - tearing the Young Soldier’s cheek. The soldier staggers back, stunned, watching as Logan’s claws retract, swallowed by the rapidly healing skin around his knuckles. THE SOUND OF GUNFIRE turns their heads. In the distance, JAPANESE SOLDIERS are the ones running now, chased by A WAVE OF BRITISH SOLDIERS. The Soldier knows he’s doomed. He drops to his knees bows his head and waits for Logan to finish him. But Logan offers the sword handle-first. The Soldier is surprised yet again by Logan. He takes the sword as he stands. Logan nods to him: “Go. That way.” But the Soldier is torn. Ready to fight impossible odds. Logan puts a hand on his shoulder - his eyes desperate for the boy. “Go.” The Soldier nods and runs to fight another day.  INT. PALATIAL HOTEL SUITE - DAY  LOGAN  The’hellizzah-  Logan wakes from a deep sleep on the sofa, rain beating the windows. The sword is back in its stand.  21. The door opens behind him. He inhales. LOGAN (CONT’D) Good morning, Zen. ZEN I trust that you slept we",
      "dialogue_count": 0,
      "word_count": 3190
    },
    {
      "scene_number": 7,
      "slugline": "EXT. ALLEY - DAY  Samurai   continues to carve up the pavement until A LONE COP at the end of the alley points and yells. Samurai sees him and freezes. The Lone Cop looks away long enough to call OTHER OFFICERS over. When he turns back, Samurai is gone.  INT. DRAIN-TUNNEL - DAY  Logan catches another ladder with one hand, holding Mariko with the other. They climb, emerging into:  INT. BOILER ROOM - DAY  A giant heating system hums. Logan’s claws pierce a man-hole cover and shove it aside. He climbs out, pulls Mariko up and then collapses, exhausted. Mariko kneels over him, his wounds miraculously washed away. Their eyes meet. Mariko kisses him - gentle but lingering - a little more than thank you. LOGAN Have we met before? MARIKO I think I would have remembered. LOGAN Don’t be too sure. (standing, sore) ‘Should get you someplace safe. He heads for the door and opens it to: Sirens walking, POLICE EVERYWHERE. Chaos. He shuts the door quickly, looking around. MARIKO I’m safe with you. She stares at him, her eyes hypnotic. LOGAN In case you hadn’t noticed, lady, I’m barely holding my own. (she keeps staring) And whatever kind of trouble you’re in... I’m worse.  32.",
      "characters": [],
      "action_text": "MARIKO You’re the trouble I choose. LOGAN Aren’t you getting married? MARIKO Eventually. Logan looks toward a staircase on the far side of the room, leading up. He sighs. LOGAN This way, then... And he reads her up the stairs...  EXT. AUDITORIUM - DAY  Chaos and confusion as the police cordon off the area. In the rain-soaked crowd we find Zen and Yukio escorting Shingen to an ambulance. SHINGEN (in Japanese) [Where is my daughter?] ZEN [We’ll find her, Sama. First we need to tend to that arm.] They reach the ambulance and Shingen steps in back. MEDICS swiftly slice off his jacket and shirt, revealing a surprisingly ripped frame for his age. LOW ANGLE LOOKING UP as Zen goes to shut the door: SHINGEN [Find Mariko, do you hear me? Nothing else matters.] ZEN [I will search high and low, Sama.] He is unaware that BEHIND HIM AND HIGH UP, Logan and Mariko make their getaway along the rooftop. Shingen slumps back into the ambulance. The medics go to work as Zen and Yukio shut the doors and stand guard. ACROSS THE STREET THEY SEE: Justice Minister Noburo talking to a MOB OF PRESS.  33. NOBURO [... but my staff reacted swiftly and the would-be assassins were pacified. I credit the fine men of the Tokyo Police for putting down the second wave of the attack.] REPORTER [Witnesses say Lord Shingen was the target of the attack and not you. Do you have any idea why someone would want to kill Lord Shingen?] NOBURO [This brazen and cowardly act happened just days after I proposed a crackdown on organized crime-] REPORTER [Are you saying this is the work of the Yakuza?] NOBURO (stepping away) [I am saying this brazen and cowardly act happened just days after I proposed a crackdown on organized crime. Draw your own conclusions. No more questions.] Noburo, his Bodyguards and his knock-out Secretary pile into two waiting limos amid a flurry of shouted questions that will remain unanswered. Just before he gets in the car, Noburo looks ACROSS THE STREET TO: Shingen, emerging from the ambul",
      "dialogue_count": 0,
      "word_count": 686
    },
    {
      "scene_number": 8,
      "slugline": "INT. LOGAN’S PALATIAL HOTEL SUITE - BATHROOM - LATER  The opulence of the suite provided by Zen stands in stark contrast to the wet, bedraggled occupants entering. Logan carries Mariko across the threshold. Mariko is chilled to the bone. Logan rushes into the shower, clothes and all, turning the water on full. He tries to put her down, but she clings to him, staring into his eyes. He moves to speak and she puts a hand on his mouth. She doesn’t want to talk. When he tires to talk anyway, she kisses him. Then the gentleman gives way to the animal...  INT. PALATIAL HOTEL SUITE - BATHROOM - LATER  A trail of wet clothes leads from the shower to-  INT. PALATIAL HOTEL SUITE - BEDROOM - NIGHT/DAY  -the bed where Mariko sleeps peacefully. Logan stands over her, wounded look on his face, put there by deep suffering in his forgotten past. AN anguish without a name. DISSOLVE AS: The sun rises. Logan has hardly moved. Mariko stirs, looks around, about to ask “did we?” LOGAN You were asleep before you were out of the shower. She is at once relieved and disappointed. MARIKO How long have you been- LOGAN All night. Pause. Logan stares at Mariko. MARIKO The way you look at me. LOGAN What about it?  35.",
      "characters": [],
      "action_text": "MARIKO I remind you of someone you used to know. LOGAN. No... Someone I used to be... She studies him for a moment. MARIKO Why are you here? In Japan. LOGAN Are you really going to marry him? This catches her off guard. She recovers. Nods. LOGAN (CONT’D) Just like that. MARIKO It is my duty. I accept that. LOGAN But is it what you want? MARIKO What I want doesn’t matter. I serve something greater. LOGAN The House of Yashida. MARIKO You understand. LOGAN Not really. MARIKO ... You should sleep. LOGAN I gave it up. She smiles, doesn't buy it. After a beat: MARIKO Come. She moves over in the bed, making room for him. Logan hesitates, but her eyes insist. He sits on the bed, unsure. Mariko gently pushes him back on the pillow.  36. She touches his cheek, tracing a finger gently across his lips, his eyebrows. MARIKO (CONT’D) Close your eyes. (as he does) When I was a little girl I had terrible nightmares. My father would say go back to sleep. Face your fears. LOGAN There’s a few fears I’d like him to meet. MARIKO (ignoring this) My grandfather was different. LOGAN Tell me about your grandfather. MARIKO You knew him. LOGAN We only met briefly. MARIKO Another time. Where was I? LOGAN Your father said ‘face your fears.’ MARIKO Ah, yes. He did. But my   grandfather  would tell me stories about   Kuzuri.  A fierce and terrible creature that would do whatever I commanded. He would protect me from my fears. LOGAN ...   Kuzuri.  MARIKO Mmm-hmmm. Half-man, half-beast - a heart filled with rage... And six... long claws. He opens his eyes. She nods: “You heard right.” LOGAN Did the nightmares stop?  37. MARIKO Yes... But even as a little girl, I never believed he was real. She touches his eyes, closing them gently. MARIKO (CONT’D) So now...   Kuzuri ... Do as I say. Close your eyes. And let me watch over   you . She kisses him once, twice, a third time. Logan beings to respond, but then: MARIKO (CONT’D) Now sleep. He closes his eyes and exhaustion takes over as: MARIKO (CONT’D) He ",
      "dialogue_count": 0,
      "word_count": 1000
    },
    {
      "scene_number": 9,
      "slugline": "INT. PALATIAL SUITE - BEDROOM NIGHT  Each night she lays him down, talking softly in his ear, holding his hand or rubbing his shoulders - then watching over him while he sleeps fitfully, touching him reassuringly at the slightest sound of distress. And, each night, he sleeps a little easier.  INT. PALATIAL SUITE - BEDROOM - LATER  Mariko is picking up his clothes when something drops from his pocket and plunks on the carpet. She picks the object up, her expression darkening.  INT. PALATIAL SUITE - BEDROOM - DAWN  CLOSE ON: Logan’s eyes rolling behind his eyelids in REM sleep. He wakes not with a start, but a mere flinch, happy to find Mariko watching over him. MARIKO Another nightmare? LOGAN No. A dream. He smiles. She doesn’t. She holds out her palm, revealing the green pearl. There is fear in her eyes. MARIKO Where did you get this? LOGAN What is it with that thing? Mariko signs and sits on the edge of the bed. Beat: MARIKO Before Kofun, before Asuka, there was the age of Jomon... The darkest days of a remote island kingdom. Before it was called Japan...  EXT. YASHIDA STRONGHOLD - DAY  Est. The ancestral home of the Yashida family, high in the hills overlooking the Port City of Agarashima.  40.",
      "characters": [],
      "action_text": "High-walled, sparsely-lit garden pavilions, elegant, understated buildings, sprawling gardens, a placid pond. An oasis. A fortress. A home in mourning.  INT. YASHIDA STRONGHOLD - SHINGEN’S OFFICE - DAY  CLOSE ON: Two ancient, magnificently ornate swords. The symbols of a venerated family empire. They are behind Shingen, seated at his desk, his collar open, hands to his temple, a bandage on his forearm. He is surrounded by ADVISORS and STAFF, all in dark suits. ADVISOR We have done what we can to control the press, but... word is quickly spreading that you personally fought off the attackers. Shingen looks up at him as if to say: “So?” ADVISOR (CONT’D) You have honored the family name, Sama. SHINGEN Where is   my daughter ? All of the Advisors shift uncomfortably. ADVISOR The... police have every available man looking for Mariko... and they are interrogating the assassin who survived. But... SHINGEN ... But. ADVISOR He is not a kidnapper, Sama. He is an assassin. SHINGEN What about this other man? The gai-jin with the... At a loss for words, he holds up three fingers on each hand. No one speaks up. SHINGEN (CONT’D) No one here can tell me   anything   about him?  41. ADVISOR We have only your... remarkable description, Sama. SHINGEN Bring me my father’s will... And find Zen. MARIKO (PRE-LAP) I think you have been marked.  INT. PALATIAL SUITE - LIVINGROOM- DAY  Mariko pours tea as Logan studies the green pearl. LOGAN Marked... MARIKO By the Black Clan. (as Logan scoffs.) It is said they do not eat or sleep until they’ve killed their intended victim. But first they send a warning. A single, sea-green pearl. LOGAN Come on. What sort of assassins  tell   you they’re coming? MARIKO Assassins bound by a strict code of honor. They do not kill for a living. Killing is their way of  life ... it is their   faith . And this pearl is a warning. Your only chance for survival. LOGAN Yeah, howzzat? MARIKO According to myth, you must challenge their master and kill him in combat. No",
      "dialogue_count": 0,
      "word_count": 1732
    },
    {
      "scene_number": 10,
      "slugline": "INT. SUMO ARENA - DAY  The rippling back of a SUMO WRESTLER, his diapered back-side roaring toward us, feet scrambling for purchase. The wall of blubber flies over our head and  WHAM   - Lands like so much uncut Kobe at Logan’s feet where he sits calmly puffing a cigar in the front row of a CHEERING, CHAIN SMOKING AUDIENCE. ON THE PLATFORM ABOVE, THE WINNING SUMO raises his arms in victory, flinging sweat. Logan blinks, rubs one eye, disgusted but cool. Then he looks over at: AN EXECUTIVE BOX containing a DOZEN MEN IN SHARK-SKIN SUITS and SUNGLASSES. Kurusawa’s Goodfellas. The Mob. YAKUZA Rank is obvious, factoring age, body-language, amount of overall movement. The OLDEST MAN, mid-60s, sits dead center, motionless, with GOONS whispering in each ear. He is obviously the top dog. The Big Man. THE OYABUN Logan studies the box for a while then stands and heads that way. It takes a moment before he sense someone walking in step behind his right shoulder. He stops, turns, comes to face to face with: YUKIO LOGAN ‘The hell are you doing here? YUKIO I am your bodyguard. LOGAN My what? YUKIO Your bodyguard. Orders of Mr. Zen. LOGAN Go wait in the car. Yukio doesn’t move. Logan sighs. LOGAN (CONT’D) I don’t have time to spar with you. Just follow me and keep your mouth shut, KATO.  49.",
      "characters": [],
      "action_text": "YUKIO Yukio. LOGAN I   what ? YUKIO Yukio. It’s my name. Logan sighs, approaches the executive box. BODYGUARDS block his path. One tucks a hand in his jacket. LOGAN That hand comes back empty or I break it off, Cagney-hito. BODYGUARD [Private party. Go round.] LOGAN I want to talk to the Oyabun. The Bodyguards blanch - the very word should not be spoken. Logan points right at the top man. LOGAN (CONT’D) Right there. The Oyabun. That’s what they call him, right? The Oyabun does not react, even if every other Goon in the box does. The Bodyguards press close, one of them jabbing a gun in Logan’s ribs. LOGAN (CONT’D) You’re going to have to eat with a fork when I’m done with you- VOICE (O.S.) YOU. Logan turns. A SLICK, LEAN GANGSTER, Japan’s answer to Frank Sinatra, stands in the box, pointing at Logan. Over his shoulder, the Oyabun sits stone-like. SINATRA What is it you want? LOGAN I want to talk to your boss. SINATRA Why would he want to talk back?  50. LOGAN ‘Cuz I’m the white devil killed three of his clowns the other day. Beat. Sinatra jerks his head to the two bodyguards. SINATRA [Bring him around.] They shove Logan and Yukio. Logan plays along.  INT. SUMO ARENA - BACKSTAGE CORRIDOR - DAY  Logan and Yukio are escorted down a long, narrow corridor lined with FAT, FAT MEN waiting to go on. LOGAN Like a drive-thru car-wash in here. Yukio cracks a smile. A door opens to REVEAL:  INT. LOCKER ROOM - DAY  “Sinatra” stands, The Oyabun sits, motionless. The air is already thick with their cigarette smoke. SINATRA He clean? The Bodyguards nod. Sinatra nods back. The Bodyguards push Logan in, stop Yukio from following, and shut the door. Logan pulls a cigar. LOGAN Mind if I... you know what... I’ll just breathe. He puts the cigar away. SINATRA You wanted to talk. Start talking. LOGAN Leave the Yashida family alone. Beat. SINATRA Is that the speech.  51. LOGAN That’s the speech. Anything happens to Shingen or his daughter, I’ll skin your boss and turn him into a track-suit. ",
      "dialogue_count": 0,
      "word_count": 1214
    },
    {
      "scene_number": 11,
      "slugline": "EXT. STATE RESIDENCE - NIGHT  A far cry from the ancient Yashida Stronghold. This mountain-top estate is modern, with imposing iron gates, a moat, garish lights and ARMED SECURITY.  INT. STATE RESIDENCE - SECURITY STATION - NIGHT  MORE GUARDS watch security monitors - cameras covering nearly every square inch of the compound.  INT. STATE RESIDENCE - OFFICE - NIGHT  Noburo’s Secretary, working late, types on a laptop, looking over the rims of those glasses. She doesn’t see the shadow slide past the open door behind her...  INT. STATE RESIDENCE - NOBURO’S BEDROOM - NIGHT  Noburo is even pompous in his sleep. That is until:  SCHANK   - Three blades impale his pillow close enough to nick his earlobe. Noburo’s eyes spring open, along with his mouth. Logan looms over him in nothing but jeans and a t-shirt, soaking wet, he came by moat. Noburo inhales to scream and:  SCHLICK   - A second set of claws spring forth, the middle blade gently resting on Noburo’s tongue. LOGAN Shhhh. Don’t want to wake the babe. Noburo glances to his left where a TRAMPY YOUNG WOMAN is sleeping, snoring slightly, a hand-cuff dangling from one wrist. One the floor we see an assortment of leather props and sundries. Noburo’s a freak. LOGAN (CONT’D) Tying up a few lose ends before the wedding? Noburo’s eyes darken. Startled, but not scared. LOGAN (CONT’D) The truth is a funny thing. Nobes. It always comes out. Always... I know about your deal with the Yakuza.  55.",
      "characters": [],
      "action_text": "LOGAN (CONT’D)  And when it comes to light, you’ll bring disgrace on Mariko’s family. Now as the House Yashida’s self- appointed enforcer, I can’t have that. So... tomorrow morning you’ll make a formal announcement calling of the wedding. That, or I come back here and take out your tonsils... Through your forehead.  SCHINK   - His claws retract, leaving a hairline cut down the center of Noburo’s tongue. Noburo laughs. LOGAN (CONT’D) You need counselling, bub. NOBURO Me disgrace Mariko’s family? I am the only thing standing between her and disgrace. The Old Man was a fool. How much money do you think was left after a lifetime wasted helping the sick and the poor? Where d you think Shingen’s money comes from now? It’s the first rule of money, gai-jin. Behind every green fortune... is a crime. Logan considers this, knowing it’s unusually true. NOBURO (CONT’D) And you’re wrong about the truth. It doesn’t have to come out, Not if you marry the man in charge of looking for it... TAKE HIM. Logan springs without looking half an instant before an arrow punches into the head-board directly over Noburo. A single drop of liquid drips from the shaft and onto Noburo’s forehead. He screams as: Logan rolls and comes up on his feet. A second bold catches him between his neck and shoulder. It over-penetrates, exposing the narrow steel tip, Steaming poison drops from a hollow point. CLOSE ON: A mechanical, auto-loading compound crossbow swiftly prepping another shot. A pair of slender, GREEN GLOVED HANDS shoulder the crossbow to REVEAL THE FACE OF:  56. NOBURO’S SECRETARY, no longer in her business-attire, but a skin-tight, backless green number, complete with a black gun-belt and boots. The butt of the cross- bow pushes back that sultry lock of hair to reveal a long, strangely appealing scar on her cheek. We liked her before. Now we’d gladly let her beat us to death. This is VIPER  KA-SHUNK KA-SHUNK KA-SHUNK -   The crossbow spits out bolts, two per second. Logan dodges, charges, clo",
      "dialogue_count": 0,
      "word_count": 821
    },
    {
      "scene_number": 12,
      "slugline": "EXT. STATE RESIDENCE - NIGHT  Crash   - Down he falls, landing flat on his back with a sickening smack, sinking like a bleeding stone. INT. NOBURO’S BEDROOM - NIGHT The coast clear, Noburo leaps from his bed, a perfect pit burned into the center of his forehead. Viper gets up as SECURITY GUARDS charge in. They all rush to the window and look down at the settling water. NOBURO [WHAT ARE YOU DOING JUST STANDING HERE? FIND HIM.] The Guards rush out. Noburo’s Trampy Mistress stirs, wakes up. She looks at the wrecked room, the smashed window, Viper in her green get-up. She rubs her eyes. TRAMP [this is too much even for me.] Viper picks up the bolt Logan pulled from his shoulder, studying traces of his blood. Fascinated.  EXT. STATE RESIDENCE - NIGHT  In the distance, SECURITY GUARDS search the inner bank of the moat with dogs and flashlights. Now floodlights are coming on. An alarm wails. IN THE FOREGROUND: Logan emerges from the moat, trembling, pale and weak. The wounds on his arm and shoulder are welted and purple. One by one, the flashlights turn this way. VOICES SHOUTING. DOGS BARKING. Then GUNSHOTS. This whole thing is going to hell fast. Logan plunges into a nearby line of trees and-  EXT. STATE RESIDENCE - CAR-PARK - NIGHT  -emerges at the top of a high garden wall overlooking the long driveway, bullets nipping the foliage behind him. He falls, landing on his head. Lying there he spies a row of vehicles with government insignias. Noburo’s.  58.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 259
    },
    {
      "scene_number": 13,
      "slugline": "INT. GUARD HOUSE - SECURITY GATE - NIGHT  A heavy steel security gate just outside. TWO GUARDS load rifles. There is too much traffic on the radios to make sense of what’s going on. 1ST GUARD [What is it? What are they saying?] 2ND GUARD [An intruder at the house, I th-]  WHAM -   a heavy Bentley sedan blasts through the gate behind them. The Guards are still staring when FOUR GUARD VEHICLES come roaring after it. 1ST GUARD [Was that the Boss’ car?] The sound of screaming rubber takes us to:  EXT. MOUNTAIN RAODS ABOVE TOKYO - NIGHT  The Bentley roars past, winding along the narrow cliff-side roads, fishtailing wildly.  EXT. BENTLEY - NIGHT  Logan navigates treacherous roads, struggling to stay conscious, vision blurring badly. Through the window behind him we see the cars in pursuit, vanishing and appearing again with every hairpin turn.  EXT. MOUNTAINSIDE - NIGHT  The Bentley and the four security vehicles whip past. We linger, turning and looking down the mountain at: DOZENS OF FLASHING LIGHTS. POLICE CARS coming.  INT. BENTLEY - NIGHT  LOGAN’S P.O.V. The dashboard is a blur, the road alternates from serpentine to hallucinatory serpent.  PA-KACK   - His brow furrows, annoyed. He’s being shot at. He punches the gas, yanks the wheel:  59.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 212
    },
    {
      "scene_number": 14,
      "slugline": "EXT. MOUNTAINSIDE - NIGHT  And careens off the mountain road, down a steep rocky slope, banging off trees and-  Smash -   landing hard on the same road, just lower down the mountain. Logan’s idea of a shortcut.  INT. SECURITY VEHICLE - NIGHT  TWO SECURITY MEN see the Bentley’s tail-lights vanish around a curve. The DRIVER guns it, gaining speed. The road ahead narrows, enters a dark tunnel and: TAIL-LIGHTS APPEAR. The Bentley is stopped. The Driver hits the breaks, tires wailing and  INT. BENTLEY - NIGHT  Logan leans back in his seat as  WHAM-WHAM-WHAM... WHAM   - All four pursuing cars pile up into the Bentley’s ass-end. A moment later: A FLEET OF POLICE CARS come screaming up the road from the opposing direction. Logan shields his eyes. Twelve police cars smash into the Bentley’s grill.  EXT. TUNNEL - NIGHT  Dazed and battered COPS and SECURITY PEOPLE stagger out of their smashed vehicles. The Bentley is crushed to about five feet long. And empty.  EXT. MOUNTAINSIDE - NIGHT  ABOVE US, steaming engines and shouting men. BELOW US, Logan lets gravity carry him staggering down the mountain toward the distant city lights.  EXT. STREETS OF TOKYO - NIGHT  Logan drags himself toward the hotel, stopping when a massive outdoor TV screen shows a familiar face: HIS OWN  60.",
      "characters": [],
      "action_text": "The news is covering a home invasion at the residence of the Minister of Justice. Just then, POLICE CARS drive up to the Hotel and a dozen police jump out. Logan slinks into the shadows - a fugitive now.  EXT. TOKYO BACK-ALLEY - NIGHT  Agonized, trembling, he huddles between two dumpsters, fading in and out of consciousness. ACROSS THE ALLEY: Bright lights blaze through the floor-to-ceilings windows of a clean white room. Inside, MEN IN WHITE KARATE GI’S all black-belts practice champion-level martial arts. This is not a school about show. These guys play for keeps, honing their skills with open hand knives, swords staffs. Logan stares at tis absently until his eyes go.  BLACK  No sound. A bright flash. Sparks. A liquid casket. Red-hot molten metal, an explosion of steam. Logan’s dreams mix with semi waking reality in feverish delirium images of war and anguish blend with the increasingly intense fighting of the martial artists. THAT WOMAN walks down a long, windswept beach - then her limp body in Logan’s arms. Then the Young Soldier in the Jungle, nodding to him, running away to live another day. Then Noburo. Mariko. Shingen... NOBURO (V.O.) Behind every great fortune... is a crime. Logan opens his eyes to the blaring of car horns, the noise of traffic and blinding sunlight. We are:  EXT. TOKYO BACK-ALLEY - DAY  His wounds have closed, but they have not fully healed. In fact, they look almost... human. The martial arts school is empty. Maybe it always was. Logan stands, a determined look in his eye. He walks out of the alley, through the dense foot traffic and into the street. A horn blares, breaks shriek, a truck skids to a stop, just missing him.  61. Logan ignores it, keeps walking. A TRUCK DRIVER screaming at him from behind the wheel. We notice a name emblazoned across the truck’s container: YASHIDA  EXT. SHIPYARD - DAY  MATCH FRAME to an identical container. PULL BACK SLOWLY TO REVEAL another and another... then thousands more. PULL BACK WIDE TO REVEAL: The P",
      "dialogue_count": 0,
      "word_count": 7786
    },
    {
      "scene_number": 15,
      "slugline": "INT. SMELTER - DAY  Shingen observes STEEL-WORKRERS as they pick up pieces of the glowing skeleton with iron tongs. CLOSE ON: NUMEROUS HANDS assembling the skeleton, connecting joints with wooden pegs and leather. PAN OVER TO: Schematics taken form the box intended for Logan - blueprints for the design of Logan’s own adamantium skeleton. PUSH IN ON THIS AS: A SERIES OF DISSOLVES carry us over:  INT. NOBURO’S BEDROOM  Mariko in a night-gown at a dressing table, removing make-up, revealing the unhappy woman underneath. She looks in the mirror at: Noburo, his corpulent frame lying on the bed in black socks, boxers and an undershirt, snoring.  INT. WORKSHOP - NIGHT  Viper studies the crossbow bolt pulled from Logan’s shoulder and the traces of dried blood there. She then consults select pages from   PROJECT: WOLVERINE.  CLOSE ON THE HEADING TOXINS: KNOWN VULNERABILITIES  INT. FORGE - NIGHT  Kenuichio carefully sharpens the edge of his sword with a well-worn stone, resting a piece of paper on the blade and watching its own weight cut the parchment in two. Then he sharpens some more.  INT. YASHIDA STRONGHOLD - NIGHT  Shingen in a workout room, shirtless, honing his martial arts skills on something O.S. He hits it with hands, swords, spears, knives, the intensity of the workout ever-increasing until we:  96.",
      "characters": [],
      "action_text": "PULL BACK TO REVEAL: His practice dummy: A blackened steel copy of Logan’s skeleton - right down to his six claws -arms raised in defense.   Sinewy leather joints it together. Animal-hide bladders - representing internal organs - fill the chest cavity. Shingen learns how to avoid Logan’s indestructible skeleton altogether. From across the room, he throws a knife with stunning accuracy - the blade passing between two ribs, impaling the soft heart. With a simple short sword he charges, hacking off one arm at the elbow, the other at the shoulder. Then he strikes the neck precisely, finding the space between two tightly fitted metal vertebrae and:  SCHAK   - “Logan’s” skull rolls across the floor. A winded, sweating Shingen smiles. Ready.  INT. LIMOUSINE - NIGHT  We end on Yukio, staring up at the forboding Yashida Stronghold - her home if she wants it. But does she? She shakes her head as if to say she regrets what she is about to do. Then she puts her car in drive.  INT. GAMBLING PARLOR - NIGHT  Tracking shot through the energized chatter of a smoke-filled late-night underground city of sin for the international high-roller. Lots of tables, all of them packed - a large bar backed by a mirrored aquarium filled wit choral and man-o’-war jellyfish. It’s strictly jacket-and-tie. Stunning women decorate the men who can afford/don’t deserve them. Big money changes hand, most of it Euro and Yuan. The Oyabun himself plays dominoes with a few minions. AT THE BAR “Sinatra,” (or at least Japan’s answer there-to) keeps one eye on the scene while fending off numerous carnal opportunities. Then she walks in: She wears a red dress cut dangerously low, a slit up one side riding scandalously high. Men step aside at her approach as if she might set them on fire. One has to admit, Yukio cleans up nice. Sinatra sees her coming and quickly shoos a BRAZILIAN BOMBSHELL off her stool.  97. Yukio eases into the opening and offers a mind- melting smile before whispering in his ear. Sinatra’s s",
      "dialogue_count": 0,
      "word_count": 2469
    },
    {
      "scene_number": 16,
      "slugline": "INT. MERCEDES - NIGHT  Yukio come to, dazed. Unaware the car is moving, she opens the door and steps out, landing hard. The Mercedes rolls off the pier and into the water. The trunk opens on impact, REVEALING NOBURO - eyes wide with terror - just before the trunk inhales water and the car sinks like a stone. ANGLE ON: Samurai, as he kicks Logan onto his back. SAMURAI Accept your destiny, gai-jin. Go to the Stronghold. Face Shingen. If not, she dies.  WHACK -   Samurai kicks Logan under the chin, snapping his head back and knocking him out cold. Mariko is dragged away, looking back at Logan as things go:  BLACK INT. YASHIDA STRONGHOLD - SHINGEN’S OFFICE - NIGHT  WHITE GLOVED SERVANTS take down the Yashida Family swords, carrying the precious relics reverently.  INT. YASHIDA STRONGHOLD - NIGHT  Viper scrapes the small traces of Logan’s dried blood from the crossbow bolt into a porcelain bowl, mixing it with a minute amounts of other compounds in a thin glass tube, distilling it over an open flame. The result: A SINGLE DROP OF BLOOD RED LIQUID. The care with which she handles it tells us it is highly lethal. LATER: Viper melts pale green wax over a candle until it is the consistency of water. She adds the single drop of red liquid to the green wax, mixing it in. LATER: she dips A DAGGER, its blade ornately engraved, into the molten wax. As it cools, the wax in the blade’s engraving appears pale green - more like patina than lethal poison.  107.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 263
    },
    {
      "scene_number": 17,
      "slugline": "INT. YASHIDA STRONGHOLD - TEMPLE - NIGHT  Shingen prays on his hands and knees, incense burning, sensing a presence. Opening his eyes. Viper offers the green-bladed dagger. VIPER One cut... And you’ll kill him. Shingen shakes his head, no. Viper grins, shrugs. VIPER (CONT’D) If all else fails. He reaches for the blade but stops himself, unsure. SHINGEN Victory without honor VIPER But   certain   victory. Now she’s got him. Shingen considers this temptress, his hands hovering over her knife, interrupted by: VOICE (O.S.) SHINGEN!  INT. YASHIDA STRONGHOLD - GREAT HALL - NIGHT  Samurai, still in his armor, helmet under one arm, casts a long shadow across the floor of the grand entrance. He holds Mariko by the wrist. SAMURAI SHIIIIINGENNNNN. SHINGEN (O.S.) What is the meaning of- Shingen emerges on the second floor balcony. When he sees Samurai’s face: SHINGEN (CONT’D) You. SAMURAI I have come home, father. MARIKO  Father?  108.",
      "characters": [],
      "action_text": "Mariko blinks. She can tell by her father’s face that Samurai is not speaking metaphorically. Shingen descends to greet his bastard face-to-face. SHINGEN How dare you show your face here. How dare you lay a hand on m-  SHING   - Samurai drops his helmet and draws his sword - the tip cracking just under Shingen’s chin. SAMURAI - my   sister. SHINGEN What do you want? SAMURAI The animal is coming to claim her. You will face him Whoever is left will face me and then I... Will be Master of The Black Clan. Shingen considers, clearly plotting. Then: SHINGEN Very well. I accept. Let her go. SAMURAI You are not the Master yet. SHINGEN Ignorant boy... I am Lord Shingen of the House Yashida, standing in the great hall of my ancestors and I am telling you now... I   will  win... In fact, I   cannot   lose. The sound of a weapon cocking O.S. Samurai hauls Mariko in front of him, his blade to her throat as a figure appears at the top of the stairs. Viper aims a crossbow right at him. Samurai’s eyes widen, his soul drops. SAMURAI No... SHINGEN You see? I gave you more than you ever knew...  109. Viper smiles, shrugs, “What can I say, kid?” Samurai lets Mariko go, heartbroken. Shingen waves to Viper. She lowers her weapon. SHINGEN (CONT’D) The boy has too much potential. (to Samurai) It would be a shame to waste it.  EXT. YASHIDA STRONGHOLD - FRONT GATE - NIGHT  Logan and Yukio arrive in her car. Guards merely glance at them before letting them pass.  EXT. YASHIDA STRONGHOLD - TREELINE - NIGHT  A treeline at the edge of the property. Nothing remarkable. Until A PAIR OF EYES OPENS. The Monk is standing right in front of us. He is watching the car head toward the stronghold.  INT. YASHIDA STRONGHOLD - GREAT HALL - NIGHT  The house is still. Dark. Eerie. Logan enters, inhaling deeply through his nose. LOGAN This way...  EXT. JAPANESE GARDEN - NIGHT  A full moon casts cold blue light over a magnificent garden complete with ponds, bridges, pagodas - like a painted backdrop fora grand s",
      "dialogue_count": 0,
      "word_count": 4284
    }
  ]
}