{
  "slug": "the-handmaids-tale-211-holly-2018",
  "title": "the handmaids tale 211 holly",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 6058,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. GARAGE - CONTINUOUS 2   2 Offred tries the side door. Locked. She rubs frost and dirt off the tiny window with her sleeve. Inside, under a cloth cover, is a CAR. Muscular, gas- guzzling, pre-Gilead. A beloved hobby project. The possibility of escape. Freedom. Offred’s panic melts away. She urgently tries the door again with more force, but without success. She needs a key. Heading back to the house with purpose, she stops dead in her tracks. A WOLF watches her from the edge of the woods. A wild, dangerous thing, untamed by Gilead. It’s an image from a fairy tale, Red Riding Hood facing off against the Wolf, but all too real. OFFRED (V.O.)  My, what big eyes you have.  Fear spikes through Offred, but the wolf doesn’t approach. OFFRED (V.O.)  When I was little, my mom would never take me to those princess movies. I remember hating her for it. But now I know why. In the real world, you can’t wait for a prince.  Wary, she continues on her way back to the house. OFFRED (V.O.)  Happily ever after is up to you.  ON Offred, resolute. She has a chance to get herself and her baby out of here, just like she promised. END OF TEASER  THT   Production Draft   Ep. 211 \"Holly\" 1/25/18   2.",
      "characters": [],
      "action_text": "ACT ONE OMITTED 3   3 INT. LAKE HOUSE - FOYER - LATE AFTERNOON 3A   3A Offred hurriedly searches for keys to the garage and the car. Anywhere she flips the light switches, nothing happens. Power’s shut off. Offred checks the tchotchkes and furniture by the front door, every place you’d keep extra keys. No luck. CUT TO: OMITTED 4   4 INT. LAKE HOUSE - KITCHEN - MOMENTS LATER 4A   4A The faucet DRIPS, keeping the pipes from freezing. Offred rifles through junk drawers in the kitchen. Still nothing. The family center/bulletin board, the calendar still turned to a summer month (wordless, of course), holds only empty key hooks. An open door gives view onto an OFFICE, a decidedly male room. The kind of room for the man who’d own that car. CUT TO: INT. LAKE HOUSE - OFFICE - MOMENTS LATER 5   5 The inner sanctum of another Commander. Unsettling to Offred. She takes in the books and maps. Photos of him with his fishing buddies. A few taxidermy birds and animals, hunting trophies. Smart of that wolf to come around in deep winter, when no one’s home, or he could be on the wall too. Offred goes to the desk and opens drawers. Then she sees a KEYCHAIN, holding both house keys and car keys, in a lumpy clay BOWL on the desk. Success. Her triumph fades when she picks up the bowl, registering that it’s something a child made. Something Hannah made. (CONTINUED)  THT   Blue Revisions   Ep. 211 \"Holly\" 2/11/18   3. The desk is full of Hannah reminders. CONTINUED: 5   5 (CONTINUED)  THT   Blue Revisions   Ep. 211 \"Holly\" 2/11/18   3A. A mug painted with flowers and hearts holds pens and pencils. Crayon drawings sit framed around the desk, along with snapshots of Hannah and her adoptive PARENTS. Laughing, picnicking, having fun by the lake. Bittersweet, this all lands on Offred like a body blow. Because it means that Hannah is loved. She left Hannah, and now someone else loves her.  FLASHBACK TO:  EXT. PRE-SCHOOL ENTRANCE - MORNING -   FLASHBACK 6   6 The usual morning mayhem of PRESCHOOL",
      "dialogue_count": 0,
      "word_count": 3471
    },
    {
      "scene_number": 2,
      "slugline": "INT. GARAGE - DUSK 22   22 Offred struggles in with the shotgun and shells. Drops them in the car. The plan’s still on, labor be damned, but she has no time to lose. She reflexively hits the wall button for the GARAGE DOOR OPENER but nothing happens. Right, no power. Thinking quickly, Offred goes to the emergency disconnect CORD and yanks it, disengaging the opener from the door. She’ll lift it up manually. She tries. But it doesn’t budge. Frozen to the ground, or the metal parts have contracted from the cold. She’s hit with another CONTRACTION. It hurts. Bad. OFFRED Holy shit. Breathing through it, Offred gets into the car, STARTS it, FLOORS it, and throws it into REVERSE, trying to shove the door free with the car. OFFRED (CONT’D) C’mon c’mon... It doesn’t work. FUMES and acrid TIRE SMOKE billow into the garage. Dangerous for her, dangerous for the baby. OFFRED (CONT’D) Goddammit! Offred turns off the engine. Still thinking, still not giving up. CUT TO: EXT. GARAGE - DUSK 23   23 In the twilight, Offred tries again to lift the garage door. And fails again. She attempts to pry it up with the handle of a rake, straining, but the door’s stuck solid. She SLIPS and FALLS, landing hard on her side. (CONTINUED)  THT   Blue Revisions   Ep. 211 \"Holly\" 2/11/18   19.",
      "characters": [],
      "action_text": "Offred attempts to get up but another CONTRACTION keeps her down, panting with effort and pain. Doubtful she could drive in this condition, not that that’s possible now. She struggles to sit up and sees WETNESS spreading between her legs, staining her dress and cloak. OFFRED No. Please. Not yet. But there’s no doubt. Her WATER HAS BROKEN. The baby is coming. The door is not going to open. She is not escaping. A wave of hopelessness crashes over Offred. Shattered and despairing, a hostage of her own body and the baby now imminently on its way into the world, Offred slumps against the garage door. Freedom, at least a fighting chance for it, was so close. But it’s gone now. OFFRED (V.O.)  I used to think of my body as an instrument. Mine to use, to make things happen. Now the flesh arranges itself differently. I’m a cloud, congealed around a central object, more real than I am.  (and then)  And still I am empty.  She looks up to see that the WOLF has returned. Closer this time. Offred tenses, but the wolf keeps its distance. It HOWLS. Though eerie, the sound is oddly encouraging. In this moment, it’s what Offred needs. A reminder that she’s also a wild, dangerous thing, untamed by Gilead. CONTINUED: 23   23 (CONTINUED)  THT   Production Draft   Ep. 211 \"Holly\" 1/25/18   20. OFFRED (V.O.)  No. You’re not done. Get up. Get up, goddammit. Get. UP.  She gets up, fueled by resignation and resolve. She’s going to have this baby and then they’re getting out of here, together. This isn’t over. CUT TO: INT. LAKE HOUSE - LIVING ROOM - NIGHT 24   24 Some time later. Dark outside. Offred now wears a teal bathrobe, courtesy of the mistress of the house. Offred’s sweaty and tired, well into active labor. She’s having a CONTRACTION amid the nest she’s made of blankets and towels in front of the FIREPLACE. Nearby sits the bag of escape supplies, now her birthing supplies. The contraction passes, allowing her to start a FIRE against the cold. She strikes MATCHES near the tinder and kin",
      "dialogue_count": 0,
      "word_count": 2587
    }
  ]
}