{
  "slug": "the-spy-who-dumped-me-2018",
  "title": "the spy who dumped me",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 0,
  "characters": [],
  "total_words": 25187,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. EASTERN EUROPE - OUTDOOR MARKET - DAWN  A MAN -- rugged, square chin, hasn’t slept or shaven in days. This is DREW THAYER (30s). He wears a thick coat, tries not to stand out. He’s not from around here. “Here” is a bleak, locals-only market surrounded by crumbling Soviet-era buildings. Anemic vegetables. Dried meat. Fish. Handmade woolens. This place isn’t in a Lonely Planet guide.  VILNIUS, LITHUANIA  Drew shouldn’t be out in public but he needs to eat. He glances around furtively as he buys a ROLL from a BAKER. DREW (Lithuanian)  Thank you.  He sees something in his periphery -- his gears turn -- knows he’ll have to run. Or fight. Probably both. He crosses to -- A table of sad Chernobyl-looking shit manned by a skinny LITTLE GIRL -- bootleg Snoopy alarm clock, filthy handmade dolls -- one man’s trash... Drew picks up a HAND MIRROR. LITTLE GIRL (broken English) Three Euro. Drew ignores her, uses the mirror to look behind him -- at a FLOWER STAND there’s a THUG. Shaved head. Flat nose from repeated breaks. The kind of man who’d never buy you flowers. LITTLE GIRL (CONT'D) (broken English) Two? I give you for two. Drew puts the mirror down and walks away. LITTLE GIRL (CONT'D) One-fifty... ?  EXT. WOOLEN STAND - CONTINUOUS  Colorful clothes sway as Drew slips behind them. The THUG appears... looks around... Then suddenly -- a STRIPED SCARF ensnares his neck. Tightens, tightens -- Thug gasps for air. Drew’s behind him -- he’s done this before -- Thug kicks, knocks over a table of mittens -- The AGING VENDOR SCREAMS. Then it’s over. Thug goes LIMP. Drew holds him by the waist with one hand, swiftly reaches the other to his belt. Pulls out Thug’s HANDGUN and lets the dead body fall into a PUDDLE.",
      "characters": [],
      "action_text": "VENDOR (Lithuanian)  Savages! You pay for this mess!  As Drew drops a stack of Euros onto her table... ANOTHER GUY jumps out. Probably his brother. Bigger -- if that’s possible. Drew FIRES -- but his target’s ready for it and dives behind a BUTCHER’S STAND. Drew FIRES again... most of the bullets hit SALAMI. But his last bullet HITS the guy’s CHEST. He falls. Drew calmly moves in to finish the job. Click. Gun’s empty. Fuck. As the guy gasps for life, goes for his own gun -- Drew yanks down a SALAMI, smacks the guy’s hand with it -- a makeshift bat -- then leaps onto his chest. With one hand, Drew holds the guy’s nose -- with the other, shoves the jagged, broken SALAMI DOWN THE GUY’S THROAT. Bad way to die. But at least there’s no one coming after him now. Wait. Spoke too soon. From around the corner, a MAN with a horrible 1994 haircut comes at Drew -- GUN BLASTING. Drew DUCKS. He WEAVES. Drew dives around the corner, disappearing. The GUNFIRE keeps coming...  INT. BARCADE – LOS ANGELES - NIGHT  The GUNFIRE now comes from DUCK HUNT -- the old Nintendo game. We’re in a retro arcade-themed bar and the shooter of the ORANGE PLASTIC HANDGUN is AUDREY. She turns 27 today. She decimates duck after duck, insanely good at this game. Unlike every female character in every other movie, Audrey knows   exactly   how beautiful she is. Like a 7. Maybe an 8 if she wasn’t wearing her tacky Hawaiian TRADER JOE’S UNIFORM.  LOS ANGELES, CALIFORNIA  MORGAN (27), her best friend, walks over with TWO BEERS. MORGAN You can’t stand over here all night. Morgan’s parents always told her she could be anything, including a rocket scientist or a supermodel, if she wanted. Morgan totally buys that. Girl has zero insecurities. AUDREY Why? I’m having a good time. MORGAN Because it’s your birthday party. Behind Audrey: some FRIENDS, a half-eaten supermarket cake.  2. AUDREY Right. And for my birthday, I want to stand in the corner and not talk to anyone who isn’t caught up on my life. Everyone’s gon",
      "dialogue_count": 0,
      "word_count": 1339
    },
    {
      "scene_number": 2,
      "slugline": "INT. BROTHEL - UPSTAIRS ROOM - MOMENTS LATER  Drew closes the door behind them. The girl starts to take off her clothes, speaks in Broken English. DREW No. Keep them on. Drew pulls the SPIKED COLLAR out of his jacket. The Girl is terrified. But Drew crosses to the WINDOW, opens it. GIRL What you into? DREW (Lithuanian)  I’m into you never saw me . With that, Drew hands her more money than she’s ever seen in her life ($25 USD). Then turns the COLLAR upside down and loops it over the POWER LINE out the window. He jumps out.  EXT. BROTHEL - CONTINUOUS  Drew ZIPLINES out of the brothel, over rooftops, and finally jumps off on a LANDING outside the open window of a --  INT. RAMSHACKLE HOUSE - CONTINUOUS  TWO BORED TEENAGERS watch THE MINDY PROJECT dubbed in Lithuanian. They barely look up as Drew runs past them --  INT. RAMSHACKLE HOUSE - KITCHEN  The MATRIARCH ladles BORSCHT from a pot. Seeing Drew, she SCREAMS and drops it, Pepto Bismol pink everywhere. SIRENS WAIL in the distance. DREW (Lithuanian)  Keys.  EXT. VILNIUS ROAD – MINUTES LATER  Drew whizzes down a COBBLESTONE STREET on a MOPED. TWO COP CARS round the corner, in hot pursuit.  INT. BARCADE - LOS ANGELES - NIGHT  Morgan sits at the bar, flirting with Eurotrash VIKTOR -- shaved head, Ukrainian football tracksuit. MORGAN  Such   a coincidence. I just auditioned to be a Ukrainian farm girl in a Geico spot. Wait, so is it \"Ukraine\" or “The Ukraine?\"  6.",
      "characters": [],
      "action_text": "VIKTOR You say how you like. Always let beautiful woman decide. Morgan swoons... then notices Audrey, head pressed mournfully against the JUKEBOX. Draining her SCOTCH. She puts it on top of the juke next to TWO OTHER EMPTIES. Morgan grimaces. MORGAN Hey, Viktor? Hold that thought. Morgan crosses to Audrey. AUDREY Why did I have my birthday here? This is where I met Drew. MORGAN Enough. After tonight, I never want to hear the name “Drew” again. Even if you, like, “drew” me a picture, you say “I painted you something with pencils.” You have to move on. AUDREY I know. It’s just kinda hard to do that when he left that box of shit in our apartment that I have to see every day. He won’t even text me back about picking it up. MORGAN Let me see your phone for a sec. Audrey hands her CELL over. Morgan finds the BREAKUP TEXT.  “Hey there -- it’s over. Sorry.”  Morgan then scrolls through a series of UNANSWERED REPLIES from Audrey:   Why / What are you... / Call me / WTF? / How can you ... Then she starts a NEW TEXT MESSAGE. AUDREY Who are you texting? MORGAN Drew. “Fuck you, you worthless pussy -- I’m setting your shit on fire.” AUDREY Why are you saying that? MORGAN Because we’re gonna go set his fucking shit on fire. I love setting things on fire.  7.",
      "dialogue_count": 0,
      "word_count": 491
    },
    {
      "scene_number": 3,
      "slugline": "EXT. VILNIUS SLUMS - DAY  Drew speeds through the decrepit, graffitied streets, on a mission. He parks behind a burnt out APARTMENT COMPLEX. He looks at his cell -- GRIMACES. Then rounds the corner and sees something worse -- Three GIANT THUGS waiting for him. Drew takes the long way around the building, stealthily pulling the WHIP and CHAINS from his jacket. He rounds the corner -- now behind the men -- and just STARTS SWINGING. In seconds, all three men are bloody messes. Two knocked out, the other moaning in pain. Drew steps over them.  INT. AUDREY AND MORGAN’S FIRE ESCAPE - LOS ANGELES - NIGHT  Typical L.A. stucco fourplex. Audrey and Morgan stand drunkenly on the fire escape over a BANKERS BOX of Drew’s stuff. Morgan holds a bottle of LIGHTER FLUID. Audrey gingerly picks up a pair of BOXER BRIEFS. AUDREY Really Drew? Skid marks on your underwear? Are you eight? Was I supposed to wash this for you? Is that why you dumped me? I didn’t mother you enough? MORGAN Fuck you and wipe your own ass! Next, Audrey picks up a small PLASTIC TROPHY shaped like a VICTORIOUS FOOTBALL PLAYER. The plaque reads: SECOND PLACE. AUDREY Your Fantasy Football trophy for SECOND place? And you   saved   it? MORGAN It’s not even real football. It’s a fucking fantasy. AUDREY And I’m a real fucking person. So if you think you’re gonna get some supermodel who also has nothing better to do with her time than blow you while you watch the game... uh, fuck you. Morgan pulls out a STRAIGHT TO DVD SPY ACTION MOVIE. MORGAN Um, speaking of fantasy, say goodbye to your straight-to-DVD shitty action movie starring Ryan Phillipe and Mischa Barton!  8.",
      "characters": [],
      "action_text": "AUDREY That you forced me to watch with you. I will never get those 82 minutes back. There’s like one review on the cover. Three and a half stars from  JeffreyLovesMovies.com ?! MORGAN And you got it used at Chevron? Really Drew? You walked into a gas station and you’re like, yes! One copy of “Marked Target” please. Here’s $3.99. Morgan pours LIGHTER FLUID all over the box and its contents. She hands Audrey a matchbox. MORGAN (CONT'D) You do the honors, birthday girl. Audrey takes the matches. We’re CLOSE on the MATCH LIGHTING... and then... BUZZ. Her cell, in her pocket. Audrey shakes out the match and pulls out her phone... AUDREY It’s... Drew. DREW (V.O.) Hey.  INT. DREW’S SHITTY VILNIUS APARTMENT - INTERCUT  Not a place you’d want to spend the night in. Peeling walls, roaches, bare light bulb. Drew paces, earpiece in, checking the SURVEILLANCE SCREENS by his bed. AUDREY Really? That’s it? “Hey?” DREW Audrey, I'm so sorry. I fucked up. MORGAN Tell him to go fuck himself. DREW I'll come by your place tomorrow. I can explain everything... and I’ll get the stuff I left there. AUDREY (annoyed) So that’s why you called? Just to get your shit back? Awesome.  9. She awaits a response. But Drew’s busy PUNCHING THE DRYWALL by his night stand. In the hole: a SECRET STASH of MONEY, PASSPORTS and GUNS. Drew stuffs it in his POCKETS. AUDREY (CONT'D) It’s my birthday, by the way. Drew hears a GUN COCK. Someone’s behind him. ON AUDREY: The line goes DEAD. ON DREW -- spinning around -- knocking the gun from his attacker, an OLDER THUG. They know each other. No weapons now. They punch and kick, equally matched. OLDER THUG Fight me all you want but you have more problems coming. You know what they want. DREW They’re not getting it. OLDER THUG They’ll get it when you’re dead. DREW I can handle dead. Can you? Drew PINS the old thug to the floor with one hand. CRACKS HIS NECK with the other. Drew shakes off the body and moves to --  THE KITCHENETTE  Drew pulls a bag of MICROWAVE POPC",
      "dialogue_count": 0,
      "word_count": 2757
    },
    {
      "scene_number": 4,
      "slugline": "I/E. AUDREY’S HONDA CIVIC - DAY  Audrey, shaking, fighting tears, drives as fast as she can -- not terribly fast. A conservative driver. Morgan’s shotgun. MORGAN Where are we going?! AUDREY I don’t know. Give me a minute. Okay. Where would we be safe? MORGAN Pull into this parking lot. There’s a bathroom in Pilates Plus. AUDREY We’re not hiding in fucking Pilates Plus! Where’s the police station? I think I voted there... MORGAN We can’t go to the   police . I just killed someone. And I have a ton of unpaid speeding tickets. And... Black Lives Matter. AUDREY You killed someone in self-defense. That doesn’t count. MORGAN Just call those CIA agents. AUDREY Drew said we can’t trust anyone. And he’s right. He’s dead. Probably because I talked to them. MORGAN Or because I brought an assassin into our apartment. AUDREY Okay so it’s both our faults. Audrey slows as she approaches a STOP SIGN. MORGAN Go! Why are you stopping at stop signs? People are after us. Audrey nervously SPEEDS through the stop sign. Then her PHONE RINGS on the BLUETOOTH. BLOCKED NUMBER. She inhales, picks it up. It plays through the CAR SPEAKERS.  21.",
      "characters": [],
      "action_text": "SEBASTIAN (V.O.) Audrey? It’s Sebastian. AUDREY You killed Drew. I told you where he was gonna be and you killed him. MORGAN Who is this asshole? SEBASTIAN (V.O.) Are you in the car? (no response) What did Drew say to you? AUDREY Why would I tell you anything after everything you’ve done? SEBASTIAN (V.O.) Audrey. Where are you taking it? Audrey eyes the TROPHY, on the car’s console. SEBASTIAN (V.O.) Give us the package. Trust me. AUDREY I don’t trust anyone anymore. Audrey HANGS UP. A moment. MORGAN You trust me though, right? AUDREY Of course. Not counting you. MORGAN Good. Cause this isn’t like, a fake spy friendship that the Russians put together. AUDREY Dude, shut up. I know. (grabbing the trophy) Drew said a lot of people are gonna die if we don’t deliver this. MORGAN What people? AUDREY He didn’t get that far. But he was like, lying on the floor about to die when he said it. I know he lied about a lot of shit, but like... (MORE)  22. if I don’t do what he said and a bunch of people die, in a terrorist attack or whatever, I will always wonder if I could have stopped it. Morgan thinks about this. MORGAN That would fucking suck. (beat) What did he say we have to do? AUDREY Bring this to some cafe in Vienna. MORGAN Vienna? As in, Austria, Vienna? AUDREY That’s what he said. MORGAN Then... why don’t we do that? AUDREY Why don’t we go to Europe when people are trying to kill us? MORGAN They’re trying to kill us here too. AUDREY But we’re just like, regular people. Yes, we happen to be in this extreme situation right now but we are not qualified to like... do some international spy mission. MORGAN It doesn’t sound like a whole “mission.” It’s just doing this one thing. Versus staying here and getting killed. Plus, you’ve never been to Europe. Do you really want to die never having gone to Europe? Or do you want to go to Europe and die, having been to Europe? AUDREY Why are those my only two options? MORGAN I don’t know, cause you dated a spy? AUDREY You fucked an ass",
      "dialogue_count": 0,
      "word_count": 2917
    },
    {
      "scene_number": 5,
      "slugline": "INT. VIENNA METRO STATION - MOMENTS LATER  POUNDING MUSIC FROM THEIR CHASE continues as the girls try to work the confusing METRO PASS DISPENSER. MORGAN Gah!   AUDREY Fucking take my Euro!  INT. VIENNA METRO STATION - MOMENTS LATER  Music continues as they keep swiping their cards to no avail... they keep getting an ERROR MESSAGE:   FEHLER! FEHLER !  Finally, they get through. Slip into a METRO CAR.  INT. VIENNA METRO - SAME  Audrey and Morgan collapse on to seats, breathless. Finally. The train moves. They look up -- A VERY PREGNANT WOMAN and an ELDERLY MAN. Audrey and Morgan exchange a look and give up their seats. Hold the bars as they continue panting.  INT. CIA PARIS STATION – NIGHT  An industrial underground complex with SCREENS everywhere.  CIA STATION -- PARIS, FRANCE  SEBASTIAN -- still in his bloody shirt -- enters the SITUATION ROOM. Patel sees him, breaks from a conversation with WENDY (50s), their permanently-disgruntled BOSS. PATEL Great job, Henshaw! (deadpan) Your mission was to have everyone in that cafe die and the girls get away, right? Sebastian ignores PATEL, turns to Wendy. SEBASTIAN Extenuating circumstances. WENDY They had the package and you didn’t get it. Explain that circumstance. SEBASTIAN I was trying to protect them. PATEL Why? Let them die. They’re idiots. I know an idiot when I see one.  35.",
      "characters": [],
      "action_text": "SEBASTIAN (sotto) In the mirror. PATEL I’m not an idiot, Sebastian. I was-- SEBASTIAN Harvard. Yes. We know. WENDY (stern) Boys. If I wanted to sit here with two children, I’d spend time with my own children. And I don’t want to spend time with my own children. Now what do we know about these idiots? PATEL leans over and types a few keys. ON THE SCREENS -- DMV PHOTOS of AUDREY and MORGAN. PATEL Audrey Stockman. 27. Works at Trader Joe’s. (to Sebastian) You’re right. Can’t let anything happen to her. Who else would serve the samples of Vegan Gyoza? (to Wendy) She’s worked there since she graduated from Oberlin with a B minus average. Which is where she met this genius... MORGAN’s PICTURE. PATEL (CONT’D) Or shall I say “This Musical Theater major who designed her own minor.” WENDY In what? PATEL She literally minored in “Personality.” SEBASTIAN What’s your point, Patel? You’re okay letting two innocent women die? PATEL I think society is okay letting these two die. They’re losers. And we’ll catch them the minute they try to cross the border. (MORE)  36. These girls are the stupidest people America hasn’t managed to kill yet.  INT. WIEN HAUPTBAHNHOF TRAIN STATION - NIGHT  An uber-modern mall-like International hub.  INT. THE TICKET WINDOW  AUDREY grabs two tickets and hurries through the CROWD, keeping her head down, lying low... she arrives  INT. OUTSIDE THE GIFT SHOP  Just as MORGAN emerges with a BAG. The girls walk quickly. AUDREY Keep moving. There are cameras everywhere. MORGAN I got us changes of clothes. Morgan pulls out two BASEBALL HATS with MOZART’S FACE. MORGAN (CONT’D) They really play up that Mozart’s from here. Really downplay that Hitler’s from here. The girls put on the hats and head for the tracks. AUDREY What else did you get? MORGAN Everything that said Wiener on it. She shows Audrey a jar of VIENNA SAUSAGES and a cake labeled TORTE WIENER ART. Then Audrey suddenly STOPS. AUDREY Wait. Fuck. Our passports. Sebastian said we’ll get stopped if we try t",
      "dialogue_count": 0,
      "word_count": 3334
    },
    {
      "scene_number": 6,
      "slugline": "INT. ROGER’S HOUSE - DINING ROOM - NIGHT  Roger re-emerges with a dish of GRILLED EGGPLANT. ROGER Here. Eat. MORGAN You know what? I’m good. I’m trying not to eat when I’m not hungry. ROGER What happened to Audrey? MORGAN She went to the bathroom. But I think she’s done. ROGER Then let’s retire to the living room, shall we? Morgan smiles politely and follows, but she’s skeeved out.  INT. ROGER’S HOUSE - BATHROOM - NIGHT  Audrey wretches again. IN HER POV... The room is SPINNING.  INT. ROGER’S HOUSE - LIVING ROOM - NIGHT  Roger and Morgan stand before an intense EGON SCHIELE NUDE. ROGER You like art? MORGAN She doesn’t look like she’s enjoying herself. ROGER Sometimes the sweetest pleasure comes when you’re not enjoying yourself. MORGAN I don’t think I agree with that. And then Roger PUTS HIS ARM AROUND HER. Morgan stiffens. MORGAN (CONT’D) Uh, hey Roger? You’re so nice and my dad says great things about you and everything you did with those refugees’ eyes... but... He squeezes Morgan’s shoulder harder.  51.",
      "characters": [],
      "action_text": "MORGAN (CONT’D) Ow. That hurts, actually. Can you -- She realizes Roger’s hands are drifting up to her NECK. Before Morgan can stop him, he’s SHOVED HER TO THE GROUND. MORGAN (CONT’D) Aaaaaah! Help! She kicks Roger in the BALLS. ROGER Ow! Fuck!   MORGAN (CONT'D) Audrey! Roger climbs on top of Morgan.  INT. ROGER’S HOUSE - BATHROOM- SAME  Still in Audrey’s POV. Morgan’s yelling is muffled. Audrey tries to stand -- but loses her balance. She falls into -- THE SHOWER. THERE’S A DEAD BODY IN THE TUB. A different BALD NERD. THE REAL ROGER. Audrey flails to get off him. It’s tough. She’s been drugged. She COLLAPSES to the floor, barely conscious.  INT. ROGER’S HOUSE - LIVING ROOM - SAME  Roger, on top of a screaming Morgan, yanks up the side of her shirt and injects her with a TRANQUILIZER.  INT. ROGER’S HOUSE - BATHROOM - NIGHT  Roger tosses a WOOZY MORGAN into the bathroom with Audrey, slams the door. The girls are barely lucid. MORGAN Audrey... Roger drugged me... AUDREY That’s not Roger. Audrey pulls back the shower curtain, reveals the body. Morgan gasps. Audrey pulls out the flash drive. AUDREY (CONT’D) You have to swallow this. MORGAN What? AUDREY So they can’t find it. Come on! Before he comes back!  52. MORGAN You swallow it. AUDREY I just puked like nine times. I’ll just throw it back up. MORGAN I can’t even swallow Advil! I have to mash it up and put it in Applesauce... that thing is huge. AUDREY Pretend it’s that homeless guy. MORGAN (fading) Dude. I didn’t know... Audrey musters the strength to lift Morgan’s head to the sink. She runs the water into Morgan’s mouth, putting the FLASH DRIVE IN. Morgan tries to swallow... but coughs it up. AUDREY Lift your head back. Hold your nose. Morgan tries holding her nose and dangling the flash drive into her mouth. It goes in... and Morgan starts CHOKING. Audrey SLAPS her on the back. The flash drive flies out. Audrey, passing out, picks up the flash drive, thinking fast-- THE DOOR flies open just AS THE TOILET FLUSHES. ",
      "dialogue_count": 0,
      "word_count": 1200
    },
    {
      "scene_number": 7,
      "slugline": "EXT. ABANDONED ICE HOCKEY ARENA - DAY  THE SUVs pull up just in time to see the CHOPPER LEAVING.  INT. BLACK SUV - DAY- CONTINUOUS  Patel and Sebastian watch as the chopper retreats. PATEL Fuck. They got the drive. (into a handset) Okay kids. On my order, scuttle the F-15s. Let’s blow this shithole up. SEBASTIAN Wait. The girls could be in there. PATEL If they are, they’re either dead or surrounded by terrorists. Also: I don’t care. SEBASTIAN Just give me five minutes and three agents. I want to check. PATEL So four agents can get killed? I can’t authorize that. And this is my operation. THE RADIO (V.O.) F-15s are a minute out. PATEL Sweet. Let’s crush this mother like we’ve crushed Yale in every football game since 2007. (beat) By “we” I mean Harvard. Sebastian makes a snap decision. He SLAMS PATEL’S HEAD INTO THE STEERING WHEEL, knocking him out. Sebastian seizes his RADIO. Does his best Patel impression: SEBASTIAN Actually guys, hold up? Abort mission. THE RADIO (V.O.) Roger that. SEBASTIAN Go Crimson. He HANDCUFFS Patel to the steering wheel.  57.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 186
    },
    {
      "scene_number": 8,
      "slugline": "EXT. ABANDONED ICE HOCKEY ARENA - MOMENTS LATER  Sebastian, HANDGUN up, creeps along the side of the building.  INT. ABANDONED ICE HOCKEY ARENA - CONTINUOUS  A GUARD on the other side of the door with a RIFLE. Sebastian leaps out of nowhere -- KICKS HIM IN THE FACE -- we see his training in action. The Guard’s rifle CLANGS to the ground. Sebastian STOMPS on his fallen body. He’s out.  THROUGH ANOTHER SET OF DOORS  Sebastian peeks out -- moves quietly -- hiding under a BLEACHER. Takes in the cavernous HOCKEY RINK. Rats scuttle across DIRT where the ICE used to be. A MASSIVE DECREPIT ZAMBONI in the corner. A moldy old HOCKEY GOAL. In the shadows, creepy THUGS stalk, on patrol. A muffled SCREAM from across the rink. Sebastian spots the locker room door on the far side. Knows they’re in there. FLICK! A RUSSIAN GUARD lights a cigarette inches from Sebastian -- doesn’t see him. He takes a drag, enjoying it. He’d better - it’ll be his last ever. He walks a couple paces, around the ZAMBONI -- Sebastian’s waiting. In one fluid move, he has the guard in a headlock -- shoves the lit cigarette into his mouth -- holds it closed as the guard burns from the inside. Then crumples. Sebastian drops him -- runs swiftly, unseen, under the rink- side barriers. Stops a few yards from the LOCKER ROOM... A CARD TABLE stands in the way. NINE BAD FUCKING GUYS around it. All with guns on them. Eating, drinking, laughing. Sebastian silently checks his clip. He wouldn’t have enough bullets for all of them even if every shot was perfect. Fuck.  INT. LOCKER ROOM - DAY  Blood is now streaming out of both the girls’ mouths. Nadedja smiles for the first time -- albeit sadistically -- as she pulls out JUMPER CABLES attached to a CAR BATTERY. AUDREY I’m telling you we don’t know anything! MORGAN I’ve never kept a secret in my life! I tell everyone everything!  58.",
      "characters": [],
      "action_text": "Nadedja just hits the jumpers together. SPARKS fly. MORGAN (CONT’D) I have herpes! AUDREY What are you doing? MORGAN Proving to her that I’m honest and have nothing to hide! I stole my dad’s painkillers from his hernia surgery and sold them at Coachella! Nadedja approaches Morgan with the jumpers... MORGAN (CONT’D) I text while I drive -- drunk -- all the time! I once made out with this guy who has a hormone disorder where he looks twelve. He’s actually forty, but still! It’s like I hooked up with a child! AUDREY Morgan. This is not helping-- MORGAN Tell her something personal about you. AUDREY No! MORGAN Audrey has a recurring sex dream about Turtle from   Entourage!  Nadedja SHOCKS MORGAN. Morgan SCREAMS. Blinding pain.  I/E. BLACK SUV - DAY  Patel stirs awake -- groggily realizes what happened. Then realizes his hand is CUFFED. PATEL You fucking dick, Henshaw. Fuming, he reaches down with his free arm, manages to grab the WIRE to his mouthpiece. Talks into it. PATEL (CONT’D) Okay! Send the F-15s.  INT. ABANDONED ICE HOCKEY ARENA - DAY  SEBASTIAN HEARS THIS...  59. PATEL (V.O.) Drop the payload. Now. SEBASTIAN knows he has to move. Now.  THE ZAMBONI -- MOMENTS LATER  Sebastian sits astride the beast. There’s no way this thing still works, right? No fucking way. But he has to try. He turns the IGNITION. It burps awake. Fucking miracle.  AT THE CARD TABLE  The thugs are confused. What the fuck is that? THE ZAMBONI ROARS AHEAD -- NOW ON TOP OF THEM. SEBASTIAN drives. One moment the table was full of scary dudes. Now a THREE TON hunk of metal and giant spinning blades SHRED the life out of every one of them. Someone’s SEVERED HAND flies into the HOCKEY GOAL. Sebastian doesn’t have time to be impressed with himself -- A GIANT MAN pulls him out of his seat. No actually, a straight up HULK -- pulls him to the ground. Stands over him. This guy is the biggest monster Russia has ever created and he’s about to crush Sebastian. Sebastian KICKS. Gets him in the shin. This is n",
      "dialogue_count": 0,
      "word_count": 850
    },
    {
      "scene_number": 9,
      "slugline": "INT. LOCKER ROOM - CONTINUOUS  Sebastian enters and GASPS. Audrey and Morgan look horrible. But they’re alive. Seeing him, they start collapsing in sobs -- but there’s no time -- SEBASTIAN We have to move fast. Sebastian struggles to lift Audrey -- unhooks her from the pipe she hangs from. Not easy given his own injuries... Audrey unhooks Morgan. They hurry toward the BACK EXIT--  EXT. ABANDONED ICE HOCKEY ARENA - DAY  A bloody, hobbled Audrey, Morgan and Sebastian hurry out of the arena into the sunlight. The girls stop. AUDREY Where are we -- ? SEBASTIAN Keep moving! Go! Go! The F-15s buzz over the ARENA. DROP THEIR PAYLOAD. Sebastian pulls them away as fast as he can as the building -- EXPLODES. A fiery boom. Then just a fire. The old rink is now a HEAP of RUBBLE along with everyone inside. At least they’re safe. Sebastian crouches over the girls, shielding them from the debris. As the smoke clears: AUDREY Okay. I trust you now. SEBASTIAN Jesus, I should hope so. But when the smoke clears... there are FIFTY SPECIAL FORCES AGENTS surrounding them. Guns drawn. Oh shit.  INT. CIA PARIS STATION, HOLDING CELL - DAY  Sebastian -- one arm bandaged, one in a SLING -- sits with the girls in a holding room. AUDREY Be honest. Does this look fake? She smiles. An UNNATURALLY WHITE FAKE TOOTH where hers was. MORGAN You know I would never lie to you.  61.",
      "characters": [],
      "action_text": "Morgan leaves it at that. Audrey turns to Sebastian. AUDREY I should have just given you the drive in the cafe. Then none of this would have happened. SEBASTIAN I wouldn’t have believed me either. Drew told you to keep it safe. MORGAN Okay. Can you just tell us what is on that fucking drive? SEBASTIAN I actually don’t know. What I know is it was made by an international terrorist group called Highland. Intelligence tells us they’re planning a series of assassinations. High profile people. The plans will be on that drive. So if we had it, we’d know how to stop them. Audrey is about to say something when -- THE DOOR OPENS. WENDY enters with PATEL -- his nose broken and bandaged. WENDY Henshaw? My office. Patel, stay here. Sebastian glances back at the girls, then follows Wendy out. In their wake, PATEL is alone with the girls. Awkwardly: AUDREY What happened to your nose? PATEL Your new best friend slammed my head into a steering wheel so he could put our entire team at risk. In order to save you. AUDREY Oh. An awkward silence. MORGAN So, “Patel.” Do you know a Danny Patel who went to Wesleyan?  62.",
      "dialogue_count": 0,
      "word_count": 448
    },
    {
      "scene_number": 10,
      "slugline": "INT. CIA PARIS STATION - WENDY’S OFFICE - DAY  Wendy coldly sits across from Sebastian. WENDY Henshaw, you read English at university. Did you ever learn the word “hierarchy”? SEBASTIAN Wendy, I know I -- WENDY How about the word “treason”? That’s a good one. Love when it comes up in the crossword. SEBASTIAN I know I overstepped -- WENDY Overstepped? Overstepping is wearing a tank top on Casual Friday. Overstepping is stealing my Activia from the office fridge even though I brought it from home. SEBASTIAN I didn’t steal your Activia. WENDY Goddammit. We work for an international intelligence organization and I can't figure out who’s been eating my yogurt. My point is you did a lot more than overstep. You violated my direct orders, handcuffed your superior and went into a building swarming with terrorists without backup. SEBASTIAN I know. I exercised poor judgment -- WENDY Which one of them is it? SEBASTIAN Sorry? WENDY The only reason I can fathom why you’d put the entire mission on the line to save two girls’ lives is you’re in love with one of them. So which one is it? (MORE)  63.",
      "characters": [],
      "action_text": "The one with the tooth or the one who invited me to see her in   Pippin  at the Santa Monica Playhouse?  INT. CIA PARIS STATION HOLDING CELL - LATER  PATEL paces the room, enjoying this. The girls are upset. PATEL So what was going through your mind exactly when you flushed it down the toilet? “This thing is so important that actual people are actually dying because of it. So I know what I’ll do! I’ll treat it like a piece of shit wrapped in a piece of toilet paper.” Morgan involuntarily LAUGHS. Claps a hand over her mouth. PATEL (CONT’D) This is funny? Death is funny to you? MORGAN No, just...   that’s   how you go to the bathroom? Audrey starts quietly laughing too. PATEL Go ahead. Laugh. Meanwhile, I’ll tell you how many lives were lost and will be lost because of you. MORGAN ...So let me get this straight. You take a piece of toilet paper and what? You like wrap your hands in it and then poop into it, and then take that whole contraption and that’s what you drop into the toilet? You know the toilet is designed to take all that work out of it for you?  INT. CIA PARIS STATION. WENDY’S OFFICE - DAY  Wendy and Sebastian, as before. WENDY How long did the doctor say it would take your arm to heal? SEBASTIAN Two months for the bullet wound. Three for the fracture. WENDY (CONT'D)  64. WENDY Great. Take a five month leave. SEBASTIAN Oh, I assume he meant the two arms will heal simultaneously. WENDY I know what I said.  INT. CIA PARIS STATION HOLDING CELL - DAY  Patel is in the middle of berating the girls. He leans in. PATEL And every time you hear the song that will be recorded by Sting (featuring Bruno Mars) about everyone who’s about to be killed, just know that   that   song would  never have had to be made   if you two weren’t such fuck-ups. AUDREY Okay. We get it. PATEL Oh, sorry, have you had enough? (then) Drew was right about you. Audrey FLINCHES. Patel savors this. PATEL (CONT’D) You’re nothing to him. Just a place for him to put his stuff. Because no one woul",
      "dialogue_count": 0,
      "word_count": 1582
    },
    {
      "scene_number": 11,
      "slugline": "INT. MOSCOW HOTEL - DAY- INTERCUT  The back of someone’s head, staring out the window at the KREMLIN as he ties a TIE. His phone buzzes. He looks at the number, doesn’t recognize it, but answers it anyway. EDWARD SNOWDEN This is Edward. MORGAN Eddie? Eddie Snowden? Yes -- it’s EDWARD SNOWDEN. MORGAN (CONT’D) It’s Morgan. From Buck’s Rock Camp. Edward Snowden loses his shit. EDWARD Oh my God, Morgan! How are you? It’s been forever. I’ve sent you a bunch of emails over the years... I thought maybe you didn’t have your AOL account anymore. MORGAN Yeah, I have a Gmail now. EDWARD SNOWDEN Actually... I knew that. MORGAN Right. I guess you would. (beat) So hey. I need a really big favor. A knock at Edward’s hotel room door. A RUSSIAN AIDE appears. RUSSIAN AIDE Sir, Mr. Putin is ready for you. EDWARD SNOWDEN He can wait. (into phone) What do you need, Morgan? Anything. MORGAN Are you near a computer? EDWARD SNOWDEN Always.  INT. CIA SITUATION ROOM - DAY  In the SITUATION ROOM, Wendy stares at the screens. Silence. Then a CIA TECHNICIAN notices something on his computer.  71.",
      "characters": [],
      "action_text": "CIA TECHNICIAN Ma’am! Ma’am. (Wendy looks over) They didn’t get on their flight. WENDY Shit. She turns to PATEL. WENDY (CONT’D) Either those dum-dums took their selfie sticks to the Eiffel Tower or they lied about not having the drive and they’re on the run. Which agent took them to the airport? Patel freezes. He fucked up. PATEL I, uh, sent Henshaw. WENDY You sent the agent I just suspended for insubordination? PATEL I’ll fix it. WENDY You’d better. Give me an excuse to leave couples therapy early. I’m sick of watching my husband cry.  INT. BIBLIOTHEQUE MAZARINE - DAY  Sebastian types in the password Morgan reads off... MORGAN ...Two, upper case L, at sign, at sign, asterisk, lower-case j... ON THE SCREEN: A CHECK MARK. Sebastian and Audrey exchange a look, amazed. Sebastian hastily downloads the de-encryption key. He’s in.  INT. BIBLIOTHEQUE MAZARINE - LATER  Morgan is now trying desperately to wrap it up with Snowden. MORGAN Yeah. Yeah. Totally. I love the Mighty Mighty Bosstones too. Makes sense that they’re touring Eastern Europe now... I’ll definitely try to make it. (MORE)  72. But if I can’t, call me if you’re ever in LA!... Oh right, I guess I knew that. K then... bye. She hangs up on Edward Snowden. ON SEBASTIAN’S LAPTOP: ICONS flood the screen and don’t stop. There must be millions. Sebastian’s eyes widen. AUDREY What? What’s on the drive. SEBASTIAN These... aren’t Highland’s plans. This is a lot bigger. Sebastian SLAMS THE LAPTOP SHUT just as Morgan returns. SEBASTIAN (CONT’D) We have to get out of here.  INT. EUROPEAN HOTEL ROOM – SUNSET - INTERCUT  In a lavish bed in a luxury hotel in Europe somewhere sits -- NADEDJA. She’s still alive? What the fuck? Her PROFILE, haunting beauty, lit by the sunset. She’s stone- faced, chain smoking, surrounded by artillery. EURO MTV plays low in the background but she stares out the window. Her CELL buzzes. She answers in CROATIAN. NADEDJA  Zdravo.  A VOICE speaks through a VOICE MODULATOR. VOICE MODULATOR I need to a",
      "dialogue_count": 0,
      "word_count": 620
    },
    {
      "scene_number": 12,
      "slugline": "EXT. SUBURBAN PARIS SHOPPING CENTRE PARKING LOT - DAY  By the parked Corolla, Sebastian switches the SIM CARD in his phone -- opens the TRUNK, pulls out DRY CLEANING. SEBASTIAN Here. Change your clothes. We need to ditch anything they could use to find out where we’re going. AUDREY Where are we going? SEBASTIAN Amsterdam. I know a place we can hide. As they all put on Sebastian’s DRESS SHIRTS... MORGAN Oh my God my friend Beth lives in Amsterdam! She just emailed me about a new gallery show. (to Sebastian) She uses pipe cleaners and glitter to discuss draconian abortion access in contemporary India. SEBASTIAN Interesting. Do you want your friend Beth to die? MORGAN I wasn’t saying we should go. (beat) Unless we get this all resolved and we’re safe. Then I wouldn’t mind supporting her. Meanwhile, Audrey tries not to stare at Sebastian’s body as she helps him button his shirt. Dude’s in great shape. He catches her looking. An awkward moment as they both redden. There’s tension -- and not just the life and death kind. A series of QUICK CUTS, over energetic music -- -Morgan THROWS ALL THEIR CLOTHES into a DUMPSTER. -Sebastian pulls a stash of SPY SHIT -- MONEY, PASSPORTS, GUNS, GADGETS, A PACK OF CIGARETTES -- from his glove box... -Sebastian walks Morgan through JIMMYING the lock on another car, a modest PEUGEOT HATCHBACK. Then through hot-wiring it.  EXT. FRENCH HIGHWAY - MINUTES LATER  The Peugeot zips out on to the road. Success.  74.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 253
    },
    {
      "scene_number": 13,
      "slugline": "I/E. A PARIS TRAIN – NIGHT  NADEDJA in a CLOSED TRAIN CAR -- bad side facing away from us, toward the window. She tracks the moving DOT. KNOCK KNOCK! A sleazy SPANISH GUY slides the door open. SPANISH GUY Good evening, beautiful. He sits next to her. Nadedja blithely turns, revealing the other side of her face -- now bandaged but SOAKED WITH BLOOD. SPANISH GUY (CONT’D) Bella, what happened to your face? Nadedja calmly lifts a hand and BASHES HIS NOSE IN. Amused: NADEDJA What happened to yours?  I/E. SEBASTIAN’S CAR – MIDDLE OF THE NIGHT  Sebastian and Audrey up front, Morgan sleeping in back. AUDREY So what kind of dog do you have? SEBASTIAN Well,   had . AUDREY Oh. I’m sorry. SEBASTIAN No. No. The dog’s still alive. He just lives with my ex. AUDREY Do you ever see him?... Or her? Or, sorry, maybe they’re both “him,” I don’t mean to be presumptuous. SEBASTIAN The dog’s a “he.” The ex is a “she.” AUDREY Got it. What happened? SEBASTIAN You know. The usual. I worked too much. We never saw each other. She was having an emotional affair with one of her coworkers. They were always hugging. They once hugged for five minutes. (MORE)  75.",
      "characters": [],
      "action_text": "Just try to hug someone for five minutes. I bet you can’t. AUDREY Yeah, that’s a really long time. SEBASTIAN Also I found out she was selling weapons to the Chinese government. AUDREY Where is she now? SEBASTIAN Off the grid. I lost track of her -- and Banjo -- somewhere along the Kyrgyzstan border. AUDREY I’m really sorry. SEBASTIAN Yeah. Breakups suck. As you know. A moment of connection. AUDREY They just make you feel crazy. Like, you’re with someone for ten months, you think you’re in love... then you’re like, oh wait, that was all a lie. I was just a vagina for him to store a flash drive in. SEBASTIAN It’s more complicated than that. People reveal who they are in the end. It doesn’t mean what you had wasn’t real. AUDREY Morgan says Drew was always a selfish dick. SEBASTIAN And what do you think? AUDREY I mean, he did bring assassins to my apartment. But then again, so did you. SEBASTIAN (smiling) Shut up. In the back, MORGAN wakes up. SEBASTIAN (CONT'D)  76. MORGAN Hey guys? I know we’re on the run from a shit-ton of people but can we eat soon? I’m fucking starving.  EXT. ROTTERDAM, NETHERLANDS - DAY  The sun rises over the gorgeous town.  ROTTERDAM, NETHERLANDS INT. AN OFFICE – DAY  Long, thin fingers type into a PHONE.  “Targets located.”  NADEDJA stands in a corporate office -- empty for the weekend -- overlooking a quaint outdoor cafe. Through her SCOPE...  EXT. OUTDOOR CAFE - SAME  AUDREY, MORGAN and SEBASTIAN eat breakfast - in her CROSSHAIRS. We leave Nadedja’s POV and pull closer... revealing... It’s NOT THEM. It’s the AUSTRALIAN TOURIST GIRLS they stole passports from in Vienna. And some RANDOM SKEEVY GUY. One of the girls wears SEBASTIAN’S JACKET FROM EARLIER. AUSSIE TOURIST 1 How cute is this jacket? AUSSIE TOURIST 2 I can’t believe you found it in a dumpster. You always find the best secondhand stuff. SKEEVY GUY Yeah, so, you guys into threesomes? BAM-BAM-BAM! All three collapse, instantly dead --  EXT. A DIFFERENT CAFE - DAY  In an entirely differe",
      "dialogue_count": 0,
      "word_count": 824
    },
    {
      "scene_number": 14,
      "slugline": "INT. FLYING PIG YOUTH HOSTEL - ROOM - NIGHT  Sebastian sits on one of the beds, on his laptop while Audrey looks on. Morgan, on another bed, channel-surfs on the tiny TV. On the tiny DESK, an assortment of GUNS is laid out. AUDREY ...So you’re telling me this drive gives us access to   the entire Cloud?   Everyone’s private shit? SEBASTIAN The U.S. government has built a back door to access everything. Everyone’s private emails, their finances... everyone’s secrets. That’s what Drew stole. AUDREY What does Highland want with that? SEBASTIAN Imagine the power that comes from unlimited information. Blackmail, theft, they can take anything. Know anything. This is why people are -- MORGAN Hey! You guys! On TV: CNN INTERNATIONAL NEWS. It’s a story about AMERICAN GIRLS ARMED, DANGEROUS, AT LARGE. It’s Audrey and Morgan.  CNN INTERNATIONAL ANCHOR ...Thought to be part of a bigger terrorist plot, the young women were said to be involved in a hack at the Apple Store in Prague...  The girls stare, mesmerized...  CNN INTERNATIONAL ANCHOR (CONT’D) ...and the murder of a local doctor, which may have had a sexual motive.  MORGAN Ew. We would not have sexual motives with that guy. That’s like, so insulting to us.  CNN INTERNATIONAL ANCHOR Here are recent photographs of the suspects...  ON THE TV: Morgan’s photo is a glamorous headshot. Audrey’s is a drunken, shiny bar photo. Baggy, stained sweatshirt.  79.",
      "characters": [],
      "action_text": "AUDREY Ugh, I keep trying to untag myself in that picture. MORGAN Was that from Halloween? AUDREY No. MORGAN Oh.  (beat) It’s cute! AUDREY It’s really not. MORGAN Sebastian, back me up here. Doesn’t Audrey look cute in that photo? SEBASTIAN I’m busy. MORGAN What, you don’t have one second to validate her? All you have to do is give a thumbs up or thumbs down!  CNN INTERNATIONAL ANCHOR ...The FBI has released transcripts of Facebook messages between the suspects about victim Drew Thayer, confirming their intent.  AUDREY Oh God. Morgan. Our chats...  CNN INTERNATIONAL ANCHOR “I just wish he would die. Is that too much to ask? Just for someone to [expletive] murder him,” said Audrey Stockman. Then, “Do you want me to murder him? I totally will. That’s what friends are for. Music note emoji, music note emoji,” replied Morgan Freedman.  Sebastian finally looks up, amused. SEBASTIAN Your name is Morgan Freedman? MORGAN It’s Morgan Alexa Freedman on IMDB.  80. AUDREY Oh God. Morgan. Look. Onscreen -   TESS BAKER-TONETTI: COLLEGE FRIEND OF SUSPECT .  TESS ...Honestly? I just don’t believe Audrey would ever do this.  Audrey is surprised and weirdly touched. Until... TESS (CONT’D)  She’s just like, not that complicated of a thinker. I mean she’s 27 years old and she doesn’t even have a bed frame.  Audrey shuts off the TV. She and Morgan cross to Sebastian. MORGAN So with this drive, if anyone had ever emailed or like iMessaged a naked picture to someone else... SEBASTIAN This drive could access it. AUDREY Who did you send naked pictures to? MORGAN Don’t worry about it. AUDREY I can find out. He just said I can find out. Audrey grabs the LAPTOP. Morgan smacks her hands away. MORGAN Or we could look at pictures of someone we actually want to see naked. The girls exchange a knowing look. Beat. MORGAN (CONT’D)  Anderson Cooper.   AUDREY Amal Clooney. Morgan starts typing... Sebastian tries to wrestle the laptop back but she playfully holds it out of his reach. SEBASTIAN Guys. Thi",
      "dialogue_count": 0,
      "word_count": 3129
    },
    {
      "scene_number": 15,
      "slugline": "EXT. BERLIN - DAY  The sun rises over Berlin.  BERLIN, GERMANY  SEBASTIAN (V.O.) Here’s the plan. The guest list for the gala includes the Canadian ambassador and his wife. Audrey, you and I will pose as them.  INT. TEGEL AIRPORT, BERLIN - CUSTOMS - DAY  Passengers deplane, hug family, pick up their bags. AUDREY (V.O.) Won’t people know what they look like? SEBASTIAN (V.O.) No. No one ever remembers what Canadians look like... They land at Tegel Airport at 2pm. At BAGGAGE CLAIM -- a GENERICALLY HANDSOME MAN and his PLAIN BLOND WIFE walk briskly towards... A SIGN with their NAMES on it: “AMBASSADOR AND MRS. MULLICAY.” Pan up-- The DRIVER HOLDING IT is MORGAN. In a hat and everything. MORGAN (V.O.) Can I do an accent? SEBASTIAN (V.O.) You don’t need to. MORGAN (V.O.) Nah, I’m gonna do an accent. I know what I’m gonna do. “To really inhabit a character, you must speak with their tongue.” Stanislavsky. She takes the couple’s carry-ons. In a THICK COCKNEY ACCENT: MORGAN ‘ELLO. Funny coincidence -- you two is from London, Ontario and me, I’m from Jolly Old London! England. The Canadians are taken aback.  EXT. TEGEL AIRPORT – PARKING GARAGE ROOF – DAY  Morgan leads them to a LIMO in a corner of the EMPTY roof. It wasn’t necessary to park this far. The Canadians exchange glances but don’t say anything because they’re Canadian.  94.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 235
    },
    {
      "scene_number": 16,
      "slugline": "INT. LIMO - MOMENTS LATER  Morgan turns on the engine and opens the sunroof... AUDREY -- suddenly on TOP OF THE CAR -- sticks her head down into it! The Canadians SCREAM. Morgan feigns SHOCK too. MORGAN Oh my! Rascal! Ruffian! Begone! Audrey shoots the couple with TRANQ DARTS. They pass out. AUDREY Have a nice nap, guys. Sorry you’ll miss the party.  INT. GERMAN REST STOP BATHROOM - DAY  A dingy public bathroom. Audrey DYES HER HAIR BLOND in the sink to MATCH THE CANADIAN WOMAN’S. Morgan dyes her hair RED. AUDREY Do I look like her? MORGAN Yeah. Do I look awesome? AUDREY You look cute. MORGAN I just feel like for our friendship, we should be changing our looks at the same time. You to a Canadian Ambassador’s wife and me to a young Julianne Moore.  EXT. DEUTSCHES TECHNIKMUSEUM BERLIN - NIGHT  A stunning modern glass-walled building with a GOLDEN PLANE on top. Fancy couples walk up a RED CARPET to the GRAND ENTRANCE, manned by SECURITY. From behind, we follow a MAN in a TUXEDO, and a BLOND WOMAN in a RED SATIN DRESS and HEELS. We move around them... It’s Sebastian and Audrey. They look amazing. Throughout this sequence, Sebastian, Audrey and Morgan will be able to hear each other on earpieces. SEBASTIAN Morgan, are you in position?  EXT. DEUTSCHES TECHNIKMUSEUM BERLIN - BACK DOOR - INTERCUT  Morgan is dressed in a LAVENDER UNITARD. Acrobats in matching unitards stretch and warm up. Morgan stretches with them.  95.",
      "characters": [],
      "action_text": "MORGAN I was born in position. AUDREY Everyone was born in position. That’s why they call it “the fetal position.” MORGAN Oh, I just put that together. But yes. I’m psyched about this. Performing with Cirque de Soleil is like, a top three dream. I was a C.I.T. in Acrobatics and Clowning at camp. It was competitive. SEBASTIAN Once again, Morgan, you are not performing with the troupe. Your job is to stay backstage and watch the surveillance. We have to locate the assassin. MORGAN What about just for one song? SEBASTIAN No. Morgan longingly eyes a LITHE MAN doing a warm-up back flip. MORGAN This is like taking a thoroughbred to the Kentucky Derby and telling him, “you have to stand here and watch the Kentucky Derby, Horse.” Sebastian addresses the Marines in a PERFECT CANADIAN ACCENT. SEBASTIAN Evening! Honey, you have our passports? Audrey proffers the Canadians’ passports. The Marine surveys them. Looks back to Sebastian and Audrey. A tense moment. Then he waves them through. As they enter the party... AUDREY That was a perfect Canadian accent. SEBASTIAN I watch a lot of   Degrassi.  AUDREY Really?!  96. SEBASTIAN (dumb bro accent) Naw -- it’s my training, dumbass. (then) That was my LA accent. AUDREY Shut it. SEBASTIAN You look good as a blond, by the way. And are you wearing lipstick? Hearing this, MORGAN smiles as she mans --  INT. DEUTSCHES TECHNIKMUSEUM BERLIN, BACKSTAGE - NIGHT  -- a bank of SECURITY SCREENS. Guests move around the party. MORGAN What am I watching for exactly? SEBASTIAN (V.O.) Anyone you’ve seen before. Or anyone who looks suspicious. But Morgan can’t help but glance longingly at the unitard- clad Cirque de Soleil performers as they frolic past the curtains to a STAGE set up in the ATRIUM.  INT. DEUTSCHES TECHNIKMUSEUM BERLIN, LOCOMOTIVE ROOM - SAME  A vast room of German TRAIN CARS from various eras. Sebastian and Audrey hold hands as they move through the crowd. AUDREY What constitutes suspicious? SEBASTIAN Use your instincts. AUDREY I have ",
      "dialogue_count": 0,
      "word_count": 2918
    },
    {
      "scene_number": 17,
      "slugline": "INT. DEUTSCHES TECHNIKMUSEUM BERLIN HALLWAY - NIGHT  Morgan rushes down the hall, frantically looking for Sebastian and Audrey.  INT. SHIPS ROOM - NIGHT  The others, as before. “Tom” turns to Drew impatiently. “TOM” All right, Thayer, we gave him a full check. Drive’s not on him. Can we remove the target now? AUDREY (to Drew) Wait, you said you were the target. You said you’re Operation Albrecht. “Marsha” points her gun at Audrey’s head. Audrey is TERRIFIED. Then DREW pulls out a GUN as well... Audrey screams... But he doesn’t shoot her. He SHOOTS MARSHA. BAM. “TOM” LUNGES for the door but Drew gets him too. BAM. “Tom” falls back, on to an ANCIENT ANCHOR. It IMPALES HIS HEAD. Brain matter everywhere. Audrey shakes, tries not to wretch. AUDREY (CONT’D)  Oh my god...  DREW It’s okay, Audrey. I’m right here. No one else matters right now. He turns the gun on SEBASTIAN. AUDREY Drew, don’t! SEBASTIAN (calmly) Audrey, listen to me. Drew has been working with Patel. DREW Sebastian was working with Patel. SEBASTIAN Audrey, you saw Patel try to kill me yesterday. He’s the one who sent that assassin after you in Belgium. Drew was gonna let that happen. He would have let you die. DREW Sebastian sent the assassin to Belgium.  108.",
      "characters": [],
      "action_text": "SEBASTIAN Okay. Everything I say you did, you can’t just say I did. DREW I can do whatever I want! I’m the one with the gun. He turns to Audrey. Meanwhile, Audrey notices MORGAN slip into the room. No one else sees her... Morgan spots DREW. SHOCKING. But she stops herself from making any noise. The girls share a meaningful look. Morgan tiptoes into the SHIP beside Drew. DREW (CONT’D) That night we met... changed my life. I was driving by that bar and I saw you. Walking. And I was like, wherever that girl’s going, that’s where I want to be. AUDREY So that’s why you went into Barcade? Because you saw me? DREW I would have followed you anywhere. There was just something magnetic. I know this is cheesy but it felt like Kismet. It felt like fate. AUDREY Really? Cause I thought we were being totally honest with each other. You went to Barcade to assassinate the bartender. And suddenly, Audrey puts it all together. AUDREY (CONT’D) Wait. Hunter Pierce, from those emails. That was Ryan Phillippe’s character in that terrible “Marked Target” movie you made me watch .  And “Albrecht”. That’s Theo Albrecht. Founder of Trader Joe’s. You came here to assassinate... me. SIRENS approach outside. Drew SNAPS. DREW Oh my God, I forgot how fucking annoying you are. Fuck this shit. Drew SHOOTS SEBASTIAN, who falls backwards. Audrey tries to move to him but Drew is now pointing the gun at her.  109. DREW (CONT’D) Where’s the fucking drive? AUDREY I’ll tell you, okay? But there’s one thing you need to know first. Morgan likes to set things on fire. DREW What are you talking about? AUDREY Morgan likes to set things on fire . INT. SHIP - SAME  Morgan crouches behind a SMALL SHIP’S CANNON, aiming it at Drew. She uses the CIGARETTE TASER he tossed aside to LIGHT THE FUSE. Amazingly, it WORKS. BAM!  INT. SHIPS ROOM - SAME  A CANNONBALL sails from the ANCIENT CANNON across the room... NOWHERE NEAR DREW. It arcs through the air -- CRASHES through the glass window. SMASH! It lands on a parked car ",
      "dialogue_count": 0,
      "word_count": 1795
    },
    {
      "scene_number": 18,
      "slugline": "EXT. SHIBUYA, TOKYO - LATE NIGHT  The unmistakable neon hub of Tokyo’s popular nightlife area. As we move to a side street, push into a dark BASEMENT CLUB--  TOKYO, JAPAN INT. SHIBUYA KARAOKE CLUB - NIGHT  Dimly lit except for garish flashing neon lights. We follow-- AUDREY -- now in a stunning GOLD COCKTAIL DRESS -- as she confidently winds through a packed, intoxicated crowd. Approaches an expressionless CLERK at a HOST STAND. CLERK (Japanese)  Reservation?  Audrey’s about to give her name when the sound of GLASS SHATTERING cuts the air. The clerk -- and everyone else -- turns, distracted by the DRUNK COUPLE who just knocked over a huge stack of glasses... It’s MORGAN. With a Japanese BUSINESSMAN. Making a huge scene. Seemingly oblivious to Audrey. MORGAN (to the Businessman) Oh my God Akira you’re a mess! (to the bartenders) Barkeep! Two more Yakuzas please! Or wait, whatever this whiskey is called. Yakuza is the thing you’re in, right? Oh wait, shit, was that a secret? Unattended now, Audrey subtly REACHES BEHIND THE HOST STAND and presses a button. A DOOR behind the stand clicks. Unlocked. Audrey heads for it, when-- MAN (O.S.) Miss? Excuse me! Miss! This stops Audrey dead. She slowly turns... It’s SEBASTIAN. At the bar behind her. Holding out a GOLD PURSE that matches Audrey’s dress. AUDREY Oh! Silly me. Must have dropped that. They share a private, knowing, look, then she keeps moving.  116.",
      "characters": [],
      "action_text": "INT. HALLWAY - MOMENTS LATER  ...Audrey removes a GUN from the purse as she strides down the hall, solo. Drops the purse in the trash as she arrives -- At the end of the hall. Another door. Inside, muffled voices conspire, up to no good. Audrey takes a deep breath. As she cocks the gun and kicks the door open, we -- SMASH TO BLACK.  THE END  117.",
      "dialogue_count": 0,
      "word_count": 309
    }
  ]
}