{
  "slug": "the-comey-rule-102-night-two-2020",
  "title": "the comey rule 102 night two",
  "genre": "drama",
  "format": "series",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 20342,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. COMEY HOME - DEN - RESUMING 7   7 Patrice, Abby, Claire, Kate, and (now) MAURENE COMEY are in their socks, on the couch, consoling each other. MAURENE He said “Grab ‘em by the pussy.” Didn’t everyone hear him say “You can grab ‘em by the pussy”? Abby starts to cry again. They reach for her, when-- Comey appears, dressed for work, briefcase in hand. He STOPS, takes them all in. They look up. He can see the hurt... COMEY We’re gonna be okay. America will figure this out. ABBY I can’t go to school today, Dad. They’re gonna kill me. That lands. OMIT 8   8 INT. DOJ - CORRIDOR - MORNING (2016) 9   9 Sally Yates passes through. To her right, an ASSISTANT quietly cries at her desk. Behind a glass door,   a CAREER-PROSECUTOR is shrieking into his cell- phone , completely unglued. The name COMEY pokes through... Yates gets to her outer office, where her ASSISTANT is. YATES Everyone inside? INT. DOJ - DAG'S OFFICE (YATES) (2016) 10   10  A shouting match between Axelrod and Bob   is at full throttle, with Toscas and TWO SENIOR STAFFERS watching: BOB All the Formers are up my ass about this! They think it’s OUR fault! AXELROD The Formers can think whatever they want. They aren’t HERE!  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   2",
      "characters": [],
      "action_text": "BOB But you were. And what you let that fucking guy do is disgusting. Might be the end of the Goddamn republic! YATES Good Morning. (they go silent...) I saw she was leading in Florida so I curled up with a romance novel and went to bed. How much did she win by? They appreciate it. But no one can laugh. She knows that. YATES (CONT’D) Today is a day to remember that this is a politically- agnostic  institution. In that spirit, we’re going to welcome every lawyer sent here by the new administration and we’re going to do everything in our power to ensure their success in serving and protecting the American people. Right? (they all nod) Meanwhile, we have until January 20 to complete the projects that are  essential   to us before our tenures here are finished. What things do we most need to get across the finish line? INT. FBI DC - 7TH FLOOR - MORNING (2016) 11   11 Start on an EMAIL on a COMPUTER SCREEN. It reads: “ Fuck Hillary. She got what she deserved. ” Then someone quickly QUITS the screen, as-- Comey walks by, heading for his office. Across the floor, a WOMAN sniffs back tears. Comey continues on. INT. FBI DC - CONFERENCE ROOM - SAME 12   12 His SENIOR TEAM is here. On the table, we see 20 STACKED COPIES of a GAG CALENDAR featuring a shirtless VLADIMIR PUTIN. Seemed so funny yesterday. Now? Devastation: PRIESTAP We should be looking at likely scenarios now. Hate Crimes spiking, White Nationalism.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   3 MCCABE Maybe he surrounds himself with people who keep him in check. I mean, they won’t just let him govern by   tweeting . TRISHA ANDERSON It’s just... I keep thinking we were causal in some of this. It was razor-thin in some states... STRZOK Ya know what was   causal ? She ran a horrible campaign. LISA PAGE What if none of that mattered? What if we didn’t matter?   What if Russia just handpicked our next president and we fucking missed it?  What a grim reality. No one comments. Comey enters, and: COMEY Good m",
      "dialogue_count": 0,
      "word_count": 2331
    },
    {
      "scene_number": 2,
      "slugline": "EXT. MANHATTAN - 5TH AVENUE - MORNING (2017) 29   29 An 8-SUV caravan rolls down 5th Avenue, led by police. SUPER: “ January 6, 2017. 14 Days Before Inauguration .” OMITTED 30   30 INT. TRUMP TOWER - ELEVATOR - MINUTES LATER 31   31 SILENCE. Lots of TRUMP signage. Comey, Clapper, Brennan, and Rogers ascend. Some dread hanging... CLAPPER Remember, we are here simply to lay out the facts. Tight nods all around. We CUT TO: INT. TRUMP TOWER - CONFERENCE ROOM - MINUTES LATER 32   32 At a table we find Michael Flynn, REINCE PRIEBUS - facing Comey, Clapper, Brennan, Rogers. Chairs in back for MIKE POMPEO, TOM BOSSERT, K.T. McFARLAND. The lighting in here feels dark, shadowy. A door opens... And DONALD TRUMP enters. Comey rises. They all do. TRUMP Good morning. Seems pleasant enough. Clapper is the first to greet him: CLAPPER Mr. President-Elect. Jim Clapper. TRUMP I know who you are. Saw your testimony yesterday. You look good on tv. CLAPPER No, Sir. I have a face made for radio. Please meet Jim Comey, John Brennan, and Mike Rogers. COMEY Mister President-Elect. Comey and Trump shake hands. We CUT TO:  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   12",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 3,
      "slugline": "INT. TRUMP TOWER - CONFERENCE ROOM - ONE HOUR LATER (2017) 33   33 Deep into the briefing now. CLAPPER The Russians’ initial objectives were to make Americans doubt the validity of our electoral process, and to weaken what they saw as the likely Presidency of Secretary Clinton. In July, once you’d become the nominee, the Russians’ objective changed. At that point, their focus became helping you become President. NOT a small assertion. Comey awaits a collective gasp. Yet   no one in the room seems even mildly surprised . BRENNAN A part of the effort was a social media campaign using fake Facebook accounts, fake YouTube videos, false identities on Twitter and Instagram, all of it tightly coordinated to duplicate propaganda coming from Russia Today and Sputnik Radio. Again, no one reacts. No one is surprised... COMEY There was also an attempt by the Russians to attack the voting process itself. Voter rolls in twenty-one states were targeted. PRIEBUS Do we have any evidence that those efforts met with any success? COMEY No, Sir. We don’t. PRIEBUS So there was no actual   impact   from the meddling-- CLAPPER I think we should be careful with that word. “Meddling” is what my mother-in-law does. (at Trump) We can also say with a high degree (MORE)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   13",
      "characters": [],
      "action_text": "of confidence that this was not a fishing expedition conducted by low or mid-level GRU officers. This was a Putin-directed effort. That’s been substantiated by human intelligence, signal intelligence, and cyber forensics. TRUMP How dumb were the Democrats not to protect their cyber? The RNC was a lot smarter about that, a lot tougher. And you said there was no impact on the result, right? CLAPPER Sir, we were not given the charter, the authority, or the resources to make a call on how much the Russians   affected   the electoral process. We were simply tasked with assessing their methods and objectives - namely your election - a result which is now viewed in Moscow as a success. PRIEBUS We should get in front of this. There’s information in the unclassified version that should come from us as opposed to unfriendly news outlets. (Asst. nods) Let’s start drafting a statement for the press. “The Chiefs of the Intel Community have found NO evidence that Russian meddling affected the election results.” Should this be a release or a press conference?  Asst. actually starts drafting a statement on a TABLET . Right here. McFarland joins in. Wildly inappropriate. CLAPPER Mister President-Elect, there is also some additional material in this assessment -   sensitive  material - that we thought Director Comey should review with you more privately. TRUMP How private? CLAPPER (CONT'D)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   14 COMEY I thought the two of us would be best. PRIEBUS Can I join? COMEY (to Trump) Entirely up to you, of course. I just didn’t think it would be fitting in front of a larger group. Trump’s instincts kick in, and he decides: TRUMP Just the two of us. Thanks, everybody. With that, everyone stands... and files out. We STAY ON COMEY AND TRUMP as the room thins... ...until it’s just the two of them. Then: TRUMP (CONT’D) You’ve had one hell of a year. COMEY I suppose I have, Sir. TRUMP I thought you handled the email thing honorably. First you s",
      "dialogue_count": 0,
      "word_count": 665
    },
    {
      "scene_number": 4,
      "slugline": "INT. TRUMP TOWER - CONFERENCE ROOM - RESUMING 35   35 Comey shifts in his seat, then: COMEY Mister President-Elect, as Director Clapper mentioned, there is additional sensitive material in the assessment. (no reaction) A few caveats: this material was collected by a private intelligence firm on behalf of private clients. We have not independently corroborated it. But its source is a person known to the Bureau as a reliable former employee of a friendly intelligence service who collects information from a layered network of sub-sources. TRUMP Okay. COMEY At the request of his clients, he compiled a dossier of seventeen separate reports on you and your past dealings with Russia. One of those reports asserts that in 2013 you spent a night with Russian prostitutes in a Moscow hotel room, which was secretly videota-- TRUMP --There were no prostitutes; there were never prostitutes. You’d have to be an idiot to believe something like that. COMEY I am not saying that the FBI  believes   these accusations. We simply have a duty to make you aware of them. TRUMP Do I look like I need to go there? Like I need to go to prostitutes? COMEY Again, Sir, the Bureau has not passed judgment on the   truth   of the allegations. Our endeavor is to (MORE)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   16",
      "characters": [],
      "action_text": "protect you. The dossier is out there and will become public. At least two Members of Congress have it, as do the Press. CNN has it. TRUMP CNN. Of course. COMEY The dossier further states that you had the prostitutes urinate on a bed that had been slept in by President Obama and the First Lady. TRUMP This is what happens when you’re rich and famous; it just happens more to   me   because no one’s ever succeeded like I have. Women come forward, say I harassed them, and it’s never true. Lady sues me, says I touched her at Mar-a-Lago with her boyfriend in the room! But guess what? Whole thing was the boyfriend was unhappy with a business deal he and I were in. I give him what he wants and poof! She drops her suit. Summer Zervos says I harassed her on “The Apprentice.” Kissing her open- mouthed and touching her, and she’s SO upset and hurt by it. So why’s she inviting me to DINNER during the campaign? ‘Nother woman says I harassed her on a plane from London - except people on the flight say it never happened. All these lies, it’s disgraceful, and they NEVER prove anything! My ex-wife once said I raped her to get a better settlement out of me. Then she retracted it. Can you imagine that? Accusing the father of her children like that? Sad. So now some guy steps forward - probably paid by Hillary - people laughed when I first called her Crooked Hillary but it stuck because everybody knew it was true, a lot of people had always thought it they’d just never said it until Trump did - and says the Russians, it’s always the Russians lately, they’re the new bogeyman - the Russians say I COMEY (CONT'D) (MORE)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   17 needed hookers? And the FBI takes it seriously! I know some people in the Bureau have it in for me. I could see that, the way they gave Hillary a free pass. But   I’m the President now . COMEY The FBI is not investigating you, Sir. We’re always trying to assess what the Russians are doing, and what they   might   do",
      "dialogue_count": 0,
      "word_count": 746
    },
    {
      "scene_number": 5,
      "slugline": "INT. COMEY'S SUV - MOVING - DAY (2017) 38   38 Manhattan blows by on all sides of us. Comey frantically types notes into his I-Phone about the Trump meeting. Then, a PRESS RELEASE pops up -- issued by the TRUMP TRANSITION TEAM: “... there was absolutely no effect on the outcome of the election including the fact that there was no tampering whatsoever with voting machines. There were attempts to hack the Republican National Committee, but the RNC had strong hacking defenses and the hackers were unsuccessful .\" Comey eyes it, ingests it... We CUT TO: OMITTED 39-41   39-41 INT. FBI DC - 7TH FLOOR - EXEC SUITE - EVENING (2017) 42   42 McCabe moves through the suite, with some news to deliver. Althea’s desk is EMPTY. McCabe leans into: INT. FBI DC - DIRECTOR'S OFFICE (COMEY) - CONTINUING 43   43 Althea facing Comey’s desk. SUPER: “ January 10, 2017 .” ALTHEA Director Comey, the President-Elect is on Line One. Great. Comey is about to reply, as McCabe enters. MCCABE Boss, Buzzfeed just released the Steele Dossier. Also great. But now Comey knows what the call is about. He indicates to McCabe “Stay.” COMEY Thank you, Althea. Comey picks up: COMEY (INTO PHONE) (CONT’D) Evening, Sir. How are you? TRUMP (THRU PHONE) I’m very concerned about the leaking of this phony Russian dossier. I think it’s a disgrace that it could happen, and I want to know how it did.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   19",
      "characters": [],
      "action_text": "Comey rises, phone in hand, turns to his window, where a family of PIGEONS has made a home on the ledge - as: COMEY (INTO PHONE) Well, Sir, it’s not entirely accurate to call it a leak. This wasn’t a government document and it wasn’t classified. It had been compiled by private parties and was widely distributed before the FBI ever learned of its existence. So we really can’t call it a leak. TRUMP (THRU PHONE) Whatever we call it, I think it’s a disgrace. It shows a great lack of respect for the Presidency and I think it’s a terrible thing. I’ve been thinking about that phony tape, which can’t exist because it never happened. Anyway, I don’t like the leaking and the talking out of school. Maybe that’s how Obama did things, but when I take office we’re gonna run a tighter ship. No leaks. COMEY (INTO PHONE) That would be ideal, Sir. TRUMP (INTO PHONE) I saw you on tv today, on the Hill - thought your answers were very sharp; and that’s not easy, not easy. People try to trip you up. I hope you’re going to stay on. COMEY (INTO PHONE) That is very much my intention. TRUMP Good. Well, g’night, Jim. OMITTED 44,45   44,45 INT. UNNAMED BOX-LIKE SPACE - DAY (2017) 46   46 Trump’s first presser since the election. Small, informal: QUESTION #1 On that intelligence report, the second part of their conclusion was (MORE)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   20 that Vladimir Putin ordered it because he-- TRUMP Look, if — if Putin likes Donald Trump, I consider that an asset, not a liability, because we have a horrible relationship with Russia. Russia can help us fight ISIS, which, by the way, is, number one, tricky. I mean if you look, this administration created ISIS by leaving at the wrong time. The void was created, ISIS was formed. If Putin likes Donald Trump, guess what, folks? That’s called an asset, not a liability. Now, I don’t know that I’m gonna get along with Vladimir Putin. I hope I do. But there’s a good chance I won’t. And if I don’t, do you honestl",
      "dialogue_count": 0,
      "word_count": 1969
    },
    {
      "scene_number": 6,
      "slugline": "INT. COMEY HOME - DEN - SAME - INTERCUT 65   65 Patrice and Abby are watching this LIVE, with POPCORN. PATRICE That’s your father’s “oh, shit” face. INT. WHITE HOUSE - BLUE ROOM - RESUMING 66   66 Comey’s death walk continues. Cameras rolling. Trump and the GLARE of all those lights waiting. Comey reaches Trump, and sticks out his hand as if to say “There is no way in Hell I’m going to hug you on television.” But Trump grabs Comey’s hand and pulls him in. Comey exerts all the core-strength in his body to resist... resulting in an impossibly-awkward moment in which Trump is leaning in and his face nears Comey’s... ...as if they were about to   kiss . Good Christ. INT. COMEY HOME - DEN - RESUMING 67   67 Patrice cringes. Abby too. INT. WHITE HOUSE - BLUE ROOM - RESUMING 68   68 Trump whispers: TRUMP I’m really looking forward to working with you. (Comey cringes) Let’s take a picture. Comey puts up an “I’m not worthy” hand and backs away. So: TRUMP (CONT’D) Joe? Joe Clancy of the Secret Service? Get up here! INSERT - TELEVISION COVERAGE -- 69   69 A SEAN SPICER PRESS CONFERENCE: SPICER (ON TV) I discussed this with General Flynn just last night. There was just ONE phone call between him and Ambassador Kislyak prior to our taking office, and it covered four (MORE)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   27",
      "characters": [],
      "action_text": "subjects: a plane crash that claimed the lives of a Russian military choir; Christmas greetings; Russian-led talks over the Syrian civil war; and the logistics of setting up a call between Putin and Trump. That was the extent of the conversation. OMIT 70, 71   70, 71 INT. WHITE HOUSE - UNNAMED ROOM - DAY 72   72 Strzok and an UNNAMED FEMALE AGENT sit, waiting. Flynn, now the NAT’L SECURITY ADVISER, enters. FLYNN Morning! STRZOK Thanks for your time, General. FLYNN Not at all. I was just in the Oval. Have you seen it since we got in? STRZOK Haven’t, no. FLYNN Oh you should. Looks really different now. The President has quite a knack for interior design. INT. DOJ - RECEPTION/CORRIDOR - SAME 73   73 Yates heads out for a meeting - then slows because Comey is approaching. They meet beside a lovely mural. No one around. YATES Hi, Jim. COMEY I wanted you to hear it from me personally - we just sent two agents over to the White House to interview Mike Flynn. Bang. And Yates is livid-- YATES You what? SPICER (ON TV) (CONT'D)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   28 COMEY They’re in with him now. YATES WITHOUT notifying me first?! How could you do that? They head into: INT. DOJ - DAG’S OFFICE (YATES) - CONTINUING 73A   73A Yates shutting the door, as: COMEY Sally, I don't know where this is headed, but it could be a place where Flynn or others at the White House are in big trouble.  YATES  Exactly   why chain of command is so important here. Neither sits. They’re standing-- COMEY If you signed off on the interview it could be framed as a final partisan attack by an Obama appointee on the new president. If I do it it’s not. YATES I want you to stop doing this. I want you to stop deciding what I do and don’t need to know! You don’t get to make those calls for the rest of us! COMEY I’m trying to get to the truth with as little political interference as possible. YATES You worry about the truth part. I’ll handle the rest, okay? They study one another... YATES ",
      "dialogue_count": 0,
      "word_count": 837
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BEACH HOTEL - DOMIN. REPUB. - (FLASHBACK - 2016) 75   75 Flynn, standing in the shadowy ALCOVE,   talking to Kislyak : FLYNN (INTO CELL) While I have you: the upcoming UN vote on the Israeli settlements. Any chance I could talk you into abstaining? Or maybe delaying the vote by a few days? INT. WHITE HOUSE - UNNAMED ROOM - RESUMING (2017) 76   76 Flynn looks Strzok right in the eye, and: FLYNN No I did not. STRZOK Did you ask for his help in delaying the vote? FLYNN No. STRZOK Did you discuss with him any of the new sanctions that the Obama Administration had levied upon Russia as punishment for Russia’s interference in our election? FLYNN No. I didn’t even know about them at that time. I didn’t have access to television news in the Dominican, and my government-issued BlackBerry wasn’t working. STRZOK Did Ambassador Kislyak register any complaints with you about the expulsion of 35 Russian diplomats from the US? FLYNN No. STRZOK Did he complain about the closing of two Russian properties on US soil?  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   31",
      "characters": [],
      "action_text": "FLYNN No he didn’t. STRZOK Were you concerned at all that the Russian Government might   retaliate  for the sanctions, and perhaps escalate tensions between the two countries? FLYNN In a general way, sure. But as I said I was just learning about all this in real time. STRZOK And did you ask of Ambassador Kislyak that the Russian government not retaliate in any way to these measures? FLYNN No. STRZOK Did you say anything along the lines of “Let us get in there and fix this”? “Please don’t play tit- for-tat”? FLYNN Not really. I don’t remember. If the subject came up at all, it certainly wasn’t “Hey, don’t do anything.” STRZOK I see. INT. FBI DC - ELEVATOR BANK/BULLPEN - DAY (2017) 77   77 Comey emerges from an elevator. McCabe is waiting for him. MCCABE Boss, the interview team is back from the White House. And General Flynn denied the whole thing. INSTANT response - Comey starts walking for his office, grabs his CELL, dials, as we TRACK WITH THEM: MCCABE (CONT’D) Nearly all his answers were in direct conflict with the truth.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   32 COMEY Did they tell him we have it all on tape? MCCABE The questions made that clear. They used   whole sentences   from the conversations.   Unless he’s recently had a stroke, he'd have to know the agents were working off a transcript. COMEY Why would he do that?   He's got to know he just lit himself on fire. Who else was in the room? MCCABE Just our two guys and him. He’d opted against having White House Counsel there. COMEY How fast can I get a draft 302? MCCABE Within the hour. I-- COMEY (INTO CELL) Hi Sally. Expecting an explosion, we CUT TO: INT. WHITE HOUSE - DON MCGAHN’S OFFICE - DAY (2017) 78   78 Yates sits opposite White House Counsel DON McGAHN. To Yates’ right is MARY McCORD of the DOJ. SUPER: “ January 26, 2017 - Day 7 of the Trump Presidency .” YATES Thank you for your time, Don. I asked Mary to join us because she’s career DOJ, and I felt it would be prudent to establis",
      "dialogue_count": 0,
      "word_count": 1051
    },
    {
      "scene_number": 8,
      "slugline": "INT. WHITE HOUSE - DON MCGAHN’S OFFICE - DAY (2017) 79   79 The NEXT DAY. Those same two chairs are now EMPTY until--  Yates and Mary McCord sit into them again , having returned. MCGAHN Thanks for coming back on such short notice. YATES Of course. MCGAHN I reported back to the President after our meeting yesterday, and there was one thing we were unclear on: why does it matter if one administration official lies to  another   administration official? Yates is too stunned to reply. OMIT 81, 82   81, 82 INT. FBI DC - CONFERENCE ROOM - DAY (2017) 83   83 Comey stands at the end of the long table, looking over CONSTRUCTION PLANS for an “FBI OUTDOOR GYM.” He’s pleased. Signs off on it. Then Althea leans in: ALTHEA Director Comey, the President is calling for you. Comey pauses, doesn’t turn. COMEY Thank you, Althea. Althea backs out. Comey crosses the room, taps a button on the SPEAKERPHONE mid-table, and: COMEY (CONT’D) This is Jim Comey. WHITE HOUSE SECRETARY (THRU PHONE) Please hold for the President. Comey holds. Bracing without meaning to. Then:  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   36",
      "characters": [],
      "action_text": "TRUMP (THRU PHONE) Hi, Jim. Would you like to come over for dinner tonight? Dinner? With Trump? Sounds awful. And inappropriate. Meanwhile, Trump’s VOICE is now filling this huge room. COMEY Of course, Sir. TRUMP (THRU PHONE) Six-thirty. Looking forward to it. CLICK. End of call. Comey stands, uneasy. Dials a number. INT. PATRICE’S OFC. - SAME (2017) - INTERCUT 84   84 Patrice answers. PATRICE (INTO PHONE) Hi. COMEY Hi. I can’t meet you for dinner tonight. Sorry. PATRICE (INTO PHONE) Better offer? COMEY No. But definitely a bigger name. The President. PATRICE (INTO PHONE) Oh. Just the two of you? COMEY I hope not. INT. WHITE HOUSE - STAIRCASE/CORRIDOR - EVENING (2017) 85   85 We’re in SLOW-MOTION as   a female WHITE HOUSE AIDE leads us up a beautiful staircase. All around us, American grandeur. At the top of the stairs, the Aide guides us   down a hall. Still in SLOW-MOTION.   Two NAVY STEWARDS greet us at a door. The female Aide exits -- REVERSE TO Comey, who notices something: He’s looking at a Dining Table, set for two. END SLO-MO: COMEY Just the two of us?  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   37 NAVY STEWARD #1 Yes, Sir. INT. WHITE HOUSE - GREEN ROOM - CONTINUING 86   86 Ugh. Comey drifts toward the table, where a card before a place-setting reads “Director Comey.” Then-- TRUMP (O.S.) I like that. Comey turns. Trump is in the doorway: blue suit, too-long red tie. He blows past the stewards. TRUMP (CONT’D) People who are on time. I think a leader should always be on time. COMEY Good to see you, Mister President. TRUMP (heads for the table) I hear things are going very well at the Bureau. You’re going to love Jeff Sessions. He’s very smart. First Senator to endorse me. Sit. COMEY I look forward to working with him. TRUMP He doesn’t know I called you. I wanted this to be private, just between us. Reince Priebus doesn’t even know you’re here. At the table, Trump holds up a fancy MENU CARD-- TRUMP (CONT’D) They write these things one at a time, by",
      "dialogue_count": 0,
      "word_count": 1897
    },
    {
      "scene_number": 9,
      "slugline": "INT. COMEY HOME - MASTER BEDROOM - MINUTES LATER 94   94 Patrice is sound asleep. Comey,   still dressed , his tie loosened, climbs on the bed, wraps his arms around her, pulls her tight. She awakens. PATRICE You okay? No. He’s not. She feels that, turns toward him - sees that he’s still dressed... PATRICE (CONT’D) Jim? COMEY I don’t... I don’t think I can  protect   us from this man. What can she say? He kisses her, desperate to connect. She gives in to it. And it builds quickly, surprising them both. They will make love. We DROP BACK... and CUT TO: INT. FBI DC - CONFERENCE ROOM - MORNING (2017) 95, 96   95, 96 Strzok, Page, Rybicki, Priestap, McCabe - reading Comey’s typed notes from the Loyalty Dinner... Every expression says “Holy Shit.” Baker pours two coffees. Comey enters. COMEY Am I overreacting? PRIESTAP No. This is how a Mob Boss talks. Baker hands Priestap a coffee, then sits. COMEY A few takeaways: the independence of the FBI doesn’t mean anything to him. He sees everything in terms of personal loyalty. He’s fixated on the hookers thing. (at McCabe) And he thinks you have a problem with him. I told him you don’t. MCCABE Boss, you have to be so careful here. Memorialize any more conversations with him.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   44",
      "characters": [],
      "action_text": "BAKER There aren’t supposed to be any conversations with him. MCCABE Did he ask about Mike Flynn at all? Or acknowledge that we’d been to the White House to   interview   Flynn? COMEY No. MCCABE Is it possible he was respecting a boundary there? COMEY Hard to say. He moves so fast from one subject to another and so much of what he says is factually and legally incorrect, it’s possible he thinks the conversation went   well  and that I’m solidly on board. BAKER This cannot happen again. It is completely inappropriate for the two of you to engage like this. COMEY He’s the PRESIDENT. Am I supposed to refuse his call? BAKER He just asked you to put loyalty to HIM over your duty to investigate the threat posed by Russia-- BAKER (CONT'D) You--   TRISHA ANDERSON --Uh, Boss? Trisha just entered, semi-shocked. TRISHA ANDERSON (CONT’D) He just fired Sally Yates. Comey reacts. They all do. We CUT TO: INT. DOJ - DAG’S OFFICE (YATES) - DAY (2017) 97   97 Yates places some of her belongings into a BANKER’S BOX. Axelrod watches silently. Justin, the intern, leans in. Sad as hell.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   45 JUSTIN Ma’am... Can I get you anything? Yates pauses, smiles. YATES Are you asking me if this is a   two - Diet-Coke day, Justin? JUSTIN I guess I am. She eyes the kid. So earnest. And she considers it, but: YATES I’ll be fine, but thank you. He nods -- heads out... until: YATES (CONT’D) Justin. (he turns) Y’ever start to feel shaky, go outside and   look   at the buildings up and down Pennsylvania Avenue. They’ve been here a long time - and they’re gonna be here a long time, because what they represent is eternal. Institutions, the Rule of Law, no matter who’s in power. Wait. Her voice just cracked - a sadness hitting her without warning or permission. And   everyone heard it . Justin gulps. Yates has to, has to, regain her footing. So: YATES (CONT’D) Understand? Somehow, that sounded resolved and shaky, at once. JUSTIN Yes, Ma’am. She nods. Sil",
      "dialogue_count": 0,
      "word_count": 1713
    },
    {
      "scene_number": 10,
      "slugline": "INT. FBI DC - SUBTERRANEAN HALLWAY - LATER MORNING 103   103 Comey, McCabe, and Baker, edgy and tense, walk toward us in the world’s longest, most Kubrickian HALLWAY: BAKER Boss,   you cannot keep having conversations with this man . COMEY I’ll say it again. He’s the President. Our boss. (some edge there) He won’t invite me over again. I really offended him this time. MCCABE Did he bring up Mike Flynn? COMEY No. But he brought up you again. And the Russian hookers. And Hillary. BAKER  This is not tenable. ANY of it.  COMEY Let’s assume good faith for a second, that he just doesn’t know how a President is supposed to act with DOJ, and no one around him does either. It’s our job to help him. How can we do that? BAKER You’ve explained it to him clearly? COMEY Yes. BAKER Can we set up a briefing for him? Someone   else   to explain it? COMEY I’m not sure he’s interested. BAKER Have you seen ANY evidence that he values the Rule of Law? COMEY None.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   52",
      "characters": [],
      "action_text": "BAKER Then   why are we assuming good faith?  COMEY What should I do? Arrest him? TEMPER - not a common sight from Comey. It gets a reaction. BAKER You’ve had worse ideas. INT. UNNAMED HOTEL ROOM - DAY 104   104 Strzok and Lisa Page in a tight hug, overwhelmed by stress. LISA PAGE He’s gonna get his head chopped off, isn’t he. STRZOK We all are. Meaning, this affair is doomed. They both know it. Then   Both of their CELL-PHONES light up, simultaneously . And: INSERT - TELEVISION COVERAGE -- 105   105 SEVERAL REPORTS AT ONCE - each telling us that Michael Flynn has just resigned from his post as national security adviser. RACHEL MADDOW (ON TV) In his White House statement, Flynn said: \"I inadvertently briefed the VP-elect and others with incomplete information regarding my phone calls with the Russian Ambassador.\" OMIT 106-107   106-107 INT. WHITE HOUSE - OVAL OFFICE - MORNING (2017) 108   108 Trump at his desk. 12 PEOPLE in two semi-circles facing him. JARED KUSHNER, STEVE BANNON, Priebus, JEFF SESSIONS, Tom Bossert, several other INTEL BIGWIGS. SUPER: “ February 14, 2017 .” Trump looks   bored . Elbows on the desk... as Comey briefs him: COMEY Mr. President, as you know, tracking ISIS and its penetration (MORE)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   53 levels on American soil is a big part of the FBI’s mission. But there are   other   threats we don't talk about as much that are equally dangerous long-term, requiring an entirely different level of vigilance and attention. Pretty scary. But Trump is barely listening... COMEY (CONT’D) There is a sophisticated eastern European terror group - they call themselves the Chechen Islamic Brotherhood - that has embedded sleeper operatives in the United States. These are people who have been here, legally, for years. They speak fluent English and look Caucasian. They have families and jobs. And they are time-bombs. We are devoting enormous resources to monitoring these people. We try to jam them up where we ",
      "dialogue_count": 0,
      "word_count": 1790
    },
    {
      "scene_number": 11,
      "slugline": "INT. FBI DC - 7TH FLOOR CORRIDOR - MORNING (2017) 119   119 Comey walks, Trump’s VOICES blaring in his head, blocking out the sounds around him. He badges into: INT. FBI DC - MIDYEAR ROOM - CONTINUING 120   120 Comey enters a BRIEFING, (McCabe et al). As soon as the door shuts,   the OVERLAPPING VOICES in Comey’s head go away . Poof. Peace. He sits at the table, a big smile for one and all, facing a WHITE BOARD with a huge EVIDENCE TREE on it... And he just watches as these people work. Here they are: Civil Servants. Patriots. The “Deep State.” Trying to make their country a little safer. Comey sees that; he   feels   it. It touches him. A True North... But the moment is   broken , as Rybicki enters: RYBICKI Boss, the President is calling for you. Record-scratch. Every head turns. Comey nods, We SMASH TO: INT. FBI DC - DIRECTOR'S OFFICE - MOMENTS LATER 121   121 Comey just jotted down the time, “8:13 AM” - then: TRUMP (THRU PHONE) Do you have a publicist? Because you’re becoming more famous than me! COMEY (INTO PHONE) It’s not by choice, I assure you. I hate it. Comey grabs a pen to make notes, as-- INT. WHITE HOUSE - OVAL OFFICE - SAME - INTERCUT 122   122 Trump at his desk. A STAFFER closing the drapes, as: TRUMP (INTO PHONE) Listen, I’m trying to run the country and the cloud of this Russia business is making that very difficult, very tough. If I didn’t have the cloud we would’ve won the Health Care vote and a lot of (MORE)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   60",
      "characters": [],
      "action_text": "people are very upset about that because that should’ve gone through. You know I have nothing to do with Russia. I have a letter here from the biggest law firm in DC saying I have NO INCOME from Russia and I’m going to be filing a personal lawsuit against the author of this horrible dossier; I’m not even sure Steele is his real name, it sounds like a made-up name to me - but it’s going to be a huge suit because the things he said were very unfair and very painful. I have a beautiful wife and she’s been very hurt by this, and no one can imagine me needing hookers. I’ve always told my people “Whenever you’re in Russia, assume you’re being recorded, because you probably are.” And everyone who was traveling with me will confirm I did nothing on that trip. Nothing. So I want to know what you can do to lift this Russia cloud. COMEY (INTO PHONE) (writing furiously) Mister President, we are running it down as quickly as we can. For now it’s in your best interest to let us do that work. TRUMP (INTO PHONE) Ya know, nobody knows how many problems I create for Russia. I’m actually very BAD for Russia.   Much  tougher on them than Obama. I’m going to be commissioning more nukes, newer nukes - ours are forty years old, some of them. I’m also making sure we’re doing more oil drilling, which Russia hates. But all I get is “Trump-Russia, Trump- Russia.” The same cloud. And it’s very unfair, and very bad for the country. If some satellite of mine had done something, it’d be good to find that out. But I didn’t do anything, and I think there should be a way for you to get out there that you’re not investigating me. TRUMP (INTO PHONE) (CONT'D)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   61 COMEY (INTO PHONE) Sir, just last week on the Hill, I told Congressional Leadership that we are not investigating you. TRUMP (INTO PHONE) I’m trying to make smart deals, tough deals, and it’s incredible how well we’re doing, no one can believe it, probably the best first month any Preside",
      "dialogue_count": 0,
      "word_count": 1350
    },
    {
      "scene_number": 12,
      "slugline": "INT. DOJ - AG'S OFFICE (SESSIONS) - DAY (2017) 127   127 Rosenstein, hand on a Bible, is sworn in by Sessions. Rosenstein’s WIFE and TWO DAUGHTERS flank him. ROSENSTEIN I, Rod Rosenstein, do solemnly swear that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that I take this obligation freely, without any mental reservation or purpose of evasion; and that I will well and faithfully discharge the duties of the office on which I am about to enter. So help me God. He and Sessions shake hands. Shutters click. CUT TO: INT. DOJ - AG'S OFFICE (SESSIONS) - 5 MINS LATER (2017) 127A   127A Rosenstein’s family drifts off. He waves goodbye to them. The PHOTOGRAPHERS pack up their gear. ...as Sessions approaches Rosenstein. SESSIONS Looking forward to diving in, Rod. Discussing Department priorities. ROSENSTEIN I’ve prepared a list, General. SESSIONS Good. Where on that list would you put firing Jim Comey? BANG. That fast. Rosenstein gathers himself. ROSENSTEIN It’s certainly something we should discuss. Sessions nods. We CUT TO: INT. DOJ - DAG'S OFFICE (ROSENSTEIN) - (2017) 128   128 This used to be Yates’ office. Now it’s Rosenstein’s. He looks out his window. Then:  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   65",
      "characters": [],
      "action_text": "EXEC. ASST. (O.S.) Sir? Rosenstein turns. His EXEC. ASST. is in the doorway. And guess who Rosenstein has invited over? EXEC. ASST. (CONT’D) Director Comey is here. ROSENSTEIN Thank you. Send him in. Asst. backs out. Rosenstein exhales hard, as... Comey enters. A big moment for Rosenstein, in ways Comey can’t yet know. ROSENSTEIN (CONT’D) Jim! Thanks for coming. COMEY Of course. You settling in okay? ROSENSTEIN Reasonably. A few landmines strewn about. COMEY That’s surprising, I thought I’d stepped on all of them already. What can I do for you? ROSENSTEIN Thought you might give me a tutorial. Comey wasn’t expecting that - the humility of it. ROSENSTEIN (CONT’D) How to do this job as well as it can be done. Also wanted to know who you thought I should pick for the Manhattan Office. COMEY I’ll answer the second question first. I know the White House is pushing Bob McRaven for that position, and I think he’d be a disaster. I have serious questions about his integrity - would urge you to talk to Clark Derry about him. Clark thinks Bob committed (MORE)  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   66 perjury on a case the Chicago Office prosecuted. ROSENSTEIN That makes things easy. COMEY As to running this office, tell me: what was your favorite kind of candy as a kid? ROSENSTEIN Huh? COMEY Someone comes into my office to brief me, they’re often scared by the myth of the place. That limits their effectiveness. One personal connection and they relax. So what was yours? ROSENSTEIN Reese’s? COMEY Mine too. Almond Joy was a close second. ROSENSTEIN Not sure I can imagine   asking  someone that question though. COMEY Why not? ROSENSTEIN I’m not you. And there it is. The moment hovers, sad as hell. So: COMEY The job is about protecting people. Every decision comes back to that - and everything the   entire  Department does will run through this office. So you need to be your best. You need to eat well, exercise, get enough sleep. You need to be with your family to ",
      "dialogue_count": 0,
      "word_count": 801
    },
    {
      "scene_number": 13,
      "slugline": "EXT. BEDMINSTER GROUNDS - PATIO - NIGHT (2017) 130   130 The stillness of the 18th GREEN at night is pierced by the muffled sounds of TRUMP SHOUTING in a hotel suite, as: ROSENSTEIN (V.O.) It was called the Bedminster Memo, a four-page screed excoriating Jim. The President gave it to Don McGahn, who gave it to General Sessions, who gave it to me. INT. DOJ - DAG'S OFFICE (ROSENSTEIN) - RESUMING (NOW) 131   131 Rosenstein sighs... ROSENSTEIN And then I was summoned to the White House. INT. WHITE HOUSE - OVAL OFFICE RECEPTION - NIGHT (2017) 132   132 Rosenstein waits to go in, anxious. WHITE HOUSE SECRETARY, at her desk, grabs a CANDY from a jar, pops it in her mouth. So: ROSENSTEIN What was your favorite? As a kid? WHITE HOUSE SECRETARY I’m sorry? ROSENSTEIN Nothing. He eyes his shoe-tops. Then the door to the Oval opens. MCGAHN Rod? INT. WHITE HOUSE - OVAL OFFICE - MOMENTS LATER 133   133 Trump, McGahn, STEPHEN MILLER... and the Bedminster Memo. We’ve entered mid-discussion: ROSENSTEIN Mister President, I don’t think you can send this memo out in its current state. TRUMP Why not? It’s all true.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   69",
      "characters": [],
      "action_text": "ROSENSTEIN It reads like personal animus, instead of a reasoned executive decision. TRUMP He lied to me! He told me he would tell people I wasn’t under investigation. And I was very specific about that, very strong and powerful there. Then he goes to the Senate and doesn’t say it. A lot of people told me to fire him - but I kept him around. And he’s not a good guy. He’s a dirty guy, a bad cop. And he lied to me. ROSENSTEIN Nevertheless, the language in this memo is fairly incendiary and very easy to misconstrue. I think it would be bad for the Presidency and bad for you legally to have this out there. TRUMP What parts? ROSENSTEIN For one, you do not need to mention - and should NOT - the Russia Investigation as grounds for firing Director Comey. His mishandling of the Hillary emails is enough. TRUMP He and I had an understanding about what he was going to tell people - and he didn’t do it. The Trump- Russia cloud. He told me he’d lift it, and then DIDN’T! People should know he broke that deal. ROSENSTEIN Sir, you’d be exposing yourself to unnecessary risk here... TRUMP Then you write it. Whoa. A defining moment. Rosenstein pauses... Then: ROSENSTEIN I can do that.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   70 TRUMP Would you keep the part about him telling me three times I wasn’t under investigation? It’s very important people understand that. ROSENSTEIN Again, that would be conflating your decision to fire him with the Russia investigation, which is what we’re seeking to avoid. TRUMP He’s got people thinking I like golden showers! Are you gonna keep  anything   about it? Rosenstein swallows a reply. Miller seething now. MILLER Jim Comey takes his fucking initials too seriously. TRUMP Stephen keeps me tied to my base, which a lot of people forget and then they don’t get re-elected. I don’t want your version to go too easy on Comey. He’s a bad guy, a dishonest guy. ROSENSTEIN I understand how you feel, Sir. TRUMP Fine. Start writing. But I want Russia i",
      "dialogue_count": 0,
      "word_count": 4180
    },
    {
      "scene_number": 14,
      "slugline": "INT. FBI DC - CAFETERIA - SAME 182   182 This whole room is watching the testimony as well. INT. FBI NYFO - 5TH FLOOR - BULLPEN - SAME 183   183 Even the grumps at NYO: Sweeney, Pellegrino, Vota... INT. SENATE HEARING ROOM - RESUMING 184   184 Comey goes on: COMEY I am so sorry that I didn’t get the chance to say goodbye properly. It was the honor of my life to serve beside you, to be part of the FBI family. And I will miss it for the rest of my life. Thank you for standing watch. Thank you for doing so much good for this country.  In the FBI Conference Room, the FBI Cafeteria, at NYO - the men and women of the FBI take that in. Acknowledged . Comey collects himself. Then-- COMEY (CONT’D) Do that good as long as ever you can. (collects himself) Senators, I look forward to your questions. Our story is told, finally. We RETURN TO: INT. DOJ - DAG'S OFFICE (ROSENSTEIN) - (NOW) - NIGHT 185   185 Day has turned to night. Rosenstein and Justin both wiped. ROSENSTEIN He does speak beautifully, I’ll give him that. And he shakes hands with all the janitors. But for all his theatrics, Jim Comey got himself fired - while   I   stuck around to keep the ship afloat. Ever think of that? Me. Those people out there may not love me. But they respect me. That oughtta be   enough   for a public servant. JUSTIN Sir, I really should get started.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   87",
      "characters": [],
      "action_text": "Started? At what?   That’s when we reveal: 30 CARDBOARD BOXES (still unbuilt, and flat) leaning against the side of Rosenstein’s desk. JUSTIN (CONT’D) Have to have the place ready for the Incoming-- ROSENSTEIN Of course. Wait,   Justin came in here hours ago just to pack Rosenstein up?   The kid shrugs, begins to build the boxes. Then... he just has to say it: JUSTIN Ya know, everyday, before I come in, I spend some time   outside , looking at all the buildings on this street. You should do that. ROSENSTEIN What for? JUSTIN ‘Cause they’ve been here for so long. Doesn’t matter who the President is, or which party is in power, the institutions, the rule of law - nothing ever knocks them down. That always comforts me. ROSENSTEIN Good for you. JUSTIN And it’s Three Musketeers. (Rosenstein’s a blank) My favorite candy bar. Silence. Justin goes back to his boxes. Rosenstein nods, rises... and heads slowly to the door... But Rosenstein STOPS there. Turns. Regards Justin... and something occurs to him: ROSENSTEIN I suppose this is where Jim Comey would turn around and help you build those boxes and ask you for your life story.  The Green Room - Night Two   PROD.WHITE (Oct 3, 2019)   88 Justin shrugs, smiles thinly. Rosenstein shakes his head: ROSENSTEIN (CONT’D) Goddamn showboat. With that, he leaves. Justin continues his work. CUT TO: EXT. PENNSYLVANIA AVENUE - CAPITAL GRILLE - DUSK 186   186 Comey and Patrice emerge and stop at a corner. The DOJ is to their right. Beyond that, other institutions - all of them grand and eternal. Across the street from them is the FBI BUILDING, flags flying. We CUT TO: INT. FBI DC - MIDYEAR ROOM - (FANTASY)- DAY 186A   186A We’re inside the circular table, looking out... at the MIDYEAR TEAM, hard at work, months ago. We do a 360, stopping briefly before each member of the team... to learn the following, SUPERED UNDER THEM: “Andrew McCabe - Fired by Donald Trump” “Trisha Anderson - Resigned” “Peter Strzok - Fired” “James Rybicki - Resigned” ",
      "dialogue_count": 0,
      "word_count": 807
    }
  ]
}