{
  "slug": "the-purge-2013",
  "title": "the purge",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 7,
  "characters": [
    "MARY",
    "DIGITAL WOMAN",
    "JAMES",
    "CHARLIE",
    "POLITE LEADER",
    "BLOODY STRANGER",
    "ZOEY"
  ],
  "total_words": 23815,
  "total_dialogue": 13,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT.   LARGE BEDROOM - MORNING JAMES AND MARY SANDIN are awake in their bed.   Both in their early 40s.   JAMES is handsome, tanned, fit.   He’s sitting up - on the PHONE - in smooth salesman work mode: JAMES (ON PHONE) - Mr. Calhoun, the system will be working without a hitch by the time the Purge begins.   I have a service crew on their way now - MARY SANDIN - next to James - is also tanned, in healthy shape and pretty.   She’s looking through magazines that feature high-priced BOATS/YACHTS for SALE - barely paying attention to the TV/INTERNET PROJECTION on the wall in front of her playing the MORNING NEWS: NEWSCASTER 1 - For most, today began with the tradition of displaying Baptisia flowers outside their homes, signifying cleansing, as tonight brings us the tenth Annual Purge. Mary ear-marks a page displaying a gorgeous YACHT as: NEWSCASTER 1 (CONT’D) 90 percent of all Americans are now in favor of this annual night, and a recent Arcon evaluation of the 10 percent who oppose the Purge revealed that more than half of this dissenting faction are psychologically unstable. The NEWS CUTS to a TAPED CLIP of A PONY-TAILED MEXICAN- AMERICAN MAN standing on a STREET CORNER.   His name is CARMELO JOHNS and he’s holding a SIGN that reads;   “DO NOT CONFORM!”, “VISIT THE-RESISTANCE.ORG FOR THE TRUTH!”  He’s YELLING WILDLY at PASSERBYS - most pay him no attention at all - while others cast a weary eye on him: CARMELO JOHNS (ON TV) - The Purge has cleaned up the streets but at what cost?   OUR SOULS ARE AT STAKE! Mary takes note of something Carmelo’s said when the TV report cuts back to the NEWSCASTERS: NEWSCASTER 2 (ON TV) The start of the Purge is Sundown - 7 PM Standard - and some predict elevated levels of violen -  3.  (CONTINUED)",
      "characters": [
        "MARY"
      ],
      "action_text": "Mary raises the REMOTE - shuts the TV.   Goes back to her MAGAZINES - finds an ENORMOUS BOAT - her eyes light up. She shows this boat to her husband who’s still on PHONE: MARY Look at this one, baby.   Perfect. James smiles - silently agreeing - as: JAMES (ON PHONE, CONT’D) - Mr. Calhoun, Arcon makes the strongest steel in the world.   You will be locked in tight tonight. - Yessir, bye now. James hangs up the phone. MARY (re: phone call) Everything OK, babe? JAMES Everyone’s doing security checks, getting ready for tonight.   If one system I sold has a glitch, I’ll lose the bonus. Mary kisses her husband. MARY It’ll be fine.   Now go get ready. James stands.   As he puts on a robe: JAMES What are you gonna do today, babe? MARY Not sure.   Definitely go for a run.   Eating way too much lately. JAMES You’re crazy.   You look amazing. (then) Did you hear the scratching last night? MARY It woke me up at 3.   What the hell is it?   It’s driving me crazy. James shrugs - no idea.   He starts out of the room, when Mary stops him with:  4.  CONTINUED:  (CONTINUED) HENRY We’re gonna spend our lives together, baby.   We won’t be sneaking around like this much longer, trust me. Zoey smiles - mesmerized - crazy in love.   She embraces Henry - he squeezes her tight, equally as infatuated. ZOEY I thank God every day that you’re in my life.   But you should go. All hell will break loose if he sees you here now. One last kiss - Henry then moves to the window and climbs out, onto the balcony, disappearing below. WE STAY WITH ZOEY - beaming with young love, when her eyes fall on that WALL of TROPHIES and PLAQUES and PHOTOS of HERSELF at PIANO RECITALS, BEAUTY CONTESTS, etc. She stares at all of it - her bright smile fading. INT. SANDIN HOUSE HALLWAY - MORNING A LONG HALL decorated with PHOTOS of the attractive SANDINS - JAMES, MARY, ZOEY and CHARLIE.   We notice something at the end of this corridor - it’s a foot high - moving toward us.   As it draws near, we see that it’s: A RABBIT ",
      "dialogue_count": 1,
      "word_count": 1047
    },
    {
      "scene_number": 2,
      "slugline": "INT. A DARK SMALL SPACE - SAME BOXES piled in the corner - BOY’S CLOTHES hanging.   It’s a CLOSET that’s been turned into a secret hiding spot - replete with a TOYS, BOOKS, DRAWINGS, as well as CANDID PHOTOS of the SANDINS - MARY, JAMES and ZOEY   ( NOTE:   no PHOTOS of CHARLIE) .   We FIND: YOUNG CHARLIE SANDIN - sitting on a small CHAIR in this, his secret getaway. ( NOTE : This is clearly the back of Charlie’s closet - into which he disappeared earlier.) Charlie’s not only wearing those multiple LAYERS OF CLOTHES, but he’s also now donning a bizarre pair of SMALL, CIRCULAR DARK GLASSES/GOGGLES - as well as holding an I-POD NANO-LIKE DEVICE which he handles expertly. WE HOLD ON CHARLIE - in those dark GLASSES/GOGGLES, seemingly staring off at nothing until we SEE what he’s LOOKING AT: HIS MOM - in the KITCHEN - smiling at the Rabbit - as we just saw her.   We quickly realize that CHARLIE’S GLASSES are some kind of hi-tech MINI-MONITOR displaying the RABBIT’S ROVING POV.   With the glasses, Charlie can SEE and HEAR (and PHOTOGRAPH) everything the Rabbit SEES and HEARS - which is, right now, his Mom: MARY (ON MINI-MONITOR INSIDE GLASSES) I’m coming to visit, baby.   I’ll bring Vic. Charlie smiles.   He removes those glasses, stands, moves through the HANGING CLOTHES and emerges back into: HIS BEDROOM Charlie jumps in bed - pulls the covers over his body - obviously hiding the layers of clothes, when - KNOCK. CHARLIE Come in. The DOOR OPENS - MARY enters - cradling the Rabbit.   She places it on the dresser and then PLUGS a CORD into a SLOT in its BACK while Charlie presses the I-Pod-like device, HIGHLIGHTING a COMMAND -   SLEEP MODE -   causing: THE RABBIT to close its eyes.   And we realize that the Rabbit is just an ultra-realistic remote-controlled stuffed animal of tomorrow-land.   As the Rabbit ‘sleeps’, Mary sits next to Charlie on the bed.  7.  (CONTINUED)",
      "characters": [
        "MARY",
        "DIGITAL WOMAN"
      ],
      "action_text": "MARY Morning kiddo.   How’s the vitals? CHARLIE Slight deviation in my temperature.   Otherwise good. (then) I heard that scratching again late last night. (gestures toward the weathered Rabbit) I had Victor explore the whole house - we didn’t find anything. MARY We heard it too.   Your dad thinks it’s an animal stuck in the wall. CHARLIE I think Daddy’s wrong. They share a smile.   Beat as Mary curiously notes the way Charlie HOLDS the COVERS over his BODY. MARY Are you layering again, Charlie? Charlie lowers his eyes, embarrassed by this.   Mary leans forward, gently pulling the covers off her son - revealing his THREE SHIRTS and THREE PAIRS OF UNDERWEAR. CHARLIE Don’t tell Daddy. Mary grins warmly at her red-faced son: MARY I won’t.   But don’t be embarrassed by this, or checking your vitals, or whatever.   Who knows why we do things, baby?   It’s all OK. Charlie smiles - feeling better.   Mary ruffles his hair and then tickles him - she adores her quirky boy.   Their laughter finally whittles, and as Mary stares at her son, she sees his expression tighten into worry - just as it did when he saw the DATE in his calendar book earlier. MARY (CONT’D) (knowingly) It’s tonight, isn’t it, Charlie? Charlie nods, ‘yes it is’.  8.  CONTINUED:  (CONTINUED) MRS. FERRIN ‘Morning.   I come bearing gifts. MARY What could I have possibly done to deserve a gift, Mrs. Ferrin? MRS. FERRIN (playful) Just being the perfect neighbor is all.   I have a new hobby.   Baking. But I made way too many cookies - so I hope you’re hungry. And before Mary could even say ‘thank you’: MR. HALVERSON (O.S.) I hope you’re hungry too because those cookies are crazy good. Mary and Mrs. Ferrin turn, finding THE HALVERSONS - the ENORMOUS NEIGHBORS on the LEFT SIDE of the Sandins - the FOOTBALL PLAYER-LIKE 18 YEAR OLD TWIN HALVERSON SONS and the ROTUND HALVERSON PARENTS are getting in their car. The Big Halversons smile one last time before driving off.   Mrs. Ferrin whispers to Mary: MRS. FERRIN I know",
      "dialogue_count": 2,
      "word_count": 1578
    },
    {
      "scene_number": 3,
      "slugline": "INT.   SANDIN KITCHEN - SAME - NIGHT FALL The attractive Sandin Family sits at the kitchen table, ready to eat dinner, all holding hands for some kind of prayer/thanks.   Victor, Charlie’s rabbit, sits on the table next to him.   They all have their eyes closed, except Charlie, who’s secretly peering at everyone. JAMES (CONT’D) - To the Martyrs who bring peace. To the New Founding Fathers for letting us Purge and cleanse our souls.   We are extremely grateful. The family breaks their collective finger lock and James begins a nightly dinner ritual: JAMES (CONT’D) - So, let’s hear about everyone’s day?   Zoey, you’ll go first - but Charlie - take the rabbit off the table before we begin.   Please. Charlie gently puts his Rabbit on the floor as James looks at his daughter, waiting for her to begin the nightly ritual.   Zoey glares harshly at her Dad: ZOEY I’m not doing this anymore.   It’s stupid. James just stares at her, not accepting that. ZOEY (CONT’D) Fine.   Calc test.   Piano.   Normal day.   Who cares?   It’s dumb. JAMES I do.   So how did practice go? You ready for the recital? Zoey just stares at him - teenage angst screaming ‘leave me alone!’   Mary throws James a look - ‘stop bothering her.’   James ignores Mary, saying to Zoey: JAMES (CONT’D) You’re ready.   You always are. (then) Just make sure your left hand cooperates on the 3rd concerto. Zoey doesn’t even look at her father - so mad now.   Mary eyes James - ‘stop’.   James relents and says:  13.  (CONTINUED)",
      "characters": [
        "JAMES"
      ],
      "action_text": "Mary and Zoey burst out laughing.   Zoey almost spits some food out.   James is smiling - a good sport: JAMES Very funny.   And you ladies are laughing a little too hard.   I’ll get you back for that one, Charlie- boy.   Beware. Mary, Zoey, and Charlie are laughing even harder now. Zoey actually high-fives her brother.   James can’t help but join in.   In the b.g., we HEAR the PURGE COMMERCIAL on the O.S. TV/INTERNET PROJECTION: SOOTHING VOICE (O.S.) ...Exercise your right to Purge tonight.   Arcon encourages your participation. Charlie takes almost subconscious note of the O.S. commercial, as the Sandins’ laughter whittles.   Zoey assumes her pissy attitude again, when: JAMES Zoey, before we hear about your Mom’s day, I wanted to remind you that we need to review your Arcon University application essay. Zoey shoots her father another nasty look, like she’s going to bite his head off.   Mary jumps in: MARY James, for godsakes, we spoke about this.   She doesn’t always have to be working. (to Zoey) Zoey, I’m giving you permission to ignore him. Zoey doesn’t respond, she’s ignoring everyone now, head down, eating.   James goes to say something but Mary’s expression admonishes - ‘no more.’   He shuts his mouth. CHARLIE Mommy’s turn. JAMES That’s right.   Mary, your day? Before Mary could answer - DING DONG.   The door bell. James consults the wall-clock and his expression tightens - an unsettled look emerges - which he tries to hide.  15.  CONTINUED: (2)  (CONTINUED) James opens the DOOR revealing a COZY ROOM within. Strangely, the FLOOR of the ROOM is covered with PLASTIC TARP.   There is a LONE CHAIR in the middle of the room atop this plastic.   An unusual ominous tableau. JAMES (CONT’D) You can take a seat right there. I hope it’s comfortable. Mr. Kane enters and sits on the lone chair. MR. KANE It’s very comfortable. JAMES Great.   See you shortly, Mr. Kane. Mr. Kane smiles again.   James smiles back.   The ever- present awkwardness between them reaching a crescen",
      "dialogue_count": 2,
      "word_count": 2707
    },
    {
      "scene_number": 4,
      "slugline": "INT. BASEMENT ROOM - NIGHT SKINNY, PALE MR. KANE sits on the CHAIR in the center of the room, atop the PLASTIC SHEET, in silence.   He’s fidgeting and sweating.   The DOOR OPENS and JAMES steps in, politely smiling, and now HOLDING a PLATE OF FOOD. JAMES As requested - spaghetti and meatballs, Mr. Kane. MR. KANE It smells wonderful, Mr. Sandin. James closes the door behind him - shutting us out. CUT TO: INT.   MARY AND JAMES’ BEDROOM - NIGHT - SAME MARY enters, sipping a Martini.   She’s fighting that unsettled feeling, clearly unsure of what to do with herself.   She sits on her bed - opens a YACHT MAGAZINE and finds the luxurious BOAT she ear-marked earlier.   But something clearly bothers her about it now. Mary drops the magazine.   Her eyes falling on the TV. She CLICKS on the PROJECTION with a REMOTE.   We REVERSE TO SEE WHAT she’s WATCHING: ON TV/INTERNET -   these WORDS on the screen -   LIVE FEED - THE PURGE - PARK AVE., NEW YORK.   Above the words, a SECURITY CAM-LIKE VIEW of the MANHATTAN STREET comprised of EXPENSIVE HIGH-RISES.   All SKYSCRAPER WINDOWS BARRICADED WITH STEEL.   NO ONE is outside.   BAPTISIA FLOWERS line the sidewalk - commemorating the holiday. Mary raises the REMOTE, CHANGING the site/channel to: ON TV/INTERNET:   LIVE FEED - THE PURGE - OIL CITY, PENN.  Above these words, a HIGH ANGLE SECURITY CAM-LIKE VIEW of a TRAILER PARK - all TRAILER HOME WINDOWS protected by WOOD BOARDS - nothing else.   All trailers display FLOWERS.   This Trailer Park is quiet until we see A BURST of MOVEMENT as a MAN RUNS into CAM VIEW. This Man is MISSING both his ARMS - chopped off just moments ago - as he’s bleeding and retreating in a mad desperate dash.   The Armless Man runs out of CAM VIEW. The Park is quiet again until WHOOSH!   A half dozen MEN on HORSEBACK come thundering through.  24.  (CONTINUED)",
      "characters": [],
      "action_text": "They’re garmented in unusual CHROME SUITS and carrying STRANGE GUNS and GLOWING SWORDS.   ONE HORSE pulls a MANGLED CORPSE on a rope in its wake. MARY watches this macabre scene, disturbed.   She sips her drink, then TYPES something on her REMOTE KEYBOARD - searching for a specific web-site -   THE-RESISTANCE.ORG  ( NOTE : the web-site of Purge Detractor Carmelo Johns whom we saw on TV earlier).   As she finishes typing, she HEARS an O.S. BEEPING.   She looks up at the PROJECTION, seeing:  WARNING YOU ARE ABOUT TO ENTER THE-RESISTANCE.ORG.   THIS WEB-SITE IS NOT SANCTIONED BY ARCON.   WOULD YOU LIKE TO PROCEED? YES?   NO?  Mary hesitates - then CLICKS   NO . She shuts the TV.   Sits in silence.   Sipping her martini. CUT TO: INT.   ZOEY’S BEDROOM - NIGHT - SAME Henry sits on the bed now as cute Zoey paces in front of him.   She rants emotionally about her father: ZOEY - He knows how angry I am with him, but he keeps badgering me. It never stops. HENRY Shhhh, baby - he’ll hear you. ZOEY (cont’d) No matter how good I do - it’s never enough. Henry stands - embraces Zoey, caressing her hair: HENRY You need to relax, girl - everything’s going to be alright. She’s tearing up, so upset.   Henry reaches in his pocket withdrawing a SMALL BOTTLE.   He removes the LID - revealing a dozen PHOSPHORESCENT GLOWING PILLS. HENRY (CONT’D) This is the stuff I took at Sebastian's party.   It expanded my mind.   It’ll make you feel better.  25.  CONTINUED:  (CONTINUED) Zoey pauses, looking down at the pills.   Not something she normally does.   But she wants to make Henry happy. ZOEY I’ll take two. CUT TO: INT.   BASEMENT ROOM - NIGHT - SAME James, wearing a PLASTIC FULL-LENGTH SMOCK now, stands with MR. KANE (who’s just picking at that PLATE of FOOD as if his appetite has abandoned him).   They both appear nervous as they review a STACK OF DOCUMENTS: JAMES - Just to review the terms - when I’ve concluded, you will be brought to City Hall and made a Martyr of the 30 Provinces.   I will ",
      "dialogue_count": 0,
      "word_count": 807
    },
    {
      "scene_number": 5,
      "slugline": "INT. MARY AND JAMES’ BEDROOM - NIGHT Mary’s still inside, still sitting on her bed in silence. She swigs her Martini, finishing it.   She eyes the empty glass, contemplating getting another drink, when: A subtle O.S. NOISE gets her attention. It’S LAUGHTER.   A CREEPY BURST of GIGGLING - FROM OUTSIDE.   Mary tenses, there’s something disconcerting about it.   She gingerly moves to the WINDOW - LOOKING out the OBSERVATION SLOT, seeing: A HINT OF MOVEMENT in the FOREST BEHIND HER BACKYARD FENCE.   A FLASH OF WHITE that disappears.   Mary, alerted, stares out - not seeing anything now - when suddenly: AHHHHHH!   An O.S. mindless SCREAM of fear ERUPTS from INSIDE her home.   Mary nearly jumps out of her skin when the SCREAM is followed by BANG!   The concussive SOUND of an O.S. GUNSHOT.   Mary knows what it is.   She freezes. CUT TO: INT.   ZOEY’S ROOM - NIGHT - SAME Zoey and Henry are on the bed - kissing tenderly.   But Zoey, strangely, looks very sleepy, her eyes heavy. ZOEY - Something’s wrong, baby.   I can’t keep my eyes open.   It must be the pills.   It must be - - BAM!   Another GUNSHOT from the BASEMENT - a bit muted in this part of the house.   As she fades into sleep: ZOEY (CONT’D) - What was that? HENRY Nothing.   Just sleep, girl.   Rest. Everything’s gonna be alright very soon. And there’s something strange about the way Henry says that.   But Zoey barely hears him as she closes her eyes - out cold.   Henry watches her, not sleepy at all. CUT TO:  27.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 261
    },
    {
      "scene_number": 6,
      "slugline": "INT.   CHARLIE’S SECRET LAIR - SAME Charlie stands frozen - in the midst of putting on a THIRD T-SHIRT.   He has clearly just heard the TWO GUNSHOTS.   He waits for another - but it never comes. CUT TO: INT.   HALLWAY OUTSIDE BASEMENT ROOM - NIGHT - SAME HOLD ON THE BASEMENT DOOR - behind which James is with Mr. Kane.   The DOOR OPENS and JAMES emerges.   He has removed the PLASTIC OVERCOAT.   We catch a glimpse of Mr. Kane’s LIMP LEGS - blood pooled around his feet. James locks the door before we see any more.   He places the key under the rug. James stands there, not moving, face red. James begins to cry, releasing emotion, very shaken by his ‘Purge’.   After a beat of crying, James takes a deep breath - as if he’s trying to convince himself that the ‘Purging’ he just did was a ‘good, cleansing act’. After several breaths, he assumes his confident facade again.   He walks up the STAIRS and ENTERS: INT. SANDIN FIRST FLOOR FOYER - CONTINUOUS As James steps into the FOYER, he immediately SEES THAT: ALL THE WINDOWS in his FOYER are now acting as DIGITAL MONITORS (just as the front windows did in the morning), DISPLAYING that same PLEASANT WOMAN from earlier: PLEASANT WOMAN (ON DIGITAL WINDOWS) Thank you for Purging, James Sandin.   Arcon will not forget your brave participation in this important tradition. The Digital Woman repeats the message over and over, and as James continues walking we see that the PLEASANT WOMAN APPEARS on EVERY WINDOW DISPLAY of his home.   James finally stops, turns to one of the WINDOW SCREENS and NODS - acknowledging the message.   The WOMAN vanishes - and the windows appear just as windows once again. James continues onward, down the SECOND FLOOR HALL now. He passes the SECURITY ROOM, where he sees:  28.  (CONTINUED)",
      "characters": [],
      "action_text": "MARY - in front of the SECURITY MONITORS now.   No longer in her bedroom.   She turns to James as he ENTERS.   They hold a long look.   She sees the muted pain behind his self-assured expression.   She tries to comfort him: MARY You’re a brave man, hun.   You’ve done your duty.   You OK? JAMES I know how necessary it is - I just remind myself what it was like before Arcon and the Purge - but it’s still so damn hard. Mary stands, hugging her tormented husband - her face sullen, she’s also quietly anguished by James’ Purge. She changes the subject, pointing at the MONITORS: MARY You need to see something, James. CUT TO: INT.   HALLWAY - OUTSIDE CHARLIE’S BEDROOM - SAME Charlie’s BEDROOM DOOR cracks open REVEALING THE GREEN WEATHERED RABBIT, VICTOR, hopping into the hall. On some kind of secret mission. CUT TO: INT.   DEN - SECURITY ROOM - NIGHT James and Mary are staring at the SECURITY MONITORS - specifically the MONITOR that DISPLAYS AN ANGLE OF THE FOREST BEHIND THEIR HOME. MARY - I saw something.   Right there. JAMES I don’t see anything.   Maybe it was the raccoon who’s been digging in our walls.   Don’t worry, Mar - who would bother us? Mary turns from the monitor, looking at James, spotting BLOOD on his neck, dripping under his clothes.  29.  CONTINUED:  (CONTINUED) MARY Oh, James, that poor man’s blood splashed on you. James reaches back - feels the blood on his neck.   He grimaces, shocked and disturbed by it - as is Mary. JAMES Damnit.   I’ll go wash it off. James exits quickly.   Mary follows.   WE STAY BEHIND - looking at THE MONITORS.   And on the MONITOR DISPLAYING THE FOREST BEHIND THE HOUSE - we see it again - MOVEMENT - IT’S CLEARLY A PERSON. A PERSON WEARING a big silly SMILEY FACE MASK.   This Masked Person appears briefly, looking up at the Sandin home, then quickly disappears into the night like a demented wraith. CUT TO: INT. CHARLIE’S SECRET LAIR - SAME CHARLIE’S in his hideaway - wearing layers of clothing and donning those strange GLASSES/GOGG",
      "dialogue_count": 0,
      "word_count": 1037
    },
    {
      "scene_number": 7,
      "slugline": "INT.   SANDIN MANSION - HALLWAY - NIGHT Charlie is walking through the home now, devastated from viewing MR. KANE’S CORPSE.   His Rabbit is not with him. He continues on, when he HEARS an O.S. protracted SOUND. He takes note.   Walking onward - through the barricaded home - when he HEARS THAT SOUND AGAIN. It’s a SCREAM.   A MAN’S SCREAM.   From OUTSIDE.   Charlie WALKS to a WINDOW - peers out the OBSERVATION SLOT. CHARLIE’S POV OF THE STREET: Charlie peers around the neighborhood, when he SPOTS: A DISTANT FIGURE - RUNNING toward the CUL-DE-SAC.   The DISTANT FIGURE IS STUMBLING and YELLING in fear/pain. Charlie stares at this RUNNING FIGURE.   As ‘it’ draws CLOSER, we can see that it is a TALL MAN - with streaks of FRESH BLOOD striating his entire body.   He’s running forward but looking back.   He’s clearly being HUNTED. Charlie looks down the street - DOESN’T SEE THE PURSUERS. HOLD ON CHARLIE’S FACE for a long beat - twisted in concern and empathy as he watches this desperate, bloody man stumbling down the CUL-DE-SAC. SUDDENLY: Charlie SPINS AND SPRINTS across his HOME.   WE FOLLOW HIM DOWN A HALL.   Up a flight of STAIRS.   Through the KITCHEN.   Down another HALL.   And into THE DEN/SECURITY ROOM. He peers at the SECURITY MONITORS - sees that BLOODY MAN still struggling down the street. Charlie doesn’t hesitate - WHAM!   HE HITS THE RED SECURITY BARRICADE BUTTON ON THE WALL. CUT TO: INT.   BATHROOM - NIGHT - SAME James is out of the tub - clean now.   Mary is helping him into a robe.   They move about in pensive silence, when a sudden RUMBLE OF SOUND rises - it’s the SECURITY BARRICADE OPENING on the BATHROOM WINDOW behind them. JAMES What the hell? CUT TO:  32.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 294
    },
    {
      "scene_number": 8,
      "slugline": "INT.   SANDIN MANSION FRONT FOYER - NIGHT - SAME A RUSH OF MOVEMENT as CHARLIE RUNS BACK DOWN the STAIRS - to the FIRST FLOOR.   He screeches to a halt by the FRONT DOOR.   He UNLOCKS THE DOOR - WHIPS IT OPEN - SECURITY GATE in front of it almost OPEN and EXPOSING THE OUTSIDE. Charlie sees the BLOODY RUNNING STRANGER - 20 yards away. Up close, the MAN is tall, with tattered blood-soaked clothes.   Beard dirty, hair matted - like a Homeless Man. He’s between 30-35 - his torn shirt reveals a hideously SCARRED BODY - including one scar that jack-knifes across his face, ending at his right eye - which is just a dark hole where his eye used to reside. He is also missing part of his scalp - hair and skin cut from his head, exposing bloody subcutaneous tissue. Unlike his other scars, this scalp wound is fresh. There’s also a LONG RUSTY SERRATED KNIFE sticking out of the Stranger’s pocket conspicuously. Charlie, undaunted by the Man’s grisly appearance, YELLS: CHARLIE Hey - hey - come here! BLOODY STRANGER spots CHARLIE - a beacon.   He PIVOTS TOWARD THE SANDIN HOME.   Climbing the IRON GATE that SURROUNDS the PROPERTY. Charlie looks - but still can’t see the MAN’S ATTACKERS. CUT TO: INT.   DEN - SECURITY ROOM - NIGHT - SAME As James (dressed now) ENTERS in a BURST.   HE SLAMS HIS HAND against the RED SECURITY BUTTON and suddenly WHIRR - the SOUND of the STEEL BULWARKS CLOSING RISES AGAIN. CUT TO: INT.   SANDIN MANSION - FRONT ENTRANCE - NIGHT - SAME Charlie stands under the threshold of the front door. The Bloody Stranger just TEN FEET AWAY NOW. The SECURITY DOOR between them is NOW CLOSING.   IN TWO MORE SECONDS the BLOODY STRANGER won’t be able to enter. CHARLIE Come on!  33.  (CONTINUED)",
      "characters": [
        "CHARLIE",
        "JAMES",
        "POLITE LEADER"
      ],
      "action_text": "Security door CLOSING.   Almost closed.   Just a foot left. The Stranger reaches the door - Charlie grabs his hand and PULLS HIM THROUGH the ever-closing SLOT and INTO THE HOME just as THE SECURITY BARRICADE SHUTS behind him. The Stranger’s INSIDE.   The house is locked-down again. The Stranger, out of breath, stares down at little Charlie with his one eye - an eye dancing with surprise and an ever-present fierce intensity, when: JAMES (O.S.) WHAT THE HELL IS GOING ON? Charlie and Bloody Stranger turn to see JAMES AND MARY RUNNING down the CIRCULAR STAIRCASE, into the LARGE FRONT ENTRANCE FOYER, SPOTTING Bloody Stranger standing prominently, next to Charlie. Their faces fall in shock as they scrutinize this sinister-looking Man - his one eye - his throng of scars - his raw scalp wound - the BLOOD that veils his body and the LARGE KNIFE in his pocket. Bloody Stranger eyes James - and James’ GUN - wedged in James’ front pant’s pocket.   Tension and fear immediately rise in the air like a dense cloud. MARY Charlie - come over here. Charlie doesn’t move. JAMES What did you do, Charlie?   Do you know this man? CHARLIE No.   He needed help. James stares at Charlie, flabbergasted.   The gruesome Stranger is standing very still - breathing hard - staring at everyone with that uncompromising intensity. JAMES You know the rule, Charlie - never open the security doors. CHARLIE He would’ve died. JAMES That’s not our business, Charlie.  34.  CONTINUED:  (CONTINUED) MARY Were you being hunted, sir? The Stranger just stares at Mary - his heavy panting breaths betray his otherwise intransigent silence. JAMES That’s not our business either. (then, to STRANGER) Sir, my son made a child’s mistake.   You can’t stay here. CHARLIE Why?   He’s hurt. JAMES But we don’t know how he got hurt. Maybe he isn’t being hunted - maybe he’s doing the hunting. CHARLIE He was running from someone.   I saw him.   He needs help.   He - JAMES - Charlie, shut up now, son. James admonishes Charlie with a l",
      "dialogue_count": 3,
      "word_count": 5880
    },
    {
      "scene_number": 9,
      "slugline": "INT. PLAYROOM - NIGHT - SAME Charlie’s staring at the STRANGER - on the MINI SCREENS. He’s clearly up to something.   The Boy presses a button on the remote and: THE RABBIT’S EYES ILLUMINATE - flashing RED - announcing its presence to the Stranger for some reason. The Stranger, alerted, raises his knife and crawls toward the RABBIT now. CHARLIE holds steady - the man’s taut scarred face looming large inside Charlie’s GLASSES’ MINI SCREENS. The Stranger stares hard at the Rabbit - seeing it up close.   After a beat, The Stranger dismisses the toy, and starts moving away when the RABBIT’S EYES FLASH AGAIN. THE STRANGER pauses.   Something about the Rabbit and its clear attempt at communication has his curiosity piqued. The Stranger waits for more as Charlie works the remote, moving Victor forward now.   The Stranger remaining behind, just watching the Rabbit, considering it. The Rabbit pauses - looks back at the Stranger - flashes its eyes one more time.   A signal - ‘follow me’. The Rabbit then hops forward.   After a beat, the Scalped Man takes the cue - he begins FOLLOWING the green Rabbit. INT. SANDIN MANSION HOME GYM - NIGHT As James searches for the Stranger in the GYM, he HEARS: POLITE LEADER (O.S., THROUGH BULLHORN) - Mister and Misses, take a gander outside if you will.   As time is running out on your lives, we’d like to give you some motivation. James moves to the window - peers out the OBSERVATION SLOT but his VISION IS BLOCKED BY: A DEMENTED FACE RIGHT ON THE OTHER SIDE OF THE SLOT - LOOKING RIGHT AT HIM!   It’s one of the FREAKS - THE SURREAL BLOODY POPE - SCREAMING AND LAUGHING MANICALLY: FREAKISH POPE DID YOU FIND HIM!   I WANT TO PLAY WITH HIS BLOOD!  56.  (CONTINUED)",
      "characters": [
        "BLOODY STRANGER",
        "JAMES",
        "POLITE LEADER"
      ],
      "action_text": "Suddenly, a HAND clutching a KNIFE reaches around the LAUGHING POPE’S NECK - SLICING his THROAT WIDE OPEN - blood sprays across the observation slot.   James stands SHOCKED as the POPE DROPS and the POLITE LEADER’S FACE APPEARS: POLITE LEADER (re: The Pope) I never liked him. (then) Now, back to the issue at hand. Motivation.   Send out He - or this will be Thee, Sir Sandin. The Polite Leader moves away from the observation slot, granting James VISION again.   He sees: THREE PEOPLE in tattered CLOTHING - clearly HOMELESS PEOPLE - HANGING from STREET-LIGHT POLES - dead - HUNG the old-fashioned way - with NOOSES around their necks. James eyes the dead trio, then HEARS a soft haunting childish song: POLITE LEADER (O.S. SINGING) (CONT’D) Tickety Tock.   Tickety Tock. You’re time is almost up. James just stares out - his terror intensifying. INT. SANDIN HALLWAY - NIGHT WHUMP!   WHUMP!   WHUMP!   As the RABBIT hops down the dark hall.   Every few seconds the RABBIT looks back at: THE STRANGER - who’s following the Rabbit now.   He seems shocked that he’s doing it - but he’s not stopping.   The Rabbit flashes its red eyes in the darkness - a beacon for the Stranger to follow.   SAME TIME: CHARLIE - PLAY ROOM Steering the Rabbit and taking the Stranger in a specific direction.   Together, this incongruous duo moves through HALLS, ROOMS, STAIRS, finally coming upon: CHARLIE’S BEDROOM.   The Rabbit enters and moves into: THE CLOSET - through hanging clothes.   The Stranger follows the Rabbit inside, finding:  57.  CONTINUED:  (CONTINUED) CHARLIE’S SECRET LAIR The Stranger quickly surmises what this place is; the boy’s hideaway.   The Stranger gets it - understanding what Charlie has done.   The Stranger looks at the Rabbit - winks his one eye - ‘thanks’. CHARLIE - PLAYROOM Sees the Stranger ‘winking’ at him on the MINI-SCREENS. THE RABBIT flashes its eyes one last time, before exiting the closet, leaving the Stranger alone, hidden. THE RABBIT takes post in Charlie’s room - st",
      "dialogue_count": 3,
      "word_count": 7561
    },
    {
      "scene_number": 10,
      "slugline": "INT.   SANDIN MANSION - BACK HALL - NIGHT Mary is now standing over POLITE LEADER’S HEADLESS BODY - coolly withdrawing a WEAPON from his POCKET when she HEARS FOOTSTEPS in the HALL: MARY Kids?   I told you to stay - She turns - raises her FLASHLIGHT and SEES TWO SMILEY FACE MASKED PEOPLE standing at the end of the hall - both pointing GUNS AT HER. SMILEY FACE MASKED PERSON Don’t move.   Drop your weapon. Mary freezes - confused, caught. MARY Who are you? They don’t answer - both proceeding menacingly - guns up. Mary’s eyes land on a NEARBY ROOM - just a YARD AWAY - and, suddenly, as the Smileys close in, Mary MAKES HER MOVE.   WHOOSH!   BURSTING into this ADJACENT ROOM! POP!   POP!   TWO GUNSHOTS RING OUT - just missing her. Mary crosses that ROOM - exiting into a HALL. THE SMILEYS are hauling ass after her as MARY finds the: STAIRS She ascends, taking two at a time. She reaches the: SECOND FLOOR - running full tilt for her life - down the winding hallway, away from the Smileys.   MARY reaches the end of the hall.   She kicks open a door and ENTERS: A HOME OFFICE. She locks the DOOR, when BAM!   The LOCK IS BLOWN off by an O.S. GUNSHOT - delivered by the Smileys.   The DOOR swings open in a violent burst - Mary is thrown backwards.   She drops in a heap as the SMILEYS step in. Mary is trying to crawl away.   The Two Smileys are quickly upon her - securing her - pulling her to her feet - pushing her forward, guns to her back.   Mary’s caught. MARY (CONT’D) Who are you?   What are you going to do?   Did you hurt my children? The Smileys don’t speak - they push Mary into the:  85.  (CONTINUED)",
      "characters": [
        "ZOEY",
        "MARY"
      ],
      "action_text": "HALL Their GUNS to her back.   Mary’s terrified - no escape, when there’s a rush of movement behind MARY - a silver flash, the shimmering glint of a KNIFE’S EDGE SLASHING OUT at the TWO SMILEYS.   The blade SLICES SMILEY 1’s THROAT - a second flash punctures SMILEY 2’s TEMPLE. The Smileys drop.   Mary spins, seeing them dying at her feet.   She’s baffled as to what just happened when: THE BLOODY STRANGER - steps out from the SHADOWS - having just killed the Two Smileys with some expert knife work. Mary stares up at the Scarred Man.   She doesn’t move. The Stranger opens his mouth and says in his raspy voice: BLOODY STRANGER Are you hurt? Off Mary’s surprised, confused face - INT.   BASEMENT ROOM - NIGHT - SAME A FLURRY of FURIOUS MOVEMENT as about 6 SMILEY FACE MASKED PEOPLE tie up ZOEY and CHARLIE on the FLOOR. The Children are flopping around desperately, trying to break free from their quiet Happy Faced captors. CHARLIE ZOEY! ZOEY CHARLIE! (to their captors) Why are you doing this?   Why?   Who are you?   How did you get in here? No answers - just all those SMILEY FACES hovering above them silently - securing their FEET and HANDS viciously: ZOEY (CONT’D) LEAVE MY BROTHER ALONE! Zoey is losing it.   She’s flailing about.   She gets an ARM FREE and SWINGS IT VIOLENTLY, CONNECTING WITH ONE OF THE SMILEY FACES - KNOCKING OFF THE MASK, REVEALING: MRS. FERRIN.   Mary spoke to Mrs. Ferrin earlier in the day.   She lives next door to the Sandins.   She’s their fake-breasted neighbor who gave Mary the nasty cookies. Zoey and Charlie stare at her, beyond shocked.  86.  CONTINUED:  (CONTINUED) CHARLIE Tell me how you got in here. (looking toward the back of the room) There’s no way in from back there. There’s no - Charlie stops - seeing something in the REAR of the ROOM - DIRT/MUD all over the FLOOR behind some MACHINERY. CHARLIE (CONT’D) (realization) You dug a tunnel.   Are you crazy? MRS. FERRIN It took us a year.   Underneath the yard and into the basement here. Charlie",
      "dialogue_count": 2,
      "word_count": 2643
    }
  ]
}