{
  "slug": "the-white-lotus-101-arrivals-2021",
  "title": "the white lotus 101 arrivals",
  "genre": "drama",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 8482,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BOAT - DAY  A picture-perfect tropical day.   A small boat transports ARRIVING HOTEL GUESTS across a placid bay toward the hotel’s dock.   At the bottom of frame:   “TEN DAYS BEFORE” CLOSER ON DECK  Shane is here with his new bride, RACHEL, 30s.   His arm around her, they soak up the beautiful surroundings, looking very much in love, wind whipping their hair.  INSIDE THE CABIN  Two college girls, OLIVIA and PAULA, 19, sit in the cabin, side-by-side, observing the passengers out on the deck. Olivia wears a BARDO COLLEGE sweatshirt.   Paula wears a t- shirt with “POST-HOPE” written across it. They size up Shane and Rachel, under their breaths, rat-a-tat. OLIVIA Elyse and Chad.   Just got married in the Hamptons - her parents have a house there. PAULA She’s still thinking about her maid of honor’s toast, calling her out for being a total slut in college. OLIVIA She’s in fashion, marketing.   She feels her talents are being wasted. PAULA She wants her own Goop site - so she can hawk skin cremes. OLIVIA She loves him, but... PAULA He’s got a small dick. OLIVIA Her last boyfriend was hot as fuck - threw her around in bed... PAULA Stole her money, took a surfing trip to Bali, never came back.  THE LOTUS - 3.",
      "characters": [],
      "action_text": "OLIVIA Then she got serious.   Joined Raya. Met Chad. PAULA He went to Dartmouth - International Finance. OLIVIA Her dad loves him. PAULA She loves her dad. OLIVIA He’s a closet Adderall snorter. PAULA Gives him an edge at work. OLIVIA Makes his dick even smaller. PAULA They’ll have a baby in a year. OLIVIA She’ll have major post partum. Which begins a series of phantom illnesses she’ll bring awareness to on her insta. PAULA Hash-tag pain.   Hash-tag believe all sufferers. OLIVIA Munchausen’s is real. PAULA He’ll become disgusted with her. OLIVIA He’ll never forget the maid of honor’s toast at the wedding. PAULA How many guys   did   you fuck?   Huh, Elyse? PAULA One day, in an Ativan haze, she insults his little penis.   He loses it.   Clocks her.  THE LOTUS - 4. OLIVIA She jumps out the tenth-floor window.   That’ll show everyone.  PAULA  See!   I really was in pain . OLIVIA Their baby is raised by her parents in Montauk. They stare in silence at Rachel and Shane for a moment. PAULA Sad. OLIVIA Totally. They now turn their attention to a woman traveling alone, in her 50s, sitting on the deck.   Her name is TANYA, looking glamorous in sunglasses and a fashionable outfit. PAULA Walmart heiress. OLIVIA Republican bundler. PAULA Meeting her friends for a girls trip. OLIVIA She gets on their nerves.   But she pays for everything so they put up with her. PAULA She’s got Crohn’s.   She keeps having surgeries - they’ve taken out half her large intestine. OLIVIA The flatulence is deadly. PAULA Sepsis farts.   She’s rotting inside. Out on the deck, an attractive couple in their early 50’s, MARK and NICOLE, cross Olivia and Paula’s eye-line.  THE LOTUS - 5. OLIVIA A pair of high-end pimps for a billionaire sex pervert.   They masquerade as well-meaning corporate-woke fucktards. PAULA They’re coming to recruit us into their   Illuminati   pedophile ring. The couple opens the door and pops their head into the cabin. NICOLE Having fun, girls?! OLIVIA Yeah, Mom.   What? NICOLE C",
      "dialogue_count": 0,
      "word_count": 1746
    },
    {
      "scene_number": 2,
      "slugline": "INT. GARDENIA SUITE - DAY  Rachel is lying on the bed, studying the hotel menu. RACHEL They’re having a lobster bake tonight.   Yummy. Shane, now in a bathing suit, gets on the bed and crawls over to her, pulling the menu from her hand and tossing it. SHANE Let’s get this honeymoon started. Shane starts kissing her.   They are all over each other. Then, Shane suddenly stops and sits up, looking around the room with a dissatisfied expression. RACHEL What is it?   What’s wrong? Shane continues surveying the room, grimacing. RACHEL Shane? SHANE This is the wrong room. RACHEL What do you mean? SHANE We’re supposed to be in a honeymoon suite.   This isn’t the honeymoon suite. RACHEL Maybe it is.   Why isn’t it? SHANE Because I did a virtual tour of it on their website - and this is not it.   This is just a regular room. RACHEL This is like the swankiest hotel room I’ve ever been in, Shane. SHANE But we’re   paying   for the Honeymoon suite.  THE LOTUS - 12.",
      "characters": [],
      "action_text": "RACHEL Technically, we’re not paying for anything. SHANE Okay, my parents are paying for it. Still - we should get the room we booked.   I’m gonna talk to the guy. RACHEL We just put everything away.   I think it’s fine.   Great view. We’re near the restaurant.   It’s convenient - we can stuff ourselves then go drown in the ocean. SHANE We were supposed to have our own pool. RACHEL The pool’s literally right there. SHANE Our   own   pool, Rachel. RACHEL In the room? SHANE On our private deck! RACHEL What, like a plunge pool? SHANE That’s fucked up.   They screwed us on the room. RACHEL I wouldn’t go that far.   Just talk to the guy.   Is it a big deal? SHANE Yeah.   It’s our once-in-a-lifetime honeymoon.   I want this to be perfect for ya, baba. RACHEL Awww. SHANE I’m gonna go talk to him.   Let me get a blowjob first.  THE LOTUS - 13. RACHEL Are you serious? SHANE (flirty) It was a twelve hour flight.   You got me so horned up. (off her look) All right, yeah, let’s save it for the right room. Shane heads out.   Rachel hops up from the bed. RACHEL Wait, I’m coming. The door closes on her.   She opens it and follows him out.  INT. PALM SUITE - DAY  Carmen, clutching the tray to her chest, has delivered Tanya to her room.   Carmen looks ashen, something’s bothering her. CARMEN Will you be needing anything else at this time, ma’am? TANYA Where are my bags? CARMEN Right there by the closet. TANYA (looks over; distressed) There was a small white plastic bag - I don’t see it. CARMEN Plastic bag? TANYA Yes!   It’s very important. CARMEN I can call the bellman. TANYA It has my mother’s ashes in it! CARMEN Oh!  THE LOTUS - 14. TANYA Oh my god.   Are they lost? Tanya panics.   Carmen spots the bag, tucked behind Tanya’s oversized luggage.   Carmen picks it up. CARMEN Is this it? TANYA Yes.   Yes, thank god.   Thank you. I can’t lose this. Tanya hands Carmen a TWENTY.   Carmen takes it, smiles, then exits. Outside the room, Carmen’s expression changes - she looks nauseated, cl",
      "dialogue_count": 0,
      "word_count": 2905
    },
    {
      "scene_number": 3,
      "slugline": "INT. SPA OFFICE - DAY  Tanya is now lying on the floor, her head in Belinda’s lap. Belinda is massaging Tanya’s scalp. TANYA Ahh.   That feels nice. BELINDA Tanya... TANYA Yes. BELINDA I want you to repeat after me, okay? TANYA Okay. BELINDA Every moment... TANYA Every moment... BELINDA I am being born into this life. TANYA I am being born into this life. BELINDA The world around me is alive and full of wonder. TANYA The world around me is alive and full of wonder. BELINDA I will drop the story. TANYA I will drop the story. BELINDA And feel the newness of each moment. TANYA And feel the newness of each moment.  THE LOTUS - 28.",
      "characters": [],
      "action_text": "BELINDA I am my own phallic mother. TANYA (slightly thrown) I am my own phallic mother. BELINDA My own vaginal father. TANYA My own vaginal father. BELINDA I fill my own cup. TANYA I fill my own cup. BELINDA Nothing is ever lost and all will be returned to me - except those things that are inessential. TANYA Nothing is ever lost and all things will be returned to me except the... umm... Tanya forgets what she’s supposed to say.   Belinda just keeps going - her massaging movements getting more intense. BELINDA I have the power to heal myself. TANYA I have the power to heal myself. BELINDA My failing body is immaterial - the child in me is as alive and fresh as the day I was born... TANYA My failing body is... BELINDA ...and I will connect with that child at all times and feed and nourish her. TANYA I... okay.  THE LOTUS - 29. Belinda starts speaking in some kind of foreign tongue. BELINDA Aum bhur bhuvah svah... TANYA Aum bhuverer... BELINDA You don’t need to repeat this. TANYA You don’t... ya, okay. BELINDA It’s a Hindi mantra.   Shh... (chants)  Aum bhur bhuvah svah tat-savitur varenyam bhargo devasya dhimahi dhiyo yo nah pracodayat...  Belinda keeps chanting - while making adjustments to Tanya’s head and neck.   Tanya seems overwhelmed.   Tears fall from her eyes - it’s having some powerful effect.  INT. LOTUS LOBBY - DAY  Carmen is at the concierge desk.   She looks unwell.   Her brow is sweaty, she clutches her stomach. Suddenly a SPLASH of water hits the floor beneath her. Carmen, horrified, looks down.   Her water has broke.   She doesn’t know what to do, but she’s panicking. Armond arrives, oblivious.   Carmen struggles to speak. CARMEN I... I think I... Armond looks her over and grimaces. ARMOND Carmen, you all right?   You’re white as a sheet. CARMEN I should sit down. ARMOND We can’t have you sitting in the lobby.   Wouldn’t look right.  (MORE)  THE LOTUS - 30. Go take a break in my office.   Food poisoning, do you think?   Maybe the tuna? Carmen stumbles ",
      "dialogue_count": 0,
      "word_count": 3325
    },
    {
      "scene_number": 4,
      "slugline": "INT. TRADEWINDS SUITE - NIGHT  Olivia and Paula, in their nightwear, both in bed, scroll through their phones.   Without looking up... OLIVIA So you thought that guy was hot? PAULA (never looks up) What guy? OLIVIA The one at the fire pit.   The one you were gawking at? PAULA I don’t remember any guy at the fire pit. Olivia’s brow furrows - she finds this suspicious. There are NOISES coming from the closet.   Olivia looks over. OLIVIA Quinn, what are you doing in there?!   Are you fapping??! INSIDE THE CLOSET Quinn is trying to get comfortable on his fold-out bed.   He’s trying to find room for himself amongst all his electronics. QUINN FUCK OFF! OTHER BEDROOM Nicole and Mark are getting ready for bed, when MARK’S CELL RINGS.   He crosses to the table where his CELL VIBRATES. ON PHONE - the CALLER ID reads “MARIN COUNTY MEDICAL CENTER”. Mark sees this and turns to Nicole. MARK Shit, it’s the doctor, Nicole. Nicole looks up, sharply. NICOLE I told you.   Today   is   tomorrow. Answer it.  THE LOTUS - 48.",
      "characters": [],
      "action_text": "Mark picks up the phone and answers the call. MARK Hello? NURSE’S VOICE Mark Rohrbacher? MARK Yes, this is he. NURSE’S VOICE Do you have a minute for the doctor? MARK Yes, of course. NURSE’S VOICE One second and I’ll put him on. Mark is put on hold.   He and Nicole exchange expectant looks. Their expressions run the spectrum of hope, anxiety, forced smiles... After an excruciating few moments, the Nurse hops back on. NURSE’S VOICE I’m so sorry, Mark.   I just lost him. MARK What? NURSE’S VOICE Can we call you back in a few minutes? MARK I’m on vacation, uhhh...   It’s late here.   Can’t you just get him back? NURSE’S VOICE So sorry.   Just be a few minutes. I promise.   Call you right back. She hangs up. Mark and Nicole are left hanging.   Mark gives Nicole a look of dread and disbelief.  THE LOTUS - 49. NICOLE It’s gonna be okay, Mark.   It’s gonna be good news. Mark nods, but he looks like he might throw up.   He sets the phone back down and stares at it.   It doesn’t ring.  INT. GARDENIA SUITE - NIGHT  Shane is in bed, reading.   Rachel enters the room and climbs into bed with him. SHANE You good? Rachel nods and gives him a satisfied smile. RACHEL We’re married.   We’re on our honeymoon. SHANE (smiles, lovingly) Yep. RACHEL I’m happy. (beat) I just hope we don’t ever become one of those old, depressing couples with tons of baggage and resentments and regrets and...   I just hope it always stays like this, you know? SHANE It will, baba. RACHEL Really?   Promise? He pulls her close to him and holds her, tight. SHANE We’ll always feel this way.   We’ll always be young.   We’ll always be in love.   And there will be days and days - just like this. They share a warm smile, then a passionate kiss - and continue holding each other as we... FADE TO BLACK.  THE LOTUS - 50.",
      "dialogue_count": 0,
      "word_count": 506
    }
  ]
}