{
  "slug": "the-lunchbox-2013",
  "title": "the lunchbox",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 7,
  "characters": [
    "SAAJAN",
    "ILA",
    "RAJEEV",
    "SHAIKH",
    "ILA'S MOTHER",
    "PHOTOGRAPHER",
    "OLD MAN"
  ],
  "total_words": 15375,
  "total_dialogue": 17,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ILA'S DOORSTEP - CONTINUOUS Ila answers the door to - the Dabbawallah DABBAWALLAH Madam... He hands her the lunchbox back, and takes off just as fast. Ila's hand goes up and down, she is surprised at how light the lunchbox is. She shakes it, curious, she opens it up at her doorstep itself - every compartment is empty. INT. ILA'S KITCHEN - CONTINUOUS Ila goes to the window. ILA Auntie...auntie... Mrs. Deshpande's voice comes in from above. MRS. DESHPANDE What happened? ILA He ate it! Not only did he eat it, he finished it, he licked it clean!! A beat, Mrs. Deshpande is just as surprised as her. And then- MRS. DESHPANDE (O.S.) (laughs-) Didn't I used to tell you? This is just the beginning...you will see... Ila smiles. INT. OFFICE - DAY Saajan is holed up behind his desk. He glances at the office clock- It is 4:45. He peers down the hall. Saajan's POV. - Shaikh has been intercepted, he chats with someone, a mile a minute. Saajan reaches for his bag, this is his chance. He sneaks out the cubicle, and walks in the opposite direction. He glances over his shoulder - Shaikh is still busy talking. Saajan turns the corner and circles around, he makes his way to the reception, taking quick strides. He looks over his shoulder as he exits, making sure...  9.  (CONTINUED)",
      "characters": [],
      "action_text": "Saajan exits the office, without as much as a nod or a goodbye to anyone. EXT. STREET - LATER Saajan has made his escape, he walks past Flora Fountain, and the High Court building... Walking alongside the rest of the evening commute all in the same direction - like items going down an assembly line. He walks past a STREET ARTIST perched on the footpath, painting deftly. The Artist has several paintings on sale, all identical of the scene in front, the traffic, hordes of people. Saajan strides past him like the rest of the evening commute. INT. TRAIN - MOMENTS LATER Saajan stands in the crowded compartment as the train makes its way North. At every station, people jostle to get in and out in mere seconds, the people are the lunchboxes. Nearby, TWO BEGGAR CHILDREN, one plays the harmonium, the other sings. A Yuppie in wire frame glasses, in office clothes chats, animated, in the background. Saajan struggles to stay awake as the train chugs northward. BEGGAR Pardesi pardesi...jaana nahin... INT. BANDRA STATION - LATER Saajan alights the train at a crowded station, jostling and pushing a sea of commuters to get out. He walks down the platform. EXT./INT. BUS STOP - MOMENTS LATER Saajan boards the bus from the bus stop outside the station, the number 211 bus. Saajan stands in the crowded bus, holding on to the handlebar. The beggar's song, perhaps in his head, continues over all this. INT. ILA'S HOUSE - LATER A song plays at Mrs. Deshpande's house above. SONG Pardesi pardesi...jaana nahin...  10.  CONTINUED:  (CONTINUED) Ila mumbles, singing along as she puts finishing touches to her make up.   The doorbell rings. Ila, now with a touch of make-up, subtle yet noticeable, she looks beautiful. On her way to the door, she screams out the window- ILA Auntie, turn off the music Rajeev is here... MRS. DESHPANDE (O.S.) OK... The music goes off. She opens the door with a smile. ILA How was your day? Standing in front of her is RAJEEV, 30s, he wears metal framed glasses and a crisp",
      "dialogue_count": 0,
      "word_count": 1485
    },
    {
      "scene_number": 2,
      "slugline": "INT. SAAJAN'S LIVING ROOM - NIGHT Saajan reads a yellowed paperback and eats from take out polyethylene bags, it all looks very unappetising, the opposite of his lunch in the day. CUT TO: THREE MUMBAI LOCALS CRISSCROSS, THE CONVEYOR BELT OF THE CITY AT WORK AGAIN... INT. TRAIN - DAY Saajan stands with the rest of the commute, rocking to the motions of the train. The chugging of the train is flogging the spark of the life out of these people, and its only morning. Oblivious to its effects, Rajeev chats with someone far in the background. INT. OFFICE - DAY Saajan works in his cube, doing the same thing as the day before. Shaikh approaches. SHAIKH Good morning sir... Saajan looks up from his work. SAAJAN Good Morning. SHAIKH How are you sir? Saajan merely nods, as his fingers work the calculator. SHAIKH (CONT'D) I came by yesterday, at four forty five...you were not here. I was here. SAAJAN You were late. SHAIKH (confused-) No sir...four forty five I came... SAAJAN You were late.  16.  (CONTINUED)",
      "characters": [],
      "action_text": "Saajan is buried in his work. Shaikh hovers at Saajan's desk for a beat, he has no choice - He looks at the file the Saajan is working on. SHAIKH Are these claims files sir? SAAJAN This is the Claims department. Shaikh laughs, as though Saajan has cracked a joke. SHAIKH Can we start the training today Sir? SAAJAN I am busy, lets talk after lunch. SHAIKH Why don't I just come by after lunch? SAAJAN OK... SHAIKH For sure you'll be here right? Saajan doesn't respond. SHAIKH (CONT’D) OK sir...see you after lunch... Shaikh departs, Saajan's look of disdain follows him. INT. CANTEEN - LATER The canteen is filled with the lunch crowd. Saajan sits alone, away from everyone else. He opens up the lunchbox, steam rises up from the food, the aroma hits him. And instantly, he is seduced by it. He takes a bite of the food, and very quickly one roti is finished. He goes for another, and comes up with a folded piece of paper instead. He looks around- is someone playing a prank on him? Laughter at another table. Saajan unfolds it curiously - it is a letter- ILA (V.O.) Hello, I hope you are enjoying the food...  17.  CONTINUED:  (CONTINUED) Saajan glances around, just the busy chattering lunch crowd around him. He continues reading. ILA (V.O.) Thank you for polishing off this dabba yesterday... CUT TO: INT. ILA'S KITCHEN - EARLIER THAT DAY Steam rises from the pot, onions fry in another pan. It is hot in this kitchen. ILA (V.O.) ...It was the best thing that happened to me in years... Ila stands over the cooking range. ILA (V.O.) For a few hours I thought my husband ate the food I cooked for him, he wiped it clean and would come home and tell me that it was very good. VARIOUS SHOTS - Of Ila's hands as she crafts this meal. Its like she has infused herself in this food. We see only her hands as a complete picture of her emerges in Saajan's mind. ILA (V.O.) Of course none of those things happened. But for a few hours they happened over and over, inside my imagination...And in return fo",
      "dialogue_count": 0,
      "word_count": 939
    },
    {
      "scene_number": 3,
      "slugline": "INT. FILING AREA - DAY Saajan searches for some files. SHAIKH Good afternoon sir, how are you? SAAJAN Good SHAIKH I went to your desk sir, didn't find you there, so I came here... Saajan keeps looking for his files. SHAIKH (CONT’D) I saw you in the canteen, in the corner table...I wanted to come over and sit with you, but you were reading something so I didn't want to disturb. No response. Shaikh presses on- SHAIKH (CONT’D) What a wonderful aroma from your tiffin box sir...waah! I could taste the food by just the whiff of it... Saajan offers no opening, Shaikh valiantly tries again. SHAIKH (CONT'D) Very wonderful aroma sir, you are a lucky man, your wife must be a very good cook. SAAJAN My wife is dead. Saajan goes into his cubicle leaving Shaikh hanging behind, and tongue tied. Shaikh sighs in defeat, he could kick himself. EXT./INT. BUS - LATER The evening Sun spreads an orange hue over the sky. overcast. A soft drizzle falls over the city. It is Saajan sits in the c. He walks past the church and then past its adjoining cemetery.  21.  (CONTINUED)",
      "characters": [
        "SAAJAN",
        "ILA",
        "RAJEEV"
      ],
      "action_text": "His pace slows, he glances over the cemetery wall, scanning the gravestones, there are flowers on some of them... He keeps on walking, leaving the cemetery behind. CUT TO: INT. OFFICE - DAY Saajan looks to his watch. It is a little past noon. He peeks out of his cubicle, down the aisle. The peon approaches - distributing dabbas along the way. The lunchbox lands on his desk. Curious, Saajan unzips it and takes in the aroma, the aroma of Ila's food. His neighbor eyes him quizzically. He gets back to work. But only for a beat or two, intoxicated by the aroma. Much to the surprise of his Neighbor, Saajan closes his file shut, and turns the calculator off, takes the lunchbox in his hand and takes off. INT. CANTEEN - MOMENTS LATER Saajan opens up the dabba, and spreads out the boxes of food. He takes in the aroma. Before he eats, he first checks between the rotis. He finds nothing. He checks under the last roti, again, nothing.   Saajan puts the container down, and takes a bite of the food in front of him and chews on it. He coughs violently, and reaches for the water bottle, and gulps some water down. He goes back to the food, the spices bring tears to his eyes, yet he keeps eating. INT. ILA'S DOORSTEP - LATER The doorbell rings, Ila answers it. DABBAWALLAH Madam The dabbawallah hands her the dabba and takes off. Once again it is light, Ila feels the weight of it. INT. ILA'S KITCHEN - MOMENTS LATER Ila stands by the window sill, the empty dabba, polished clean, sits on the counter. She reads Saajan's reply - in neat meticulous hand.  22.  CONTINUED:  (CONTINUED) Its like Saajan's letter was a brief outing outside of this flat, too brief. Rajeev snores, Yashvi lies in the middle of Ila and Rajeev. Ila stares up at the rotating ceiling fan, sleepless. CUT TO: INT. CANTEEN - DAY Many old ceiling fans creak in the canteen. Below - Saajan sits at this usual table. He opens up the lunchbox. And the compartments one by one. He checks between the rotis again, and this time he un",
      "dialogue_count": 4,
      "word_count": 2212
    },
    {
      "scene_number": 4,
      "slugline": "EXT. STREET - CONTINUOUS Saajan walks in a hurry, taking long strides past the stalled traffic. INT. AUTORICKSHAW - MOMENTS LATER Saajan's autorickshaw, stalled in the traffic. AUTO RICKSHAW DRIVER Bus, rickshaw, aeroplane, everything   gets stuck in the Mumbai traffic   sahib... Saajan peeks ahead impatiently. AUTO RICKSHAW DRIVER (CONT’D) This road is blocked from the morning...A woman jumped off with her little girl from that highrise building ahead... Saajan freezes, instinctively SAAJAN What was her name? The woman's name... AUTO RICKSHAW DRIVER What do I know sahib? I am not related to her. The driver is more than eager to share gossip. Saajan peeks out of the rickshaw, he sees only traffic AUTO RICKSHAW DRIVER (CONT’D) She must have some family problems...Do you know someone in that building? Saajan shakes his head, no.   They remain stuck in traffic for a beat or two, Saajan tries to peer ahead, sees only traffic. An ambulance siren draws closer, and an ambulance zips past them going in the opposite direction. Saajan peeks out from the other side of the rickshaw. The ambulance draws away, siren blaring, Saajan looks on. The wait is even more excruciating now.  31.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 195
    },
    {
      "scene_number": 5,
      "slugline": "INT. OFFICE CUBICLE - LATER Saajan sits in his cubicle, working. He peers down the aisle between the desks every now and then, checks his watch. Finally, he spots the Peon distributing dabbas. He waits nervously for the Peon to come into his cubicle. THUMPS as lunchboxes land of various tables. This is taking awhile. THUMP. The Peon deposits a dabba on his desk and moves on. Saajan waits for a beat till the peon is out of earshot, he then grabs the dabba, and quickly unfastens it. He unzips the case and breathes in. The aroma of Ila's food hits him and he lets out an AUDIBLE sigh of relief. INT. CANTEEN - MOMENTS LATER Saajan sits alone at his usual table, his back to the lunch crowd. He reads from a piece of paper. ILA (V.O.) Hello, this morning I switched the radio on after my husband left for work and my daughter left for school. CUT TO: INT. ILA'S ROOM - LAST NIGHT Ila is alone in her room, going through a trunk. She flips through old photographs of a young man- her brother. ILA (V.O.) When my brother died...everyone said he should have had courage...so what if he failed in his exams...he should have had courage...What must have gone through that woman's mind... CUT TO: INT. ILA'S ROOM - NIGHT Ila takes her bangles, chain and earring off... ILA (V.O.) She must have taken all her jewelry off...bangles, earrings, chain... INT. STAIRWELL - NIGHT Ila walks up towards the roof hand in hand with Yashvi.  32.  (CONTINUED)",
      "characters": [
        "ILA",
        "SHAIKH"
      ],
      "action_text": "SAAJAN No...you don't come back...go and work. SHAIKH Right away sir... Shaikh leaves with a sense of purpose. Saajan goes back to the letter. CUT TO: INT. ILA'S KITCHEN - DAY Ila reads Saajan's letter. SAAJAN (V.O.) Dear Ila, Please don't think like that...Things are never as bad as they seem. One day I was on the train on my way to work... And we see just that- INT. TRAIN - ONE DAY Saajan in the jam-packed morning local. the door, sandwiched by the crowd. He stands close to He is weirded out by a strange sensation below. SAAJAN (V.O.) ...And then suddenly I felt something. Someone touching me...down...down there you know... He scans the people around him - An OLD WOMAN- toothless, smiles at him. SAAJAN (V.O.) And then I felt it again... The Toothless Old Woman smiles at him again. SAAJAN (V.O.) And again and again...Mahim came and went, then Matunga, Dadar...Mahalaxmi, Bombay Central...  35.  CONTINUED: (2)  (CONTINUED) The train stops and starts, the Old Woman remains smiling at Saajan each time he glances in her direction. He is trapped. SAAJAN (V.O.) ...Then, I finally mustered up the courage to look down... Saajan looks down and much to his surprise he sees - a file. The Man in front of him holds a file wedged between his legs, so his hands are free to hold the handlebars. The file has been hitting up against Saajan's crotch this whole time. We stay with Saajan and his realization for a beat. Despite himself, he smiles at the Old Woman, she smiles back - her toothless smile. INT. ILA'S KITCHEN - CONTINUOUS Ila laughs as she reads the letter, despite herself. She folds the note. MRS. DESHPANDE (O.S.) Are you laughing? ILA Yes auntie...I remembered a joke... MRS. DESHPANDE (O.S.) Tell me the joke...will you? Ila thinks fast. ILA I forgot. MRS. DESHPANDE (O.S.) You forgot!? Soak five almonds everything and eat them in the morning...its a tonic for memory! ILA I will, right away auntie... EXT. CIGERETTE STALL - LATER Saajan buys cigarettes, waits for his change. S",
      "dialogue_count": 4,
      "word_count": 2034
    },
    {
      "scene_number": 6,
      "slugline": "INT. SAAJAN'S HOUSE - LAST NIGHT Saajan rummages through the old things in a drawer. Beneath everything else he uncovers - dusty video cassettes. He wipes the dust off, and tries to read the yellowed labels on them. SAAJAN (V.O.) My wife used to love them... The yellowed labels in neat hand read - 'Humlog', 'Yeh Jo Hai Zindagi', 'Nukad'...There are many tapes. SAAJAN (V.O.) She would watch them again and again. It used to make me very annoyed... Especially on Sundays... INT. SAAJAN'S LIVING ROOM - LAST NIGHT Saajan stands outside the video shop, smoking. SAAJAN (V.O.) I never watched them with her. But yesterday...I don't know why, I wanted to see them. Saajan watches an episode of 'Yeh Jo Hai Zindagi', an old TV show. SAAJAN (V.O.) I watched for hours... He sits on the couch and gazes intently, impassive, the laughter track plays after each joke. SAAJAN (V.O.) I went through them show by show, episode by episode... Day breaks... INT. SAAJAN'S HOUSE - DAY The morning light floods the room. SAAJAN (V.O.) And then finally after staying up all night...I realized what it was that I was looking for... A show still plays on the TV, but Saajan is not on his couch anymore. The room is empty, smoke comes in through the iron bars.  43.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 221
    },
    {
      "scene_number": 7,
      "slugline": "EXT. SAAJAN'S HOUSE - CONTINUOUS Saajan is outside, looking at the TV through the iron bars of the window. Saajan puffs on his cigarette as he watches his TV inside, one of the 80s shows still playing on it. SAAJAN (V.O.) Every Sunday when she watched the shows, I was outside, repairing my bicycle, or just smoking...and I'd glance through the window every now and then...just for a second... Saajan's POV.-Of the TV playing 'Yeh Jo Hai Zindagi' SAAJAN (V.O.) ...I would see her reflection on the TV screen, laughing...laughing at the same jokes over and over...each time as if she was hearing it for the very first time...I wish... I had kept on looking back then... Saajan takes a deep drag from his cigarette and keeps on watching the TV from outside for several beats. BACK TO: INT. ILA'S KITCHEN - DAY Ila finishes reading Saajan's note. She folds it, and looks out the window, contemplating what she just read. INT. CANTEEN - NEXT DAY Saajan opens up the dabba. Out of nowhere, Shaikh joins him, seating himself across the table. SHAIKH Hello sir, I sent all those pay orders to accounts... He is now wearing a more sober shirt like Saajan's, this is not lost on Saajan. SAAJAN OK Shaikh removes fruits from a plastic bag.  44.  (CONTINUED)",
      "characters": [],
      "action_text": "SHAIKH Today sir, I have got you bananas and apple. Shaikh offers him an apple. Saajan knows what Shaikh wants- SAAJAN Here, have some... He pushes Ila's food forward. SHAIKH No no sir, you eat. SAAJAN It is too much for me, have some... Shaikh doesn't need much convincing. He happily goes for a roti, and uncovers - Ila's note, tucked between the two rotis. Saajan eyes the note, embarrassed. SAAJAN (CONT’D) What is this? SHAIKH Sir... seems to be a paper.. Saajan takes it in his hands and examines it as though it was a foreign object he has never seen, then he tucks the note in his pocket and eats as though nothing happened. Shaikh eyes him suspiciously. The WATERBOY passes, just in time SAAJAN Can I have some water please...? As the Waterboy pours the water- SAAJAN (CONT’D) How the food? SHAIKH I love this... Saajan grabs a second roti and starts eating as if nothing happened.  45.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 383
    },
    {
      "scene_number": 8,
      "slugline": "INT. SAAJAN'S OFFICE - LATER Saajan reads Ila's note from the safety of his desk, as though he were reading a comic book in class. ILA (V.O.) Hello, my mother loves the old TV shows. She still talks about them sometimes...I wanted to say...you should not smoke. My father has lung cancer...They say you lose five minutes for every cigarette you smoke. When the pain gets very bad, my father says he should have smoked thousands more so he would not have to go through these years. I hope you don't mind me saying this... Saajan folds Ila's note, and tucks it under a file in the corner. Music begins and carries over to... EXT. SAAJAN'S BALCONY - NIGHT Saajan stands on his balcony holding an imaginary cigarette in his hand, and taking deep drags from it and blows the imaginary smoke in the air. Then he pauses, and puts his hands behind his back.   He inhales deeply, taking in the evening air, then he exhales. He does it again, and again, the music mounts as Saajan takes fresh air into his lungs. INT. ILA'S KITCHEN - LATER Ila washes the eggplants in the sink. MRS. DESHPANDE (O.S.) Ila...oh Ila... Ila turns the tap off. MRS. DESHPANDE (O.S.) (CONT’D) Did you get my carrots? ILA Yes auntie Ila grabs the bag of carrots as Mrs. Deshpande's basket is lowered to her window. She places the carrots in the basket and takes the money that Mrs. Deshpande has placed on it.  46.  (CONTINUED)",
      "characters": [
        "ILA",
        "ILA'S MOTHER",
        "SAAJAN"
      ],
      "action_text": "She indicates at the room, where Ila's father is.   Ila watches her father from down the hall- Inside a bedroom, lies an OLD MAN with a drip over his bed, this is ILA'S FATHER, his breathing labored ... ILA'S MOTHER (CONT’D) Go and see him...I will wake him up. ILA No ma, we should get back home... At their feet, Yashvi makes the old doll mimic her grandfather's position on the bed. INT. ILA'S KITCHEN/LIVING ROOM - MOMENTS LATER Ila stands at the window looking at the street below. Yashvi plays a game of pretend blind man's bluff with the old doll, she has tied a blindfold over the doll's eyes. Ila spots the dabbawallah slowing down, and getting off of his bicycle. He makes his way up with Ila's dabba. The doorbell rings, Ila goes to the door. Yashvi's game continues, as Ila retrieves the Dabba from the dabbawallah. Ila comes back with the empty dabba, and sits on the dining table. She opens up Saajan's note. Close on Ila as she reads the note- SAAJAN (V.O.) Dear Ila, you won't believe what happened to me on the way to work yesterday... CUT TO: EXT. STREET - YESTERDAY EVENING Saajan and Shaikh walk towards the station. SAAJAN (V.O.) In the evening as I was walking to the station with Shaikh...Shaikh and I, we work together... They walk past the Street Artist as he deftly draws up the busy scene in front of him. Saajan pauses to look at his work.  49.  CONTINUED: (2)  (CONTINUED) Saajan sits in the rickshaw as it zips in and out of streets, he looks up at tall buildings, rows of shops. The painting still tucked under his arm. SAAJAN (V.O.) The old houses of boys I used to play with when I was a child are gone now...my old school too... He looks at new mall as they ride past. SAAJAN (V.O.) But some things are still the same...the old post office is still there...and the hospital where I was born, and where my parents died...and my wife... Saajan's POV. The hospital flashes past... They ride through the streets as Saajan looks on... BACK TO: INT. ILA'S HOUSE - CONTINUO",
      "dialogue_count": 3,
      "word_count": 1355
    },
    {
      "scene_number": 9,
      "slugline": "INT. ILA'S HOUSE - CONTINUOUS Ila folds the letter. She looks at Yashvi playing blind man's bluff with the doll still. ILA Don't...don't cover her eyes like that... YASHVI But I am playing blind man's bluff... ILA The dolly must be tired of shutting her eyes so tight... Yashvi ponders, this makes sense to her. ILA (CONT’D) Should I tell you what we used to play? Yashvi smiles YASHVI What? Ila removes the blindfold from the doll and contemplates it ILA We used to play house with it... I used to play the papa, and your uncle used to play the mummy, my wife... Ila and Yashvi smile at the memory... INT. CANTEEN - DAY Saajan sits on his regular table in the canteen. He opens up the dabba. In the first compartment he finds - eggplant! He smiles. He opens up the other compartment, and retrieves Ila's note from between the two rotis. He looks around to make sure Shaikh is not approaching, and then unfolds it. ILA (V.O.) Hello, you are right, life is strange. I think my husband is seeing another woman. Saajan pauses  52.  (CONTINUED)",
      "characters": [
        "ILA",
        "SHAIKH"
      ],
      "action_text": "Ila takes it in her hands. She feels how heavy it is. The dabbawallah takes off. INT. ILA'S LIVING - MOMENTS LATER Ila unfolds Saajan's note and reads it. Ila gapes at it, surprised. She reads the note over again. INSERT NOTE - 'What if I come to Bhutan with you?' CUT TO: INT. TRAIN - LATER Saajan gazes outside the window absentmindedly as he and Shaikh ride the train home together. Shaikh peers at him. SHAIKH You look very distracted today sir...Is everything OK? SAAJAN Shaikh...Have you been to Bhutan? SHAIKH Bhutan? I have only been to Saudi sie... SAAJAN I have been thinking...instead of Nasik, maybe I should go retire in Bhutan... SHAIKH (smiles) I have only been to Saudi. But Bhutan might be good...our one rupee is equal to five there... A beat SHAIKH (CONT'D) And my mother always says -... sometimes the wrong train can take you to the right station. Saajan looks at him for a beat, thoughtful SAAJAN Your mother? You told me you were an orphan.  54.  CONTINUED:  (CONTINUED) SHAIKH I am sir, but when I say -'my mother always says...' people take it more seriously... And it feels good... Saajan smiles, he looks out the window again. INT. SAAJAN'S BALCONY - NIGHT Saajan sits on an old rocking chair tunes an ancient radio. A lot of intermittent static, he tunes past several stations. RADIO You are listening to radio Bhutan... More static   A Bhutanese song comes in. Saajan leans back and listens, moving his foot to the beat of the music. INT. CANTEEN - DAY The Bhutanese song continues over- Saajan reading Ila's note. ILA (V.O.) Hello, How can you come with me to Bhutan? I don't even know your name. Saajan smiles, almost blushes. SHAIKH How are you sir? Music ends. Saajan tucks the note in the pocket of his shirt as Shaikh seats himself across. Saajan pushes the food forward. Shaikh takes in the aroma. SHAIKH (CONT’D) You are glowing today sir...You look ten years younger, touch wood. Shaikh munches on the food, enjoying each morsel. SAAJAN Your mother always says..",
      "dialogue_count": 2,
      "word_count": 3066
    },
    {
      "scene_number": 10,
      "slugline": "INT. OFFICE - DAY The peon distributes dabbas as he walks down the rows of desks. He leaves one on Saajan's table with a HOLLOW THUMP. Saajan looks up from his work, he regards the Dabba. He picks it up tentatively. Once again, his Neighbor peeks over with interest. It is very light, he shakes it. He unscrews the top and opens it up, pulling out the three tiered tiffin box. He opens the first box, its empty. And the third is empty as well. The second, also empty, Saajan sits there with the empty lunchbox in front of him. SAAJAN (pre-lap) Dear Ila,.... INT. ILA'S HOUSE - LATER Ila stands by the window sill and reads Saajan's note. SAAJAN (V.O.) I got the lunchbox today, there was nothing in it...and I deserve that. Yesterday, you waited in the restaurant for me...for a long time... But before that, that same morning, I...forgot something in the bathroom... CUT TO: INT. SAAJAN'S ROOM - YESTERDAY Saajan in front of the mirror, feels the missed spot on his chin. SAAJAN (V.O.) I went back in to get it... INT. BATHROOM - CONTINUOUS Saajan stands there and looks at himself in the mirror. SAAJAN (V.O.) And the bathroom smelt the same, exactly the same as it used to after my grandfather had been in the shower. It was like my grandfather had been there...  69.  (CONTINUED)",
      "characters": [
        "SAAJAN",
        "PHOTOGRAPHER",
        "SHAIKH",
        "OLD MAN"
      ],
      "action_text": "Close on - Saajan's reflection. He picks up the razor, he leans into the mirror, and starts to shave the stubble off of a spot on his chin that he had missed. SAAJAN (V.O.) But he had not, it was just me... Saajan examines his chin to make sure he took care of the missed spot. SAAJAN (V.O.) Just me and the smell of an old man. Saajan steps to the middle of the bathroom, looking around, just him and the smell of an old man. The trains chugs come in. CUT TO: INT. TRAIN - YESTERDAY Saajan stands in the crowded Bandra local as it goes North. SAAJAN (V.O.) I don't know when I became old...Maybe it was that morning...maybe it was many many mornings ago...and maybe if I had forgotten something in the bathroom before I would have found out sooner... YOUNG MAN Uncle, would you like to sit? The scene we have seen before plays out again. Saajan regards the seat that has been vacated for him. Cut to- he is sitting on it. He sits there rocking with the motions of his train. SAAJAN (V.O.) Life kept on going and lulled me with its motions, I kept rocking back and forth as it threw me left  70.  CONTINUED:  (MORE)  (CONTINUED) and then it threw me right...and then before I knew it... BACK TO: INT. OFFICE - DAY Saajan stacks up the lunchbox again- SAAJAN (V.O.) ...No one buys yesterday's lottery ticket Ila. CUT TO: INT. ILA'S HOUSE - CONTINUOUS Ila still reads the letter by the window. SAAJAN (V.O.) I came to the restaurant while you were waiting. Ila pauses, surprised, she thinks, recreating the scene at the restaurant in her mind, scanning the faces of the lunch crowd... INT. RESTAURANT - PREVIOUS DAY SAAJAN There you were... Saajan's POV.Ila sits shuffling nervously, alone, looking around. SAAJAN (V.O.) ...Fidgeting with your purse, drinking all that water... Ila does just that, she gulps a glass of water. SAAJAN (V.O.) I wanted to come up to you and tell you all this in person. But I just watched you wait...You looked beautiful. Ila taps the floor with her heel impatiently, she ",
      "dialogue_count": 4,
      "word_count": 3318
    },
    {
      "scene_number": 11,
      "slugline": "INT. ILA'S HOUSE - DAY Ila is still at the window, looking out. ILA (V.O.) Perhaps I will send you this letter, and your new postman will deliver it to you. Or perhaps, I will keep it and read it again years from now. I had read somewhere that sometimes the wrong train can get you to the right station... Lets see. INT. BOMBAY LOCAL - LUGGAGE COMPARTMENT - CONTINUOUS The dabbawallahs sing, chanting to their deity... Saajan sits in a circle of dabbawallahs in the train, on their afternoon commute to return the empty lunchboxes. They clap and sing. Saajan looks out the window in anticipation, the next station is his destination. BACK TO: INT. ILA'S HOUSE - CONTINUOUS The dabbawallah's chorus continues over Ila as she still stands at the window, looking out. She stands there and listens intently as though she can hear the chants, there is much to do before she leaves, and so little time... FADE TO BLACK: CREDITS ROLL  85.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 167
    }
  ]
}