{
  "slug": "the-beach-bum-2019",
  "title": "the beach bum",
  "genre": "romance",
  "format": "film",
  "scenes_count": 32,
  "characters_count": 0,
  "characters": [],
  "total_words": 22119,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. UNIVERSITY OF CUBA - LIBRARY - DAY Moondog stands at a podium in a mismatched suit. His hair is unkempt. He holds a Mojito, his book of poems is open. Hundreds of Cuban students and faculty stare up at him. He clears his throat and gently lowers his eyes. He begins to speak forcefully in the microphone. MOONDOG And now for a bit of poetic foreplay.   I’m going to lube up your ear sockets with something I wrote as a prepubescent turk growing up in the wilds of Kentucky surrounded by rednecks and turds and inbreds and cock jammers, hostile locals with dead souls and limp dicks.   It’s the first poem I ever wrote as a boy, an innocent, and I always like to start out each reading I do with this.   It’s short and sweet and it takes me back to a pure place. (long pause) “Swaying on the swing.   I smell the stench of all the losers trying to bring me down.   But I will now bow. I will not break.   I am 8 years old today.   It’s my birthday.   And I am a great man.   I am the Moondog, and one day I will swallow up the world.   I hope you all perish violently.   Just kidding.   The end.” Moondog stops and smiles at the audience. They clap wildly. He laughs to himself. MOONDOG (CONT’D) (under his breath) Wow I am a genius. He gulps down the rest of his Mojito and licks his lips. EXT. OCEAN/SAILBOAT/CUBA - MAGIC HOUR A small boat floats in the water. The Havana landscape is visible in the distance. Steve Miller’s “The Joker” blares from the speakers. A fishing pole is set and cast out at sea. The side of the boat reads “Poon Palisades.”",
      "characters": [],
      "action_text": "I/E. BOAT/CAPTAINS CABAN - MAGIC HOUR Inside the boat the song grows much louder. Moondog 40s-50’s, lays on a small bed in the captains quarters. He makes out with two topless Cuban women. A joint burns in the ash tray. He kisses one of their nipples and smiles. He holds the joint to her lips. She inhales and shotguns it into the mouth of the other girl. Moondog grabs a handful of cherries from a gold leafed bowl. He eats cherries while seductively dangling the stems above his mouth. He spits the pits onto the bed. His lips turn red. EXT. BOW OF THE BOAT - MAGIC HOUR We see the fishing line being tugged. A large bell rings, it sounds like a door bell. I/E. CAPTAINS CABAN - MAGIC HOUR The ringing sound goes off again. MOONDOG I caught one! Yeah! He jumps out of bed and quickly puts on an old corduroy jacket. He wears neon Che Gavara shorts. The two girls stare at him and laugh. He takes a quick hit from the joint. The bell rings again. He looks excited. He grabs some cherries and spits the pits at the girls. They crack up. EXT. BOW OF THE BOAT - MAGIC HOUR The fishing line tugs again, this time much harder. The ringing sound intensifies. It echoes across the ocean. I/E. CAPTAINS CABAN - MAGIC HOUR Moondog holds a Polaroid camera. He snaps photo’s of the girls. They kiss each other. He tosses the photos on the bed. 2. MOONDOG Good lord. The lighting in here is magic. The ringing sound again. Moondog smiles and then turns up the volume on the stereo, the Steve Miller song is now blasting. MOONDOG (CONT’D) (screaming over the music) Don't move too much, I'll be right back.   Hold that vibe girls! He runs out of the room. We follow him through the tight hallways of the boat and onto the bow. EXT. BOW OF THE BOAT - MAGIC HOUR Moondog clicks a button on the pole and the ringing stops. He starts to reel it in with all of his might. He looks like he might be pulled over the side of the boat. MOONDOG (to himself) Fuckin great white. Come out of the abyss you bastard. I've fin",
      "dialogue_count": 0,
      "word_count": 1279
    },
    {
      "scene_number": 2,
      "slugline": "EXT. HAVANA STREET - NIGHT Moondog runs through traffic. A cab whizzes by and almost hits him. The cab blows his horn. Moondog smiles and waves. EXT. MALECON HAVANA - NIGHT Moondog stumbles along the Malecon with his arms straight out like he is walking a tight rope. Waves splash against his feet. EXT. BUSY SECTION OF MALECON - NIGHT Moondog stumbles forward. People are night fishing. A large man sits on the edge of the malecon playing a tuba. His chubby feet dangle into the water. The man repeats the same note over and over again. Moondog pulls a beer out of his front pocket and quickly downs it, he softly tip-toes up to the guy with the tuba. He starts bopping his knees up and down in a mock dance move. Some fisherman off to the side start laughing at him. Moondog begins laughing to himself. He looks around and swiftly kicks the tuba player into the water. The tuba player falls off the edge and lands in the water. He looks up at Moondog and starts yelling. MOONDOG I apologize sir. Please forgive me. Everyone laughs. The tuba player splashes water onto moondog’s pant leg. MOONDOG (CONT’D) Please forgive me.   It was an accident.   Continue playing.   It was actually quite beautiful. Moondog tosses his beer bottle at the ocean and stumbles off. 6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 227
    },
    {
      "scene_number": 3,
      "slugline": "EXT. HAVANA QUIET SIDE STREET - NIGHT Moondog makes his way down the sidewalk, singing to himself. EXT. HAVANA BACK ALLEY - NIGHT Moondog cuts down an old alley way. An old woman wearing curlers sweeps glass into a pile. Moondog stumbles past her. He sees a tiny kitten lapping up sewer water. He bends down and picks it up. MOONDOG Well hello my little angel pussy. (he kisses the kittens head) Where’s your mommy?   Are you thirsty?   I’m all out of booze or I’d offer you some.   I’m terribly impolite aren't I?   Such a cute little pussy. He kisses the kittens paw and it purrs. EXT. HAVANA BEUTIFUL RESIDENTIAL STREET - NIGHT Moondog drunkenly wobbles down the street holding the kitten. He sings the words to “the Joker” again. EXT. BEAUTIFUL HOME IN THE CENTER OF HAVANA’S OLD TOWN - NIGHT Moondog pushes his way past the gate. He drunkenly pulls a key out of his pocket and unlocks the door. He manages to hold the kitten gracefully. MOONDOG Home sweet home. He kisses the kitten’s head again. They walk inside. INT. MOONDOGS HAVANA HOME - NIGHT Moondog turns on the lights. The house has beautiful high ceilings and cuban tiles. Books and artworks line the walls. MOONDOG (talking directly to the kitten)  (MORE)  7.",
      "characters": [],
      "action_text": "This is my house angel pussy.   This is what the house of a poet looks like.   I am a great poet and a great lover.   Welcome. He walks through the living room holding the kitten. INT. LIVING ROOM - NIGHT Moondog stares at a shelf full of his books all translated into different languages. MOONDOG These are my books. One day you will read them all angel pussy. He kisses the kittens head and stares at his books. INT. KITCHEN - NIGHT Moondog sets the kitten on the table. He opens the refrigerator and pulls out a carton of milk. He pours some into a bowl. The kitten laps it up. MOONDOG (he whispers “beutiful kitten” in Spanish) Gatito Hermoso. He walks out of the room. INT. LIVING ROOM - NIGHT The curtains blow wildly in the wind. The lights are low. A record plays Leonard Cohen’s “Who By Fire”. Moondog holds a joint and prances around shirtless in his Che Gavara shorts. He sings along and takes a puff. He cracks up at his own reflection in the mirror. He karate chops the air. The kitten looks up at him. INT. BEDROOM - NIGHT Moondog lays on his bed, smoking a joint. He watches 1950’s Cuban propaganda cartoons on a black and white TV. He takes a drag. The kitten sleeps on the pillow next to him. He blows smoke into the kitten’s ear and cracks up.  MOONDOG (CONT'D)  8.",
      "dialogue_count": 0,
      "word_count": 458
    },
    {
      "scene_number": 4,
      "slugline": "INT. WRITERS ROOM - NIGHT Moodnog sits at a table littered with papers and books. The sound of the street outside blends with the cartoons. Moondog stares at a typewriter with a blank sheet of paper resting inside. His unwashed hair sticks straight up. He chugs a beer. He drops the bottle and burps. MOONDOG I am a pure genius. Lets let it flow bitches. He itches his balls and starts laughing. EXT. IN FRONT OF MOONDOGS HAVANA HOME - NIGHT Moondog drinks and dances on the sidewalk with a few old timers. Music blares from inside his house. He waves to the passing cars. He does a Karate chop towards the moon. INT. WRITERS ROOM - NIGHT Moondog sits down at his typewriter and hits the same key over and over again. MOONDOG Ah now we’re talkin. This is some good shit here. I’m a fuckn idiot. Whoo! Oh yeah! He drops his head onto the table. INT. BEDROOM - NIGHT The kitten is asleep and purring on the pillow. INT. KITCHEN - NIGHT Moondog stumbles to the refrigerator. He takes a beer and chugs it. He collapses onto the kitchen table. With a loud thud he hits the floor, beer bottles everywhere. INT. BEDROOM - NIGHT The TV flickers as it plays an old Tom and Jerry cartoon. 9.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 222
    },
    {
      "scene_number": 5,
      "slugline": "INT. KITCHEN - NIGHT Moondog lies motionless on the floor. Long pause. MOONDOG Ouch. The sound of cartoon music playing. INT. BEDROOM - MORNING The kitten is awake it yawns big and smiles. EXT. MALECON HAVANA - MORNING The sun rises. The city is alive. The waves splash against the malecon. The music from passing taxi’s is audible. EXT. IN FRONT OF MOONDOGS HAVANA HOME - MORNING We see an old cuban maid move down the street, smoking the nub of a cigar. She wears a faded red baseball cap and mens dress shoes with tube socks. She carries mops and beer. INT. ENTRANCE OF HOME - MORNING The maid enters and sees the mess. She walks through the rooms and nods her head. It’s a familiar sight. She begins to open up the blinds and let the sun in. INT. KITCHEN - MORNING The maid walks in to find Moondog on the floor. She bends down and starts slapping his face. He opens his eyes and smiles up at her. MOONDOG (still drunk) Hello my love.   That feels oh so good.   I’m super horny. She smiles. CUBAN MAID Eres asqueroso! (You are disgusting) 10.",
      "characters": [],
      "action_text": "MOONDOG (he looks like he is about to puke) You frisky old wench.   Get your foul hands off me. She starts laughing and then slaps his face harder again. MOONDOG (CONT’D) Is a handjob absolutely out of the question then? He growls like a dog. CUBAN MAID Cerdo. (Pig) She continues cursing him in Spanish. INT. BATHROOM - MORNING Moondog pees into the bathtub with the door open. He looks like hell. EXT. HAVANA BACK OF HOUSE IN THE GARDEN - MORNING The landscaping is perfect. Gardeners work amongst the statues and lily ponds. EXT. HAVANA BALCONY - MORNING The maid helps a nearly naked Moondog with his clothes. He holds a bong. The Grateful Dead is blasting. A few passersby stop to stare up at him. Moondog scratches his balls and hocks a lugie over the balcony. INT. LIVING ROOM - MORNING Moondog stares at all his translated poetry books. He runs his fingers over the spines. He can barely stand. The kitten is licking the side of his bare foot. EXT. TINY OUTDOOR BAR - MORNING Moondog hunches over a bar drinking a Mojito. Hard rain pours down on the tarp behind him. He holds a joint in one hand and a cell phone in the other, his wife Minnie is on speaker. 11. MINNIE (over the phone) I miss you. MOONDOG I miss you too. MINNIE (over the phone) You do? MOONDOG Not really. MINNIE (over the phone) I thought so. MOONDOG A little bit. MINNIE (over the phone) Well I need my husband back here soon. MOONDOG Alright Minnie. MINNIE (over the phone) It’s boring here without you. MOONDOG OK. MINNIE (over the phone) Your daughter and I need you to come home. MOONDOG Home? MINNIE (over the phone) Yes. MOONDOG My real home is here in Cuba dear. I bought this house when I was 19 from a gay cigar farmer.   You know that.   This place is my true home. 12. MINNIE We need you back in Florida love. MOONDOG Yuck. MINNIE (over the phone) Back to Palm Beach. MOONDOG Fuck Palm Beach. MINNIE (over the phone) Stop it. MOONDOG Yuck. MINNIE (over the phone) I need help with the wedding. MOONDOG Never. MI",
      "dialogue_count": 0,
      "word_count": 751
    },
    {
      "scene_number": 6,
      "slugline": "INT. MASSAGE PARLOR - MORNING Moondog is getting a massage. He is naked except for a towel draped across his groin. A nude dark skinned masseuse named Maria rubs oil on his leg. Reggaeton music plays on the radio. A poster of Fidel Castro hangs on the wall. The windows are open, and chickens eat corn off the floor. Moondog takes a drag from his joint and starts coughing. MOONDOG The weed here is pretty weak Maria, I have to admit, so I have to smoke a massive amount to feel anything resembling a full body buzz.   It’s kind of a dull and uninspired home grown version of the good hydro I was getting back home. MARIA (sarcastic, she answers in Spanish) Estupendo. (Great) Moondog coughs up a fit. MOONDOG It’s a mellow schrubby sort of high,   with hints of lemon candy and basil tart, with a slight melancholy aftertaste. MARIA Eso es genial Moondog. (That’s great Moondog.) Maria squirts a bunch of oil into her hand and then quickly begins rubbing it up and down Moondogs other thigh. MOONDOG Go easy on me today. I just had my balls waxed. MARIA Si. Maria slides both of her hands under Moondog’s towel. MOONDOG Good news though Maria. The writing is flowing, just like the runs I've suffered all week from the food here. 15.",
      "characters": [],
      "action_text": "He shifts his body and takes a hit of weed. He coughs and closes his eyes. From the window, the sound of the city and the salsa music mix. EXT. BUSY SECTION OF MALECON - NIGHT Moondog walks down the Malecon holding the kitten. As he passes the tuba player, he kicks him into the water again. He scurries away laughing. EXT. RUN DOWN OUT DOOR HAVANA BAR - NIGHT Moondog is drinking alone in the corner. The kitten drinks milk from a small bowl on the counter. Moondog puffs a huge cigar. He quietly talks to himself and laughs. The song “Margaritaville” is playing on the radio. A group of ominous men watch him from the other side of the bar. Their faces are obscured by a dark shadow that cuts across the dance floor. A skinny old guy in an oversized pink sequined suit and a lopsided wig is playing a broken tambourine on stage. Moondog saunters over to stage and starts dancing. EXT.   HAVANA QUIET SIDE STREET - NIGHT Moondog stumbles alone. He is still completely soaked. He sings and holds the kitten to his chest. The ominous men in ski masks appear behind him. They hold machete's. A few people see them and run back inside their homes. The leader runs up behind Moondog and taps him on the shoulder. Moondog turns around and smiles. MOONDOG Hello handsome. (he looks at the group of men) Very scary. Very scary. Can I help you? The guy whacks moondog on the head. He drops to the sidewalk. His face falls into a puddle of sewer water. 16. MOONDOG (CONT’D) (under his breath, the sewer water submerges the side of his face) Limp dicks. The kitten runs away. EXT. BUSY HAVANA STREET - NIGHT The kitten moves crosses the street, miraculously avoiding the cars. It jumps onto the sidewalk and stares back at Moondog, unconscious on the ground. The men hover above him. The kitten purrs sadly, and walks into the darkness. EXT. HAVANA GHETTO BACK ALLEY - NIGHT The men drag Moondog through puddles, and past housing units. A few kids on bicycles ride alongside and throw fire crackers. They stare",
      "dialogue_count": 0,
      "word_count": 913
    },
    {
      "scene_number": 7,
      "slugline": "EXT. DOCKED FISHING BOAT - NIGHT We see men in masks walk onto the dock. INT. DOCKED FISHING BOAT- NIGHT The kidnappers stand around Moondog who is completely bound except for the hand he smokes with. A masked kidnapper holds a phone up to moondogs face. MINNIE (over the phone) What do you mean kidnapped? MOONDOG Yeah its not so bad.   I was hog- tied for a while.   It was great. Moondog takes a hit of weed and then passes to the kidnapper. MINNIE (over the phone) Are you fucking with me? The kidnappers chuckle and pass the joint around. EXT. OCEAN/YACHT - DAY The rest of their phone conversation plays of this image. MINNIE sits in the center of a beautiful yacht. She is beautifully dressed and dripping with jewelry. Her hair is perfect. Her skin in tanned. MOONDOG V.O No.   I'm for real.   It’s wild. They are holding me for ransom.   A bunch of gnarly goons. Semi retards.   I’m gonna write a poem about the experience. Minnie looks ahead, determined and concerned. There are several armed guards onboard. INT. MINNIE’S YACHT - DAY Minnie is in the main cabin of her lavish yacht. She looks at a small hand gun on the glass table. 19.",
      "characters": [],
      "action_text": "MINNIE V.O What do they want? MOONDOG V.O They’re Gonna kill me if you don't take a boat over to Havana tomorrow with a duffle bag filled with cash. I/E. MINNIE’S YACHT - DAY Minnie stands on the bow holding her gun and a glass of wine. MOONDOG V.O They know how rich you are.   They googled you Minnie. She stares out at the Havana skyline. EXT. PORT OF HAVANA - DAY The boat is docked. MOONDOG V.O Your wealth knows no bounds. Minnie steps off down holding her duffle bag. EXT. BUSY HAVANA STREET - DAY Minnie makes way across the street. MOONDOG V.O No excuses.   Lets hustle love. It’s just another chapter in out adventure together. She is flanked by her armed guards. EXT. RUN DOWN OUT DOOR HAVANA BAR - NIGHT Minnie walks into the quiet bar. The same guy from before plays the broken tambourine. The kidnappers sit in the dark. Minnie approaches them. The sound of her high heels is magnified. She drops the bag in front of them. They make kissing sounds. She looks on annoyed. 20.",
      "dialogue_count": 0,
      "word_count": 391
    },
    {
      "scene_number": 8,
      "slugline": "EXT. HAVANA ABANDONED GHETTO SOCCER FIELD - NIGHT Moondog is alone in the center of the abandoned soccer field. The trash cans are blazing. He is still tied up. Minnie walks across the field. He smiles and screams out. MOONDOG Minnie!   My love! You made it!   You look so lovely!   You dressed up perfectly for the occasion! She walks up to him and stares down. She starts laughing. MINNIE You’ve got to be kidding me. MOONDOG Don't just stand there laughing at me you dirty dog. MINNIE Right. MOONDOG Lets get frisky. I popped a half dozen quaeludes before I was kidnapped. MINNIE What the fuck? MOONDOG I was gonna date rape myself but now that your here the timing is perfect. She wipes the dried blood from his forehead. She unties him. MINNIE I don't believe this.   You look like total shit Moondog. Minnie looks around the stadium. His hands are free. MOONDOG How hot is this scenario? He grabs her and pulls her onto the dirty mattress. MINNIE Shut up Moondog. They wrestle around for a moment and then start to kiss. 21.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 186
    },
    {
      "scene_number": 9,
      "slugline": "EXT. HAVANA PARK - NIGHT Moondog and Minnie walk through a bustling city park. They hold hands. Moondog puffs on a huge cigar, a loose bandage wrapped around his head. Minnie holds her high heels. The armed guards follow them closely. EXT. HAVANA RESTERAUNT - NIGHT Moondog and Minnie sit. A waiter pours wine. MOONDOG I think getting kidnapped is good for my inspiration. Moondog chugs the entire glass and looks lovingly at Minnie. MINNIE Yes it suits you. MOONDOG I kind of feel reborn and exhilarated. MINNIE Heard that before. MOONDOG Maybe now I'm ready to write something. MINNIE Aha. MOONDOG Some poetry with real balls. MINNIE OK. MOONDOG An epic. Beat. MINNIE Sure you are. MOONDOG Something violent and filled with passion. 22.",
      "characters": [],
      "action_text": "MINNIE (laughing) Passion? MOONDOG Don't laugh. MINNIE (still laughing) Sorry. MOONDOG It doesn't suit you love. I'm onto something. She stares at him. MINNIE Oh Moondog. I do miss you. MOONDOG My comeback! Moondog swigs and coughs into his sleeve. Minnie smiles. MINNIE But you know your charm is dwindling. She stares at him then sips her glass. MINNIE (CONT’D) You were charming and beautiful when you were young, but your not aging well dear. MOONDOG Bullshit! Moondog snorts the air and tightens the bandage on his head. MINNIE You haven't published a poem in years. MOONDOG True. MINNIE Not a word. MOONDOG Not a word? 23. MINNIE Nada. MOONDOG Well time is just an abstract notion.   The earth is melting. Fuck it dear. MINNIE Right. Who cares anyway? MOONDOG Exactly! MINNIE That's why I love you. Moondog ignores her and pushes his plate of food away, he spits his food out in his napkin. MOONDOG Poison!! He picks up the bottle of wine and takes a swig. He swishes the wine around and gargles it. MOONDOG (CONT’D) It tastes like fried turd. MINNIE Don't embarrass me please. MOONDOG (ignoring her, his voice grows very loud) I remember when I was in China, before we met, and I accidently ate a human foot. Some people in restaurant stop and stare. Minnie smiles. MOONDOG (CONT’D) That was gourmet compared to this Cuban caca!! Minnie starts laughing. MOONDOG (CONT’D) Turd soup! (he scans the room and looks in the direction of the waiters) Bastards are trying to poison me. 24. Moondog pulls a joint out of his shoe and licks the tip. MOONDOG (CONT’D) I'm not gonna let them get away with it. MINNIE You’re so dramatic. MOONDOG You wanna little spliff-piff Minnie? Minnie shakes her head no. MOONDOG (CONT’D) Your loss. It’s mild Guatemalan. He looks around and lights it. He takes puff and coughs. He blows smoke at another couple. Minnie stares at him. MOONDOG (CONT’D) You are so sexy lookin when you are disappointed in me. MINNIE Then I must always look sexy to you. Moondog laughs. M",
      "dialogue_count": 0,
      "word_count": 2798
    },
    {
      "scene_number": 10,
      "slugline": "INT. JIMMY BUFFETS MANSION - NIGHT Moondog and Jimmy make their way through the mansion. Both are high and staggering a bit. INT. JIMMY BUFFETS SECRET HYDROPONIC WEED ROOM - NIGHT Moondog and Jimmy open the door and enter. Jimmy hits the lights to reveal a state of the art weed facility. In the center of the room on a metal table is a single marijuana plant. Spotlights beam onto it. Moondog looks around the room completely amazed. MOONDOG Jimmy what is this? Jimmy pushes him forward. JIMMY BUFFET Moondog.   My friend.   Fellow Comrade and artiste’.   This is a place I rarely show anyone.   It’s hallowed ground.   Its like the NASA command center of Marijuana dude. Moondog walks over to the weed plant. He stares at it. JIMMY BUFFET (CONT’D) And that right there is what you just smoked.   The Mona Lisa of weed.   The grand lady. Moondog touches the plant, a tear falls from his cheek. JIMMY BUFFET (CONT’D) Touch lightly old friend.   It’s a fragile lover. MOONDOG (in a whisper) Wow. JIMMY BUFFET Pure virgin high grade. MOONDOG Sweet Jesus Jimmy. JIMMY BUFFET I’ve been smoking her since the late 60’s.   She’s called the “The Magical Stoner.” 40.",
      "characters": [],
      "action_text": "MOONDOG (whisper) Magical Stoner. JIMMY BUFFET I was first introduced to her down in Key West, by Ernest Hemingways gardener Leon. MOONDOG Leon? JIMMY BUFFET A strange dwarfy Jamaican dude with an odd face, shaped kind of like a surfboard. MOONDOG The Magical Stoner? Moondog bends down and examines the plant. JIMMY BUFFET That's right moondog.   It only grows in one isolated pond in Jamaica.   It sprouts out of a fluorescent pink moss patch. MOONDOG Wow. JIMMY BUFFET Sixteen miles southwest of Bob Marley’s birthplace outside Kingston. MOONDOG I'm blown away man. JIMMY BUFFET A small group of wayward Rastafarians devote their entire life to growing it.   They don't even eat solid food, they just smoke that weed for nourishment. MOONDOG (whispering it again) The magical stoner. JIMMY BUFFET Its the rarest herb in the world. I wrote all my greatest hits on it. Margaritaville, everything. 41. MOONDOG Your secret weapon? JIMMY BUFFET Yeah it’s been my secret weapon to success dude. MOONDOG Inspiration. JIMMY BUFFET I thought you'd appreciate it moondog.   I know your a connoisseur. MOONDOG How can I get some of this? JIMMY BUFFET I fly up to Jamaica on my private jet about once every year and get a big stash and fly right back.   I bribe the government with a free concert in the park.   They turn the other cheek.   It works out perfect. Moondog sniffs the leaf. INT. JIMMY BUFFETS MANSION - NIGHT Minnie looks for Moondog. We hear the sounds from the party. EXT. BEAUTIFUL OUTDOOR DECK OVERLOOKING THE ENTIRE ESTATE - NIGHT Moondog and Jimmy Buffet pass a bong and look out. Moondog takes a hit. His eyes pop out, and he wipes swath of drool from his cheek. He looks up and recites a poem. MOONDOG Softly, in the dusk, a women is singing to me; Taking me back down the vista of years, till I see A child sitting under the piano, in the boom of the tingling strings. And pressing the small, poised feet of a mother who smiles as she sings.   In spite of myself, the insidious mastery ",
      "dialogue_count": 0,
      "word_count": 1142
    },
    {
      "scene_number": 11,
      "slugline": "EXT. OUTDOOR BEACH BAR - NIGHT Moondog gets drunk next to an old Asian couple at the bar. The Asian couple pass a vape and down shots of Jagermeister. Moondog downs a shot, a bit of drool on chin. He turns and looks at the old couple. MOONDOG Jimmy’s weed. It’s a miracle.   The Magical Stoner. I feel it coming. The old couple smiles and tries to ignore him. MOONDOG (CONT’D) With Jimmy’s weed I'll be able to write again. OLD ASIAN MAN That’s great. MOONDOG Secret weapon! Moondog leans over the bar and rubs his hand on the old mans cheek. He gently kisses the old women on the lips. MOONDOG (CONT’D) I’m gonna make you guys proud of me again. The bartender walks up and taps the bar with his knuckles. Moondog looks up. The bartender points to the door. Moondog turns to see Minnie standing there laughing. She looks beautiful in the light. Moondog cracks up. He walks over to Minnie and they kiss. EXT. FERRARI - NIGHT Minnie drives Moondog home in the convertible at top speed. The Simple Minds song “don't you forget about me,” is blasting. Moondog waves his hands in the air. I/E. FERRARI - NIGHT Minnie shifts the gear and steps on the pedal. They sing the words. It’s a beautiful moment. The two of them stare at each other for a brief moment. Minnie smiles and hits the gas. In the distance, bright lights move towards them. The lights get brighter until they overtake the screen. Minnie swerves. CUT TO BLACK: 46.",
      "characters": [],
      "action_text": "The sound of cars crashing. EXT. JIMMY BUFFETS MANSION/OUTDOOR PATIO - NIGHT Jimmy stands on the patio strumming a guitar. He looks out and sees smoke fill up the sky. INT. AMBULANCE - NIGHT Moondog is in an ambulance staring at the ceiling as they race down the highway. INT. AMBULANCE - NIGHT Minnie is in a separate ambulance. Her eyes are shut. INT. HOSPTAL   - NIGHT Moondog sits on a bench in front of the ER where Minnie is being treated. His suit is still wet and torn up. There is soot all over his face. His bow tie is still wrapped around his forehead. A doctor walks past him and closes the door. INT. HOSPITAL HALLWAY - NIGHT Moondog stumbles through a series of lonely   hospital hallways. He stares through windows at the sleeping patients. He seems like a clown or a silent movie actor. INT. HOSPITAL BATHROOM - NIGHT He stares at his dirty faced reflection in the mirror. MOONDOG Oh Minnie. He turns on the water and tries in vain to wipe the soot off. INT. HOSPITAL MINNIE’S ROOM - NIGHT Minnie lays motionless. Moondog looks at her. She is hooked up to a machine. Nurses scurry as Moondog grabs her hand. MOONDOG Wake up you old wench. 47. He kisses her hand. Minnie opens her eyes and smiles. MINNIE (barely audible whisper) Moondog. You’re such a fuck up. Her eyes quickly dim as she takes her final breath. I/E. BLACK CADDY, FUNERAL PROCESSION - DAY Moondog rides in a caddy with Heather and her husband. They follow the hearse down Royal Palm Ave. He smokes a joint and blows smoke out of the window. The Grateful Dead is blasting. EXT. CEMETERY - DAY Minnie's family and friends listen to a priest say his final words as they Lower the coffin into the ground. Moondog has his arm around Heather. The wind blows. EXT. HEARSE/SIDE OF CEMETERY   - DAY Moondog sits on the hood drinking a beer. His bare feet dangle. Family and friends walk past him and wave. Jimmy walks up to him and puts his hand on his shoulder. JIMMY BUFFET She was a fabulous lady and She loved you very muc",
      "dialogue_count": 0,
      "word_count": 690
    },
    {
      "scene_number": 12,
      "slugline": "INT. MOONDOG’S PALM BEACH MANSION - BEDROOM - MORNING Moondog lays in bed staring at the ceiling fan. He wears Minnie's robe. The sun outside is shining. We see palm trees swaying in the wind. The song “Eye in The Sky” by the Alan Parsons Project plays on the record player. INT. MOONDOG’S PALM BEACH MANSION - MINNIES BATHROOM - MORNING Moondog is holding up a framed picture of him and Minnie together on vacation.   He is staring at the photo. MOONDOG You remember this trip to Ibiza? You cought me doin blow in an alley way. We had that wild threesome with the midget.   You were the best Minnie. So understanding. He kisses the photo. MOONDOG (CONT’D) My partner in crime.   I love you. Moondog puts the framed photo back on the sink. INT. MOONDOG’S PALM BEACH MANSION - BEDROOM CLOSET - MORNING Moondog is staring at Minnies dresses.   His lifts one up off the rack and smells it.   His eyes flutter. INT. MOONDOGS WRITING ROOM - DAY Moondog sits at his typewriter tapping one key over and over. INT.   MOONDOG’S PALM BEACH MANSION - BEDROOM - DAY Moondog watches Jaws. He laughs as the shark eats the captain. MOONDOG (speaking to the TV screen) Eat this dick you old son of bitch. He grabs his balls and laughs. 49.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 222
    },
    {
      "scene_number": 13,
      "slugline": "EXT. FANCY BEACH AREA - DAY Moondog walks Minnie’s toy poodle. He wears red shorts, Gucci loafers, and a pair of Minnie’s sunglasses. He has a newspaper under his arm. EXT. PALM BEACH GOLF COURSE - DAY Moondog dangles a joint from his lips, he relaxes into a perfect golf stance. He hits the ball as hard as he can into the water. The ball makes a loud splashing sound. CADDY Nice shot Moondog! Moondog smiles and hands the caddy the club. MOONDOG Yeah that felt good. CADDY Your finally getting the hang of things now. Moondog starts hacking into his hand. He nods in agreement. They step onto the golf cart and quickly drive away. EXT. JIMMY BUFFETS YACHT - DAY We hear the sound of Moondog having a conversation with his lawyer. The conversation plays over the following scenes. Jimmy performs on the deck for all his friends. Everyone is dancing and getting stoned. LAWYER V.O. As your lawyer I gotta tell you. Your fucked. MOONDOG V.O Come again. LAWYER V.O. Minnie left strict instructions in her will. MOONDOG V.O I didn't know she had a will? 50.",
      "characters": [],
      "action_text": "LAWYER V.O. Well she did and it’s very precise. She was concerned that if anything ever happened to her you would piss away the fortune. Moondog wears Che Guevara shorts and a life preserver. He holds two bongs and dances with blonde MILFS in g strings. I/E. MINNIE’S WHITE CONVERTIBLE BENTLY - DAY The conversation continues over the image. Moondog drives through Palm Beach listening to a jazzy Jack Kerouack book on tape. LAWYER V.O. Minnie was adamant.   Your to receive nothing. He tries reciting the words but eventually gives up. INT. LAWYERS OFFICE - DAY Moondog sits at a desk across from his lawyer. The lawyer scans Minnie’s Will. MOONDOG What’s nothing mean? LAWYER Nothing means nothing. Not a single red cent until..... MOONDOG ....Until What Lewis? LAWYER You must publish your novel. MOONDOG Poems! LAWYER Whatever it is. MOONDOG I write poetry. 51. LAWYER And until then Half of everything goes to Heather and the other half of yours sits frozen in escrow for a bit of time until you fulfill the requirements stated here. MOONDOG Minnie was brilliant.   Forcing my hand like this. LAWYER Those were her wishes. The lawyer nods. EXT. LAWYERS OFFICE PARKING LOT - DAY Moondog watches his Bently get towed away. LAWYER V.O. You are to be immediately removed from your house and all personal belongings taken away, effective immediately, you can go home and grab your typewriter and some underwear and leave and that's it. Starting now the clock is clicking. Moondog stares as the Rolls is towed away. INT. PALM BEACH COUNTRY CLUB/DINING ROOM- DAY Moondog sits alone eating a large lobster. He wears a plastic bib. His hair sticks up. He sips his bloody mary, then slurps juice out of a tiny lobster leg. LAWYER V.O. You are now persona non grata. Minnie owned everything.   It was all her family money, in her name. Your basically a bum. She owned the cars, the clothes, houses, country club memberships, the dogs and cats. He wipes the butter from his lips onto his coat sleeve. Some c",
      "dialogue_count": 0,
      "word_count": 543
    },
    {
      "scene_number": 14,
      "slugline": "EXT. PALM BEACH STREET - DAY Moondog walks home smoking a joint. LAWYER V.O. Minnie loved you very much but she also hated to watch you throw it all away.   It may not seem like it but this is a blessing.   It’s a gift to you. He sings the Cindy Lauper song “Girls Just Wanna Have fun.” EXT. MOONDOG’S PALM BEACH MANSION - DAY He walks to the gate. A police car sits in the driveway. LAWYER V.O. Good luck to you Moondog.   You better start writing. He tosses the remainder of his joint into the bushes. Moondog looks annoyed. Two officers walk up to greet him. INT. MOONDOG’S PALM BEACH MANSION - DAY Moondog walks through his mansion. The two police officers follow. All of the hired help stop and stare. INT. MOONDOG’S PALM BEACH MANSION - BEDROOM CLOSET - DAY Moondog puts on a a tuxedo top and yellow swim trunks. MOONDOG Its best to be a bit formal up top and then casual down below. Fuck it.   How do I look? He picks silver Uggs with pink hearts from Minnie’s closet. MOONDOG (CONT’D) I'm wearing these puppies as a little reminder of my wife, and her message to me. He squeezes his feet into them. MOONDOG (CONT’D) (looking up at the police officers)  (MORE)  53.",
      "characters": [],
      "action_text": "Minnie had massive feet.   But great style. The officers smile. MOONDOG (CONT’D) Her toes were long and distorted. I have to admit I’ll miss sucking them though. The officers laugh. INT. MOONDOGS WRITING ROOM - DAY Moondog sticks his typewriter into a flowered pillow case. The officers watch him closely. INT. MOONDOGS BOOK SHELF - DAY Moondog stares at the middle shelf at his books of poems. The cops are next to him. He points to the books. MOONDOG I wrote all those. He turns and smiles. MOONDOG (CONT’D) I'm sure you don't read though. It’s cool.   No pressure. The cops don't respond. EXT. MOONDOG’S PALM BEACH MANSION - POOLSIDE - DAY Moondog walks past the pool. His pillow case is slung over his shoulder. He looks at Jose the Pool Boy who cleans the water with a large scooper. MOONDOG Jose!   Turn the heat up!   You know I like it toasty in there. JOSE THE POOL BOY Yes Mr. Moondog. MOONDOG Jam it past 110 degrees. JOSE THE POOL BOY I put it to 120.  MOONDOG (CONT’D)  54. MOONDOG Nice! Light it up. I’ll be home soon man. JOSE THE POOL BOY Yes Mister Moondog. MOONDOG Extra chlorine!   I’m planning a serious gang bang in there when I get back.   We can invite your mother next time. Jose looks at him with sad eyes. JOSE THE POOL BOY Bye Moondog. Moondog waves. MOONDOG Later Jose. The Police officers tap Moondog, motioning for him to go. EXT. PALM BEACH STREET - MAGIC HOUR Moondog walks towards town with the typewriter slung over his shoulder. His Ugg Boots glisten. Cars whiz by. EXT. BEACH SIDE PAY PHONE - MAGIC HOUR Moondog is talking on the phone. MOONDOG Heather I just need to crash on the couch a few days. (beat) No.   I don't have any friends Heather. Moondog pulls a joint out of his pocket and lights it. EXT. HEATHER’S PALM BEACH CONDO/FRONT DOOR - NIGHT Moondog stares at Heather with puppy dog eyes. Heather is standing in doorway looking up at him. Her husband hovers. HEATHER I love you dad but I’m not gonna let you stay here.  (MORE)  55. Mom did this for a rea",
      "dialogue_count": 0,
      "word_count": 779
    },
    {
      "scene_number": 15,
      "slugline": "INT. PALM BEACH MOTEL CHECK IN - NIGHT The song continues. Moondog stands in front the check-in counter. The scrawny hotel clerk hands him a room key. EXT. PALM BEACH MOTEL SECOND FLOOR BLACONY - NIGHT The song continues. Moondog sits with his legs swinging off the balcony, a case of beer next to him. He stares out as the cars drive by. His hotel door is open and we hear the TV playing cartoons. INT. MOTEL ROOM - NIGHT Moondog sits on his bed talking to Lewis on the phone. MOONDOG (a bit of desperation in his voice) ....If you cant float me for the next few weeks then I need you to do something else, book me something.   Anything man.   I’m just trying to get enough loot so that I can fly back to Cuba. (beat) I'm destitute man. I’d gladly do a reading at the Public Library.   A retirement home.   I’ll read poetry at Mapco man.   They can pump their gas and listen to me read. I'm cool with that.   I have no pride.   You know that. (beat) Remember I was a great poet.   Still am dammit. We hear Lewis yelling over the phone. Moondog hangs up. INT. MOTEL ROOM - NIGHT Later. Moondog lays in his underwear on the bed. He leans over and rips from a cheap bong. He coughs. He turns the volume up on an old Mickey and Minnie episode. He talks at the screen. 57.",
      "characters": [],
      "action_text": "MOONDOG There you are Minnie. You look beautiful sweetie.   For a minute I thought you had left me. Minnie kiss Mickey. Moondog blows out smoke. EXT. LONG PIER - DAY Moondog staggers past the yachts towards Jimmy’s boat at the end of the pier. A six pack of beer dangles from his wrist. He is sunburnt, a wet cigar hangs from his mouth. EXT. JIMMY BUFFETTS YACHT - DAY Moondog walks up to two armed guards in front of the yacht. MOONDOG Is Jimmy in? GAURD 1 No. MOONDOG Where is he? GAURD 2 Jamaica. Moondog smiles and stares down the gaurd. MOONDOG (his eyes light up) The Magical Stoner? Moondog steps closer to them. The guards are silent. MOONDOG (CONT’D) Say no more comrades. No problem. I get it.   Your silence is code. Beat. MOONDOG (CONT’D) Why do you guys have guns? The guards glare at him. 58. MOONDOG (CONT’D) You ever watch that show Magnum P.I? The guards grip their guns. MOONDOG (CONT’D) It was based on my life, and I used to love watchin that shit. Moondog turns around and walks away. INT. WHORE HOUSE/BEDROOM - DAY Moondog sits naked at a table, a joint in his mouth. His typewriter sits next to a wad of bills. Three naked tattooed whores dance to a Jimmy Buffett song. Moondog is sloshed. He taps the typewriter and cracks up. EXT. FANCY STREET/PALM BEACH - EVENING Moondog walks through his old neighborhood. EXT. MOONDOG’S PALM BEACH MANSION - EVENING Moondog stares at his old house. He sings the song “Yesterday.” He sips beer from can and tosses it at the gate. INT. GAS STATION - NIGHT Moondog walks up to the register and puts down a six pack. MOONDOG Can I also get a lotto and cigar? The register guy rings him up. Moondog hands over his card. MOONDOG (CONT’D) You don't sell acid do ya? CASH REGISTER GUY No. MOONDOG No LSD? REGISTER GUY No. The guy swipes the card. 59. MOONDOG No trippy-trip?   I guess I was told false information then.   I thought this place was just a front. CASH REGISTER GUY Your card is declined. Want me to slide it in again? MOONDOG Slide ",
      "dialogue_count": 0,
      "word_count": 747
    },
    {
      "scene_number": 16,
      "slugline": "EXT. UNDER HIGHWAY BRIDGE OVERPASS - NIGHT Moondog is passed out amongst empty cans. Cars zoom by. His typewriter sits next to his head with a blank sheet of paper. EXT. BEHIND AN ABANDONDED STRIP MALL - DAY Moondog sits on the sidewalk with a few homeless guys. They pass around a bottle of rot gut whisky. Moondog gulps. MOONDOG (reciting a poem) ...And the wind, the wave, the star, the bird, the clock will answer you: “Time to get drunk!” Don't be martyred slaves of Time, Get drunk! Stay Drunk! HOMELESS PHIL Is that Poetry? MOONDOG Yes it is, you toothless illiterate chump.   It’s Baudelaire fool! HOMELESS PHIL Bottle Tare? MOONDOG Yeah exactly.   Bottle Tare. A few of the homeless guys start laughing. HOMELESS PHIL That's bullshit.   If it don't rhyme is don't count for shit Moondog! It just sucks! MOONDOG (nodding) No you suck Phil. Moondog passes him the bottle. HOMELESS PHIL Here’s one. MOONDOG One what? HOMELESS PHIL A poem. 61.",
      "characters": [],
      "action_text": "MOONDOG Go for it. HOMELESS PHIL It’s famous. It goes “Fuck you.   Fu Man Chu!” Homeless Phil starts cracking up. Beat. MOONDOG I have to admit that’s not bad Phil. The rest of the homeless guys start cracking up. EXT. PARKING LOT - NIGHT A radio on the sidewalk blasts a ZZ Top song. We watch as the homeless guys and Moondog take turns riding a broken skateboard around the parking lot. A few of the them dance. EXT. TENT CITY- NIGHT Moondog and the homeless guys sit around a fire drinking. Moondog takes a whiff of the air and gags from the smell. MOONDOG When was the last time you guys took a bath?   The stench here is ridiculous. They stare at him and start to chuckle. I/E. CITY BUS - NIGHT Moondog is sitting on the city bus with twenty homeless guys. EXT. FANCY BEACH AREA - NIGHT Moondog and the homeless guys walk down a posh residential street. People stare. Moondog leads like the Pied Piper. He still holds his typewriter. Homeless Phil plays a flute. EXT. MOONDOG’S PALM BEACH MANSION - NIGHT Moondog and the homeless guys are in front of the huge gate. 62. Moondog presses a security code and the gate pops open. MOONDOG Still works. HOMELESS PHIL Those fools never did change your code. The homeless guys stare up at the mansion in amazement. EXT. MOONDOG’S PALM BEACH MANSION FRONT YARD - NIGHT Moondog and his friends walk up the estate towards the house. INT. MOONDOG’S PALM BEACH MANSION - NIGHT Total party chaos. The group runs through the house like animals. They smash things and flip furniture. They laugh hysterically. Grateful Dead music blasts as they clean out the booze from the liquor cabinets. A Homeless guy hangs naked from a chandelier. Moondog walks through the house in Minnie’s G-string. He smashes everything with a golf club. EXT. MOONDOG’S PALM BEACH MANSION   - NIGHT Police cars screech up to the gate. EXT. MOONDOG’S PALM BEACH MANSION - POOLSIDE - NIGHT The home security alarm is going off. Nobody pays attention to the alarm. Moondog and his friends ",
      "dialogue_count": 0,
      "word_count": 746
    },
    {
      "scene_number": 17,
      "slugline": "INT. COURTROOM - DAY Moondog stands before the judge. He is still in a g-string. His shirt is unbuttoned and has no shoes on his feet. JUDGE ...Your choice Moondog.   Prison or rehab? MOONDOG Is there a third option your honor? JUDGE Nope.   Last chance. Long pause. Moondog’s lawyer elbows him lightly. Moondog clears his throat. MOONDOG Rehab it is then judge.   Maybe somewhere tropical? JUDGE I'm remanding you directly into your daughters custody.   The court worked it out with her already, she will drive you right now to a rehab facility. MOONDOG Nice! JUDGE You will need to spend a mandatory twelve months getting your life together and making a real change Moondog. MOONDOG Perfect!   Twelve days! JUDGE (irritated) Twelve months. MOONDOG Gotcha. JUDGE It all stops now.   This foolishness. MOONDOG I need a change of pace. 65.",
      "characters": [],
      "action_text": "JUDGE And if you mess this up its jail time your doing. MOONDOG Wonderful!   Your honor if I may suggest? JUDGE Yes Moondog. MOONDOG I was once told of an amazing rehab facility somewhere in the Virgin Islands with an open bar policy and 24 hour Thai massage.   A little jerky jerky to take the edge off during the detoxification period. Moondog makes a jerkin motion. JUDGE Excuse me? MOONDOG I don't wanna overstep here but I heard through the grapevine that the therapeutic value of a groin massage during the acute withdrawal phase was off the charts. Beat. JUDGE Not gonna happen. MOONDOG (shrugs his shoulders like a spoiled child) OK. The judge stares long at hard at Moondog. JUDGE I was a real fan of your writing. MOONDOG Oh yeah? JUDGE It amazes me that someone who writes so beautifully can be so crude and reckless. 66. Moondog looks proudly over his shoulder at his homeless friends sitting in the back of the courtroom. MOONDOG Thank you your honor. JUDGE Please don't betray your gift. Don't throw it all away. MOONDOG Never! JUDGE Don't let us down Moondog.   We’re rooting for you. The judge taps his wooden gavel. I/E. HEATHER’S MERCEDES/HIGHWAY - DAY Heather drives Moondog silently down the highway. MOONDOG Would you be so kind as to let me have one final beer? Heather looks over at him. He looks like a puppy dog. He starts making monkey noises. She smiles. EXT. GAS STATION BY HIGHWAY - DAY Moondog and Heather stand in the parking lot. Moondog drinks a tall boy and smokes a huge cigar. She stares at him. MOONDOG Can I ask you something? HEATHER Of course. MOONDOG Did Minnie really love me? HEATHER Yes dad. MOONDOG She said that? HEATHER Of course. 67. They look at each other and smile. I/E. HEATHER’S MERCEDES/HIGHWAY - DAY The radio is on. MOONDOG ...Did she ever say I was a genius? HEATHER She thought you were brilliant. MOONDOG She said that? HEATHER That’s why she stayed with you all those years. MOONDOG An amazing lady your mother was. She had an incredible as",
      "dialogue_count": 0,
      "word_count": 575
    },
    {
      "scene_number": 18,
      "slugline": "EXT. REHAB ENTRANCE - DAY Moondog buzzes the intercom. INTERCOM VOICE Hello? MOONDOG Hi it’s Moondog. Moondog does a karate chop into the air. INT. REHAB/DRUG COUNSLER’S ROOM - DAY Moondog is sitting across from his female drug counsler. DRUG COUNSLER We are really happy your here Moondog.   We have your entire year planned out.   When you leave us you will be a changed person. Moondog shrugs his shoulders and smiles. INT. REHAB GROUP ROOM - DAY Moondog sits in the back of the room snoring. A bald man in a neck brace stands on stage giving an account of his drug use. Moondog smacks his lips and adjusts his groin. A few patients turn around and look at him, annoyed. INT. REHAB CAFATERIA - DAY Moondog sits alone eating fruit and a chocolate bar. MOONDOG (under his breath) Pussies. He stares at the other patients with suspicion and disgust. EXT. REHAB/OUTDOOR SMOKING AREA - DAY Moondog and his drug counsler smoke a cigarette together. 69.",
      "characters": [],
      "action_text": "DRUG COUNSLER It’s gonna be amazing for you here. You just need to listen to the counselors and take it one day at a time.   I bet your poetry will get better then ever. Moondog glares at him. EXT. REHAB - FRONT LAWN - DAY Moondog and the other male patients hold hands in a large circle. They recite the serenity prayer. The prayer finishes. MOONDOG (coughs really loudly) Bullshit!! The patients all stop and stare at him. Beat. MOONDOG (CONT’D) Sorry.   I have Tourette's. Moondog shrugs as if it were a nervous twitch. INT. REHAB - MOONDOGS ROOM - AFTERNOON Moondog enters. His roommate Flicker is a tan, dim witted beefcake in his 20’s. He has a Jerry curl and tribal tatoo’s. His face is kind looking. Christian heavy metal blasts from his computer. Flicker holds a bible in one hand and plays air guitar with the other. Moondog puts his typewriter on the desk. He looks at flicker. MOONDOG (trying to speak above the music) I didn't know white guys wore Jerry curls anymore. FLICKER Yeah. MOONDOG It’s kinda retro.   I like it. 70. FLICKER Thanks! MOONDOG What type of music is this? FLICKER Christian metal dude.   You like it? MOONDOG Yes very much actually. FLICKER This band is from Albuquerque New Mexico.   The lead singer blew himself up on accident. Moondog takes an instant liking to him. MOONDOG That’s cool. FLICKER I was in a cover band that used to rock this shit. MOONDOG Well it’s dam good.   I don't blame you. FLICKER What’s your name? MOONDOG Moondog.   What's yours? FLICKER Flicker? MOONDOG Flipper? FLICKER No Flicker.   Flick.   Like flicking. He makes a flicking motion with his finger. MOONDOG Flicker.   That’s great! They shake hands. 71.",
      "dialogue_count": 0,
      "word_count": 456
    },
    {
      "scene_number": 19,
      "slugline": "INT. REHAB/SWIMMING POOL AREA - DAY Moondog and Flicker tread water. Patients splash around. FLICKER I been here six months already.   My father is a preacher.   He sent me. MOONDOG Why? FLICKER He caught me sniffing glue in the basement one night. And I was breaking into houses and burning shit.   Arson and robbery were my main passions. MOONDOG Nice! Moondog floats onto his back. EXT. REHAB/OUTDOOR SMOKING AREA - NIGHT Moondog and Flicker share a cigarette and look at the stars. FLICKER Out there is the real world.   In here is the fake world.   Out there is where things really happen.   The seasons change.   Babies are born. MOONDOG Beautifully put Flicker.   Very eloquent. FLICKER Moondog we gotta get out of here dude.   We gotta join up with the real world. Moondog looks at Flicker who is transfixed by the sky. INT. REHAB/TV ROOM AREA - NIGHT Moondog and Flicker sit in the back. The other patients are close to the TV. They watch “One Flew Over The Cuckoos Nest”. 72.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 172
    },
    {
      "scene_number": 20,
      "slugline": "INT. REHAB - MOONDOGS ROOM - NIGHT Moondog sticks his typewriter into his pillow case and slings it over his shoulder. MOONDOG Lets get out of here. FLICKER Lets do it. Moondog smashes the window with his typewriter. An alarm goes off. EXT. DIRT ROAD - NIGHT Flicker and Moondog are running away together. EXT. OCEAN SHORELINE - NIGHT Flicker and Moondog walk on the shore. Moondog pants heavily. He looks at his shaking hands. The waves crash. MOONDOG Where are we going? FLICKER Key West!   It’s just straight down from here. Flicker points to the ocean. MOONDOG Aright, but I think I need a drink first. We hear police sirens in the distance. EXT. PIER - NIGHT Flicker walks down the pier. There are boats docked on all sides. People in formal clothes walk to and fro. Moondog is huffing in the back trying to keep up. EXT. END OF PIER - NIGHT Flicker runs towards a large red speedboat that’s docked on the end of the pier. Moondog trails far behind him. 73.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 176
    },
    {
      "scene_number": 21,
      "slugline": "EXT. SPEEDBOAT - NIGHT Flicker jumps into the boat. A young bride and groom stand on the boat drinking wine. The motor is on. They approach him. MAN Can I help you? FLICKER Did you guys just get married? They look confused. MAN Yes. FLICKER Congrats dude. Flicker smiles and throws him overboard. The woman screams. He picks her up and tosses her as well. Moondog jumps in. MOONDOG Is everything OK here? Flicker tosses two life preservers into the water. FLICKER Yeah man they just married. MOONDOG Well lets celebrate then brother. Moondog stares at the couple treading water, his eyes light. I/E. SPEEDBOAT - NIGHT The boat is lit up with neon. Flicker drinks whiskey and steers. “Margaritaville” blasts on the speakers. Moondog chugs a bloody mary. EXT. KEY WEST DOCKS - NIGHT The red speedboat is docked. EXT. DUVAL STREET/KEY WEST - EVENING Moondog and Flicker walk past throngs of drunk tourists. 74.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 157
    },
    {
      "scene_number": 22,
      "slugline": "EXT. KEY WEST BAR - EVENING Moondog and Flicker stare at patrons. Moondog winks at an older female who is dancing on the floor. MOONDOG (licks his lips) We need some money man. I need a few drinks. Flicker turns and smiles at moondog. He flexes and nods. EXT. KEY WEST/SIDE STREET - EVENING Flicker and Moondog follow a drunk tourist down the street. Flicker sneaks up and hits him on the head with a wine bottle. The man falls to the ground and Flicker takes the wallet from his back pocket. MOONDOG (looking down at the guy ) I'm starting to feel inspired again.   Once I write my next batch of poems its all gonna be different.   I’ll get published again.   I’ll be taken care of.   My inheritance will come in. I wont need to participate in this type of activity. But for now it’s survival of the fittest. Flicker flexes his muscles and nods his head. FLICKER Fuck yeah bro! Flicker’s eyes light up when he sees the cash in the wallet. EXT. KEY WEST MOTEL/OUTDOOR TERRACE - NIGHT The door to their room is open. The TV flickers. Jimmy Buffett music is playing from inside. INT. KEY WEST MOTEL - NIGHT The motel room is a wreck. Moondog sits next to the open door holding a bong. His typewriter wrests on his knees. Flicker is passed out on the bed wearing only a jock strap. Moondog takes a big pull from the bong. 75.",
      "characters": [],
      "action_text": "MOONDOG (reciting a poem as the weed smoke drains from his crooked nostrils) O setting sun!   Though the time has come, I still warble under you, if none else does, unmitigated adoration. He sets the bong down and stands. He adjusts his groin and looks at the remaining cash next to a faded bible on the night stand. He looks down at Flicker who snores loudly. Moondog stuffs the cash into his pocket. EXT. KEY WEST BEACH - NIGHT Moondog skinny dips in the ocean and cleans himself off. He holds a tall boy and chomps on a soggy cigar. A big wave crashes down and knocks him over. EXT. KEY WEST BEACH/SHORELINE - NIGHT Moondog walks along the quiet beach. He makes a sharp turn and walks towards the city lights. His typewriter is in the pillowcase, slung over his shoulder. EXT. TROPICAL ASIAN THEMED WHORE HOUSE - NIGHT Moondog stares up at a few scantily dressed women on a second story balcony, deep red neon lights cast them in a glow. PROSTITUTE 1 (yelling down to Moondog) What are you doing tonight cutie? MOONDOG I don't know what's goin on up there? PROSTITUTE 1 Just having some fun.   Why don't you come up and see? The girls motion for him to come, he looks around and smiles. 76.",
      "dialogue_count": 0,
      "word_count": 468
    },
    {
      "scene_number": 23,
      "slugline": "INT. TROPICAL ASIAN THEMED WHORE HOUSE - NIGHT Moondog stands in the living room of the whore house. Ten women of every shape, size, and ethnicity are lined up in front of him. They wear lingerie. The light is red and glowing. There are photos of palm trees on the wall. Moondog stares at a six foot tall blonde with giant fake boobs that stick out like missiles, he touches her boob. FLICKER Are those natural? The blonde nods yes. INT. WHORE HOUSE/BEDROOM - NIGHT Moondog is strapped to a bondage device hung from ceiling. Three of the prostitutes whip him. He howls like a wolf. EXT. WHORE HOUSE/BALCONY - NIGHT Moondog sits at a table on the balcony in front of his typewriter. The sound of the ocean is heard. The three topless prostitutes sit across table and stare back at him. The light is soft and romantic. They pass a joint around. Moondog taps repetitively on a single key. He looks straight ahead at the girls sitting in front of him. PROSTITUTE 1 What are you doing Moondog? MOONDOG Waiting. PROSTITUTE 2 Waiting? MOONDOG Yeah just waiting. He continues to tap. PROSTITUTE 3 For what? He takes a breath and looks at the ocean. The girls chuckle. 77.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 211
    },
    {
      "scene_number": 24,
      "slugline": "EXT. KEY WEST BAR - NIGHT Moondog downs shots at the bar. A live band plays “ Low Places” in the back. People are dancing. MOONDOG (to nobody) I feel cleansed! Moondog drops his head on the bar and passes out. A bit of drool makes its way down his cheek. EXT. BEACH AREA - NIGHT Moondog sleeps on a hammock, his things scattered around the beach. EXT. OCEAN - MORNING Moondog pees into the ocean and drinks a beer. EXT. DUVAL STREET/KEY WEST - MORNING Moondog walks down the sidewalk. He sees a fishing pole in a trash can and grabs it. EXT. FISHING PEIR - MORNING Moondog fishes at the end of the pier next to a short, salty old man wearing a dirty sailors hat. Captain Wack has a parrot on his shoulder. The sunrise beams through the clouds. CAPTAIN WACK ...Business is so good I bought a second boat.   I named the boat “Success.”   Its easy work.   I just take the tourists to the outer key and when you see a dolphin I just act real fucken stoked and then tell ‘em to dive in.   Make sure they don't drown, although I'm completely indemnified and covered by insurance.   I've only ever had four deaths on my watch. Captain Wack starts reeling in a fish. MOONDOG Only four deaths? 78.",
      "characters": [],
      "action_text": "CAPTAIN WACK Four deaths in over eight straight years of doing dolphin tours is a terrific record.   I’m fuckin stellar.   I'm minted in this industry.   They love ole’ Captain Wack in these parts. He spits onto the floor and then takes the fish off the hook. EXT. CAPTAIN WACKS HOUSEBOAT - MORNING We see a small rundown houseboat floating in the ocean. The sound of Jimmy Buffett music blares from the speakers. INT. CAPTAIN WACKS HOUSEBOAT - MORNING The interior looks like an insane packrat has lived there. Guns and weed plants are scattered about. Music plays. Captain wack burns the fish on the stove. The room fills with smoke. Moondog takes a huge hit from a neon pink bong. CAPTAIN WACK You can come and work for me Moondog.   It’s gonna be great man. Dolphin's are great.   The way they go up and down in the water dude. Like a porpoise. MOONDOG Sounds good man.   I’m into it. Moondog blows out some smoke and nods. CAPTAIN WACK Your gonna love being out there in the abyss dude.   Skimming the waves. Captain Wack picks a piece of burnt fish from the pan and feeds his Parrot. Moondog picks up a gun and stares at it. CAPTAIN WACK (CONT’D) I need a partner man.   I have a good sense about you. Captain Wack waddles over to the kitchen counter. There are lines of cocaine cut up, he picks up a straw and snorts one. CAPTAIN WACK (CONT’D) We’re gonna kick some ass together man. 79. He puts a little cocaine on his finger for the parrot. The parrot licks it. It spreads his wings and begins to talk. PARROT Good Stuff! Good stuff! Thank you Captain! Captain Wack starts cracking up. EXT. BOAT PIER - DAY The two of them walk past the docked fishing boats. Tourists move about. Captain Wack uses a machete like a cane. One of Captain Wack’s legs is shorter then the other and he wobbles from side to side. Moondog watches Captain Wack walk. MOONDOG I love your swagger man. CAPTAIN WACK Thank you Moondog.   I got nicked in Nam, makes me walk like a pimp. Moondog follows drinking a beer. ",
      "dialogue_count": 0,
      "word_count": 1492
    },
    {
      "scene_number": 25,
      "slugline": "EXT. KEY WEST DOCKS - DAY Moondog jumps into the red speedboat. The keys are in the engine. He opens the mini fridge and takes beer. He turns the radio on. I/E. SPEEDBOAT/OCEAN - DAY Moondog speeds along the ocean. The sunset is vivid. The song “Come Monday” by Jimmy Buffett plays on the radio. He puffs a joint. He starts singing along. He sticks his arms out to feel the breeze. I/E. SPEEDBOAT/OCEAN - MAGIC HOUR Later. Moondog steers the boat toward the dock. A sign reads “welcome to Palm Beach”. EXT. ENTRANCE OF JIMMY BUFFETS HOUSE/PALM BEACH - NIGHT Moondog approaches a massive gate and rings the buzzer. JIMMY BUFFET (he speaks through buzzer) Whose that? MOONDOG Hay Jimmy it’s me. JIMMY BUFFET Who? MOONDOG It’s Moondog. JIMMY BUFFET You kiddin me?   Stick your head up closer to the security camera.   My eyes are bad. Moondog sticks his face right up. JIMMY BUFFET (CONT’D) Holy shit Moondog. MOONDOG Hay Jimmy. 85.",
      "characters": [],
      "action_text": "JIMMY BUFFET It is you!   You look like hell mother fucker! Moondog leans in closer so that his eye touches the camera. The gates open up. EXT. JIMMY BUFFETS MANSION/FRONT YARD - NIGHT Moondog makes his way up the front yard past the fancy cars parked in the driveway. Moondog looks deranged. He clears his throat and spits into a fountain. INT. JIMMY BUFFETS MANSION ENTRANCE - NIGHT Jimmy and Moondog look at each other. Jimmy wears pink surf shorts and a yellow tank top. His eyes are glazed over. JIMMY BUFFET Good lord man.   What the hell happened to you man? Moondog rolls his eyes and shrugs. MOONDOG Nothing much. Jimmy smiles and puts his hand on Moondog’s shoulder. INT. JIMMY BUFFETS MANSION/HALLWAY - NIGHT They walk down the hallway, Jimmy’s music is playing JIMMY BUFFET I heard you escaped and the cops are looking for you now. MOONDOG Wow that’s pretty cool. JIMMY BUFFET Your a wanted man apparently. MOONDOG (smiling) Nice! JIMMY BUFFET A fugitive. 86. They approach the door. A haze of smoke streams out. INT. JIMMY BUFFETS MAN CAVE - NIGHT Jimmy stands barefoot on a stage singing with his guitar. The stage is covered in sand. A bunch of Jimmy’s wealthy friends listen and get stoned. A few aging Rastas gingerly play steel drums by the bar. All the massive TV's play formula one racing videos. Moondog is in the center of the room watching Jimmy sing. Jimmy is midway through the song. The Lyrics are about a man with wasted talent who spends all his days and nights drinking and getting stoned and running away from his gifts. The chorus just repeats the words “Moonfog, Moonfog, Moonfog, Moonfog,” over and over again. Jimmy performs as if there were thousands of people in the audience. Moondog stares. EXT. JIMMY BUFFETS MANSION/OUTDOOR PATIO - NIGHT Later. Jimmy slurps a huge bowl of Lucky Charms cereal. Moondog is slumped down sitting on the counter drinking a beer. JIMMY BUFFET The name of that song is “Moonfog”! Moondog shrugs.   Beat. MOONDOG Whose it about? JIMMY",
      "dialogue_count": 0,
      "word_count": 2084
    },
    {
      "scene_number": 26,
      "slugline": "EXT. BACK EXIT -   JIMMY BUFFET’S MANSION - DAY Jimmy, Moondog, and the Rasta push a wheelbarrow full of weed into the back of a black van. The house buzzer rings. Jimmy looks at the security monitor and see’s several cop cars. A police officer staring directly into the camera. JIMMY BUFFET Aww shit. MOONDOG What is it? JIMMY BUFFET Guess your costume didn't work dude. MOONDOG Why not? JIMMY BUFFET Looks like a bust. RASTA The pigs! Moondog adjusts his wig and then shifts his balls back. MOONDOG (perplexed) It didn't work? The Rasta walks up and stares at the monitor. JIMMY BUFFET Lets get him out of here. The rasta slams the trunk closed. I/E. BLACK VAN - DAY The three of them drive past the beach. The windows are down and weed smoke steadily streams out. The Rasta drives. Moondog is sandwiched tightly between them. MOONDOG I need to say goodbye to Minnie. 98.",
      "characters": [],
      "action_text": "Moondog hands Jimmy the joint.   Jimmy nods in agreement. EXT. UPSCALE PALM BEACH CEMETERY - DAY Moondog and Jimmy stand in front of Minnie's ornate marble tomb stone. Moondog downs a tall boy of beer. The rasta stands a ways back playing the kettle drum. MOONDOG Minnie my love.   I miss you dearly.   And I want you to know that I'm gonna make you proud from now on.   I'm gonna make it up to you baby.   I know you never expected to see me looking like this here.   In womens clothes. With make up.   Like an old whore. Moondog hiccups and chugs the rest of his beer. He tosses it. JIMMY BUFFET Is that it? MOONDOG Yep. The rasta keeps playing. I/E. BLACK VAN - DAY The three of them drive again. Smoke pours out of the widows. The Grateful Dead play on the radio. JIMMY BUFFET (pointing to the Rasta) The Rasta is gonna fly you in my seaplane all the way to your place in Cuba.   Just lay lo.   Get some work done. MOONDOG OK. JIMMY BUFFET You can set yourself up till all the shit settles down here. Get a little poonanny and chillax. 99. MOONDOG You got it. JIMMY BUFFET I have good lawyers, and the district attorney in Palm Beach owes me a favor, I hooked him up with about 200 Ecstasy pills back in the day.   His wife Claira was a nympho. (beat) We used to race sail boats together. It should all be fine. MOONDOG I really appreciate that Jimmy. JIMMY BUFFET It’s cool man. Moondog smiles as the breeze from the open window blows his wig back. The sun shines on his face. EXT. BEUTIFUL YACHT DOCK - DAY The van is parked in front of a row of yachts on the pier. They stack bales of weed into the wheelbarrow. EXT. YACHT PIER - DAY The rasta smokes a joint and pushes the wheelbarrow towards Jimmy’s seaplane. A few locals stare. Moondog and Jimmy walk behind him. Moondog wobbles in his heels, he looks at the rasta. MOONDOG Is he a good pilot? JIMMY BUFFET He’s pretty good. MOONDOG Pretty good? JIMMY BUFFET He has Glaucoma in both eyes but if he’s stoned enough he starts seeing visions ",
      "dialogue_count": 0,
      "word_count": 2133
    },
    {
      "scene_number": 27,
      "slugline": "EXT. MOONDOGS HAVANA HOME - OUTDOOR PATIO - DAY Moondog stands next to Lewis. They stare out at the action below them. Lewis wipes the sweat from his forehead. He has sunburn and wears a white linen suit that's bursting at the seams. Moondog wears a red bra and floral shorts. They drink Mojitos. There are beautiful Cuban women lounging around drinking and smoking, the Grateful Dead is playing. LEWIS (out of breath) ....I had to come to Cuba for this. MOONDOG It’s a real surprise Lewis. LEWIS Hopefully its a nice surprise? Moondog makes a face. LEWIS (CONT’D) Its so strange being here. MOONDOG Seein you in Havana, sweating like a pig on my porch. LEWIS Your book man! MOONDOG Yes. LEWIS Everyone is flipping out.   Saying you wrote a modern classic. MOONDOG I thought you’d given up on me man? Beat. LEWIS I did.   I did give up on you. But You were a burnout. Beat. MOONDOG Until now? 108.",
      "characters": [],
      "action_text": "LEWIS Listen man. MOONDOG I’m listening. Moondog walks over and starts dancing with one of the women. LEWIS (almost passing out from the heat) I had to tell you in person. MOONDOG Tell me what? Moondog grabs one of the women and   starts to make out. LEWIS Your up for the Pulitzer.   I just got word.   And the National Book Award.   Your a shoe in for both. Its fucken incredible. Moondog turns and stares at Lewis for a second then walks over to the balcony and looks out at the water. MOONDOG You shittin me? He lets out a loud belch. MOONDOG (CONT’D) (under is breath) The magic weed.   It is real. Moondog straightens his bra and stares out at the palm trees. INT. MOONDOGS HAVANA HOME - DAY Moondog talks on speaker phone to his lawyer, he holds the kitten. The cuban maid mops and smokes a cigar. The rasta sits on the couch. He leans and snorts a line off a glass table. He rubs his nose and plays the kettle drum. LAWYER (over the speaker phone) As your lawyer I gotta tell you its a miracle.   You completely fulfilled Minnie’s requests and requirements. You published a book. You unlocked the fortune.  (MORE)  109. The money is yours.   Your entire inheritance.   All of it. Congratulations. Moondog smiles and gently caresses the kittens head. MOONDOG I want it all in cash. Beat. LAWYER What was that? MOONDOG I want it all in cash. LAWYER Come again? MOONDOG Cash man.   I don't trust banks you know that.   I don't want gold bars either.   I want it all in cash man. Take some money out separately and buy a sailboat.   A 150 footer.   A nice one.   Preferably something vintage.   Don't skimp.   Then I want you to fill the sailboat.   Fill that bitch up with the cash and then have someone sail it over from Palm Beach into Havana.   I’ll be here waiting.   You might need some guards to protect it from pirates. LAWYER But that's over 15 million in cash Moondog. MOONDOG Perfect!   Don't fuck it up man. Moondog hangs up and kisses the cat. The rasta gives Moondog a thumbs up. EX",
      "dialogue_count": 0,
      "word_count": 561
    },
    {
      "scene_number": 28,
      "slugline": "EXT. WHORE HOUSE - DAY The scooter is parked on the sidewalk in front of the whore house. Music comes from inside. INT. WHORE HOUSE/BEDROOM - DAY Moondog sits on the bed with a towel over his lap. Two naked prostitutes massage his shoulders. The room is lit neon blue, communist radio is on. MOONDOG (speaking in Spanish) In truth it was all Minnie. She knew what was up.   I know for a fact shes up in heaven now.   Toking on some reefer. Beaming with pride. One of the prostitutes rubs her breast onto Moondogs shoulder. He picks up a bowl of cherries and feeds her one. EXT. PULITZER PRIZE CEREMONY - NIGHT Moondog stands at the podium looking down at his new book. He chews on a half lit cigar. He wears a floral tuxedo and a lovely blonde wig. He has a bloody mary with a pink umbrella. The room is packed with people in evening attire. Everyone in the room stares up at Moondog.   Heather is sitting in the front row beaming with pride. MOONDOG This is a poem I wrote at 3am after I was coming down from an two day acid trip in the Virgin Islands. Just kidding. (he begins to read slow and with a full poetic exaggeration in his delivery) It’s called The Beautiful Poem.   “I go to bed in Havana thinking about you.   Pissing a few moments ago I looked down at my penis affectionately.   Knowing it has been inside you twice today makes me feel beautiful.” He closes the book. Beat. The crowd erupts into applause. He smiles and gulps the rest of his drink. 111.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 276
    },
    {
      "scene_number": 29,
      "slugline": "INT. PULIZER PRIZE CEREMONY/AFTER PARTY - NIGHT Moondog and Heather are dancing together. HEATHER I have to admit I didn’t think you could do it dad. MOONDOG No? HEATHER You pulled it off somehow. MOONDOG People can change. Heather starts to laugh. MOONDOG (CONT’D) And you should never bet against the Moondog. Moondog spins her around and then kisses her on the cheek. EXT. OCEAN/SAILBOAT - DAY An amazing old sailboat is gliding down the ocean. I/E. OCEAN/SAILBOAT - DAY A few armed guards, mercenary types, stand inside the boat. It is filled with massive stacks of cash, 15 million dollars worth, wrapped in plastic. EXT. BOAT PIER HAVANA - DAY Moondog stands next to the Rasta. They stare out at the sailboat in the sea. Moondog holds the kitten. RASTA (weed smoke pours from his nose) Nice boat. Moondog smiles. 112.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 143
    },
    {
      "scene_number": 30,
      "slugline": "I/E. BOAT DOCK/SAILBOAT - DAY Moondog stands on the bow of the sailboat. He stares down at his cash. It’s an amazing sight. The armed guards look at Moondog. Moondog puffs a joint and passes it to the rasta. MOONDOG What do you think?   I feel like we should throw a party or something. The rasta gives him a thumbs up. MOONDOG (CONT’D) And invite all the mother fuckers I know. Moondog breaks the plastic and pulls out a stack of cash. MOONDOG (CONT’D) First I wanna get some fireworks though.   We should light the sky up as a big fuck you to the world. He puts the cash in his mouth and grabs his balls. Everyone in the room cracks up. EXT. HAVANA STREET - DAY Moondog zips through traffic on his scooter. The kitten is poking out of Moondogs handbag. INT. FIREWORKS SHOWROOM HAVANA - DAY Moondog walks quickly through the aisles of a run down fire works factory. He holds two Coronas and a joint. The owner of the place follows closely behind him with a clip board. MOONDOG (in Spanish and very animated) I want it all. Lets blow it all up. Fuck it all man. I’m in a good mood. Lets light up the sky. FIREWORKS OWNER OK. MOONDOG I want the best fireworks display in the history of Cuba.  (MORE)  113.",
      "characters": [],
      "action_text": "None of that communist sparkler bullshit you use to impress babies and lesbians and pregnant women. Lets light it all up maestro. Do it big. Lets wake up Fidel. FIREWORKS OWNER (in Spanish) Everything? MOONDOG Fuck yes! Make it awesome. For Minnie! Moondog takes a hit and coughs. He hands him a stack of cash. EXT. MALECON HAVANA - NIGHT Moondog walks down the Malecon with the kitten. He holds a bottle of wine and sings to himself. Fireworks erupt in the sky. Everyone on the street stops and stares. Moondog looks at their faces. It’s a beautiful moment. EXT. BOAT MARINA/HAVANA - NIGHT Moondog walks towards his sailboat. Fireworks in the sky. EXT. BOAT MARINA/SAILBOAT - NIGHT Moondog steps onto the massive sail boat. He motions for the armed gaurd to leave. The fireworks display is on the edge of the water, next to the marina. We see people on the Malecon stare up at the thunderous lights in sky. EXT. SAILBOAT - NIGHT The boat slowly sails into the harbor. The fireworks are falling from the sky and disappearing into the water. I/E. SAILBOAT - NIGHT Moondog lays on top of the stack of money. He drinks straight from a bottle and laughs. He stares at the fireworks. EXT. OCEAN - NIGHT The burning embers from the fireworks fall onto the ocean.  MOONDOG (CONT'D)  114.",
      "dialogue_count": 0,
      "word_count": 455
    },
    {
      "scene_number": 31,
      "slugline": "I/E. SAILBOAT - NIGHT Moondog watches the fireworks. The embers begin to fall onto the boat. Moondog stands up and laughs. He is drunk, he pulls a roman candle out of his purse. He lights it and holds it upsidedown. It shoots out and hits the money. The plastic wrap around the money catches fire. Smoke fills the air. Moondog laughs for a second, then looks confused. He tosses his bottle of tequila onto the burning money. It flares up. MOONDOG Oooops. Moondog grabs the kitten and walks to the bow. Smoke fills the sky. The whole boat becomes engulfed in flames. EXT. OCEAN - NIGHT From a distance we see the sailboat burn. EXT. MALECON HAVANA - NIGHT People line up to watch the sailboat burn. We hear sirens. Fireworks still go off in the sky. EXT. OCEAN - NIGHT The sailboat explodes. Burning money floats into the sky. EXT. MALECON HAVANA - NIGHT Women and children run after the burning cash. EXT. OCEAN - NIGHT We watch the sailboat burn. EXT. SKY - NIGHT The fireworks fade and we are left with the moon. We hear Moondog cracking up. I/E. TINY RED RAFT - NIGHT Moondog is covered in soot, holding the kitten. He floats down the ocean on the tiny red raft. He has a soggy joint dangling from his lips. 115.",
      "characters": [],
      "action_text": "MOONDOG That was a close one.   For a second I thought we were goners man. He picks up the kitten and kisses it. EXT. MALECON HAVANA - NIGHT The chubby tuba player sits alone. Half burnt hundred dollar bills fly into his tuba as he plays. He stares out at the little red raft floating in the distance. He stops and laughs. EXT. MALECON HAVANA - MORNING Moondog and the kitten sleep in the red raft. They are washed up onto the shore. A few fisherman look down at them. EXT. BOAT MARINA - AFTERNOON Moondog stands on the edge of the Malecon staring at what's left of his burnt sailboat floating in the water. MOONDOG (speaking to the kitten) That’s pretty cool lookin man.   I never seen a burnt sailboat like that.   I'm definitely gonna restore that to it’s natural beauty. He is covered in soot and his dress it torn down the side exposing part of his butt. EXT. RUN DOWN OUTDOOR BAR - AFTERNOON Moondog drinks Mojitos alone. There are a few burnt bills on the bar. The Peter Tosh song “legalize it,” is playing on the juke box. Moondog sings the words and sways his head. EXT. HAVANA STREET - EVENING Moondog staggers home. He looks like a total wreck. EXT. MOONDOGS HAVANA HOME - EVENING Moondog walks up to the house and opens the door. “Margaritaville” plays inside. 116.",
      "dialogue_count": 0,
      "word_count": 460
    },
    {
      "scene_number": 32,
      "slugline": "INT. MOONDOGS HAVANA HOME - EVENING Moondog walks in. All the lights are cut off. MOONDOG Hello? Beat. All the lights flash on. EVERYONE Surprise!!!!! Moondog’s eyes light up. We see all of Moondogs friends and family. The bartenders, Lewis, the strippers and prostitutes, his kidnappers, Jimmy, the maid, Heather and her limp dick husband, the Rasta, the Caddy, the Lawyer, Jose the pool boy, Homeless Phil, Flicker, a footless Captain Wack, an assortment of Palm Beach socialite stoners, and cuban locals. Jimmy starts playing “The Joker” in the living room. Everyone drinks, smokes, and dances. We follow the interactions, jump cutting between moments. We watch everyone sing the words to the song. It’s a moment of bliss. Moondog looks around and smiles. He picks up the kitten and walks out. EXT. MOONDOGS HAVANA HOME - OUTDOOR PATIO - NIGHT Moondog stares at the sky. He puffs a joint and drinks a Margarita. The moon is out. Everyone downstairs sings. Moondog is drunk. He sings as well. Two beautiful cuban women walk onto the balcony. Moondog kisses them and begins dancing. He holds the kitten. The title, The Beach Bum appears once again. Credits begin to roll over the image. The end. 117.",
      "characters": [],
      "action_text": "(CONT’D) 118.",
      "dialogue_count": 0,
      "word_count": 206
    }
  ]
}