{
  "slug": "the-worlds-end-2013",
  "title": "the worlds end",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 3,
  "characters": [
    "GARY",
    "OLIVER",
    "ANDY"
  ],
  "total_words": 19372,
  "total_dialogue": 3,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. OVERLAND TRAIN STATION - DAY  A train pulls up. Peter cautiously steps onto the platform. Steven appears from the next carriage and walks over. STEVEN Peter? PETER Thank god. I had a horrible feeling I was going to be the only one here. STEVEN I reckon that’s not the last horrible feeling you’ll have today. PETER This can't be happening. Can it? STEVEN You said it, mate. They share warm if awkward hugs and pleasantries. STEVEN What the hell are we doing? OLIVER (O.S.) What we always did. Oliver approaches, a mini-suitcase trailing behind him. OLIVER Follow Gary King into almost certain oblivion. Peter and Steven greet Oliver. OLIVER Didn't we decide to stop calling him fearless leader somewhere around 1992? PETER Old habits die hard. STEVEN We'll be putting that on Gary's tombstone.  19.  (CONTINUED)",
      "characters": [],
      "action_text": "OLIVER No we won't. Gary's going to outlive us all. STEVEN That'd be funny if it wasn't true. Peter notices Oliver looking quizzically at him and Steven. PETER What? OLIVER I'm just trying to figure out which of us is the biggest idiot for coming. A whistle. They turn to see Andy standing on the next platform. He wears the resigned look of a condemned man.  EXT. OVERLAND TRAIN STATION - LATER  The station clock reads '3.57'. Andy, Oliver, Steven and Peter sit on their bags. They check their watches. PETER Maybe he’s had an accident. Sorry Andy. ANDY It’s fine. Gary having an accident would actually be the best outcome for us all. Including Gary. THE BEAST comes tearing in. Matt black. Belching fumes.  'There's No Other Way'   by Blur blaring from the stereo. Gary parks and bounds over to the others, excitedly. GARY Oh yes! Look at these cunts. ANDY You're late. GARY No I'm not. ANDY It's almost 4, you said 3. GARY Yeah, 3 for 4.  20.  CONTINUED:  (CONTINUED) ANDY You know your problem Gary? You're never wrong. GARY How is that a problem? Gary throws the bags into the boot of The Beast. PETER I can't believe you bought another Granada MK2. GARY What do you mean? PETER This looks exactly like the car I sold you in 1989. GARY  This is   the car you sold me in 1989. Best 300 quid I ever spent. PETER  This is   The Beast? GARY Pretty much. She's had a bit of work done. New suspension, brakes, exhaust, seats, wheels, panelling, carburettor, manifold - well, the whole engine really - other than that, it's the same old motor. OLIVER One might say an antique. GARY Then what say we get this   antique  on the   roadshow?  The clock chimes four times. Gary beams, oblivious. GARY C’mon you bellends. We’re going to be late.  INT. THE BEAST - MOMENTS LATER  The gang sit cramped in the car. Gary tries to start it.  21.  CONTINUED:  (CONTINUED) GARY And we’re back. The Five Musketeers. STEVEN Three Musketeers isn’t it? PETER Four if you count D’Artagnan. GARY Well nobody really know",
      "dialogue_count": 0,
      "word_count": 1439
    },
    {
      "scene_number": 2,
      "slugline": "INT. THE B&B - DAY  A kindly landlady watches as the boys fill in forms. LANDLADY Do you have plans for dinner? Gary takes a TOURIST MAP from a display, opens it out. GARY Tonight, we will be partaking of a liquid repast as we wend our way up The Golden Mile, commencing with an inaugural tankard at The First Post then onto The Old Familiar, The Famous Cock, The Cross Hands, The Good Companions, The Trusty Servant, The Two Headed Dog, The Mermaid, The Beehive, The King’s Head and The Hole in the Wall for a measure of the same, all before that last bitter sweet pint in that most fateful terminus, The World’s End. Leave a light on good lady, for though we may return with a twinkle in our eyes, we will, in truth be blind... drunk. The landlady stares at Gary.  INT. B&B. BEDROOM 1 - DAY  Andy sits on his bed. We hear banging from another room.  INT. B&B. BEDROOM 2 - DAY  Steven flicks through the TV channels. More banging.  INT. B&B. BEDROOM 3 - DAY  Oliver is laying out some clothes onto the bed. GARY (O.S.) Oh come on!  INT. B&B. BEDROOM 4 - DAY  Peter frowns at the noises coming from Gary’s room.  28.  (CONTINUED)",
      "characters": [
        "GARY",
        "OLIVER"
      ],
      "action_text": "Gary nods sagely and opens the door with a flourish to-  INT. THE FIRST POST - CONTINUOUS  -the shittiest chain pub you’ve ever seen. It’s completely without charm or atmosphere. Gary smiles. GARY It’s like déjà vu. PETER I don't remember this at all. Has it been refurbished? STEVEN Must have been bought by a chain. OLIVER Yes, it's part of that nationwide initiative to rob small, charming pubs of any discernible character. STEVEN Starbucking, man. It's happening everywhere. GARY Can't take away that smell though. ANDY I'm sure they tried. They walk to the bar. There are few patrons present. Gary approaches PUBLICAN 1 with an expectant smile. GARY Good evening Raymondo. The prodigal sons return. The publican doesn't seem to recognise Gary. GARY Who's on the guest list tonight? PUBLICAN 1 Come again? GARY The guest ales. We're doing The Golden Mile and you sir, have the honour of drawing first blood. What do you recommend?  30.  CONTINUED:  (CONTINUED) PUBLICAN 1 There's one. Crowning Glory. GARY Rather fitting. PUBLICAN 1 Why's that? GARY I'm Gary King. PUBLICAN 1 What? Gary continues, not phased. GARY So tell me more. PUBLICAN 1 About what? GARY Crowning Glory. Is it hoppy? Is it nutty? Is it foamy? Does it have a surprisingly fruity note that lingers on the tongue? PUBLICAN 1 It's beer. GARY Mmmmmm, we'll have five of those then. ANDY Four. And one tap water. GARY You fucking what?!  INT. THE FIRST POST. TABLE - LATER  The group sits at the same table from the prologue. Gary looks at Andy sipping his water and shakes his head. GARY I can't believe this, a man of your legendary prowess drinking fucking rain. It's like seeing a lion eating some hummus.  31.  CONTINUED:  (CONTINUED) OLIVER That doesn't make any sense. GARY I know it doesn't make any sense. ANDY You seriously have a problem with me not drinking, after what happened? GARY I don't but King Arthur does! OLIVER Ooh this'll be good. ANDY What's King Arthur got to with it? GARY Do you think King Arthur woul",
      "dialogue_count": 2,
      "word_count": 8816
    },
    {
      "scene_number": 3,
      "slugline": "INT. THE CLOAKROOM - CONTINUOUS  BASIL That’s when you get replaced. Once they get your DNA they’ve got you. STEVEN How do they do that?  INT. THE MERMAID - CONTINUOUS  Gary, Andy & Peter are worked by the Marmalade Sandwich. Erica Leeks licks Peter’s neck, Gary snogs Tracy Benson. BASIL (O.S.)  Any way they like, blood tests, the nit nurse, sweat,   kissing , saliva on the rim of a glass- INT. THE CLOAKROOM - CONTINUOUS  Basil produces his curly straw. BASIL Why do you think I drink with this crazy straw, not so crazy now is it? If you’re not on their side they’ll create a version that is.  INT. THE MERMAID - CONTINUOUS  Andy does his best to resist Becky's kisses. He shows her his wedding ring, she sucks it off his finger and swallows it. BASIL (O.S.)  They can bring you back exactly the same or even make you young again. It looks like you, even has your memories but really it's just a vessel to spread their message. People you know, trust, love, respect, desire, replaced in the name of progress.  80.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 186
    },
    {
      "scene_number": 4,
      "slugline": "INT. THE CLOAKROOM - CONTINUOUS  STEVEN What happens to the people who get replaced? BASIL The 'empties'? Don't ask me what happens to them. STEVEN Why, what happens to the empties? BASIL I told you not to ask me that! Go! Get out, before it's too late! CREAK! The cloakroom door opens. Steven and Basil turn to see a coat thrown in and the door just as quickly shut. When Steven looks back,   Basil is gone...  STEVEN Basil? Basil appears from underneath the coat. BASIL I said go!  INT. THE MERMAID - CONTINUOUS  SAM This can't be good. Sam, aghast as the Marmalade Sandwich tempt our heroes. OLIVER Sam, who was that boy you liked in sixth form? Adrian? SAM Adrian Keane. Why? OLIVER He’s over there. Sam sees a HANDSOME YOUNG MAN in school uniform, standing in a dark corner. He sees her, smiles and approaches. ADRIAN KEANE Hey Sam. How’s life?  81.  (CONTINUED)",
      "characters": [],
      "action_text": "Sam's own glass slips from her hand to smash on the floor. Horrified, Sam turns to run and SLAMS right into- STEVEN & SAM We have to get out of here! STEVEN Where are the others? SAM They're blending in. Steven sees his friends being seduced on the dance floor. STEVEN Fuck! Sam and Steven attempt to separate the couples. GARY Just to the end of the song. STEVEN Gary, she's a blank! GARY Don't be so judgmental.  EXT. THE MERMAID - MOMENTS LATER  The gang bursts from The Mermaid. Oliver stops them. OLIVER Hold up. Where are you all going? SAM & STEVEN We're leaving! OLIVER What happened? SAM Adrian Keane was in that bar. OLIVER I thought you liked Adrian Keane. STEVEN Prick. SAM  Adrian Keane   is dead.  82.  CONTINUED:  (CONTINUED) STEVEN Sorry. SAM Adrian Keane died in a motorbike accident in Italy eight years ago. OLIVER Did he? STEVEN They must have had his DNA on file. That’s how they were able to replicate him. They know how to get to us. Jesus, they know everything. SAM They didn’t know Adrian was dead. STEVEN They know enough to tempt us. They knew these three would fall for 17- year-olds in school uniform. GARY Who wouldn’t? Am I right guys? STEVEN We have to get out of town, get beyond it, before it’s too late. OLIVER Who’s given you these ideas? STEVEN Basil. OLIVER Oh Mad Basil? He of the Bermuda Rhombus and the Aqua Nazis? GARY Another good name for the band, Steve. OLIVER You’re going to put our lives in the hands of a crazy old man? STEVEN He’s not crazy!  83.  CONTINUED:  (CONTINUED) OLIVER Maybe he's not. Maybe he's a blank trying to lure us to the edge of town, onto those dark country roads where they can deal with us. PETER Yeah, we could end up dead in a field. I hate fields. Sam is aware of the VARIOUS PASSERSBY watching them argue. SAM Steven's right. We should go. OLIVER We're going to The Beehive. Gary's plan is still the best we have. GARY You know what? The 1990 model Oliver was out of commission by this point in the evening. OLIVER What are ",
      "dialogue_count": 0,
      "word_count": 1835
    },
    {
      "scene_number": 5,
      "slugline": "EXT. THE BEEHIVE. ROOF - NIGHT  They get on the roof. The fire alarm appears to be ringing throughout the entire town. Gary is out of ideas. GARY Come on! SAM Ooh look, there's my car! Let's climb down the drainpipe. GARY I've got a better idea. Gary jumps and lands on the roof of Sam's car, severely denting it and blowing out the windscreen. GARY Climb down the drainpipe. A minute later, Sam gets into the car. Gary shuts her door. GARY Okay, go. SAM Wait. What about everybody else? GARY Leave 'em with me. I got this. SAM Are you sure? GARY I always come up smiling. SAM I don't know if that's true, Gary. GARY Just go. SAM Will you find out what happened to my brother? GARY Of course, and I'll look after Stevie for you, eh? Off Sam's bashful acknowledgement.  91.  (CONTINUED)",
      "characters": [],
      "action_text": "GARY He's a good guy, better than me. SAM Gary, you’re not a bad person, you’re just not boyfriend material. The whole ‘free spirit, quick one in the disabled toilets’ thing is kinda cool when you’re seventeen but not so much when you’re facing forty. There comes a time when you have to go forwards and not backwards. GARY Maybe if I hadn’t left you behind that night, it would have been different. SAM It's not all about that night y'know. GARY Isn't it? SAM It doesn't have to be. GARY We'll always have the disableds though eh? SAM Yes, we'll always have the disableds. Sam smiles and fondly kisses him on the cheek. She drives off, her damaged car RATTLING LOUDLY. Gary gets up, his knees cracking. He groans, feeling his age. This attracts the attention of a BLANK who appears at the mouth of the alley, its eyes ILLUMINATING INTO SEARCHLIGHTS. Gary disappears out of shot. We hear a jump and a crash. The blank turns its searchlights to see that Gary has failed to vault a fence. He gets embarrassed and disappears again. Gary hightails it to a local park, past a sign saying 'KEEP OFF THE GRASS' and towards the deserted bowling clubhouse.  92.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 357
    },
    {
      "scene_number": 6,
      "slugline": "INT. THE BOWLS CLUB - CONTINUOUS  Gary bursts in. Andy, Peter and Steven spin around. STEVEN Where's Sam? GARY I put her in her car. STEVEN/PETER You did what?! GARY Put her in a car, told her to leave. ANDY You just sent away the only one of us sober enough to drive?! GARY Yeah. STEVEN You just couldn’t stand the fact that she might prefer me to you. GARY That’s not true. STEVEN It is true Gary! I was getting somewhere. We held hands. GARY Oh c’mon! I was trying to help! STEVEN Trying to help yourself more like! GARY Jesus, I do something right for a change and you all get on my case. ANDY Wow, that’s the first time I’ve ever heard you admit being wrong. GARY I said I did something   right!  93.  (CONTINUED)",
      "characters": [],
      "action_text": "STEVEN Yeah ‘for a change’. GARY So? ANDY Meaning the rest of the time you’re wrong. GARY Not necessarily. ANDY & STEVEN Arrrgghhhhh! GARY I just thought it would be best to get her out of harm's way. PETER And what about us Gary? Aren't we in harm's way? GARY We're alright Pete. We're The Five Musketeers. PETER Four Musketeers. STEVEN Wait, how do we know you put her in her car? How do we know you're you. GARY Of course I'm me! ANDY Yes but who the fuck are you, Gary? GARY I'm Gary King. There's only one Gary King. How do I know you're you? ANDY We've been together the whole time. GARY You might all not be you. How did you know that O-Man wasn't O-Man?  94.  CONTINUED:  (CONTINUED) ANDY His birthmark was back. GARY What does that prove? STEVEN Because of what Basil said. They make a copy from your DNA. That's why he had his birthmark. He was new, like a baby. ANDY Like a man-baby. PETER A 'maybe'. STEVEN Oliver with none of the shit that had happened to the real Oliver. ANDY The laser surgery! GARY So the blanks really are blank? ANDY No wear and tear, no scars. GARY Steven, in 1987 we were playing cricket and I accidentally pushed you onto a broken bottle that nearly went up your bum. STEVEN So? GARY So show us your arse. Steven drops his trousers and bends over. He shows off an area of scar tissue just beneath his right buttock. GARY Very nice. Peter, when you got that 50CC Suzuki in 1988, you let me have a go and I ran over your leg. Peter gingerly pulls up the leg of his trousers, revealing a perfectly intact limb. The others gasp in horror.  95.  CONTINUED: (2)  (CONTINUED) PETER Oh wait it's my other one. Peter pulls up the other leg to reveal knotted scar tissue. GARY Andy, in 1986, we re-enacted the Knife Game out of Aliens and I stabbed you in the middle finger. ANDY Or how about December 1997, when you OD'd and I drove you to hospital, four times over the limit and ended up rolling the car and almost severing my femoral artery at which point you made a mi",
      "dialogue_count": 0,
      "word_count": 1867
    },
    {
      "scene_number": 7,
      "slugline": "EXT. STREETS OF NEWTON HAVEN - CONTINUOUS  Gary runs down the middle of the street towards the next pub. GLOWING EYED blanks give chase. A huge spotlight illuminates Gary, the sound of the BRONZE SCULPTURE growing closer. Andy too is on Gary’s tail, screaming at him. ANDY Come back you stupid bastard! Gary barges aside blanks, intent on reaching his goal. We see familiar faces from earlier among the blanks: The same VARIOUS PASSERSBY, all THE PUBLICANS they've met. He rips the arm off PUBLICAN 1 and knocks the head off PUBLICAN 3 with the severed limb. As he nears the eleventh pub, he runs over a picnic table, and kicks the MOTORCYCLE COP in the face on the way down. Andy knocks aside attackers with the same ferocity. He sees Gary up ahead, ducking into The Hole in the Wall. We follow Andy as he makes his way towards the pub, DODGING AND FIGHTING BLANKS of all apparent ages and sizes. The BRONZE SCULPTURE suddenly stands in Andy's path. He skids underneath the legs without breaking his run. Andy then rips the arms from two of THE TEENS and smashes another two with the same dismembered limbs.  INT. THE HOLE IN THE WALL - CONTINUOUS  Andy enters The Hole in the Wall at such speed, the door flies off its hinges. Gary is already behind the bar, raising a pint to his lips, he sees Andy and knows he must act fast. GARY Andy look out! TWO BLANKS pounce on Andy from behind. He barely turns to swiftly and furiously dispatch them with the severed limbs. Andy makes toward Gary but hears the ROAR OF AN ENGINE. THE BEAST SMASHES THROUGH THE WALL. Steven is at the wheel. We see SWARMS OF BLANKS approaching the new hole in the wall.  104.  (CONTINUED)",
      "characters": [
        "ANDY"
      ],
      "action_text": "STEVEN Gary, Andy, get the fuck in! GARY You heard him, Andy. Gary finishes his pint, crosses 11 off his map and runs for a back window. He DIVES THROUGH THE GLASS, smashing it. STEVEN We don’t have much- BANG. TEEN 1 jumps onto the Beast’s roof. Like Andy it has adopted the dismembered limbs as clubs. It flips down to the ground to face Steven as another blank rips the car door off. A jagged shape smashes through the back window. The BRONZE SCULPTURE pulls the Beast back outside with its limbs. ANDY Steven! The Beast is overwhelmed with blanks. The Teen jumps down to menace Andy as the Bronze Sculpture shatters the windscreen. STEVEN (O.S.) Andy! Go! Now! Andy has no option but to follow Gary through the window.  EXT. THE STREETS OF NEWTON HAVEN - CONTINUOUS  Andy lands and rolls on the tarmac. Up ahead he sees: Gary, sprinting uphill towards THE WORLD’S END. Andy follows. The wind whips against Gary. The TOURIST MAP blows out of his jacket and flies into the air landing in Andy’s face. As he casts it aside, Andy sees the Marmalade Sandwich approaching fast. He barges into Tracy Benson, knocking her flying. He shoulder charges Erica Leekes then sees - Becky Salt. No glowing eyes. Looking absolutely perfect. BECKY SALT I want you inside me Andy. ANDY I'm sorry.  105.  CONTINUED:  (CONTINUED) Andy plunges his fist into Becky's stomach. His hand emerges covered in blue stuff, wedding ring between finger and thumb. He places it back on his finger and runs off. ANDY Cheers.  INT. THE WORLD'S END - NIGHT  A single full pint stands alone on a table. Behind it, the door bursts open to reveal Gary, mad, panting. He approaches the drink as though it were the holy grail. An eerie silence in the bar, as though the world has been reduced to just Gary and the pint. He raises it to his lips. SMACK! It's Andy. He slaps the glass from Gary's hand. ANDY You've had enough! GARY This is it, Andy! This is The World's End! ANDY I know! Furious, Gary runs towards the bar. Andy tries to s",
      "dialogue_count": 1,
      "word_count": 4872
    }
  ]
}