{
  "slug": "the-man-who-invented-christmas-2017",
  "title": "the man who invented christmas",
  "genre": "drama",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 12899,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HADDOCK’S OFFICE - CONTINUOUS 30   30 Dickens hastens down the street, and turns the corner. He leans up against the wall, eyes closed, sweating. FORSTER (O.S.) Charles? Dickens opens his eyes to find FORSTER looking at him closely. He claps him on the shoulder. FORSTER (CONT’D) Charles? Are you all right? Dickens straightens up, shrugging off the moment. DICKENS A kidney spasm. That’s all. He stalks off. DICKENS (CONT’D) (over his shoulder) Find me an illustrator. INT. PAWNSHOP - DAY 31   31 Mr. Dickens Senior is showing a PAWNBROKER a book as his wife looks on. MR. DICKENS Best quality, sir. A1 condition.... and look — He opens the cover. MR. DICKENS (CONT’D) Inscribed by the author. The pawnbroker peers at the handwritten inscription. PAWNBROKER To Papa. Love, Charles. The pawnbroker examines Dickens Senior skeptically. PAWNBROKER (CONT’D) Five bob. VOICE (O.S.) Hallo old girl. Hallo old girl. Mr. Dickens looks up to see a CAGED CROW, walking up and down on his perch. Mr. Dickens’s face lights up. He turns back to the pawnbroker.  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 33",
      "characters": [],
      "action_text": "MR. DICKENS Perhaps we might strike a bargain? INT. HALLWAY - DAY 32   32 Outside the study, a trio of servants and Tara are giggling as they listen to the master making strange noises. DICKENS Oh but he was a tight-fisted hand at the grindstone, old— ... Scratch? Scrounger?... INT. STUDY - DAY 33   33 DICKENS - a covetous old sinner! ... old — whatshisname! He throws his pen down in frustration. INT. HALLWAY - DAY 34   34 DICKENS (O.S.) ....Screwpull.... Scrabbly... scr—rrrr—aahhh— chh...aahhh They push Tara forward. SERVANT Go on. He won’t bite. Tara knocks softly on the door, and opens it. INT. STUDY - CONTINUOUS 35   35 Tara enters. Dickens is nowhere to be seen. She tiptoes over to the fire. Suddenly, she hears— DICKENS (O.S.) Mr.... Scrimple! She squeals with terror. Dickens sits up from the couch where he has been lying and takes the handkerchief off his face. DICKENS (CONT’D) You, what are you doing in here? TARA I’ve just come to see to the fire, sir. DICKENS I’m not to be interrupted under any circumstances. Do you hear?  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 34 TARA I beg your pardon, sir. It won’t happen again. Tara turns to go. DICKENS Wait. What’s that in your pocket? Tara’s takes out a Penny Dreadful magazine and reluctantly hands it over to Dickens. Dickens examines the cover: a winged vampire with bloody teeth. DICKENS (CONT’D) “Varney the Vampire: The Feast of Blood.” Any good? TARA Oh, yes, sir. Thrilling. He smiles. DICKENS Where did you learn to read? TARA My mum taught me. But then she died. So, I had to go to the Grubber. Dickens recoils. DICKENS The Workhouse? TARA You won’t tell Mrs. Fisk, will you? She’d think I was shirking. DICKENS It will be our secret. Dickens plucks a book off the shelf: The Arabian Nights. DICKENS (CONT'D) In fact, I’ll make you a trade. Varney the Vampire for... Aladdin and his Magic Lamp. She takes the book in her hands with awe. TARA Oh. My.  The Man Who Invented Christmas   Yellow Rev",
      "dialogue_count": 0,
      "word_count": 3708
    },
    {
      "scene_number": 2,
      "slugline": "INT. STUDY - NIGHT 48   48 Dickens and Scrooge stare at a ghostly figure (looking a good deal like Tara), dressed in white, wearing a wreath on her head. She stands by the window where the muslin curtains float eerily around her in the wind. SCROOGE Tell him who you are. GHOST OF CHRISTMAS PAST I am the Ghost of Christmas Past. The Ghost gestures towards the window. GHOST OF CHRISTMAS PAST (CONT’D) Follow. SCROOGE It’s awfully late and I’m not quite dressed. GHOST OF CHRISTMAS PAST Follow. Scrooge draws back. SCROOGE Not bloody likely. DICKENS Why? SCROOGE Mucking around in the past? What’s the point? DICKENS You might learn something. SCROOGE I already know everything I need to know. (to the Ghost) Take him, why don’t you? DICKENS Me? SCROOGE If you’re so keen. The ghost turns her gaze to Dickens.  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 55",
      "characters": [],
      "action_text": "DICKENS It’s not about me. SCROOGE You’re the author aren’t you? Dickens looks at the ghost, fearful. He doesn’t move. The Ghost turns to look at the slightly ajar window, which now SLAMS wide open. EXT. WARREN’S BLACKING FACTORY - NIGHT 49   49 Young Charles holds his father’s hand tightly, through the bars of a bailiff’s van, trying to keep from crying. The rest of the family are huddled together behind his father in the van. MR. DICKENS Don’t cry, Charlie. We’ll be back for you before you know it. YOUNG CHARLES But why can’t I stay with you? MR. DICKENS You’re a big boy now, Charlie. You need to help out. You’ll see. (MORE)  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 55A It will be an adventure. You’ll hardly think of us at all. Behind him, the bailiff climbs on board the van. BAILIFF Time to go. Young Charles starts to cry. MR. DICKENS Now, sir, enough of that. Stand up tall. Blood of iron, heart of ice. The van starts to move off. Young Charles lets go of his father’s hands. MR. DICKENS (CONT’D) (shouting back) Remember: you are the son of John Dickens. A Gentleman. You be sure and tell them that! The van disappears around the corner. The boy turns and looks with dread at the old, tumbledown building, beneath the sign WARRENS BLACKING: “The Pride of Mankind”. A door opens spilling some light. YOUNG CHARLES (trying to gather strength) Blood of iron, heart of ice. INT. BEDROOM - MORNING (PRESENT) 50   50 Dickens is in bed, tossing in his sleep. Kate comes in, dressed for the day. Dickens awakes with a start. KATE Good morning. She bustles about the room. DICKENS What? Oh. Yes. KATE You were tossing and turning all night, you know. DICKENS Bad dreams. KATE What about? MR. DICKENS (CONT'D)  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 56 He shakes his head. DICKENS I don’t know. Shadows. Nothing more. KATE A little daylight will cure you. She throws open the curtains. INT/EXT. MARKET - DAY 51   51 A theatre curtain is",
      "dialogue_count": 0,
      "word_count": 3157
    },
    {
      "scene_number": 3,
      "slugline": "INT. WARREN’S BLACKING - CONTINUOUS 60A   60A Inside the noisy, squalid factory, Young Charles is led by a Foreman to a score of pale-faced, miserable-looking CHILDREN, all of them busy pasting labels on bottles or packing them in casks. FOREMAN Boys. This here is Charlie Dickens. And what was it you was just telling me, lad? About your Dad? Young Charles draws himself up proudly. YOUNG CHARLES My father is a gentleman. The boys jeer. Young Charles flushes with embarrassment. One of the boys, POLL, calls out. POLL Where is he, then? Dining with the queen? Another boy calls out. BOY I ‘eard he’s in the stone jug. FOREMAN Hush, you lot. Where’s your manners? The Foreman addresses him with elaborate politeness. FOREMAN (CONT’D) Master Dickens. Perhaps you would be so good as to join us at work? If you’ve nothing better to do? The Foreman thrusts him down hard onto the work bench. Young Charles looks around, miserable, at his surroundings. FOREMAN (CONT’D) No shirking here. A rat scuttles nearby, to reveal a sheer drop to the giant blacking VATS below. Poll sits down beside him and hisses at him.  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 72",
      "characters": [],
      "action_text": "POLL You’re no better than me, cocker. You’d best learn that. BACK TO  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 72A",
      "dialogue_count": 0,
      "word_count": 227
    },
    {
      "scene_number": 4,
      "slugline": "INT. DICKEN STUDY - NIGHT 61   61 Dickens sits at his desk. He looks at the clock. It’s the middle of the night. He once again goes through his ritual of straightening everything on his desk. He tidies his manuscript, picks up his pen, dips it in ink, then stares at the paper. There is a racket in the hallway outside the door. MR. DICKENS (O.S.) 'Tis now the very witching time of night, MRS. DICKENS (O.S.) Shhh, dear. Mr. and Mrs. Dickens are in the hallway outside the door. MR. DICKENS (O.S.) When churchyards yawn and hell itself breathes out— Scrooge appears. SCROOGE Shakespeare. Now there’s a man who could write. I doubt he ever had a blockage. MR. DICKENS (O.S.) Now could I drink hot blood! Dickens grips his hair in frustration. SCROOGE (egging dickens on) Self-preservation is the first law of nature. That’s just a fact. Dickens throws open the door to find Mr. Dickens, drunkenly negotiating the stairs with the help of Mrs. Dickens. MRS. DICKENS That’s right dear. Just a few more steps. MR. DICKENS “Oh, heart lose not thy nature; let not ever the soul of Nero-- Mr. Dickens sees Charles and attempts to regain his posture.  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 73",
      "characters": [],
      "action_text": "MR. DICKENS (CONT’D) Oh. Good evening, Charles.  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 73A Mrs. Dickens is a little afraid of her son. MRS. DICKENS We’ll get him straight into bed, Charles, dear. We were up the river to Kew and I think perhaps it was too long a day. DICKENS Kew! What about your newspaper article? MR. DICKENS Article? DICKENS The one you’re writing on the Bank Charter Act? It’s been over a month. Mr. Dickens shifts, uncomfortably. MR. DICKENS Oh, that. As it happens, the editor was not able to— that is to say— due to pecuniary involvements of a complicated nature— he found it necessary to— to cancel the commission. DICKENS So. No newspaper article. MR. DICKENS However, I rejoice to say that I have every hope of something turning up — Dickens sees Scrooge hovering behind him, scowling. DICKENS I think it’s time you went back to Devon, Father. Beat. MR. DICKENS Indeed. DICKENS As soon as possible. MR. DICKENS Of course, dear boy. We shall catch the afternoon train tomorrow.  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 74 He stumbles and nearly falls, but is caught by Tara. MR. DICKENS (CONT’D) (with dignity) Thank you, my dear. Here-- He fumbles in his pocket for a coin. MR. DICKENS (CONT’D) Let me give you something for your trouble. TARA That’s all right, sir. MR. DICKENS You’re very kind. They move away. MR. DICKENS (CONT’D) (to Tara) No-one is useless in this world who lightens the burden of another. Remember that, Tara. TARA I will, sir. Mrs. Dickens gives Dickens a reproachful look. MRS. DICKENS Don’t be hard on him, Charlie. You don’t know what he’s been through. DICKENS Don’t I? MRS. DICKENS He feels it all, you know. He would never tell you, but he feels it all. MR. DICKENS (O.S.) Ride on! Ride on over all obstacles and win the race! Dickens turns back to his study. Scrooge is smug. SCROOGE That’s it. Blood of iron, heart of ice. Now maybe we can finish this thing.  The Man Who Invented Chr",
      "dialogue_count": 0,
      "word_count": 2649
    },
    {
      "scene_number": 5,
      "slugline": "INT. BEDROOM - NIGHT 71   71 Kate stares at the ceiling, as Dickens rails away in the study. DICKENS (O.S.) Come out. If you be a man. Come out and fight! She is clearly disturbed. INT. DICKENS STUDY - MORNING 72   72 Dickens wakes with a start and looks around. The room is a disaster. Papers everywhere. Ink staining the wall. His glance falls on the Penny Dreadful that Tara left behind, with its lurid cover of Varney the Vampire. He stares at it a moment. DICKENS Tara! He goes to the door and bellows down the stairs. DICKENS (CONT’D) Tara! INT. DICKENS HOUSE. DINING ROOM - MORNING 73   73 The children are at breakfast with Kate. Mrs Fisk is there too.   The mood is sombre. Dickens appears, his clothes awry, full of an edgy energy. DICKENS Whatever is the matter? CHARLEY Tara. Charley bursts into tears. DICKENS What about her? CHARLEY She’s gone. DICKENS On whose authority?  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 88",
      "characters": [],
      "action_text": "KATE You asked Mrs. Fisk to take her away. DICKENS (to Mrs Fisk) Then go and search for her. Rehire her at once. MRS. FISK An Irish orphan in London? It would be like trying to find a needle in a haystack.  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 88A Dickens eyes blaze. He turns on Kate. DICKENS Why didn’t you stop her? KATE How was I to know you didn’t mean it? You said— DICKENS I say a lot of things that are nonsense. It’s what happens when I’m working. KATE Charles. DICKENS You knew, when you married me, what I was like: how ideas take possession of me. KATE I did. But you don’t know what it’s like to live with you, always walking on eggshells, trying to guess your mood, to know which of your commands is a whim and which is in earnest. Sometimes I think your characters matter more to you than your own flesh and blood. DICKENS I am who I am. KATE And who is that? It’s as if there are two of you, Charles. One that is good and kind, and a secret self, that no-one is allowed to know or question. Dickens stares at her a moment, then storms out of the room. INT. STUDY - DAY 73A   73A Dickens, heads back into the study, distraught. He catches himself in the mirror. We hear sounds of squealing rats, quietly as first, but as they build up... OMIT 74   74 OMIT 75   75 OMIT 76   76  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 89 OMIT 77   77 OMIT 78   78 OMIT 79   79 OMIT 80   80 OMIT 81   81 OMIT 82   82 FLASHBACK: INT. WARREN’S BLACKING FACTORY - DAY 83   83 Young Charles is sitting at his bench, looking frail. His clothes are torn and dirty. His eyes are hollow. A ragged cough shakes his body. Young Charles chants to himself, to keep from crying. YOUNG CHARLES Blood of iron, heart of ice. Blood of iron, heart of ice. ... POLL (O.S.) Got a present for the young gent’lmun. Seeing as it’s Christmas. Young Charles, open his eyes to see one of the older boys, POLL, approaching, hands behind his back. In a sudden movement, he",
      "dialogue_count": 0,
      "word_count": 1859
    },
    {
      "scene_number": 6,
      "slugline": "EXT. TRAIN STATION - DAY 96   96 Outside the station, Dickens’ cab pulls up. He jumps out and dashes past an enterprising VENDOR who is attempting to interest the passersby in his selection of “Christmas trees”. VENDOR ...the very latest, the same as what’s in the Queen’s own drawing room... INT. TRAIN STATION - DAY 97   97 Dickens enters the station and sees his father and mother on the platform about to get on the train. He leaps over the barrier and runs towards them. CONDUCTOR (O.S.) Last call. All aboard. DICKENS Stop! A CONSTABLE sees him and blows his whistle. CONSTABLE Stop! Mr. and Mrs. Dickens, just getting on the train, turn to see their son running along the platform. DICKENS What do you think you are doing? MRS. DICKENS Please, dear. Don’t make a scene. We’re going away. DICKENS Oh, no you don’t. CONSTABLE Hi! You! Mr. Dickens sees the Constable, rushing to catch up to them. MR. DICKENS What have I done? DICKENS Done? It’s what you haven’t done. Mrs. Dickens flinches.  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 98",
      "characters": [],
      "action_text": "MR. DICKENS I don’t understand— Dickens laughs, a touch maniacally. DICKENS Who is going to carve the turkey? (to his mother) Who is going to make the Christmas pudding? It won’t be the same without you? Mrs. Dickens softens. MRS. DICKENS Oh, the pudding. The secret is to warm the treacle first. Mr. Dickens turns to his wife. MR. DICKENS There you see, my dear? I told you something would turn up. MRS. DICKENS (through tears) You did, you did. Dickens laughs again, joyfully. He embraces them warmly. The Constable has finally caught up with them. His eyes widen in astonishment. CONSTABLE You’re that Charles Dickens. DICKENS Guilty. CONSTABLE I’m a huge fan. DICKENS Thank you. CONSTABLE That last one. Chuzzlewit. Wept like a baby, I did. DICKENS Well, that’s very— What is your name, Constable? CONSTABLE My name? Copperfield, Sir.  The Man Who Invented Christmas   Yellow Revisions   January 8, 2016 99 Dickens whips out his notebook of names. DICKENS Copperfield? Interesting. CONSTABLE Any chance of a new book soon? DICKENS Eh? Dickens suddenly pats his coat, remembering the Christmas Carol manuscript stuffed in his jacket. He pulls it out and rushes for a cab. EXT TRAIN STATION - DAY 97A   97A Manuscript in hand , Dickens runs out of the train station, jumps in a cab. DICKENS Shoe Lane. And hurry. EXT PRINTERS - DAY 97B   97B Dickens arrives at the printer, just as the clock is striking ten. Forster is waiting for him on the street. FORSTER Charles. Where have you been? I’ve been waiting here for an hour. DICKENS It’s all right. I have the manuscript. He pulls it out of his coat pocket. Several pages go flying in the wind. DICKENS (CONT’D) No! Forster and Dickens go chasing after the pages. A couple of PASSERSBY stop to help. INT. PRINTERS - DAY 97C   97C Forster and Dickens run through the halls, past the noisy press room, past the bookbinding room, to the Composing room. A cranky, ink-stained compositor (MR. GRUB) is just setting up when the two men arrive, out of bre",
      "dialogue_count": 0,
      "word_count": 1299
    }
  ]
}