{
  "slug": "the-wife-2018",
  "title": "the wife",
  "genre": "action",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 2,
  "characters": [
    "JOAN",
    "SUSANNAH"
  ],
  "total_words": 17183,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PROFESSOR CASTLEMAN'S HOUSE, UPSTAIRS BEDROOM -- LATER, 14   14 NIGHT Joan is now pacing the Castleman's bedroom with the BABY, who's slung over her shoulder in a pool of drool.   While she's waiting for the kid to doze off she decides to take a little tour of the Castleman's things.   She opens the closet and peers at Joe's shirts and jackets.   She touches his clothes, briefly, careful not to disturb them.   She closes the closet and wanders over to the bedside table. She puts the baby down on the bed and picks up a book -- James Joyce's Ulysses. She opens it up and sees Joe's name written inside the fly leaf. It's a bold, sexy, important-looking signature.   She runs her fingers over it, her heart racing.   She carefully replaces the book next to some walnut shells littering the top of the table.   She sees a small, piece of walnut meat that the Professor must have missed.   She picks it up and puts it in her mouth. She looks down at the baby who's staring up at her in that dumb, unfocused baby way. JOAN Hello, you.   I'm falling in love with your Daddy. Feeling reckless, she opens the drawer of the bedside table and looks in.   There's a plastic diaphragm case and a tube of spermicide.   Joan stares at it, horrified and fascinated. Next to the diaphragm is a whole walnut with something penned on it in Joe's distinctive script. Joan picks it up:   To Carol, I love you true, J.   Joan touches the glossy lips of the nut...she's surprised by how sensuous a walnut can be.   So this is why Joe likes to eat them. INT. PROFESSOR CASTLEMAN'S OFFICE -- A WEEK LATER, DAY 15   15 Young Joan is seated across from Professor Castleman who's slowly rolling a walnut around in one hand while he leafs through Joan’s latest literary effort.   Joan is in agony, praying that she hasn't gone too far. YOUNG JOE So. \"The Faculty Wife.\" You've shed quite an interesting light on Mrs. Castleman. YOUNG JOAN No, no, it's not about your wife at all, it was just a character study.  THE WIFE   FINAL SHOOTING SCRIPT (16/12/16)   22.",
      "characters": [],
      "action_text": "Joe leans over and kisses Joan full on the lips. He finally releases her and Joan sits back in her chair, flushed and trembling. YOUNG JOE Miss Archer, I've already told you that your work is good.   But I'm not sure that I got it through to you.   Do you believe me now? YOUNG JOAN Yes.   I think you've made it perfectly clear. They continue to kiss.   In their passion, they knock Joan’s manuscript off the desk and the pages flutter to the floor. INT. CONCORD JET -- SOMEWHERE BETWEEN NIGHT AND DAY, 1992 16   16 We're mid-flight on the way to Stockholm. We see Joan and Joe ensconced in their fancy Concord seats.   In the seats behind them we see Joe’s entourage -- his publisher, agent and editor. And David, who’s curled up in a blanket, plugged into a Walkman. Joan is doing the New York Times crossword puzzle -- with a pen, of course.   Joe, in a nest of airline blankets and pillows and newspapers, his free sleep mask dangling around his neck, is busy writing down ideas for his next novel on a yellow pad.   His tray table is littered with the remains of all the in-flight offerings of drinks and nut cups and jumbo shrimp. A comely FLIGHT ATTENDANT, MONICA comes over to Joe and in a hushed tone, leans over Joan and offers him a basket of freshly-baked cookies. FLIGHT ATTENDANT MONICA Would you like a freshly baked cookie Mr. Castleman? Joe looks up at the lovely Monica who's hovering over him. JOE Yes.   Why not. As the attendant leans over Joe and delivers his cookie with a pair of tongs, Joe watches with quiet pleasure as her breasts slide forward inside the silky blouse of her uniform. JOE (CONT’D) Thank you. Joan is observing this little scene with well-practiced detachment.  THE WIFE   FINAL SHOOTING SCRIPT (16/12/16)   23. FLIGHT ATTENDANT MONICA (To Joan) Mrs. Castleman, would you like a cookie? Joan would dearly love to strangle the bitch.   But her reply is faultlessly polite. JOAN Thank you, no. The lovely Monica moves on.   Joe is aware of Joan’s annoyance. ",
      "dialogue_count": 0,
      "word_count": 1219
    },
    {
      "scene_number": 2,
      "slugline": "INT. GRAND HOTEL -- DAY 17   17 The Castlemans and Joe’s entourage -- his editor, publisher and agent -- are arriving in the lobby of the Grand Hotel, a 19th century edifice of luxury and importance. The DOOR MEN are bowing their heads to Joe, BELL MEN are scurrying to fetch the Castlemans’ luggage. HOTEL STAFF smile at him, eyes shining with awe. Joe a little rumpled and travel-worn from the plane flight stares at the phalanx of SWEDISH PRESS and the members of the NOBEL PRIZE COMMITTEE who are waiting for him up ahead. Joan squeezes his arm. JOAN Are you OK? JOE Yeah, thanks Joanie, I'm fine. Joe walks into the embrace of the adoring Swedes, and reinvigorated by the attention, starts pumping hands with members of the prize committee. Joan stands back with David and shifts Joe's heavy woolen coat to her other arm.   She adjusts her expression to one of self-assured repose as they wait for the initial flush of Castlemania to die down. JOAN Do you want to know a secret, Honey? DAVID What. JOAN I’m dying for a cigarette. David laughs, which pleases Joan. We see Nathanial walking by lugging his suitcase and a plastic bag with his rented tux.   He spots Joan and David. BONE Joan, Mrs. Castleman -- I'm sorry if I intruded on you and Joe. I didn't mean to make myself a pest. JOAN Well, I apologize for my husband's rudeness. BONE Please, no need.   I’m sure he’s been swamped by glad-handers.  THE WIFE   FINAL SHOOTING SCRIPT (16/12/16)   27.",
      "characters": [
        "JOAN"
      ],
      "action_text": "The crowd around Joe is growing larger. BONE (CONT’D) Would you like me to say something amusing while you're waiting so you look like you're having a wonderful time? JOAN Thank you, Nathanial, but I'm quite comfortable standing here in my own thoughts. Joe, seeing Bone with Joan and David, calls them over. JOE Joanie -- JOAN Take care, Nathanial. Joan is swept into Joe’s magic circle. The head of the Nobel committee, Arvid ENGDAHL, an effusive, pink-cheeked man shakes Joan’s hand. ARVID ENGDAHL Mrs. Castleman!   Hello!   I am Arvid Engdahl!   I am the one who called you about the prize, waking you up at such an ungodly hour! JOAN Not ungodly at all, you added ten years to my husband’s life. Laughter from the Swedes, delighted that their laureate’s wife is such a warm and witty lady. Arvid turns to the press people. ARVID ENGDAHL (in Swedish) [This is Mr. Castleman's wife.] The photographers politely nod to her and take a few pictures for their B rolls. ARVID ENGDAHL (CONT’D) Mr. Castleman let me introduce you to Walter Bark who will be accompanying you on your engagements. The highly efficient WALTER shakes Joe’s hand. WALTER Mr. Castleman, it’s an honor. We'll provide you with anything you need.  THE WIFE   FINAL SHOOTING SCRIPT (16/12/16)   28. JOE Thank you.   But don’t worry, I’m very low maintenance. JOAN Only when he’s asleep. Warm laughter all around -- oh these Castlemans are a fun pair! ARVID ENGDAHL Mrs. Castleman,   this is Mrs. Lindelöf who looks after our laureate wives. MRS. LINDELOF, an effusive matronly women, greets Joan. MRS. LINDELÖF Mrs. Castleman, they’ll be keeping your husband very busy so I can arrange for shopping and beauty treatments! This couldn’t interest Joan less. JOAN Thank you, we’ll see. Joe is watching LINNEA, 30’s, a stunning young woman who’s been taking his photo.   As she pauses to adjust her aperture, she studies him with her with her fiercely intelligent eyes. Joe, already intrigued, nods to her and she smiles back -- an exc",
      "dialogue_count": 1,
      "word_count": 2050
    },
    {
      "scene_number": 3,
      "slugline": "INT. WAVERLY ARMS, JOE & JOAN'S ROOM -- NIGHT, SPRING 23   23 Joan has returned.   She's now standing at the open door of their tiny room, gazing at Joe, who's hunched over the table he’s made into his desk. He has a note pad beside him with a few scribbles on it and he’s staring at the empty page in his typewriter, his heart too broken to write. Joe turns and looks at her with his beautiful, haunted eyes. YOUNG JOE You're back. YOUNG JOAN I love you, Joe.   I believe in you. I believe in you with all my heart. Joe looks like he's going to weep.   Joan goes to him and he pulls her onto his lap and buries his face in her neck. YOUNG JOE Oh Joanie, my girl. I love you, don't ever leave me again... They kiss madly and pull each other to the bed. INT. CASTLEMAN SUITE, GRAND HOTEL -- NEXT MORNING 23A   23A We see Joe and Joan buried under the giant eiderdown fast asleep.   We hear the gentle rustle of the drapes being pulled open.   A cool light pours over them.   More rustling, soft footsteps, whispers...and suddenly we hear a chorus of girls break into song. Joe and Joan lurch out of their deep traveler's sleep and stare groggily up at a circle of angelic-looking SWEDISH GIRLS in white robes who are standing around their bed holding candles and singing some indecipherable Swedish song of celebration. Joan and Joe, disoriented, sit up and groggily stare at the crowd in their room.   Walter is standing by. WALTER Good morning Mr. Castleman. Today is St. Lucia day and this is St. Lucia who has come to pay her respect to a great writer. JOE St. Lucia... WALTER (worried) I believe I told you yesterday to expect this...?  THE WIFE   FINAL SHOOTING SCRIPT (16/12/16)   36.",
      "characters": [],
      "action_text": "JOE Yes, you probably did. A GIRL PLAYING SAINT LUCIA approaches the bed, wearing a crown of lighted candles and shakily carrying a breakfast tray set with a coffee service and elegant pastries. JOE (CONT’D) This looks wonderful.   Thank you. Linnea is there.   She crouches down by the bed and starts taking pictures.   Joan, feeling puffy and unattractive, would rather she not. JOAN (slipping out if bed) Excuse me... JOE Where’re you going? JOAN I’d like to freshen up. Joan goes into the bathroom and shuts the door. WALTER I’m so sorry, Mr. Castleman, is this an inconvenience? JOE No, no, I’m grateful that you woke me up.   I was in the middle of a nightmare.   I was back in Brooklyn, still living with my mother. He gets a laugh.   Joe takes a big bite of a pastry.   Crumbs tumble onto the sheets. JOE (CONT’D) Delicious!   This is fantastic. INT. BATHROOM -- CONTINUOUS 23B   23B Joan has shut the door and is hunched on the toilet, having one of those endless morning pees.   She can hear the girls serenading Joe through the door.   She starts to shiver uncontrollably.   To calm herself, she starts quietly singing her own little song. JOAN I’m Mrs. Joseph Castleman, Oh lucky, lucky me, His brilliance shines through my soul, even when I pee.  THE WIFE   FINAL SHOOTING SCRIPT (16/12/16)   37.",
      "dialogue_count": 0,
      "word_count": 536
    },
    {
      "scene_number": 4,
      "slugline": "INT. NOBEL FOUNDATION, RECEPTION HALL -- DAY 24   24 We're at a formal reception that's set up with a vast buffet of food and SERVERS circulating with trays of champagne. Joe, with a plate of food in his hands, is regaling a group of NOTABLE SWEDES with one of his standard anecdotes. JOE ...my father was a shoe salesman. He died of a heart attack when I was seven while he was fitting some pimply kid with a pair of saddle shoes. Walter is rapidly translating this for the non-English speakers while Linnea takes pictures of Joe. Joan is standing next to David with a glass of champagne, grateful to have her son for company. JOE (CONT’D) So when I come home from school that day, my mother grabs me, presses me to her substantial bosom and says, \"Joe, I have something terrible to tell you.\" Before she can get it out, my tiny Russian grandmother, who's built like a footstool, screams at her, \"not before dinner, you'll ruin his appetite!\" The English speakers laugh.   While Walter translates for the rest of the Swedes Joe bites into a piece of bread that’s piled with herring. He glances at Joan and she discreetly signals for him to brush off a crumb from his beard.   He does so and Joan gives him a little nod that it’s gone. DAVID Have you ever thought of letting him leave in the crumbs? JOAN Married people don’t do that, Darling. Our job is to protect each other from humiliation. Arvid comes over. ARVID ENGDAHL Excuse me, I hate to interrupt this wonderful exchange, but I’d like to introduce the Castlemans to another one of our laureate families. JOE Of course.  THE WIFE   FINAL SHOOTING SCRIPT (16/12/16)   38.",
      "characters": [
        "SUSANNAH"
      ],
      "action_text": "ARVID ENGDAHL (to Joe) James Finch is getting our prize in physics.   A very brilliant man and nice as can be. JOE Terrific, can’t wait to meet him. Arvid ushers Joe, Joan and David over to JAMES FINCH who’s standing with his wife CONSTANCE and the four FINCH CHILDREN (aged 15 to 25). ARVID ENGDAHL James Finch, may I introduce you to the novelist Joseph Castleman. James, an Englishman and an alpha male like Joe shakes hands with him. JAMES FINCH Pleasure to meet you.   I wish I could say that I've read all your books. JOE Please, I wish I could say that I understand your formulas. Laughter. Finch’s wife Constance, a jolly, toothy lady shakes hands with Joe. CONSTANCE FINCH I've read your books, and I promise you, they're a much better read than James's scribblings. JAMES FINCH My wife Constance is a scientist as well, and as you can see, she's quite critical of my work. JOE Well, my wife doesn't write, thank God, otherwise I’d have permanent writer's block. More laughter.   Joan extends her hand and introduces herself. JOAN Hello, I'm Joan. JOE Joan is the light of my life.  THE WIFE   FINAL SHOOTING SCRIPT (16/12/16)   39. JAMES FINCH Let me introduce you to my children -- this is Peter, Sam, Ellen, Chester... The Finch kids, a cheerful, outgoing lot, say hello to the Castlemans and shake their hands.   David is itching for a cigarette. ARVID ENGDAHL If I may brag for James for a moment -- his children are all quite remarkable. Ellen is doing work on the metabolism of neural cells, is that right? JAMES FINCH Yes, I'm counting on her to find the cure to Alzheimer's just in time for my own dementia. Lots of good-natured chuckling.   ELLEN FINCH, a socially awkward 19-year-old   rolls her eyes to David, trying to bond with him. ARVID ENGDAHL Tell them please about your children’s other wonderfl studies! JAMES FINCH Sam here is working in conductive polymers. Peter is interested in prime factors. And Chester is trying to disprove the string theory -- he’s a bit out of ",
      "dialogue_count": 1,
      "word_count": 13378
    }
  ]
}