{
  "slug": "the-way-back-2020",
  "title": "the way back",
  "genre": "drama",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 23971,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DIANE’S HOUSE - STAIRWELL - MORNING Jack tiptoes down the stairs as he puts on his flannel jacket. He arrives at the front door when he overhears -- BOY’S VOICE (O.C.) Let’s party at Kendrick’s house. He turns to find Diane’s TEENAGE SON, 16, sitting in the den, talking on an iPhone. He hasn’t noticed Jack yet. TEENAGE SON His parents don’t care if we blaze up in the basement and it’ll give me some alone time with Mandy. Jack opens the door. It CREAKS. Loudly. Son turns, sees Jack. JACK Oh. Hey. TEENAGE SON Hey. JACK Happy Thanksgiving. TEENAGE SON Go fuck yourself, bro. (back into phone now) Not you. Some loser who was dickin’ my mom all night. EXT. DIANE’S HOUSE - MORNING Maple leaves blanket the yards of the English Tudors. Jack exits the home. It’s a frigid Fall morning and his breath escapes in white tufts. He takes a moment to gauge the fastest way home. Looks into Diane’s backyard. The home backs up to a stretch of woods. It’s a shortcut he knows well so he heads into the backyard and disappears into the woods. EXT. FOREST - MORNING A whitetail doe and her fawn drink from a shallow creek. They pause at the sound of Jack’s boots swooshing the leaves as he crosses a ford in the stream and continues up a slope.  11.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 232
    },
    {
      "scene_number": 2,
      "slugline": "EXT. HAVERTOWN - MAIN DRAG - MORNING Jack walks down the sidewalk, head down, hands tucked inside his jacket pockets. A Wawa delivery truck HONKS its horn as it passes. Jack looks up, waves at the driver, then puts his head back down again and his hand back in his jacket pocket. EXT. BURKE’S INN - MORNING The Chevy Blazer is the lone car remaining in the lot. Jack approaches, climbs in. INT. CHEVY BLAZER - MORNING Jack starts the car.   97.5 ‘The Fanatic’   SPORTS RADIO begins again. He blasts the heat, shivers off the cold, then reaches into the backseat for the mini-cooler. Sets it on his lap and slides it open. The beers are still cold thank God. He cracks one and dumps it into a Solo cup. EXT. JACK’S HOUSE - LYNNEWOOD AVENUE - MORNING A small red-brick Colonial built in the 1940s. Two Frigidaire air conditioning units protrude from the windows. Jack’s Blazer sits in the crumbling driveway. INT. JACK’S BATHROOM - SHOWER - MORNING A mildew-plagued shower curtain hangs from the two remaining plastic rungs. Jack showers behind it, washing his face with a bar of soap as thin as a potato chip. He reaches for the shampoo bottle, but it’s empty.   Shit...   He rubs the soap bar into a lather and uses it to wash his hair. INT. JACK’S HOUSE - DEN - DAY Jack lounges on the sofa in a pair of sweatpants and a hooded sweatshirt, koozie-hugged can of Coors Lite in his hand. ON THE TV: ESPN coverage of a Thanksgiving-day basketball tournament in Maui. The ANNOUNCERS wear floral print shirts. PLAY-BY-PLAY ANNOUNCER (ON TV) -- greetings from sunny Maui, folks. And boy have we got a Thanksgiving day feast for you basketball diehards out there.  12.",
      "characters": [],
      "action_text": "COLOR COMMENTATOR (ON TV) That’s right, Pat. Four games here today featuring six teams ranked in the AP Top 25. Jack reaches for an afghan, drapes it over himself. INT. BURKE’S INN - LATE DAY Jack’s at his usual spot drinking a Coors draft. The Maui basketball tournament plays on the TV. Susan reads a Sue Grafton paperback while Matty, wearing a goofy turkey hat, pulls cards from an old Sports Trivia deck. MATTY Alright, here we go, Ger -- Name the only player to be awarded NBA Finals MVP from a team that lost the championship series? GERRY (ponders it, then) I got two names in mind. SUSAN Well there’s one answer, so... GERRY Oh really? Thank you. For a second there I didn’t know how the game was played. Susan raises her middle finger above the book cover. GERRY (CONT’D) I’m gonna go with Chamberlain. MATTY Errrrr. Jack for the steal? JACK Jerry West. Lakers in ‘71. MATTY Bingo! GERRY That was the other name I had in mind. SUSAN Of course it was.  13. MATTY (to Jack, re: his beer) Another one? Jack glances at his watch, weighs it a moment. Shouldn’t really stay, but then -- JACK Alright. One more. Jack quickly drains what’s left in his pint glass, then hands it to Matty for a refill. INT. LIQUOR STORE - NIGHT Jack grabs a few bottles of cheap wine and puts them in his basket alongside a 12-pack of Coors Lite. He’s almost at the register when he backtracks and grabs a bottle of Seagram’s Gin off the shelf as well. EXT. BETH’S HOUSE - NEW HOPE - ESTABLISHING - NIGHT An immaculate, well-lit Colonial Revival on a secluded three- acre lot. A fall wreath hangs on the front door, pumpkins and ornamental corn adorn the flagstone steps. A Mercedes sedan and a Mercedes SUV sit in the paved, circular driveway. INT. BETH’S HOUSE - KITCHEN - NIGHT The table looks like something out a Williams-Sonoma catalog. A gorgeous, golden turkey flanked by countless trimmings spread out across an autumnal runner. Bottles of Bordeaux stand between sterling silver candlesticks. Seated around ",
      "dialogue_count": 0,
      "word_count": 3772
    },
    {
      "scene_number": 3,
      "slugline": "INT. BISHOP HAYES HIGH SCHOOL GYMNASIUM - DAY ASSISTANT COACH DAN HADEN, 32, a decent, mild-mannered math teacher at the high school, stands at mid-court watching the Hayes team scrimmage in their practice gear. He’s dressed in a fishermen’s sweater, brown corduroys and penny loafers. The Cheerleaders rehearse on the baseline. A door opens at the far end of the gym. Dan turns and watches as Jack enters and make his way towards him. DAN Coach Cunningham. Jack nods. Dan offers his hand. DAN (CONT’D) Dan Haden. Great to meetcha. JACK You the assistant? DAN That’s right. I teach Algebra here at the school. Thanks for steppin’ in like this. Means a lot to the boys... Want me to call ‘em in? Do some introductions? JACK Nah, let ‘em play. I wanna get a feel for what we’re workin’ with. (observes the game a beat, then) This the whole team? Ten kids? DAN We’re missin’ one. Kid named Bobby Freeze. Football player. He’s on an official visit to Penn State this weekend, but he’ll be back in time for Monday’s game. JACK Eleven then? DAN Eleven. Lot different than when you played, huh? JACK No shit. We had over 100 boys just tryin’ out.  29.",
      "characters": [],
      "action_text": "DAN 104 my senior year. JACK You played ball here? DAN Not like you, no. I spent most of my time on the bench. I’m a few years behind you. Graduated ‘03. JACK Okay. DAN Enrollment’s really taken a dive lately. Every year the diocese threatens to shut our doors an’ sell off the land... I’ll walk you through our starting five. Kid on the ball now is Brandon Durrett. On the court, WE FOCUS ON BRANDON DURRETT, 17, black, short, a gifted but exceptionally shy point guard. JACK Any relation to Russ Durrett? DAN His son. JACK Good genes. DAN Brandon’s our most talented player. He’s just not much of a leader. JACK What makes ya say that? DAN I’ve been coaching him for three years now and I can count on one hand the number of times our conversation went beyond, ‘ Yes, Coach ’ or   ‘No Coach’ . Sam Garcia is our senior captain. FOCUS ON: SAM GARCIA, 18, Mexican, the team’s dedicated, disciplined senior captain. Garcia’s the least talented player on the team, but the hardest working.  30. DAN (CONT’D) He starts in the backcourt beside Brandon. Not much of a scoring threat, but a solid defender. Kenny Dawes plays the three. FOCUS ON: KENNY DAWES, 17, a white, rawboned, Eminem-looking, hip-hop-loving roughneck with a buzzcut. DAN (CONT’D) Bit of a headcase at times, but he’s got a nice long-range stroke. Chubbs Hendricks is at the four. FOCUS ON: RONALD ‘CHUBBS’ HENDRICKS, 18, black. Just like his nickname suggests -- round, chubby and proud. DAN (CONT’D) And Marcus Parrish is our center. FOCUS ON: MARCUS PARRISH, 17, black, tall, lanky. He’s got a surfeit of swagger but little talent to back it up. He fires up a three-pointer from the wing that misses badly. DAN (CONT’D) The rest of the kids -- (pointing out the others) Dearborn, Daly, Carter, Moore and Judge -- are JV guys we brought up just so we could hold a practice. Jack watches the game for a few moments. Marcus heaves up another deep three-pointer that clanks off the rim. JACK Blow the whistle for me. Dan does --   WWWWW",
      "dialogue_count": 0,
      "word_count": 4837
    },
    {
      "scene_number": 4,
      "slugline": "INT. JACK’S HOUSE - LATER THAT NIGHT Jack steps in, hangs his flannel coat on the hook and enters the kitchen. He removes a Coors from the refrigerator when he notices the answering machine light blinking. He presses it -- MAN’S VOICE (ON MACHINE) Hey Jack, it’s Bryan. Haven’t heard from you in a while. Wanted to let you know we’re having a birthday party for Patrick -- Jack hits   ‘Delete’.   Next message -- ANGELA’S VOICE (ON MACHINE) Hey. It’s me.  Me.   That voice.  It makes his restless heart beat a little easier. Always has. ANGELA’S VOICE (ON MACHINE) (CONT’D) I know it’s late notice, but I’m gonna be up near you for a client visit tomorrow and wanted to see if we could meet up for lunch. Anyway, call me when you get this. Click. He’s quiet for a moment after the message ends, then reaches down and replays it. Just because he wants to hear her voice again. ANGELA’S VOICE (ON MACHINE) (CONT’D) Hey. It’s me. INT. CHEVY BLAZER/EXT. MANOA DINER - FOLLOWING DAY Parked in the lot of a diner. Jack’s inside listening to sports radio. He watches out his windshield as a Ford Focus rolls into the parking lot. His ex-wife, ANGELA, 34, steps out dressed in business attire. Pretty, freckle-faced, light brown hair pulled back and held with a cheap drugstore clip. She’s a simple, honest woman and nobody’s pushover. Jack doesn’t get out of his car right away. Instead, he waits and watches as Angela sits at a booth and reviews a menu. INT. MANOA DINER - A FEW MINUTES LATER Not wanting to appear too eager to see her, Jack hustles in as if he’s just arrived and approaches Angela’s booth.  52.",
      "characters": [],
      "action_text": "JACK Sorry I’m late -- JACK (CONT’D) Bus broke down on 320. It’s a nightmare out there. ANGELA No it’s fine. She stands and hugs him. They both sit now. Jack slides off his flannel jacket. A long, quiet beat follows. It’s been a while since they’ve seen one another and neither really knows where to begin. Finally -- JACK You look nice. ANGELA Thanks. You, too. JACK You likin’ the new job? ANGELA It’s fine. It’s insurance. You know how it is -- boring but it pays the bills... I hear you’re coaching basketball. JACK Did Beth tell ya that? ANGELA Is it okay that we talk? JACK I don’t really have a choice, do I? ANGELA Not really, no. Angela smiles. Jack, too. WAITRESS arrives. WAITRESS Getcha started with a drink here? JACK Just a coffee, please. Thank you. (Waitress goes. Back to Angela now) Sorry I left ya that message on Thanksgiving.  53. JACK (CONT'D) Beth said you guys talked an’  that kinda set me off cause you an’ I don’t talk much  anymore and...  ANGELA It’s fine, Jack. Really. An awkward beat. ANGELA (CONT’D) Are you enjoying it? JACK Coaching? ANGELA Hmm mmm. JACK I’d enjoy it more if we won a game, but yeah, it’s fine. Keeps me busy. Keeps my mind off’a other things. ANGELA I’m glad. I was getting worried about you. JACK What were you gettin’ worried about? ANGELA That you weren’t moving on with your life. That you were starting to see the world in some -- I don’t know -- some dark way maybe. JACK ...are you? ANGELA Seeing the world in a dark way? JACK Movin’ on with your life. ANGELA ...In some ways. JACK Uh-oh. A beat. Angela knows she’s about to step out on a razor’s edge and wants to be certain she lands the first step correctly. Before she has a chance --  54. JACK (CONT’D) What’s his name? ANGELA ...Nick. JACK Not Nick Mascaro the bartender over at The Yesteryear. ANGELA Another Nick. JACK Where’d you meet this Other Nick? ANGELA A friend introduced us. JACK How long’s it been goin’ on? ANGELA A few months. JACK What’s a few months? Two months? JACK ",
      "dialogue_count": 0,
      "word_count": 1349
    },
    {
      "scene_number": 5,
      "slugline": "INT. BISHOP HAYES GYMNASIUM - THE FOLLOWING NIGHT Game night, just before tip-off. At the bench, Jack kneels in front of the NEW STARTING 5 -- Brandon, Chubbs, Freeze, Garcia and Kenny. JACK We’re in our Diamond press after every dead ball. If they break it, we fall back into 22. Keep your arms active and watch for shooters. Nods all around. VOICE (O.C.) Hey, Jackie. Jack turns to find SAL DeSANTO -- his pick-up game pal -- standing outside the huddle in a black-and-white striped uniform. He’s refereeing tonight’s game. JACK Gonna give us a few friendly whistles tonight, Sal? SAL I aint gettin’ paid enough. I need the game ball when you get a sec. JACK Dan, will you run an’ get it? It’s in the top locker. Jack reaches into his pocket and hands Dan the office keys. INT. COACH’S OFFICE - MOMENTS LATER Dan unlocks the door and crosses to the lockers. Opens one and removes the game ball. As he does, he glimpses a few empty Coors Lite cans inside. He reacts impassively, recalling D’Onofrio’s bar comment from a few nights earlier. Finally, he closes the locker and exits the office. INT. BISHOP HAYES GYMNASIUM - LATER THAT NIGHT ON THE SCOREBOARD:   Bishop Hayes: 58 Away: 57 .   4th Quarter. 25 seconds   remaining in the game.  59.",
      "characters": [],
      "action_text": "ON THE SIDELINE Jack -- intense, sensing he might get his first win -- shouts out to his team from the sideline -- JACK Screen! Help out, Freeze! Help out! Watch the drive -- watch the drive! ON THE COURT An OPPOSING PLAYER drives to the basket and goes up for a lay- up. The shot is SWATTED AWAY by Freeze. Appears to be a clean block until REF #2 BLOWS HIS WHISTLE and signals a blocking foul. Freeze reacts incredulously. ON THE SIDELINE Jack throws his arms up in disbelief -- JACK (to Ref #2) What’s the call, Sully!? REF #2 Blocking foul -- number 32. JACK Oh that’s fuckin’ horseshit! JACK (CONT’D) Fuck me -- that’s a shit fuckin’ call! REF #2 Got him with the body, Jack. Jack rips off his blazer and fires it over the bench. Ref #2 gives him the fisheye, ready to T him up. Sal, doing Jack a favor, hustles over and cuts him off before things escalate. SAL Calm down, Jackie. You know Sully’s got a quick trigger. JACK That’s a bullshit call, Sal. SAL That’s why I didn’t make it. JACK Tell Sully to go fuck himself for me after the game, will ya?  60. SAL I’ll let him know. Jack watches disgustedly as the OPPOSING PLAYER sinks both free throws. He glances up at the scoreboard --   Bishop Hayes 58 Away: 59 .   15 seconds remaining . JACK (to Sal) Gimme a timeout. Sal BLOWS HIS WHISTLE. The Hayes team returns to the bench and sits down. Jack grabs the Dry-Erase board, takes a moment to decide on a play, then kneels before the team. JACK (CONT’D) We’re gonna run Pitt High. DAN No timeouts left. JACK Brandon you got the ball. Okay? Brandon nods his head. JACK (CONT’D) No no, don’t nod your head at me. I wanna hear your voice. Yes or no? BRANDON Yes, Coach. It’s the first time we’ve heard Brandon utter a word. JACK Fifteen seconds left. We go with eight. That’ll give us a chance for a rebound or a tip-in. (drawing out the play on the Dry-Erase) Freeze, you’re gonna set the ball screen out top. Brandon’s gonna drive the ball right. Meanwhile, Chubbs you set a pick for Kenny ov",
      "dialogue_count": 0,
      "word_count": 6009
    },
    {
      "scene_number": 6,
      "slugline": "EXT. JACK’S HOUSE - A FEW NIGHTS LATER Beth’s Mercedes SUV is parked behind Jack’s Chevy. INT. JACK’S HOUSE - DEN - NIGHT Jack, Ryan, Kurt and Anne sit around the den eating hoagies and cheesesteaks. They’ve come down to see one of Jack’s games. Anne rambles on about an old friend from Drexel Hill while Jack -- edgy and anxious -- pretends to listen while stealing glances at the handwritten game notes in his hand. ANNE -- Do you remember Mrs. Wheeler, Jack? From Mason Avenue? JACK Mrs. Wheeler? I don’t... ANNE You went to a formal with her daughter Marianne at Sacred Heart. JACK I don’t remember, ma. ANNE Anyway, she was driving home from her daughter’s the other night when she hit a deer on County Line Road. The animal flew up into the air an’ crashed through the windshield. The hoof pierced her heart an’ killed her instantly. KURT Oh geez, that’s terrible. ANNE (blesses herself) Left five kids and sixteen grandkids behind. Beth and Sarah come down the stairs following a bathroom visit. BETH Do you think maybe it’s time for a new shower curtain, Jack? JACK I don’t know. I don’t think about it very much.  87.",
      "characters": [],
      "action_text": "BETH That thing smells. SARAH Like butts. Sarah takes a seat beside Anne. Ignores her food and instead begins cracking open fortune cookies. BETH Anyone need a drink? EVERYONE I’m good -- I’m fine -- no thanks. Beth wanders into the kitchen. KURT So what’s the scouting report on this team tonight, Jack? JACK Well they’re struggling a little right now -- RYAN Saint Pius is in last place in the league. RYAN (CONT’D) They have one good shooter -- TJ Edmonds -- and a decent big man, but Jack’s team should win. And they kinda hafta win because if they don’t win tonight... IN THE KITCHEN Beth opens the refrigerator and searches for signs of booze. None in here. She opens cabinets and drawers now, pleasantly surprised to find that Jack hasn’t hidden any. RYAN (V.O.) ...their last chance at making the playoffs is against Roman and Roman’s the number one ranked team in the state. They have Greg Childress who just committed to play at Kentucky. IN THE DEN Jack looks over at Ryan, impressed by his knowledge.  88. JACK Maybe I should be the assistant coach tonight. KURT You should see him, Jack. Every morning after you play, he gets up early and checks the stats on the computer. Jack rubs Ryan’s head. Ryan smiles. KITCHEN Beth’s finished her alcohol-uncovering mission and pours herself a glass of water at the sink. Jack enters, fills his giant Big Gulp cup with Pepsi. BETH I’m ordering you a new shower curtain. (looks his outfit over) And a sport coat. I can’t believe you’re actually wearing that thing. JACK It’s good luck. BETH It’s ugly. A beat, then -- and this isn’t easy for Beth -- BETH (CONT’D) I’m proud of you. We’re all proud of you. JACK (beat, it means a lot) Thanks, sis. (then) Whaddaya think dad would say about all this? The question throws Beth. Saddens her a bit. All these years later, Jack’s still searching for his father’s approval. BETH I don’t have any idea what dad would say. I try not to think about him very much.  89. JACK I get that. He wasn’t very good to",
      "dialogue_count": 0,
      "word_count": 4984
    },
    {
      "scene_number": 7,
      "slugline": "INT. JACK’S CHEVY BLAZER - LATER THAT NIGHT MUSIC PLAYS on the radio. Jack’s can’t-see-straight-drunk as he drives through the falling snow. Diane lights a Parliament in the passenger seat. JACK (re: the cigarette) Gimme one a those. Diane fishes another cigarette out of the box, then looks over at Jack. He’s staring down at her chest. DIANE What’re you doin’? JACK Lookin’ at your tits. DIANE Oh now you notice them. JACK Know what I like about ‘em? DIANE What’s that? JACK One nipples points this way, the other nipple points that way. They got character your tits. DIANE Thank you. I like em, too. Jack lights his cigarette, takes a long drag. JACK Is your son gonna be home? DIANE He’s at his father’s house this weekend. JACK He told me to go fuck myself last time I was over. Diane CHUCKLES. JACK (CONT’D) That’s funny to you?  110.",
      "characters": [],
      "action_text": "DIANE A little.   JACK (CONT'D) I’d smack him around if he was my son. DIANE Oh that’s good parenting. JACK Well it works. My father used to beat the shit outta me. And I learned how to treat people. DIANE Eddie’s goin’ through somethin’ -- with his father and me splittin’ up. It’s been hard on him. JACK I don’t care. I wouldn’t put up with that shit if he was my son. Diane looks askance at him. DIANE Why you doin’ that? JACK Doin’ what? DIANE Pullin’ a dark cloud over everything. I got enough dark clouds in my life, I don’t need you addin’ another one. JACK I’m just sayin’ -- DIANE I know what you’re sayin’ and I don’t wanna fuckin’ hear it. Okay? You’re not his parent, he’s not your son, so cut it out... Do you wanna get laid tonight or not? Jack looks over at her, grins. JACK Gimme a kiss. DIANE Oh fuck off.  111. JACK Come on. One kiss. Diane caves, leans over kisses him passionately when --  BRMP!   The CAR SHUDDERS. Jack looks outside. He’s driven onto the sidewalk. Before he has time to steer off --   THMP!   He PLOWS OVER A MAILBOX. He brakes now. The car skids across a snowy front yard before coming to a stop. Diane looks around. DIANE Shit. This is my neighbor’s house. Park down there. Hurry up! JACK What? DIANE Park down there before someone sees you. I’ll meet you inside. Diane grabs her purse and hurries out of the car. Jack steers the car off the lawn and drives down the street. EXT. STREET AROUND THE CORNER - NIGHT Jack parks the Chevy, steps out and makes his way through the snow back towards Diane’s house. INT. HOUSE - FOYER - NIGHT The house is completely dark. The front door opens. Jack steps inside, looks around. JACK You forget the pay the electric bill in here? Jesus Christ. He continues into the KITCHEN. Opens the refrigerator and removes a bottle of beer. Opens it and takes a swig. STAIRWELL Jack trudges up the stairs -- JACK I think we got away with it. But someone’s gon’ be burnt up when they find that in the mornin’.  112. -- moves into th",
      "dialogue_count": 0,
      "word_count": 2788
    }
  ]
}