{
  "slug": "the-internship-2013",
  "title": "the internship",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 1,
  "characters": [
    "DANA"
  ],
  "total_words": 19030,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JOE’S TOWNHOUSE - OFFICE NOOK - LATER  Joe sits at a desktop PC with a chunky monitor and big block  processor. It’s probably only five years old but it looks  completely ancient.  His browser’s open to GOOGLE. Joe types:   “sales jobs ohio”  into the box and clicks SEARCH.  A SERIES OF SHOTS as Joe scans AVAILABLE POSITIONS (stuff  like   Chief Data Sales Architect, VP Online Merchandising,  eCommerce Coordinator)   and the SKILLS NEEDED for them --  EXCEL.  JOE  No.  POWERPOINT.  JOE (CONT’D)  No.  HTML.  JOE (CONT’D)  Hitmull?  A barrage of   QUICKENs   and   QUICKBOOKs   and   QUARK XPRESSes  before, finally, we end up back at the --  GOOGLE SEARCH PAGE .  Joe stares at the monitor, lost, the cursor blinking and  blinking. Nothing but a big white field and that lone  multicolored word. He’s googled all he can google. Except --  Joe types the word   “ google ”   into the box and clicks SEARCH.  ON JOE  As he eyes the results, a hint of a smile crosses his face.  INT. TARGET - HOME ELECTRONICS DEPARTMENT - THE NEXT DAY  Fluorescent lights. A Kelly Clarkson video on two dozen  flatscreens. A weird-looking DUDE is passed out in the plush  home theater seat. A TODDLER cries. His FATHER soothes the  kid by screaming at him in a harsh-sounding foreign tongue.  Amidst the horror, staring blankly ahead, we find OLLIE,  wearing the red short-sleeve polo, his once-flowing mane now  SLICKED DOWN in a neat side-part. He’s currently scanning  merchandise with one of those radar guns.  18.",
      "characters": [],
      "action_text": "RICK (O.S.)  Ollie Ollie Oxen Free.  Ollie’s brother-in-law/manager RICK (30s, goatee, overly-  complex tattoo) approaches, hand extended for a pound. Ollie  waves weakly --  OLLIE  Hey, Rick.  RICK  You look good. Sharp. Your hair is  much more professional this way.  And, if I may say, you rock out  that shirt nicely. Target red suits  you. Plus, bonus, the chicks dig  it.  OLLIE  Rick, you’re married to my sister.  Can we not--?  RICK  Hey, I can’t prevent attraction. If  you build it, they will come. And  by “come” I mean climax like a  banshee, you feel me?  OLLIE  Do you think I could take my lunch  now--?  RICK  Absolutely. You get fifteen minutes  at our in-house Little Caesar’s.  Right after you finish scanning. I  need that inventory loaded into the  EDI stat.  Ollie bristles at the mention of their computer replacement.  RICK (CONT’D)  (spies something)  Thank the lord for jeggings.  Rick’s spotted an ATTRACTIVE SHOPPER in a pair of those skin-  tight jean legging things.  FEMALE VOICE (O.S.)  Excuse me.  They spin to find a middle-aged female CUSTOMER. She looks  like she could’ve been a lunchlady at your elementary school.  19. CUSTOMER  Can you boys help me with a  television set?  RICK  Absolutely, ma’am. Ollie here will  take great care of you.  Rick gives Ollie a coach’s ass whack and saunters off to  flirt with Jeggings Girl.  CUSTOMER  My question is about LCD versus  plasma, specifically which performs  better at 1080p?  Ollie has no fucking clue. But doesn’t hesitate --  OLLIE  Right. Well there are many schools  of thought on that. Both possess  expert craftsmanship. These models  right here are assembled by only  the most detail-oriented children  in the factory. I don’t like labels  but some would call them “gifted”.  I almost feel like I’d be  diminishing their contribution by  choosing one side over the other.  JOE (O.S.)  Oh, no. No no no.  Joe marches up, dismayed at the sight of Ollie’s hair --  JOE (CONT’D)  What have they done to The K",
      "dialogue_count": 0,
      "word_count": 9466
    },
    {
      "scene_number": 2,
      "slugline": "I/E. DRIVERLESS PRIUS - CONTINUOUS  WOMAN’S VOICE (OVER STEREO)  Welcome to Google Driverless Car  Prototype. Destination, please?  JOE  465 and a half Euclid. Cleveland,  Ohio. The Forest City.  WOMAN’S VOICE (OVER STEREO)  En route. Please buckle--  The car moves slowly forward when -- THUNK! -- Ollie steps in  the way. The car stops.  WOMAN’S VOICE (OVER STEREO) (CONT’D)  Obstacle struck. Recalibrating.  Ollie throws open the passenger door and throws himself in.  OLLIE  Where do you think you’re going?  WOMAN’S VOICE (OVER STEREO)  465 and a half Euclid. Cleveland,  Ohio.  The car continues down the road.  OLLIE  Are you kidding me? After one  setback?  (to car)  Building 43!  The Prius lurches to a stop. Starts to turn around --  JOE  (to car)  Cleveland, Ohio!  (the car continues)  You were right, Ollie. We’ve got  nothing on these kids.  OLLIE  Because they’re younger--?  JOE  Because they’re better. Even at 20  we weren’t half as good as these  fuckers. Graham Hawtrey created an  algorithm that helps teach math to  inner city kids. I Googled it.  65.",
      "characters": [],
      "action_text": "OLLIE  You know what? You’re right. 20-  year-old us wouldn’t’ve stood a  chance here. But 40-year-old us  does. Because we’ve got experience.  The confidence that comes with  knowing you can look somebody in  the eye and make some magic. Can  anyone named Graham do that?  JOE  I’m just being realistic.  OLLIE  Fuck that. I had a backup plan! And  I gave it up!   For you . To come  here. And now you’re gonna walk out  on me because it’s harder than you  thought?   Building 43 !  The car SQUEALS to a stop.  JOE  465 and a half--!  Cleveland, Ohio!  OLLIE  Which was foreclosed upon, by  the way. Building 43!  Building 43!  The Prius swings violently back and forth as the two men  shout directions. Eventually the computer becomes overwhelmed  and a word appears on the screen:  BUFFERING...  Oh shit. Out of control, the Prius HOPS A CURB, heading  straight for the ENORMOUS CUPCAKE STATUE.  EXT. DESSERT STATUE GARDEN - CONTINUOUS  The car is totalled, the hood steaming, airbags deployed.  Ollie tumbles out, woozy.  JOE (O.S.)  (pained)  That’s gonna be another wicket.  Joe is splayed on the ground beside a giant sprinkle.  OLLIE  I’ll take the rap on this one.  66. JOE  Nah, I’ll take it. The Kid’s still  got a shot.  OLLIE  Not without you.  (flumps to the ground)  Joe, you got us to the dance. You  can’t leave now.  Joe struggles to turn his head --  JOE  You think you’re gonna turn me with  a sports metaphor?  OLLIE  Yes. Because they’re simple and  they’re American and they work.  Like us.  (flumps to the ground)  Now, what does a team do when  they’re struggling? Slow the bitch  down. Institute   their   offense. Play  their game.  Beat, then --  JOE  (a hint of a smile)  Scaramouche.  OLLIE  (he’s got him)  Scarafuckingmouche.  MUSIC: The fun part of   Bohemian Rhapsody   kicks in over --  INSTITUTING THEIR OFFENSE MONTAGE  *   Team Lyle Bullpen . The team fleshes out their project idea  for Joe, demonstrating on a computer --  NEHA  A password can be easily cracke",
      "dialogue_count": 0,
      "word_count": 1850
    },
    {
      "scene_number": 3,
      "slugline": "EXT. LITTLE SAIGON STREET - SAME  A Google SHUTTLE pulls up to the curb. The door accordions  open. Smoke and music pour out. Now it really is a party bus.  In super-slo-mo, off step Joe (who slips a twenty to Shonda  the driver), Ollie and the interns, dressed to the nines.  They head into a magnificent HISTORIC THEATRE.  INT. HISTORIC THEATRE - CONTINUOUS  Joe smiles. Shock and awe on the kids’ faces. The theatre has  been transformed into a massive STRIP CLUB to end all strip  clubs.  JOE  Welcome to the Silicone Valley.  A statuesque TOPLESS DANCER approaches --  TOPLESS DANCER  Show you to your table?  STUART, buried in his phone as usual, doesn’t notice.  OLLIE  Big world out there, my friend.  Just three inches up.  Ollie SLOWLY RAISES STUART’S CHIN. The woman’s perfect  breasts are exactly at eye level. We see Stu’s entire face  for the first time as it takes in the glory before him.  STUART  I have to Tweet this...  Joe swipes Stu’s phone away.  JOE  It’s living time, Stu. That goes  for all of you, gentlemen. Neha, I  apologize if any of this offends  you but we felt the whole team  should take part.  NEHA  I’m into Hentai. This is nothing.  OLLIE  What’s Hentai?  NEHA  It’s anime. Kinda like Voltron,  only the women are penetrated by  octopus tentacles.  75.",
      "characters": [
        "DANA"
      ],
      "action_text": "A beat, then --  JOE  Okay.   OLLIE  Maybe next three-minute  break.  AT A VIP TITANIUM BANQUETTE - MOMENTS LATER  Our team sit, some DANCERS already draped over them. A  WAITRESS delivers a tray of tequila shots.  JOE  (re: payment)  Papa Bear’s got this one.  Joe fishes his PHONE from his pocket, open to   GoogleWallet   (a  real product which lets you pay for things by scanning your  mobile device).  JOE (CONT’D)  Type yourself an extra good tip,  okay, Honey?  Ollie hands everyone shots. Yo-Yo refuses --  YO-YO  My mom says alcohol numbs the soul.  JOE  When it’s working right,  absolutely.  OLLIE  Yo-Yo, let me tell you a story  about a friend of mine. Guy took  guitar lessons when he was younger  and the teacher said, “If you wind  the string too tight it’ll break,  but if the string’s too loose  there won’t be any music.”  Discipline’s admirable but if you  stay this wound-up you’re gonna  snap and be the guy sniping people  at gas stations.  A Dancer strokes Yo-Yo’s hair --  DANCER  (re: Ollie’s lesson)  That’s really beautiful.  76. YO-YO  (swayed)  As far as string-tension goes,  you’re technically accurate.  (then, knowing)  This “friend”...he’s you, right?  OLLIE  Actually, it’s the Buddha. But we  share a lot in common.  JOE  (raises his glass)  Let’s get Noogly!  The crew TOASTS and THE PARTY BEGINS!  * Lapdances all around. Champagne flows. Joe and Ollie show  the kids how to make it rain.  * Yo-Yo’s one shot becomes two becomes four becomes body  shots becomes a girl simultaneously pouring a bottle of vodka  and a can of Redbull down his throat.  YO-YO  (wasted)  Is that aluminum?  * An incredibly attractive Dancer sits on Neha’s lap,  fascinated --  DANCER  And then what happens?  NEHA  The half-cat-half-woman removes her  garters in front of the giant  jellyfish...  * Mid-lapdance, a Stripper takes off Stuart’s glasses, hangs  the bridge from her nipple, and swings them back and forth.  Then returns them to his face.  STUART  (awed)  I have nipple ",
      "dialogue_count": 1,
      "word_count": 2736
    },
    {
      "scene_number": 4,
      "slugline": "INT. HAMA-HAMA SUSHI - NIGHT  Our whole team is out for dinner with Anders the graphic  designer.  JOE  I’m gonna let Red Lion here handle  the face to face pitch.  Stuart takes a deep breath. Lowers his phone. Looks Anders in  the eye and begins --  STUART  What if Google was your friend?  INT. TEAM LYLE BULLPEN - DAY  Joe works on some sales figures. Clicks over to Google+ and  sees MEGAN’s online. Clicks on her profile. An IM pops up  from her:   Joe?   He quickly closes out and slams his laptop  shut.  INT. GOOGLEPLEX - YOGA STUDIO - DAY  Joe and Ollie pitch their data to the SALES GUY, who’s got  his legs wrapped around his neck. He’s impressed.  INT. SALSA CLUB - NIGHT  Lyle and Marielena do the Cha-cha. He’s actually not half  bad.  INT. TEAM LYLE BULLPEN - DAY  Neha runs some code by one of the   Magic: The Gathering   guys  that Joe and Ollie had laughing at the cafeteria.  MAGIC GUY  Impressive.  (then)  Are you free this Friday?  NEHA  I’m looking for your respect as a  coder, not a date.  (he feels bad)  And, yes, I’m free.  (then)  Do you have an STI?  89.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 199
    },
    {
      "scene_number": 5,
      "slugline": "INT. HAMA-HAMA SUSHI - NIGHT  Anders nods along to Stu’s pitch, drawing on his paper  placemat. He’s made a logo for “Google Goggles” with the two  O’s bridged together to look like glasses. Everyone loves it.  YO-YO  Sake bombs!  Yo-Yo slams the table, causing a shot of sake to drop from a  pair of chopsticks into his pint of beer. He tosses it back.  INT. CHETTY’S OFFICE - DAY  Graham, a huge shiner on his left eye from the alley  incident, sits opposite Chetty.  CHETTY  (reads email on-screen)  Stealing food. Supplying alcohol to  minors.  GRAHAM  Misuse of the company shuttle--  CHETTY  I spoke to the driver and she  assured me they were at the science  museum.  GRAHAM  I have photos of them at an exotic  dance club.  CHETTY  Which you obtained how exactly, Mr.  Hawtrey? An illegal hack would  surely come to light in any  investigation.  GRAHAM  The final project presentation’s  this Thursday. Do you honestly want  these wankers wearing the Red Green  Yellow and Blue?  CHETTY  You honestly believe those buffoons  pose a risk?  (reads laptop screen)  I see you’re slated to play them in  the intramural league soon. Why not  settle this like men, on the field  of sport?  90.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 203
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BALLFIELD - DAY  MUSIC: Dramatic NFL Films-style war march.  Steam rises off the field. Our warriors march in...with  broomsticks between their legs.  Graham’s team wears perfect matching Harry Potter striped  outfits, goggles and capes. Our team dons a hodgepodge of  mismatched workout junk.  OLLIE  Cliffs Notes the rules for us  again?  LYLE  Right. The Beaters toss the  Bludgers at the Chasers before they  can get the Quaffle through the--  JOE  Use your Muggle words.  LYLE  You have to peg them with the  kickballs before they throw the  volleyballs through the hoop and  they’re meanwhile trying to stop  your volleyballs with their  kickballs. And then the tennis  ball--  OLLIE  (beat, then)  Maybe try the fancy words again.  Computer Guy (serving as ref) shouts --  COMPUTER GUY  Brooms up!  BOTH SIDES OF PLAYERS rush to the various balls. Each  competitor   holds a broom between their legs at all times ,  forcing them both to look ridiculous and to grab the balls  with one hand.  Joe and Ollie may be better athletes but they have a tenuous  grasp on the rules...  JOE  (re: kickball)  Should I take the Beater?  91.",
      "characters": [],
      "action_text": "STUART  You’re   the Beater. That’s the  Bludger.  Graham easily scores a hoop. Then another. Dodges our guys’  throws. Joe grabs a volleyball and attempts to score but gets  beaned by a few Bludgers. Our boys are getting their asses  handed to them. Graham dunks a ball, Joe falling to the turf.  GRAHAM  May as well throw in the Snitch.  You boys are dead.  JOE  Time out! Are there time outs?  Broom break!  Moments Later : A HUDDLE with our team.  YO-YO  Graham’s right. It’s over.  OLLIE  (winded)  Hold on a second. Maybe the problem  is we’re too focused on scoring  more points than them.  LYLE  That’s how you win. I thought you  guys knew sports.  JOE  (catching his breath)  We do, Lyle. Like the old Detroit  Pistons -- this is back when you  were all still in short pants  chasing the Good Humor truck --  they couldn’t outskill Michael  Jordan’s Bulls, right? So they out  physical’d ‘em. A Bull drove, they  ended up on the hardwood. Laimbeer  gave them a reason to think twice  before coming into the paint next  time down the court. You follow me?  ALL  Nope. / Not at all. / That’s the  Hanes guy, right? / The black man  with the Hitler moustache?  JOE  Just follow our lead.  92. Moments Later : Gameplay resumes. Graham drives for a hoop.  Joe grabs Graham’s broom and yanks it into his balls, sending  him flying into the hoop pole. Computer Guy lifts a --  COMPUTER GUY  Yellow wand!  That’s a foul. Graham’s going to feel that in the morning.  Joe nods to his teammates, touching a finger to his nose as  he heads to the PENALTY BOX.  Quick Shots : Joe, Ollie, and four formerly passive geeks are  the Bad Boys of intramural Quidditch. Leg sweeps. Cape pulls.  Broom trips. Yo-Yo gives the “not-in-my-house” finger wag.  The intimidation is working -- Chubby Kid has no interest in  driving the lane. Tosses the ball over to the other side. Our  team scores.  GRAHAM  (to Chubby Kid)  Great tenacity, Augustus Gloop.  Computer Guy blows a whistle --  COMPUTER GUY  Score’s tie",
      "dialogue_count": 0,
      "word_count": 682
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BEACH SHACK RESTAURANT - SANTA CRUZ - DUSK  A laid-back place with the most amazing view of Monterey Bay.  Ollie and Dana share a table on the patio. He’s a bit more  put-together. She’s finally out of her professional attire  and looks great.  OLLIE  I have to say, I’m a little  disappointed.  DANA  You are?  He’s got his phone open to HER CALENDAR...  OLLIE  Well, I checked your calendar and  you only allotted two hours for  this before your DVBT meeting. I  was hoping we might go longer.  DANA  You’ll be lucky if you make it to  two.  OLLIE  Fair enough.  (then)  You look amazing. That dry cleaning  really paid off.  DANA  (smiles, shakes her head)  I have to tell you something.  OLLIE  Alright, but go quick. Time’s a  wastin’.  DANA  I didn’t vote for you and Joe. To  get into the internship program.  OLLIE  (swallows)  How come?  DANA  I thought there were people who  deserved it more. Kids with better  track records.  94.",
      "characters": [],
      "action_text": "OLLIE  And now...?  DANA  There are still people with better  records than you.  (then)  But I don’t think they’d’ve made  nearly as good a Googler.  He smiles.  INT. JOE AND OLLIE’S APARTMENT - SAME  Joe sits on the couch,   testing the project   on his laptop. At  ease now. No more error beeps. A different SOUND TRILLS.  JOE  The hell is that?  Joe clicks over to see he’s got a Google+ Meetup request. A  beat, then...he clicks to accept. A window pops open with  MEGAN in it.  MEGAN  Since when is Joe McMahon social  networking?  JOE  I mostly got into it because I was  having trouble juggling all the  girls that came pouring my way  after you left. This really helped  organize the barrage.  MEGAN  (hint of a smile)  Where   are   you?  JOE  California. I moved with the world  for once.  She’s intrigued.  EXT. DANA’S HOUSE - LATER  Ollie drops Dana at her front door. A taxi waits at the curb.  DANA  That was terrible.  OLLIE  Really? Because I thought--  95. DANA  You were supposed to pack a decade  of assholes into one night but you  were totally fine.  OLLIE  I’m terribly sorry.  She smiles. Big moment. Does he try to come in? The old Ollie  would have, but --  OLLIE (CONT’D)  I should probably go. You’ve got  that thing scheduled.  DANA  (nods)  The DVBT meeting.  OLLIE  Right. Well, enjoy.  He turns, padding down the walk to the cab.  DANA  I hope I will.  OLLIE  (beat, then)  By the way, should I know what that  is? DVBT?  DANA  You’re an expert now. Guess.  OLLIE  Data...Video...Byte...Tracking?  DANA  Close.  He arrives at the taxi.  DANA (CONT’D)  Doing Very Bad Things.  Dana smiles. Ollie’s eyebrow raises --   she optimistically  scheduled him coming inside all along . He pays the CABBIE --  OLLIE  I’m good here, thanks.  He jumps back up the steps and kisses her.  96.",
      "dialogue_count": 0,
      "word_count": 478
    },
    {
      "scene_number": 8,
      "slugline": "INT. JOE AND OLLIE’S APARTMENT - THE NEXT MORNING  On top of the world, Ollie pads in with a gift box to find  Joe already up and about.  JOE  There he is. Not that I have to ask  because of that shit-eating grin,  but how did it go?  Ollie pulls the RED PADDLE out of his pocket and holds it up.  JOE (CONT’D)  There’s The Kid!  (re: present)  And she gives parting gifts.  OLLIE  It’s for you.  Ollie hands Joe the gift. As Joe opens it --  OLLIE (CONT’D)  I didn’t say anything but my rainy-  day fund has a rainy-day fund.  And I thought, today’s the final  project presentation, we’re gonna  need something to celebrate with  after.  Joe lifts a bottle of OLD FITZGERALD from the box, touched.  JOE  That’s just for me and you, though,  right? It’s way too expensive for  Yo-Yo to be yakking up on his  iPhone.  I/E. GOOGLE SHUTTLE (MOVING) - LATER  Joe and Ollie sit amidst the usual sea of Googlers on  MacBooks.  OLLIE  We good on the project? You check  everything over last night?  JOE  Dotted the zeroes and crossed the  ones. Thing’s like a Swiss clock.  (smiles, sings)  Three cheers for the bus driver,  the bus driver, the bus driver.  97.",
      "characters": [],
      "action_text": "The whole shuttle of Googlers reply in the old schoolbus  chant --  GOOGLERS  Three cheers for the bus driver who  drove us today.  INT. MEETING HALL - LATER  All the interns are gathered, Buffering before them.  BUFFERING  Good news, everybody. One of your  projects will be presented tomorrow  at your parting TGIF.  A hum through the crowd at that news. Lyle whispers to Joe  and Ollie --  LYLE  Thank Google It’s Friday.   NEHA  The whole company’s there.  BUFFERING (CONT’D)  Okay, up first, Gurinder’s Team.  Graham and company take the stage.  GRAHAM  Several years ago, my father threw  a dinner party at which a guest --  not to name drop but it was Totty  Kembell.  OLLIE  (hushed)  The   Totty Kembell?  GRAHAM  Totty was particularly enamored  with the wine. But father couldn’t  remember its provenance and that’s  when it occurred to me: what if one  could take a photo of the bottle on  their mobile and instantly know all  the pertinent information: the  tannins, the bouquet. It could even  link their guests to a distributor  at which they could order a few  cases.  98. OLLIE  (hushed)  Because everybody’s always ordering  a few cases of wine.  JOE  (hushed)  You need to be pretty drunk to live  with this kid.  Graham takes a photo of a wine bottle’s label with his phone.  On the big screen behind, we see how it links to a Napa  vineyard’s Chardonnay on sale at BevMo.com.  GRAHAM  ...so we are able to use the  breadth of ImageSearch in order to  enhance user knowledge and  facilitate purchases for our  partners. Thank you.  BUFFERING  Very nice, Graham. Up next, Team  Lyle.  Our guys take the stage. Joe and Ollie man the presentation  on a laptop. Joe nods confidently to Stuart, who steps in  front of the whole crowd. Real people, no iPhone. He clears  his throat and nails it --  STUART  What if Google was your friend? And  we all know friends don’t let  friends drive drunk.  The screen comes to life. A video of a wobbly Yo-Yo tumbling  into a car’s driver seat. H",
      "dialogue_count": 0,
      "word_count": 3416
    }
  ]
}