{
  "slug": "the-rookie-101-pilot-2018",
  "title": "the rookie 101 pilot",
  "genre": "action",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 5963,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. AUTO REPAIR SHOP - NIGHT After hours. Lucy is working on the engine of her ‘66 Stingray. Jackson sits in the driver seat, working on a beer. JACKSON This is not what I had in mind. We   *  need to blow off some serious steam.   *  LUCY I hear Hector gets pretty wild. REVEAL: HECTOR, 40, ample belly hanging out of an oil stained   *  shirt as he works on a car.   *  JACKSON   *  Pass.   *  LUCY   *  You ever think of doing something   *  else?   *  JACKSON   *  No way. My family’s been cops since   *  the 1940s.   *  LUCY   *  Funny. My people have been on the   *  other side for almost as long.   *  JACKSON   *  I spent my whole life preparing to   *  be a cop. Ride alongs instead of   *  sports. Shooting range instead of   *  music. Last year of middle school,   *  my dad comes into my room all   *  serious, tells me he thinks I’m   *  ready. I brace myself, praying to   *  God that I don’t hear my father use   *  the word “vagina,” instead he hands   *  me a copy of the California Penal   *  Code. Tells me I’ve got two weeks,   *  and then the quizzes start. And   *  every time I fail, an X-Box game is   *  going in the trash. Well, screw him,   *  cause I didn’t fail once.   *  (then)   *  You got that thing fixed yet?   *  LUCY (finishes working)   *  Try it.  THE ROOKIE -   Ep. 101   -   \"PILOT\"   -   Revised Network Draft   -   1/21/18   35  (CONTINUED)",
      "characters": [],
      "action_text": "He cranks the key. The engine ROARS to life. JACKSON Time to celebrate. Dance club or dive bar? LUCY I think I’m going to head home. Read over the manual again. I don’t have a   Daddy on the Job . INT. NOLAN’S PICKUP (MOVING) - NIGHT   *  Nolan drives the streets, lost in thought, lights playing   *  across his face.   *  INT. BRENTWOOD RESTAURANT - NIGHT Busy. Nolan enters, tells the slinky HOSTESS. NOLAN I’m just going to the bar. He heads over, only to find Captain Zoe there, dressed to kill. A double take. NOLAN (CONT’D) Captain? CAPTAIN ZOE Officer Nolan. Are you stalking me? NOLAN No. I swear. I live around the corner. In my friend’s guest house. CAPTAIN ZOE How very L.A. NOLAN Tell me about it. I’m in a constant state of sticker shock. You here alone? CAPTAIN ZOE Waiting on someone. NOLAN Can I buy you a drink while you wait? CAPTAIN ZOE No.  THE ROOKIE -   Ep. 101   -   \"PILOT\"   -   Revised Network Draft   -   1/21/18   36  CONTINUED:  (CONTINUED) But there’s chemistry between them. Both feel it. NOLAN How about I buy myself one, and wait with you? CAPTAIN ZOE Not a good idea.   *  NOLAN   *  You being my boss, and all.   *  CAPTAIN ZOE   *  Exactly. Sends a bad signal.   *  A sweaty man in a shiny suit, LLOYD, interrupts. LLOYD Excuse me. Are you Zoe? It’s clear from Zoe’s face that this is someone she swiped right on. And that she’s now regretting that decision. NOLAN Sorry, friend, her name’s --   *  CAPTAIN ZOE   *  Hannah. And we were in the middle of a conversation. Hope you find her.   *  Lloyd frowns, uncertain, but moves away. CAPTAIN ZOE (CONT’D) That was mean. Right?   *  NOLAN You want me to invite him back over? CAPTAIN ZOE Don’t you dare. He laughs. OFF: Zoe, laughing, we CUT TO: INT. NOLAN’S HOUSE. BEDROOM - NIGHT Sex. At first we think — holy shit — Nolan hooked up with his Captain. But then we see that it’s Lucy. Holy shit. OFF: the reveal... END OF ACT THREE  THE ROOKIE -   Ep. 101   -   \"PILOT\"   -   Revised Network Draft   -   1/21/18   ",
      "dialogue_count": 0,
      "word_count": 4034
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOSPITAL. EMERGENCY ROOM 1 - NIGHT Tim is lifted onto the table, medical personnel cutting his clothes off. As they prep him for surgery, we CUT TO: INT. HOSPITAL. WAITING AREA - DAY   *  Nolan and Talia enter. Sgt. Grey intercepts them.   *  SGT. GREY What the hell happened? TALIA Selby got away. But we’ll find him. NOLAN How’s Officer Bradford? SGT. GREY In surgery. This is your fault,   *  Nolan. I heard they got the Selby   *  tip from you. TALIA Sir, Officer Nolan and I -- NOLAN No, he’s right. I pushed this. If I hadn’t, they wouldn’t have driven into an ambush. SGT. GREY You’re done. Get out of my sight. TALIA  Sergeant --   NOLAN  (stopping her)  No. It’s okay.  He turns and walks out of the waiting room. TALIA The guy ran into the line of fire to save Officer Benitez. SGT. GREY Doesn’t change anything -- TALIA The hell it doesn’t. You show the guy on his first day that he’s not wanted, he’s going to swing for the fences to prove he belongs.  THE ROOKIE -   Ep. 101   -   \"PILOT\"   -   Revised Network Draft   -   1/21/18   52  (CONTINUED)",
      "characters": [],
      "action_text": "SGT. GREY You saying this is my fault? TALIA I’m saying there’s plenty of blame to go around.   *  EXT. ALLEY - DAY   *  Now a crime scene. Nolan stands among the crime scene   *  personnel, punishing himself by staring at the sea of shell   *  casings -- the blood pool blackening in the sun. All because   *  of him. He suddenly can’t breathe. Turns away. Fighting to   *  get on top of the guilt before it destroys him.   *  INT. HOSPITAL. WAITING AREA - DAY   *  Lucy sits in a chair, lost. Song approaches. Sits.   *  SONG   *  How are you holding up?   *  LUCY   *  Have you heard anything?   *  Song pulls a wet wipe from her belt, gently wipes Tim’s blood   *  off Lucy’s cheek.   *  SONG   *  No, but he’s a tough S.O.B. He’ll   *  pull through.   *  She spots Jackson in the hallway, mimicking gunfire with a   *  couple UNIFORMS.   *  SONG (CONT’D)   *  Excuse me.   *  She moves towards Jackson --   *  JACKSON   *  We both engaged. But I’m pretty sure   *  I hit him --   *  Song grabs the legacy. Pulls him away --   *  JACKSON (CONT’D)   *  Hey --   *  SONG   *  Don’t do that. Even if you weren’t   *  full of crap, a cop got shot. More   *  could have died because you froze.   *  THE ROOKIE -   Ep. 101   -   \"PILOT\"   -   Revised Network Draft   -   1/21/18   53  CONTINUED:  (MORE)  (CONTINUED) I should’ve read you the riot act   *  yesterday at the Tar Pits. You’re   *  not ready to be a cop. And you won’t   *  be until you can admit you’re   *  scared.   *  She walks away, leaving Jackson stunned.   *  EXT. ALLEY - DAY   *  TECHNICIANS are bagging evidence from Selby’s car. Nolan sees   *  something in one of the bags. It cuts through the grief.   *  NOLAN   *  Wait a second. Can I see that?   *  He takes the bag. Inside is an inhaler. Nolan turns the bag   *  to examine the label. OFF: him, mind racing...   *  INT. HOSPITAL. WAITING AREA - DAY   *  Nolan charges in. Spots Captain Zoe standing with Sgt. Grey.   *  NOLAN Selby’s got a baby mama. CAPTAIN ZOE What? SG",
      "dialogue_count": 0,
      "word_count": 897
    },
    {
      "scene_number": 3,
      "slugline": "EXT. A’JA’S HOUSE - DAY Here come our cops led by Sgt. Grey -- Nolan, Talia, Song and Lucy moving silently up the street, weapons drawn. Grey motions -- Song and Lucy peel off around the side of the house -- heading for the back.   *  We STAY WITH Grey, Nolan and Talia as they reach the front steps. Grey peeks inside. Gets a glimpse of Selby in the living room as A’Ja rises and goes into the kitchen. SGT. GREY (into his radio) Suspect is in the living room. Get ready to breach -- INTERCUT WITH: INT. A’JA’S HOUSE. BACK YARD - NIGHT Song and Lucy reach the back door, only to find it has a metal security gate. SONG Back door’s a no go. You wanna wait for SWAT? SGT. GREY No. We’re going -- He KICKS the door as -- SGT. GREY (CONT’D) LAPD! INT. A’JA’S HOUSE - CONTINUOUS Talia and Nolan charge inside to see Selby escaping into the kitchen. Nolan is right behind him to see -- INT. A’JA’S HOUSE. KITCHEN - CONTINUOUS Selby grabs A’Ja, puts a butcher KNIFE to her throat, using her as cover -- cabinets at his back. SELBY I’ll kill her! Back up! NOLAN Drop the knife! Drop it!  THE ROOKIE -   Ep. 101   -   \"PILOT\"   -   Revised Network Draft   -   1/21/18   56  (CONTINUED)",
      "characters": [],
      "action_text": "Nolan doesn’t have a shot (and he’s in the doorway, blocking Talia from entering). Grey appears in the side doorway (to the dining room). But he doesn’t have a shot, either. SELBY (sees Grey) Back up! NOLAN (heart in his throat) Selby, don’t do it. Nobody has to die here. SELBY Are you kidding? I shot a cop -- Nolan spies Song and Lucy through the kitchen window -- in the backyard. Trying to find an angle on Selby but he’s hidden by the cabinets. NOLAN I get it. You got nothing to lose. I   *  know the feeling. Granted, on a   *  smaller scale. But if you’re going   *  to kill anyone, kill me. He lowers his gun.   What the fuck is he doing?  SGT. GREY Nolan -- Nolan ignores him, reaching out to place his weapon on the kitchen island, tantalizingly close to Selby. NOLAN You brought a knife to a gun fight,   *  Selby. I’m offering you the chance to   *  remedy that. All you have to do is   *  let her go and take me.   *  Selby eyes the weapon. A siren song. Inches towards it. INTERCUT WITH: EXT. A’JA’S HOUSE. BACK YARD - NIGHT Song and Lucy see Selby’s shoulder appear as he inches out to get the gun. SONG One more step...  THE ROOKIE -   Ep. 101   -   \"PILOT\"   -   Revised Network Draft   -   1/21/18   57  CONTINUED:  (CONTINUED) INSIDE: Time stands still, then Selby lunges for the gun -- BLAM -- Song FIRES -- Selby staggers -- hit in the back -- the knife coming away. Nolan pulls A’Ja to the floor as Grey and Talia FIRE -- killing Selby.   *  OFF: Nolan, holding A’Ja tight, we start an EMOTIONAL SONG... INT. HOSPITAL. INTENSIVE CARE - NIGHT   *  Tim lies there, full of tubes. But he’s alive. REVEAL: Nolan   *  sitting at his bedside.   *  INT. TALIA’S HOUSE. JACOB’S BEDROOM - NIGHT   *  Talia strokes her son’s hair while he sleeps.   *  EXT. HOMELESS ENCAMPMENT - NIGHT   *  Lucy, in civilian clothes, makes her way through, looking for   *  Tim’s wife, Aimee. She spots her by a trash fire. Moves to   *  talk to her. But Aimee runs.   *  EXT. STATION. PARKING LOT - NIG",
      "dialogue_count": 0,
      "word_count": 1032
    }
  ]
}