{
  "slug": "the-good-cop-101-who-framed-the-good-cop-2018",
  "title": "the good cop 101 who framed the good cop",
  "genre": "action",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 11015,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. 15TH PRECINCT- STREET- NYC- CREDIT SEQUENCE MAIN CREDITS ROLL.. MUSIC: Steely Dan's blues\\funk classic \"Daddy Don't Live In That New York City No More\".. We're in midtown.   The 15TH PRECINCT BUILDING. DETECTIVE TONY CARUSO, JR. pulls up out front.   He gets out and starts up the steps.   Then he pauses. He's noticed some LITTER on the sidewalk.   A plastic cup or fast-food wrapper.   Tony picks it up, and dutifully drops it into a TRASH CAN. Then he continues up the steps.   Through the doors.   To start work. NOTE: This credit sequence will ALTER SLIGHTLY each episode. As Tony arrives for work, he'll stop and perform a DIFFERENT SMALL ACT OF KINDNESS.   One time he'll hold somebody's umbrella, one time he'll help carry a baby stroller, etc. He's a good cop. EXT.   POLICE TRAINING FACILITY- BRONX, NY- DAY BLAM BLAM BLAM BLAM BLAM! CLOSE ON: a PAPER TARGET, a SILHOUETTE OF AN ARMED THUG.   The shooter's aim is PERFECT.   A tight cluster, around the heart. We're at Rodman's Neck, a huge training facility in the Bronx.   It's like a Hollywood backlot.   Fake buildings.   Mock bad guys.   Another TARGET swings into view.   The shooter spins!   BLAM BLAM! The shooter is LT. TONY CARUSO JR, lead detective on New York's elite All-City Homicide Squad.   A man of quiet authority.   Clean cut.   Deliberate.   Focused. Tony continues to shoot.   BLAM BLAM BLAM BLAM! INT.   TRAINING FACILITY- MAIN OFFICE- LATER Tony is at the counter.   The range supervisor, SGT. CHET FINCH, a weathered, veteran cop, tallies up his score.",
      "characters": [],
      "action_text": "SGT. FINCH 982.   That's a range record.   The highest your old man ever got was 800. TONY He probably cheated. SGT. FINCH I know he cheated. EXT./INT.   TONY'S CAR- INTERSECTION- BROOKLYN- NIGHT It's late.   Tony and his father are driving home. BIG TONY is a natural-born hustler.   Irreverent.   Shameless. We don't want to love him, but we love him. They're stopped at a RED LIGHT.   The streets are empty. Brooklyn is dead.   You would run this light.   So would I. Anybody would.   But Tony is a boy scout.   Obsessively honest. BIG TONY You can go. (beat) The light's busted.   You can go. Tony doesn't move. BIG TONY (CONT’D) It's been busted all week. TONY I'm gonna give it a minute. BIG TONY You don't believe me? TONY If you told me you were lying, I wouldn't believe you. BIG TONY That's very funny.   That's a nice way to talk to your father. (then) I talked to Chet Finch.   He said you crushed it at the range on Saturday.  2. TONY You talked to Chet Finch? BIG TONY It didn't surprise me.   You could always shoot.   Remember Boy Scout camp?   You won all those medals- TONY Badges. BIG TONY Badges.   Whatever. TONY If you were there, you would know. BIG TONY I wasn't there.   I was a shitty dad.   But it doesn't matter now because we're both gonna die tonight in this car.   They're gonna find us tomorrow, staring at that facacta light, dead of starvation. TONY You're not supposed to have contact with anyone in the department. BIG TONY It wasn't contact. TONY That's a condition of your parole- BIG TONY It wasn't contact.   We weren't exchanging bodily fluids.   We talked for ten minutes. TONY That's contact!   Conversation is contact!   Especially with Chet Finch.   He was on your crew, for God's sake. BIG TONY Someone buys me a Heineken, I'm gonna sit down.   That's how God made me.   Especially if they're bragging on my boy.  3. A CAR behind them HONKS impatiently. BIG TONY (CONT’D) Now they're honking. (Tony doesn't move) You can go.   You're a cop. TONY Exactly.",
      "dialogue_count": 0,
      "word_count": 1604
    },
    {
      "scene_number": 2,
      "slugline": "EXT.   CRIME SCENE- CONTINUOUS Tony & Loomis walk up a hill, toward the body.   Loomis is out of shape.   He falls behind. LOOMIS Don't wait for me.   I promised your old man I'd watch your back, so that's what I'm doing. They reach the dump site.   A uniform officer, SGT. CHEADLE, greets them. SGT. CHEADLE Lieutenant.   Glad you're here. This one's a real freak show. Loomis joins them, wheezing from the climb. TONY (indicates Loomis) Well, we know HE didn't do it. (resuming, to Cheadle) Any I.D.? SGT. CHEADLE Not yet.   Nobody's touched him.   It looks like a taxpayer. Tony examines the BODY.   He's a world-class investigator. Out of respect, the other cops step away and give him space. SGT. CHEADLE (CONT’D) What the hell is wrong with this town? LOOMIS Nothing a well-placed hydrogen bomb couldn't cure. The victim has been shot in the chest, multiple times.   Plus there's a BLACK PLASTIC TRASHBAG over his head. SGT. CHEADLE Should we cut the bag? TONY No.   Let's wait for the good doctor. LOOMIS Time of death?  10.",
      "characters": [],
      "action_text": "TONY I'm guessing.   Two days. LOOMIS So Saturday night? TONY Maybe.   This isn't the primary.   He was killed somewhere else. (examines the shoes) No scuff marks.   He wasn't dragged, he was carried.   Who found him? Nearby: the DIRT BIKERS are being questioned. SGT. CHEADLE A couple of dirt bikers.   It's illegal in the park, so they ride at dawn. TONY Get a statement.   Separately. Separate cars.   And stay away from that bush. SGT. CHEADLE Did you see something? TONY Yeah.   Poison sumac. LOOMIS (chuckles) One of the perks of having a boy scout for a partner. Tony looks around.   He misses nothing. TONY They parked down the hill.   They carried him 35, maybe 40 yards. Why'd they leave him here, out in the open?   Another ten feet they're in the woods. LOOMIS Maybe they were interrupted. TONY Maybe. (beat) Maybe they wanted him found.  11.",
      "dialogue_count": 0,
      "word_count": 323
    },
    {
      "scene_number": 3,
      "slugline": "EXT.   CARUSO HOUSE- STREET- SAME TIME Back at the house.   An young woman ROARS up on a vintage Sportster Harley Davidson.   Meet GABRIEL VASQUEZ, Big Tony's probation officer.   Street smart, with a mischievous sense of humor. Gabby on her chopper: the sexiest thing on the internet. She's parked in front of a FIRE HYDRANT.   Gabby picks up an EMPTY TRASH CAN, flips it over, and drops it over the hydrant.   Problem solved. An ELDERLY NEIGHBOR, sitting on a stoop, watches her.   Gabby smiles and winks. INT.   CARUSO HOUSE- LIVING ROOM- SAME TIME Inside.   Big Tony is installing a NEW TV MONITOR with WENDELL, an old slacker friend. BIG TONY & WENDELL Where's the other input?   This wire's too big.. etc. Gabby enters.   The guys are distracted and don't notice her. She picks up the REMOTE and CLICKS THE TV OFF. For a beat, the guys are confused.   They think the monitor is broken.   They finally notice Gabby. GABBY I left you two messages. BIG TONY I know.   My phone died.   Sorry. WENDELL (dimly) Who is this? Gabby flashes her P.O. SHIELD. GABBY \"This\" is Gabriel Vasquez.   I'm his probation officer. Gabby picks up a TOWEL- twirls it, rolls it up- then SNAPS IT LIKE A WHIP at Big Tony   It nicks his ear.   It bleeds a little.  12.",
      "characters": [],
      "action_text": "BIG TONY YOW!   Are you allowed to do that?! GABBY I doubt it. (to Wendell) Who are you? BIG TONY (gulp) Wendell Kirk. GABBY Wendell Kirk.   Do you have a receipt for this TV? WENDELL It was a floor model.   They don't give receipts- GABBY Bullshit.   You always get a receipt. WENDELL Not at Target. BIG TONY You want a receipt?   Give me twelve hours.   I can get you a receipt. GABBY Pack it up, Wendell. Wendell anxiously carries some boxes out the door. GABBY (CONT’D) I called the lumber yard.   They said you showed up but then left before the interview. BIG TONY Okay.   Here's the thing.   I got there.   The supervisor was a guy named Randy Buttons.   I don't know Randy too well, but I know his wife, Mrs. Buttons, very well.   So I bailed.   Believe me, I saved everyone a world of trouble.  13. GABBY So we have to find an employer whose wife you never tapped? BIG TONY It's a big city.   There has to be someone. WHAPPP!   Gabby SNAPS THE TOWEL at him again. BIG TONY (CONT’D) YOW!   Gabby, Inspector, give me some credit.   I'm walking the line here.   You asked me to sell my liquor license, I sold it, no problem.   You asked me to move in with my kid, here I am.   I'm walking the line.   You gave me 90 days to find a job.   I'll do it.   I have three weeks left. GABBY Three weeks, Tony. (sigh) Why do I let you slide like this? BIG TONY Because you get me.   Because we're kindred spirits. There's a COLLECTION OF FAMILY PHOTOS on a wall.   Gabby admires a photo of Tony, shirtless, at the beach.   Any woman would. BIG TONY (CONT’D) (teasing her) You want a copy of that one? GABBY Shut up. Gabby notices ANOTHER PHOTO: Big Tony and his ex-partner, JACK LIVINGSTON. GABBY (CONT’D) Is that Jack Livingston?   Your ex- partner?   I thought you hated him. BIG TONY Hatred is too weak a word.  14. GABBY Then why- ? BIG TONY I keep that picture there to remind me what's really important in life. GABBY What's that? BIG TONY Outliving that prick. We ZOOM IN to the PHOTO OF JACK LIV",
      "dialogue_count": 0,
      "word_count": 1245
    },
    {
      "scene_number": 4,
      "slugline": "EXT.   THE STANDS BIG TONY He's out. (to Kayla & Avery) Just like you guys. EXT.   LITTLE LEAGUE FIELD- DAY The game continues.   The next batter is EVAN, Tony and Kayla's son. KAYLA & AVERY COME ON, EVAN!   GET A PIECE OF IT. I can't look. Evan takes a pitch. TONY BALL ONE! (quietly, to Evan) Good eye, buddy.   Wait for your pitch. The next pitch.   Evan connects!   The FIRST BASEMAN fields the ball.   It's a funny, sloppy play; typical little league stuff.   Evan dodges the tag.   The First Baseman chases him around.   Finally, somehow, Evan reaches first base.   He's safe! PARENTS IN THE STANDS YEAH!   WAY TO GO!   EVANNNNN! TONY You're OUT! Out?!?   A confused beat. EVAN Dad!?   He missed me by a mile! TONY You were out of the baseline. Sorry, buddy. The PARENTS BOO.   The PLAYERS BOO.   EVERYONE BOOS. TONY (CONT’D) If you break one rule, what happens?   That's right.   They all break.  19.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 158
    },
    {
      "scene_number": 5,
      "slugline": "EXT.   THE STANDS- SAME TIME Kayla, the ex-wife, knows what's coming. KAYLA Oh no.   Not the rulebook.. EXT.   ON THE FIELD Tony takes out a RULE BOOK.   The LOUD BOOING continues. TONY Here it is.   15 J.   \"A batter/runner cannot deviate more than 3 feet from the baseline while avoiding the tag\". Evan sighs, and sulks away. TONY (CONT’D) Good hit though.   Way to hustle. EXT.   LITTLE LEAGUE FIELD- LATER The game is over.   The PLAYERS are collecting their stuff. Kayla and Avery step up.   Tony and the women exchange tense, overly-polite greetings.   Divorces are tough. KAYLA Could I see that rule book?   I'm just curious. Kayla takes the RULE BOOK.. and playfully FOLDS it. KAYLA (CONT’D) Oh look.   It bends.   Unlike the umpire. TONY I get it.   Very cute.   Well, I think he learned a valuable lesson. KAYLA Oh we ALL learned a lesson, Tony. How's tomorrow morning?  20.",
      "characters": [],
      "action_text": "TONY I'll have to call you.   An ex cop was killed, so it's all hands on deck. KAYLA Well, let me know. Kayla and Avery & Evan walk away.   Big Tony IMPROVISES a sweet goodbye with his grandson.   Then he crosses to Tony. BIG TONY An ex cop? TONY I was about to tell you.   It was Jack Livingston.   They found him this morning in Ambrose Park. BIG TONY How? TONY It wasn't pretty.   Abducted. Drugged.   Suffocated.   Then shot. BIG TONY I wouldn't have done it in that order, but still- TONY Jesus!   Dad! BIG TONY I'm not gonna lie to you.   I have mixed feelings here. TONY Where would you start? BIG TONY If it was my case?   I'd be looking at me. Tony gestures, \"be serious\". BIG TONY (CONT’D) Why not?   Who has a better motive? I did 12 birthdays inside for that bastard. (grins) (MORE)  21. Maybe I'm your blind spot.   Every cop has one. TONY Are you gonna help me here or not? BIG TONY Livingston took five other cops down with me.   Every one of 'em told me they'd take him out if they could. TONY You believe them? BIG TONY I did at the time.   But that was 12 years ago.   Grudges have a way of, what's the word?- dissipating. TONY I heard he was broke.   I heard he owed the Newmark Brothers. BIG TONY They're serious people.   But what you described- abducted, drugged, shot- it doesn't sound like business.   It sounds personal. Have you met the wife? TONY Donna. BIG TONY She's a real people-pleaser.   Half of Brooklyn would love a ride on that pony. (chuckles) You've got your work cut out for you.   There won't be a lot of tears at that funeral. INT.   ALL-CITY SQUAD ROOM- 15TH PRECINCT- NIGHT The All City Task Force occupies a LARGE ATTIC-LOFT of the old precinct building.   Old school.   Wooden desks.   Piles of case files.   These detectives are overworked and underfunded. BIG   TONY   (CONT’D)  22. A CASE BOARD dominates the room.   It says \"LIST OF POSSIBLES\".   Underneath: 14 HEADSHOTS of assorted local lowlifes. TONY My old man was right.   Bookies, cops, ex cops",
      "dialogue_count": 0,
      "word_count": 5185
    },
    {
      "scene_number": 6,
      "slugline": "INT.   UPSTAIRS BEDROOM- CONTINUOUS Donna and Chet Finch are lovers.   They're in an UPSTAIRS BEDROOM.   Whispering.   Embracing.   Kissing hungrily. DONNA LIVINGSTON Chet.. what are you doing?   We agreed.. we have to wait.. Tony opens the door.   They break off, startled. TONY Knock knock. SGT. FINCH Caruso- ?! DONNA LIVINGSTON Are you lost? TONY (pointedly) I was lost.   I'm not quite as lost as I was. SGT. FINCH (recovering) Donna's an old friend.   She needed to talk.. TONY Obviously. Finch SCRATCHES HIS LEG AGAIN. TONY (CONT’D) Are you okay, Sergeant?   You've been scratching your leg all night. SGT. FINCH It's a rash. TONY From here, it looks like poison sumac. (then, accusingly) How did you do it? SGT. FINCH Do what?  52.",
      "characters": [],
      "action_text": "TONY Kill Jack Livingston with my gun. Before the couple can respond, Loomis appears. LOOMIS Tony- ! TONY Cowboy!   Is the Captain still here? LOOMIS She sent me to find you- TONY (excitedly) He's the guy.   They're in it together!   I don't know how they did it, but they did it- LOOMIS Tony- TONY Remember the poison sumac by the clearing?   Check his left leg, they can match it in the lab- LOOMIS Tony- Tony- it's over. TONY (finally focusing) What's over? LOOMIS The case.   They're closing it. (then) Your father just confessed. INT.   STATE PRISON- VISITING AREA- LATER Tony is visiting his father.   Big Tony is in prison overalls. He's doing what a good parent does: he's masking his fear, and reassuring his son.. BIG TONY You don't remember Harry Corkrin? Harry The Horse?   He's practically your Godfather. (MORE)  53. He's two cells over.   I got more friends in here than I do outside. During this, Big Tony is shamelessly smoking a CIGAR. TONY You can't smoke in here. BIG TONY No.   YOU can't smoke in here. (resuming) Plus I'm eating better.   Plus I don't have to listen to your fakakta bossa nova.   Don't worry about me, kid.   The devil watches over his own. TONY You didn't answer my question. Why'd you sign that statement? BIG TONY Because I did it.   I killed him. TONY No you didn't. BIG TONY You're a good cop, Tony.   But you're not a father. (heartfelt) I'd take a bullet for you.   Don't you know that? (clarifying) Not in the gut.   The leg maybe.   A flesh wound.   Or the thigh. A PRISON GUARD appears, as a waiter would, with a MUG OF COFFEE. BIG TONY (CONT’D) Thank you, Corey.   Is there any of that cinnamon? The GUARD adds some cinnamon to the coffee. TONY You think I did it?   You think you're protecting me? BIG   TONY   (CONT'D)  54. BIG TONY (gesturing: people might hear) Hey. TONY I didn't kill anybody. BIG TONY Of course you didn't. TONY It wasn't either of us.   It was Chet Finch! BIG TONY Finch? TONY And Livingston's wife.   They planned it together",
      "dialogue_count": 0,
      "word_count": 1397
    },
    {
      "scene_number": 7,
      "slugline": "INT.   TRAINING FACILITY- MAIN OFFICE- NIGHT Inside.   Tony and Gabby are still searching through the PAPER TARGETS.   Until.. GABBY \"May 24.   Caruso, Junior\". She pulls out the BULLET-RIDDLED TARGET.   Tony has brought the AUTOPSY DIAGRAM.   They compare the pattern of holes. Tony was right.   They're identical. GABBY (CONT’D) Wow.   Is that enough? TONY It's more than enough.   It's incontrovertible. Gabby starts to roll up the target. TONY (CONT’D) Don't touch it.   We have to preserve the chain of evidence. We'll come back tomorrow with a warrant. GABBY At least take a picture. Gabby takes a QUICK PHOTO of the paper target. EXT.   PARKING LOT- TRAINING FACILITY- MOMENTS LATER Tony & Gabby walk back to Tony's car. TONY Were you serious about taking the exam? GABBY Are you hiring? TONY Maybe we are.   I could talk to the Captain. Suddenly they stop.   The hood of Tony's car is open.   The DISTRIBUTOR CAP has been ripped out.  61.",
      "characters": [],
      "action_text": "SGT. FINCH'S VOICE Right there.   Right there. They turn.   Sgt. Finch is pointing a GUN at them. SGT. FINCH First your phones.   Let's drop them. Tony and Gabby slowly take out their CELL PHONES, and drop them. TONY You don't want to do this, Chet. You're not a murderer. GABBY (reminding him) He is a murderer.   That's why we're here. SGT. FINCH Now your guns.   You first. Tony opens his jacket.   No holster.   No gun. SGT. FINCH (CONT’D) (gloating) Oh I forgot.   It's in the evidence room.   It is, after all, a murder weapon. (then) Inspector? Gabby opens her jacket.   No weapon. GABBY I left it home. SGT. FINCH Why would you do that?   You're on the job. GABBY When he called, all he said was he wanted to see me. (embarrassed) I thought he was asking me out. TONY (surprised, flattered) Really?  62. Now we reveal: Gabby really DOES have a gun!   It's holstered behind her, out of sight.   She SLOWLY REACHES FOR IT, as.. SGT. FINCH I thought I covered every angle. How did you figure it? GABBY He remembered the pattern of the bullet holes. SGT. FINCH From one target?   From ten days ago?   It's not possible. GABBY That's what I said! TONY It was a unique pattern.   It's an almost perfect hexagon- (to Gabby) Was that true?   You thought I was asking you out? GABBY No.   Sorry. Suddenly Gabby pulls her GUN- spins- and BLAM!- fires at Finch!   Finch DIVES OUT THE WAY!   Tony & Gabby scramble away! They race toward the OUTDOOR TARGET RANGE.. EXT.   TARGET RANGE- CONTINUOUS- NIGHT Tony and Gabby run through the dark, quiet, sprawling TARGET RANGE.   Past PROP BUILDINGS and WOODEN CARS.   It's other- worldly. Suddenly- FLOOD LIGHTS!   The range is bathed in light.   Tony and Gabby are exposed! BLAM BLAM!   Finch fires at them!   But from where? Tony and Gabby scramble away.   Now the TARGETS are switched on! A MECHANICAL GOON SWINGS into view.   TWANGGG!   Gabby spins, fires!   BLAM BLAM!   More TARGETS POP UP!   TWANGGGG! TWANGGGG!  63. Cat and mouse.   They stalk each oth",
      "dialogue_count": 0,
      "word_count": 854
    },
    {
      "scene_number": 8,
      "slugline": "EXT.   INTERSECTION- QUEENS- SAME TIME Meanwhile.   In Queens.   Tony has returned to the corner where his mother was killed. He studies the crime scene like the great cop he is.   The traffic.   The apartment building.   The strip mall.   The lines of sight. He's obsessed with the case. It's a wound that will never heal. EXT.   STATE PRISON- PRISONER RELEASE AREA- DAY The next day.   At the STATE PRISON.   The BIG GATE slides open.   Big Tony emerges, carrying his personal effects bag. Tony is standing beside his car, waiting. BIG TONY (beaming) This never gets old. TONY What's that? BIG TONY Me, getting sprung, you, here, waiting for me.   It makes me think I did something right. They embrace. TONY I told you not to worry. BIG TONY I wasn't worried for a minute.   I had the second best cop in New York history on the case. The two Carusos climb into the car.   Tony drives away. They go ten feet.   There's a rusty, faded old sign: STOP HERE- WAIT FOR GUARD.   Tony obediently stops. BIG TONY (CONT’D) What are you doing?  66.",
      "characters": [],
      "action_text": "TONY It says to wait. BIG TONY You can go.   That's an old sign. They changed the rule. TONY Let's give it a minute. BIG TONY He's not coming.   Just go! (sighs) We can't be related. There's ANOTHER CAR behind them.   It HONKS impatiently. BIG TONY (CONT’D) Did you get your gun back? TONY Yes I did. BIG TONY Can I borrow it? THE END  67.",
      "dialogue_count": 0,
      "word_count": 249
    }
  ]
}