{
  "slug": "the-100-101-pilot-2014",
  "title": "the 100 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 13503,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CELL BLOCK - CONTINUOUS Her mind races, trying not to panic, straining for next moves, when what she finds in the corridor stops her cold: All along the cell block, on floors above and below, JUVENILE PRISONERS are being led out of their cells. Each of them is badly shaken and in some pain from the IDENTICAL WRISTBANDS now biting into their wrists. Before Clarke can even begin to make sense of all the activity, POUNDING from inside her cell gets attention. ABBY (O.S.) Clarke, stop!   They’ll hurt you! Emotion crashes like a wave as Clarke turns to see a WOMAN in a white lab coat rushing toward her along the rail. CLARKE ... Mom? Despite twelve years and infinite sadness, we recognize Clarke’s mother from the photograph.   ABBY is 40 now with an air of seriousness that comes from authority. More GUARDS are converging, but Abby’s presence gives them pause as she wraps her daughter in her arms... CLARKE (CONT’D) ... Mom, what is this? What’s going on? Abby can’t speak.   Holding her child for both the first time in almost a year and, quite possibly, the last time ever scrambles her thoughts. Clarke pulls back, looking from the pain in her mother’s eyes to the rows of young inmates as a terrifying thought strikes. CLARKE (CONT’D) They’re killing us all, aren’t they?   Reducing population to make more time for the rest of you. ABBY (guiding her aside) No.   Quiet.   That secret’s already done enough damage to this family. CLARKE Wrong, keeping it has.   People have a right to know the Ark is dying.  5 TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "Both of them hate the fact that they can’t get past this, hate the fact that it divides them even now, but the sight of A GUARD RECEIVING ORDERS in an earpiece changes the subject. ABBY Clarke, please, just listen. This is not what you think.   You’re not being executed.   You’re being sent to the ground.   All one hundred of you. Clarke blinks.   The meaning of that is so incomprehensible that it’s as if she doesn’t understand the words... CLARKE ... What?   But it’s not safe. No.   We get reviewed at 18. ABBY The rules have changed.   There are no prisoner reviews anymore.   This gives you a chance to live. Abby sees the guard lining up a shot with a tranq gun.   She knows that this is goodbye, touches her daughter’s face... ABBY (CONT’D) Your instinct will be to take care of everyone else first, just like your father, but be careful.   I can’t lose you, too. Tears stream from her eyes.   She sees how frightened Clarke is, but there’s nothing more she can say. And no time to say it. THE DART STRIKES, the drug hits, and Clarke collapses back into her mother’s arms as EVERYTHING GOES BLACK. ABBY (O.S.) (CONT’D) Earth, Clarke.   You get to go to Earth. MAIN TITLES: THE HUNDRED END TEASER  6 TV Calling - For educational purposes only ACT ONE INT. THE DROPSHIP - DAY FADE UP:   We’re still in CLARKE’S POV as consciousness returns.   Her eyes travel around the stark compartment, before a smiling FACE TAKES SHAPE FROM OUT OF THE BLUR. WELLS JAHA (17, handsome and well-bred compared to the young criminals all around them) is relieved that Clarke is okay. WELLS Welcome back. NORMAL VIEW RETURNS as the sight of Wells fills Clarke with rage.   She lunges at him... CLARKE ... You sonofabitch! A safety harness holds her back.   FORTY OTHER PRISONERS are strapped in just like her.   Despite delinquent bravado, all are terrified.   Clarke’s bearings flood back.   She remembers: CLARKE (CONT’D) ... Earth. Pain shoots through her right arm.   She looks to see the wristband now lock",
      "dialogue_count": 0,
      "word_count": 993
    },
    {
      "scene_number": 2,
      "slugline": "INT. THE DROPSHIP - SAME TIME The violence of reentry will build through all of the following.   So will the heat... and the fear. CHANCELLOR JAHA (ON MONITORS) If the odds of survival were better, we would have sent others. Frankly, we’re sending you because your crimes have made you... expendable.   If, however, you do survive, then those crimes will be forgiven.   Your records wiped clean.   No execution upon your eighteenth birthday.   No review. No probation.   A second chance. The CAMERA IS ON THE MOVE throughout the speech. CHANCELLOR JAHA (ON MONITORS) (CONT’D) This is not, however, a waiver against future crimes.   While unsupervised, you will adhere to the laws of the Ark, or you will be punished under them.   You have one job, ladies and gentlemen, one responsibility... Stay   alive.   Two months.   That’s how long it will take to be certain that it’s safe for the rest of us to follow... Just then, a severe jolt opens a storage compartment.   A few rolled maps spill out, floating weightlessly overhead. CHANCELLOR JAHA (ON MONITORS) (CONT’D) In the meantime, some of you may be tempted to strike out on your own. Don’t.   Your drop site has been chosen carefully. A face in the crowd gets our attention: FINN, 17 and ruggedly handsome, lights up when he sees the floating maps... FINN (OVERLAPPING) Oh, hell yes. With that, he draws a shiv from his boot and cuts the straps of his harness, floating out of his chair, loving it. CHANCELLOR JAHA (ON MONITORS) Before the Last War, Mount Weather was a military base built within a mountain in order to shelter the government of the United States...  9 TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "Finn launches himself, soaring exuberantly through the air to the delight of the crowd. A VOICE FROM THE CROWD (OVERLAPPING) Spacewalk Bandit strikes again! A CHEER goes up.   It seems Finn is a bit of a folk hero. TWO MORE BOYS follow his lead, cutting loose, then flying. CHANCELLOR JAHA (ON MONITORS) ...No one ever made it there. According to the archive, it was to be stocked with enough non- perishables to sustain three hundred people for up to two years. Because we could spare you no food, water, or medicine, you must  immediately locate those supplies. Finn drifts over to Wells, hovering above him... FINN (OVERLAPPING) Check it out.   Your dad floated me after all. LAUGHTER, but not from Wells.   From Clarke, a slight smile... CHANCELLOR JAHA (ON MONITORS) I cannot stress this strongly enough... Mount Weather is life. CLARKE (OVERLAPPING) You should come down before the parachute deploys.   All of you. CHANCELLOR JAHA (ON MONITORS) It is from there, God willing, that the next age of man will begin... with you. Finn turns his attention to Clarke.   Because he ignores her warning, so do the other two now-somersaulting floaters. FINN (OVERLAPPING) You’re the traitor who’s been in solitary for a year. CHANCELLOR JAHA (ON MONITORS) Finally, I’m sure you’re wondering about those wristbands... CLARKE (OVERLAPPING) You’re the idiot who wasted a month of oxygen on an illegal spacewalk.  10 TV Calling - For educational purposes only Finn lowers almost to her lap, floating on his back... FINN (OVERLAPPING) Yeah, but it was fun.   I’m Finn. Clarke can’t believe he’s flirting with her now.   As much as we like this guy, Wells doesn’t. CHANCELLOR JAHA (ON MONITOR) They are not punishment.   They are a lifeline.   They are how we will -- That’s when THE PARACHUTE DEPLOYS.   Sudden rapid deceleration ends the fun in an instant. The awful sound of TEARING METAL comes from all around. The video monitors go black, never to be heard from again. The floaters SLAM to the floor with ",
      "dialogue_count": 0,
      "word_count": 1494
    },
    {
      "scene_number": 3,
      "slugline": "EXT. THE DROPSHIP - CONTINUOUS CLOSE ON THE DOOR as Octavia steps out, looking around in wide-eyed amazement.   Behind her, the others are waiting, mainly because Bellamy won’t let anyone follow. As Octavia descends the short staircase, WE WIDEN OUT: The ship has come to rest in the middle of A PRIMORDIAL FOREST.   Fallen trees are everywhere, many still smoldering. Taking in everything, Octavia milks her “one small step for man” moment for several long seconds, before finally thrusting out her arms and BELLOWING: OCTAVIA WE’RE BACK, BITCHES!! Neil Armstrong had nothing on Octavia. It incites a mad rush from the ship. The STAMPEDE forces Clarke aside as they just keep coming, reveling in the warmth of the sun on their skin.   The scent of real air in their lungs.   The sight of so much green. Already we sense something primal happening here.   A century of pent-up instinct being released at once.   Soon reality will crash down, but, for these few moments the fact that they are young, alive, and on solid ground is combustible. Let the wild rumpus start. Clarke descends the stairs slowly, pausing on the bottom step to nod at the occasion, before finally, at long last, setting foot on the ground.   Something dreamt of all her life passes without fanfare.   There will be time for that later. For now, she can’t shake the feeling that something is wrong. Determined to figure it out, she heads for the nearest tree. Passing a BOY using a rolled up map as a sword, she snatches it from him, puts it between her teeth, and starts to climb. WE CLIMB WITH HER, rising above the celebration, LAUGHTER and SHOUTS OF JOY receding as she pulls herself higher, finally stopping as the leaves thin and the view steals her breath: DENSELY FORESTED, MIST-SHROUDED MOUNTAINS as far as the eye can see.   The stuff of fairy tales and nightmares. Finding a perch, she unrolls the map and holds it out, trying to orient it to the various surrounding peaks when she hears:  15 TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "FINN (O.S.) Why so serious, Princess? Surprised she’s not alone, she looks over, sees Finn already perched in a neighboring tree. FINN (CONT’D) It’s not like we died in a fiery explosion. She looks back out, back to the map... CLARKE Tell that to the two boys who followed you out of their seats. It strikes Finn hard, making the point: don’t call her princess.   She points to a distant mountain top... CLARKE (CONT’D) You see that peak over there? FINN Yeah. CLARKE Mount Weather.   There’s a radiation soaked forest between us and our next meal. Having gotten what she came for, she re-rolls the map. CLARKE (CONT’D) They dropped us on the wrong goddamn mountain. Finn looks back out.   Shit.   A good view spoiled by the realization that they are well and truly fucked.  END ACT ONE  16 TV Calling - For educational purposes only ACT TWO EXT. SPACE - DAY The beautiful mess that is the Ark drifts in pure silence two hundred and fifty-seven miles above the Earth. INT. THE ARK - THE GOVERNMENT AND SCIENCE STATION - DAY An agitated CROWD has gathered in the atrium that connects GO-SCI to the rest of the Ark through a system of tubes. A good sample of the populace, they are hard-working and hard- edged.   Life in space is not easy and it shows on every face. A GUARD UNIT backs up the Ark’s Chief Communications Officer, CALLIE CARTWIG, 42; everyone calls her “Cece.”   This is the part of her job that she hates.   The lying part. CECE Folks, as I said, at this time, we can’t confirm or deny anything. VARIOUS VOICES I saw a ship launch...Not more than 20 minutes ago...Who was on it?... Was it the prisoners?...They going to Earth?...Has something changed? The guards are clearly about to move in when a WOMAN in the crowd WHISTLES loudly, bringing instant quiet. Like many here, she’s come from work, in her case as a mechanic.   Unlike most, RAVEN, 35, is in total control... RAVEN Cool it.   Our elected leaders would never send our kids to die without telling us.   Isn’t that right, ma",
      "dialogue_count": 0,
      "word_count": 3020
    },
    {
      "scene_number": 4,
      "slugline": "INT. THE ARK - COUNCIL CHAMBER - DAY Kane sits at the head of a huge table, Earth visible through a window behind him.   The NAMEPLATE tells us he’s trying the Chancellor’s chair on for size, liking the way it feels when he hears A DOOR OPEN, quickly stands and turns to the window. If the uniformed COMMANDER OF THE GUARD knows what Kane was doing, he doesn’t let on.   His devotion to Kane is clear... COMMANDER OF THE GUARD Excuse me, sir, you asked to be interrupted if there was news. Kane doesn’t turn.   In his face, we see that he thinks this is the moment he becomes Chancellor.   Then he hears: COMMANDER OF THE GUARD (CONT’D) The Chancellor is still in surgery, but we’ve ID’d the shooter. Takes Kane a moment to push back disappointment.   By the time he turns, the Commander has summoned up an image on the huge touch screen monitor that doubles as the council table: BELLAMY’S FACE ON A SANITATION CREW ID CARD. COMMANDER OF THE GUARD (CONT’D) Bellamy Black is the only person on the Ark unaccounted for. KANE Who is he? COMMANDER OF THE GUARD He’s no one.   A janitor.   We’re still working up a profile, but his motive for going to Earth is clear. He brings up the MUG SHOTS of the prisoners alongside Bellamy, selecting OCTAVIA’S.   So young.   So afraid.   Nothing like the vivacious girl we’re getting to know on the ground. KANE Sister.   I remember them.   Their mother kept her hidden for almost thirteen years.   Nearly a record. Something in the Commander’s expression stops Kane... KANE (CONT’D) What is it, Commander Shumway? The Commander hesitates.  28 TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "KANE (CONT’D) Spit it out. COMMANDER SHUMWAY We could start now.   As Chancellor Pro Tempore, you can give the order to begin reducing the population. It hangs there.   Kane is clearly tempted.   Then... KANE Not yet.   The Chancellor’s Hail Mary mission to Earth is failing. Once it’s clear the ground still isn’t an option, the council will get in line. (looking back down to Bellamy’s picture) In the meantime, I’d like to know who helped this janitor get on that dropship.   Because he sure as hell didn’t do it by himself. The Commander says nothing, but clearly agrees. KANE (CONT’D) It seems we have a traitor in our midst, Commander... (looking to the mug shots) And the Hundred have an assassin in theirs. END ACT TWO  29 TV Calling - For educational purposes only ACT THREE EXT. EARTH - THE ENDLESS WOODS - DAY Several hours into the trek.   The group has fanned out amid the trees.   Sunlight dapples.   Wildflowers are everywhere. Clarke has assumed the lead and is setting a fast pace, appreciating none of it. Behind her, Octavia, Finn, and his two recruits all wish that she would slow down to let them enjoy the scenery. JASPER and MONTY, both 15, are, on the surface, the furthest thing from delinquents.   They are clearly very intelligent and, it must be said, incredibly uncool.   The fact that they’re studying Finn to remedy this will become clear. As we arrive, Finn stops to pick a flower and slip it into Octavia’s hair.   She’d jump him here and now if he’d let her. Jasper and Monty see this and exchange a glance... JASPER That, my friend, is game. MONTY That, my friend, is poison sumac. OCTAVIA (swatting away the flower) Jesus, Finn!   Thank you. MONTY Don’t worry.   The flowers aren’t poisonous.   They’re medicinal. Calming actually. He pops one in his mouth.   Finn and Octavia are curious. JASPER His family grows all the pharmaceuticals. CLARKE (abruptly turning around) Hey!   Try to keep up. FINN Come on, Clarke, look around you. How do you block all this out?",
      "dialogue_count": 0,
      "word_count": 4936
    },
    {
      "scene_number": 5,
      "slugline": "INT. CLARKE’S CELL - MINUTES LATER Abby is led into her daughter’s old cell.   The drawings still on the walls strike her at once, but she shows nothing. Handcuffs are removed.   Guards leave.   Door SLAMS. Only now, alone, does she let the full weight of everything show in her face.   Tears stream from her eyes. ABBY’S POV -- A DRAWING OF THE WOODS AT NIGHT EXT. EARTH - THE ENDLESS WOODS - NIGHT CLOSE ON CLARKE, asleep on the ground near the others when her eyes suddenly snap open and fill with wonder. As she slowly sits up, WE WIDEN TO REVEAL HER SURROUNDINGS: Incredibly, the trees and flowers and ground are streaked with iridescent light.   Veins of luminescence.   Multiple colors.   The effect is surreal and spectacular. A forest that glows in the dark. Appropriately agog, Clarke stands and moves amid the trees. The sound of the RUNNING RIVER adds to the splendor. Finally, her guard is down and we see the wide-eyed, inquisitive, passionate girl beneath the emotional armor. For the first time, she lets herself feel the wonder of being on Earth.   Only it’s unlike the Earth she spent so much time dreaming about.   Indeed, it’s practically another planet. Her eyes wander to the stars, her mind to the Ark (or heaven) and her mother (or father), when she hears a low voice: FINN (O.S.) Pretty cool, huh? Startled, she whirls, reverie replaced by embarrassment as she sees him returning through the psychedelic trees. Takes her a moment to react to the fact that he’s carrying a cone fastened out of large leaves and filled with water. CLARKE You went to the river? FINN Figured it was worth losing a finger or two.   Here.  49 TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "He moves the cone to her lips.   She takes a tentative sip. FINN (CONT’D) You call that a sip? She smiles.   Old habits.   She drinks again, deeply this time, letting it run down her face and neck. When she’s done, she has to look away, vibrating from all of it, forcing herself to refocus on the glowing trees... FINN (CONT’D) You think it means we’re all gonna grow two heads? Clarke LAUGHS slightly. FINN (CONT’D) What do you know?   She can laugh. She gives him a look, then picks a neon leaf.   Incredibly, it dims as if being unplugged. CLARKE Oh, now that’s cool. There’s that bright-eyed girl again.   Finn clearly likes this side of her. CLARKE (CONT’D) I’ll have to run some tests, but, right now, my operating theory is that bioluminescence is an adaptation.   Sort of a twist on photosynthesis.   That’s -- FINN Plants using sunlight to turn bad air into good air. She’s impressed.   He shrugs... FINN (CONT’D) Woke up that day in science class. Come here.   You have to see this. With that, he strides back through the trees.   She follows, trying to shake her hormonal response to this guy. He stops in a particularly surreal spot, squatting to point out something on the ground.   WE SEE THEM AS SHE DOES: Strange tracks in the dirt.   Hard to tell, but they could be simian.   A widely separated big toe is clear in some of them.  50 TV Calling - For educational purposes only She kneels, curious.   He points... FINN (CONT’D) That’s a toe.   Plus, near as I can tell, whatever it is, it’s walking on two feet.   My guess... monkeys. Clarke LAUGHS at him.   He gives her a look. CLARKE Sorry.   It’s just... According to everything I’ve read, there were no bipedal animals anywhere near here, certainly not monkeys. FINN Really?   You read anything about glow-in-the-dark forests or man- eating snakes? She meets his stare, sees his point: anything is possible. We sense that a kiss is imminent, or at least if he tried, that she’d let him.   He doesn’t try. Instead, he reaches back ",
      "dialogue_count": 0,
      "word_count": 1502
    },
    {
      "scene_number": 6,
      "slugline": "INT. PRISON STATION - HANGAR BAY - DAY Abby is being ceremonially led across the same hangar bay where her husband was executed.   An armed COLOR GUARD marches ten feet behind.   Jackson and Cece walk on either side. Abby is not crying, not showing fear.   Even as she’s led to her death, her mind is on the kids... ABBY How many more overnight? JACKSON Abby -- ABBY Goddamn it, Jackson, answer me. JACKSON Just one. She looks at him.   Showing fear for the first time.   The way he said it could only mean Clarke.   Then she hears: JACKSON (CONT’D) Wells. A moment of relief followed instantly by crushing sadness. She looks to Cece who clearly already knew. JACKSON (CONT’D) Just over an hour ago.   Vital signs spiked, then flatlined. Abby knows this is bad.   Wells isn’t some delinquent who would take off his wristband and he wasn’t injured during landing.   For the first time, outwardly anyway, she acknowledges her deepest fear: she sent her daughter to die. Cece takes her hand.   Takes Abby a moment to push past the fact that her world is crashing down, but she manages it... ABBY Jackson, listen to me.   Kane will wait until after he’s sworn in to begin reducing the population. CECE Come on, Ab, the Chancellor could still make it. ABBY Even if he does, I won’t be here to argue against Kane.  55  (MORE) TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "(back to Jackson) That has to be you now. JACKSON He already asked for recommendations. ABBY Good.   No, that’s good.   First thing you’ll do is make the case for a lottery.   If council members’ families can be taken, they’ll be less likely to rubber-stamp Kane’s agenda.   You understand? Jackson nods, amazed by her strength as they reach the symbol of the Ark on the floor directly below the hangar bay door. This is where they leave her.   Still, Abby’s not done... ABBY (CONT’D) Listen to me.   While the council drags its feet, you do everything you can to reestablish contact with the kids. Jackson gets pulled away by a guard.   Before the same can happen to Cece, she lunges forward, hugging her friend. ABBY (CONT’D) (fighting back tears) ... Watch over Clarke for me? Cece nods, WEEPING as she’s dragged away and Abby is left there all alone.   Terror seeps in, but, remarkably, she buries it, calling after them... ABBY (CONT’D) Jackson!   Use the wristbands! There may be a way to reverse engineer them for communication. Talk to Sinclair in engineering. Nod if you understand! Jackson nods as he and Cece are ushered through a door into an observation room.   Door SLAMS.   Abby is now utterly alone. INT. OBSERVATION ROOM - MINUTES LATER The witnesses to the execution stand before a wide window. Abby stands alone in a pillar of light across the bay. Prayers are MUTTERED.   Tears on every face, save Kane’s.  56  ABBY (CONT'D) TV Calling - For educational purposes only Another beat and he nods to the executioner.   The man lifts his hand, about to bring it down on the button when the door behind them bursts open. Everyone turns to see Chancellor Jaha in a wheelchair being pushed by a very out of breath ORDERLY.   There are tubes and wires coming out of him and he is visibly frail, but anger gives him the strength to stand. He rises in front of an already shaken Kane, then... CHANCELLOR JAHA Dr. Walters is pardoned. Relief soars.   Kane holds his stare. CHANCELLOR JAHA (CO",
      "dialogue_count": 0,
      "word_count": 1558
    }
  ]
}