{
  "slug": "the-edge-of-seventeen-2016",
  "title": "the edge of seventeen",
  "genre": "drama",
  "format": "film",
  "scenes_count": 5,
  "characters_count": 3,
  "characters": [
    "NADINE",
    "DARIAN",
    "ERWIN"
  ],
  "total_words": 14800,
  "total_dialogue": 8,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CASINO MORONGO HOTEL ROOM - A LITTLE LATER Nadine does a dance, sloshing booze into their cups. NADINE Who is awesome?! Who is just one big fat awesomesauce sandwich with extra awesome dressing? DARIAN Okay, you did good, shut up. KRISTA (checks the mini-fridge) We need a mixer, what's in here? NADINE Not me, I have gum. DARIAN Gum? Are you retarded? You can't use   gum   as a mixer. NADINE Yes you can, you mix it with your spit the old fashion way. I've seen it done on TV like a thousand times. DARIAN No you haven't, who's ever done that even once? NADINE Like basically everyone who's not a big gigantic pussy, okay! (knocks back a shot, grimaces) GOD THAT'S DELICIOUSLY MINTY!!! KRISTA Nadine, you better pace yourself. NADINE (pouring herself another) Thanks, mom! INT. CASINO MORONGO HOTEL BATHROOM - LATER Nadine is curled up in the bathtub, hammered and suddenly in a very dark place.  19.  (CONTINUED)",
      "characters": [],
      "action_text": "NADINE You know what my problem is in life? I've really been thinking about this a lot... It's my head. Krista leans against the opposite wall, only slightly less inebriated. KRISTA What's going on in your head? NADINE No, no, my actual head. My skull. It's too small. Before I thought my nose was too big, but now I'm thinking it's actually just that my head's too small. It makes me look ridiculous. I think that's why no guy I like ever likes me, like Hot Soccer Dan. And here's the really fucked up part, okay? There's no surgery for it. Even if I win the lotto or become the first female president, I'll still be stuck with a weird little shrunken Beetlejuice head for the rest of my life. And then I think... why even go on? KRISTA You do this every time you drink, Nadine. Get all depressed. NADINE No I do not! I do not! Yes I do. I do, I'm a depressed person with a big nose and a tennis ball head and that's the truth. I'm gonna barf right here down the bathtub drain. KRISTA Okay. Nadine leans over and pukes. NADINE That was good. And you wanna know the other thing, too? KRISTA What? But when Krista looks over, Nadine's passed out cold. She rolls up a towel, wedges it under Nadine's head as a pillow.  20.  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 395
    },
    {
      "scene_number": 2,
      "slugline": "INT. CASINO MORONGO HOTEL ROOM - CONTINUOUS Darian lies on the bed, watching TV, pretty wasted. Krista stumbles in, trying to keep her balance. KRISTA What are you doing? DARIAN I'm boning a Pygmy goat. KRISTA Um, okay. DARIAN Hey, you know that joke I told earlier about the Pygmy goat and how I was boning it, but I really wasn't because I was watching Antique Roadshow instead? KRISTA Yeah? DARIAN That was hilarious. KRISTA It was pretty good. DARIAN Come're. She walks over and Darian fills up her cup, then his. DARIAN (CONT’D) Cheers. My sister passed out? KRISTA I think she had too much. DARIAN Do me a huge favor and take my socks off for me? KRISTA Ew, no. DARIAN Please. I'd do it myself but they're so far away from my hands.  21.  (CONTINUED)",
      "characters": [
        "NADINE",
        "DARIAN"
      ],
      "action_text": "KRISTA I'm not touching your gross socks, Darian. DARIAN I'll give you a million dollars. KRISTA You don't have a million dollars. DARIAN I'll rob a bank. KRISTA You'll go to jail. DARIAN Then I'll-- OH SHHHHIT! KRISTA What? DARIAN Oh, no way. I'm gonna kill her. KRISTA What? He sits up and turns his head around to reveal: Nadine's GUM is stuck in the back of his hair. Krista starts cracking up. DARIAN I knew I smelled peppermint! Aw crap, it's all matted in there, too. KRISTA You need peanut butter. DARIAN Where am I gonna get peanut butter? KRISTA You need ice. Hold on. Come here. She stumbles over to the ICE BUCKET, brings it back and plops down right next to him on the bed. DARIAN (re: her sudden close proximity) Well,   okay then.  22.  CONTINUED:  (CONTINUED) KRISTA Oh stop it. DARIAN I'm not saying anything. KRISTA Shhh. Hold still. She applies an ice cube to the gum. DARIAN Did it work? KRISTA It's been   one   second. DARIAN (one more second) Did it work now? KRISTA I'm gonna kill you. He smirks. DARIAN Wow, I've never seen you this up close. It's like I flipped over to Krista HD. Helloooooo, pores. KRISTA (feeling exposed) Oh god, jeez. DARIAN No, it's interesting. You have a major shitload of freckles, too. KRISTA Thanks a lot. DARIAN You're Irish, right? (singing, high-pitch Irish accent)  Oh Danny boy, the pipes, the pipes are callin'...  That song's Irish, isn't it? (awful \"big band\" voice)  From glen to glen, and down the mountain side.  That was with a Sinatra twist that time.  23.  CONTINUED: (2)  (CONTINUED) KRISTA It's amazing you're not in glee club. DARIAN I thought about it, but then I was like, you know, the hours, the commitment, having to tell my mom I'm gay... Krista practically spits up her drink laughing. She takes some of his hair with her. DARIAN (CONT’D) Ouch, Jesus, you just ripped out half my scalp! KRISTA (still laughing) Sorry sorry sorry! He watches her laugh, liking this side of her. DARIAN Oh my god, and you totally laugh like F",
      "dialogue_count": 3,
      "word_count": 5663
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CARLY CORVETTI'S HOUSE PARTY / BACKYARD - CONTINUOUS As Krista and Darian make their way through the party, people eye her up and down, checking out Darian's new catch. If   he  likes her, she must be hot. KRISTA I might be paranoid and just need medication, but I feel like everyone here is staring at me. DARIAN They are. Follow me, I'm gonna grab another beer. As she follows him through the crowd, the SOPHOMORE GIRLS who made the   Twins   comment to Nadine, gaze at her, mesmerized. SOPHOMORE GIRL #1 You're so beautiful, your hair's so awesome! SOPHOMORE GIRL #2 I know, and I love how you own your freckles and just said screw it to orthodontia! KRISTA Uh, thanks... One of them snaps a cell-phone pic of her, enamored. INT. CARLY CORVETTI'S HOUSE PARTY - CONTINUOUS Darian cracks open a beer, hands her one. Just then, Heather runs over from the makeshift dance floor, grabs Krista. HEATHER Come on, come dance with us! Before she knows it, she's with a big group of POPULAR GIRLS all dancing in a circle. They cheer, pushing her into the center of it. She's tentative at first, but starts to let go, having a blast with this newfound popularity. INT. SOUPLANTATION - A LITTLE LATER Nadine and Erwin make their way down a giant SOUP BUFFET. NADINE Thanks, I really appreciate it. You didn't have to get all dressed up, honestly.  53.  (CONTINUED)",
      "characters": [
        "ERWIN",
        "NADINE"
      ],
      "action_text": "Erwin's in a FULL-ON SUIT & TIE. He looks like he's going to a wedding. And he's incredibly nervous. ERWIN Oh, no, no, I was just -- I was just dressed like this when you called. Nadine nods, not buying it. She moves down the buffet line. NADINE Mmm, clam chowder. ERWIN Ooh, I love clam, I could eat clam all night long. (eyes bulge, realizing) No! I didn't mean it like that. I seriously meant the real clam, not the other clam! No, I mean the other one is fine, too, it's great! (beat) What I'm trying to tell you is that I like shellfish and I also like  the other shellfish   -- at least hypothetically -- but only one of those things would I announce at full volume in the Souplantation. Nadine just looks at him. NADINE Erwin? ERWIN Yes? NADINE Let's not have anymore caffeine tonight. ERWIN (nods) Just water. EXT. LA HABRA CORN FESTIVAL - A LITTLE LATER Erwin munches on a GIANT EAR OF CORN while Nadine eats CHOCOLATE COVERED BACON. They wait in line for the FERRIS WHEEL. Erwin's relaxed a little.  54.  CONTINUED:  (CONTINUED) NADINE You know, I thought chocolate bacon would be bad, and I'm surprised to say: It's actually worse than that. It's just a total miss on every level. ERWIN I'm sorry. NADINE It's not your fault. Unless you invented it? ERWIN No. That was not me. NADINE That was a joke. I didn't actually think you invented chocolate bacon. ERWIN Okay. It's their turn. They buckle up in the FERRIS WHEEL. ERWIN (CONT’D) Here we go... NADINE (as it takes off) Wooooooo! They reach the top. ERWIN Wow, look at that view... TREES and BUILDINGS are completely blocking the view. Nadine laughs. NADINE I think I can see Catalina... Erwin smiles. They settle in. NADINE (CONT’D) So, tell me something while we're on the ferris wheel. What are your hopes and dreams, Erwin? What do want out of life?  55.  CONTINUED:  (CONTINUED) ERWIN Oh, I don't know. I'm just an average guy I guess. NADINE But if you had to expand for the two minutes we're on this ride. ERWIN Well, I guess I ",
      "dialogue_count": 2,
      "word_count": 2224
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SHHS PARKING LOT - AFTER SCHOOL Nadine's still singing and snapping as she walks toward the SCHOOL BUS pick-up. NADINE  Come on Eileen, oh I swear what he means, at this moment you mean eeeeevverythinnnnng...  Just then, she spots Krista across the parking lot, kissing Darian goodbye. He heads off to football practice, and jumps into Heather's waiting CONVERTIBLE with FOUR OTHER POPULAR GIRLS. Heather turns up her music and the girls hoot and cheer as they screech off. Nadine suddenly feels like absolute crap, a lump gathering in her throat. Not only is her plan not working -- it's completely backfiring. INT. NADINE'S GARAGE - LATER Darian is lifting weights in the garage when Nadine bursts through the door, announces: NADINE Krista has dandruff! DARIAN What? NADINE There's a Costco-size bottle of  Head and Shoulders   in her shower, if you don't believe me. If she doesn't use it? Flakes the size of shaved coconut. Not exaggerating. Darian sets down the weights, sensing what this is. DARIAN Nadine, I know exactly what you're doing and it's not-- NADINE In the 7th grade, she had chronic bacne. He starts pushing her out of the garage. DARIAN Get out.  65.  (CONTINUED)",
      "characters": [],
      "action_text": "NADINE People used to call her   Unusually Lot Of Bacne Person.   Nobody even took the time to give her a clever name! DARIAN Nadine-- He's forcing her out the door. NADINE One time, she ran out of pads and used her dad's tube sock! He's got her out of the garage. DARIAN G'bye! NADINE FRESHMAN YEAR SHE POOPED IN A TUPPERWARE CONTAINER! This tidbit makes Darian pause a beat. Then he slams the door on her. INT. NADINE'S BEDROOM - THAT NIGHT Nadine tosses and turns in bed, unable to sleep because she can hear Darian on the phone with Krista. He's giggling and doing a little cutesy-wootsey voice. She finally throws a BOOK at the wall. NADINE You've been on the phone for 2 hours. And stop doing that baby voice, you're a grown freaking man! He just giggles louder. She gives up, switches on her TV, turns the volume up to drown him out.   Flipping through channels, she lands on the 1970's film,   Carrie.  She's about to change it, but then something about it intrigues her... INT. SHHS/HALLWAY - MORNING Nadine finds Krista at her locker.  66.  CONTINUED:  (CONTINUED) NADINE I need to talk to you about something. KRISTA Oh you mean like an actual conversation? Not just rushing me off the phone or disappearing on me? NADINE I know, I'm sorry. But I figured something out last night. Something big. KRISTA Okay. NADINE I'm worried you'll freak out when I tell you, though, because it's really unfair to you and it might involve pig's blood. KRISTA It might involve   pig's blood?  NADINE And worse possibly. Fires. John Travolta's car exploding. KRISTA What the hell are you talking about, Nadine. NADINE Have you ever seen the movie,  Carrie?  KRISTA I've never even heard of that movie. NADINE So there's this girl, Carrie, and she's all dicked up 'cause her mom's a psycho and makes her read the bible 20 hours a day or some shit, I missed the beginning. But the point is, there are these prick popular kids who think it's funny to befriend her and act like she's one of them.  67.  CONTIN",
      "dialogue_count": 0,
      "word_count": 3161
    },
    {
      "scene_number": 5,
      "slugline": "INT. NADINE'S HALLWAY - MOMENTS LATER She drags herself down the hallway, into -- INT. NADINE'S BEDROOM - CONTINUOUS Her room is dark. She flips on her lights and sees Krista sitting on her bed, waiting for her. NADINE Ew. That was creepy! KRISTA Give me a chance to explain. NADINE I don't want hear it. KRISTA I was gonna tell you, I was gonna ask you to go with us. NADINE Oh kiss my ass! We had plans and you just flushed them down the toilet without a second thought! KRISTA That's not true, I had the suits made and everything, I was planning on it and then-- NADINE What? KRISTA And then-- NADINE And then   what,   Krista? KRISTA And then I realized I don't want be a freaking hotdog for prom! I don't want to act like it's just some big joke to me! I want to wear a dress and do my hair and I want to go with an actual   date , not   you ! This hits Nadine where it hurts. NADINE Get out.  83.  (CONTINUED)",
      "characters": [
        "NADINE",
        "ERWIN"
      ],
      "action_text": "KRISTA I didn't mean it like-- NADINE GET OUT OF MY ROOM!!! Nadine grabs her by the shirt and pushes her towards the door. Krista screams. Darian opens his bedroom door. DARIAN What the hell's going on?! Nadine keeps pushing her down the hallway. Krista starts to cry, runs off down the stairs. The front door SLAMS. DARIAN (CONT’D) Jesus! What is your problem? Nadine fights back tears. NADINE Why'd you have to do it, Darian? You have everything in the world, why'd you have to take my one friend, too? Darian pauses. He never thought of it like this. DARIAN Nadine... She runs back to her room, shuts the door. FADE TO: EXT. NORFOLK POND - DAY Where we left off from the opening scene. Nadine unzips her large DUFFLE BAG and begins to unload the contents, including TWO MASSIVE FOAM HOTDOG SUITS. She gathers it all up in her arms, ready to toss it in. A passing JOGGER sees her. JOGGER Excuse me, that's polluting. You can't do that. NADINE What, you're gonna call the cops on me? Go 'head. He takes his CELL PHONE out, starts dialing.  84.  CONTINUED:  (CONTINUED) That's it -- there's no going back now. FADE TO: INT. CHEMISTRY CLASS - DAY The whole class has their MICROSCOPES out for an experiment where they put a piece of hair on a slide and alter it with chemicals. ERWIN Hey, um, come check out this crazy thing I found in my microscope. NADINE What do enzymes do to the hair again? Turn it to goo or something? ERWIN Sorta, but just come look real quick. You have to see this. Nadine goes over and looks into his microscope. Spelled out in pieces of ERWIN'S HAIR are the words   WILL YOU PLEASE GO TO PROM WITH ME?  NADINE Oh my god. How'd you do that?! Erwin smiles, super proud of himself. ERWIN It was extremely hard, I worked on it for three weeks. NADINE Wow, that's amazing! ERWIN I know it's last minute, but... will you? Erwin's smile is massive and sincere. Nadine suddenly feels uncomfortable. NADINE Oh. Um... Erwin, that's so nice of you... His smile starts to fall, sensing ",
      "dialogue_count": 3,
      "word_count": 3357
    }
  ]
}