{
  "slug": "the-founder-2016",
  "title": "the founder",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 20653,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ED’S DRIVE-IN - KITCHEN - DAY The kitchen of a drive-in restaurant outside St. Louis. It’s 1954. Traveling salesman RAY KROC (52) stands before a sample MIXING MACHINE, making his pitch to the OWNER. RAY KROC Now, I know what you’re thinking: “What the heck do I need a five- spindle for? I barely sell enough shakes to justify my single spindle.” Right? Wrong. (BEAT) Mr. Paulsen, are you familiar with the notion of the chicken and the egg? I mention it because I believe it’s applicable here: Do you not need a Multimixer because you’re not selling enough milk shakes? Or are you not selling enough milk shakes because you don’t have a Multimixer? I firmly believe it’s the latter. You see, your customers, they know that if they order a shake from your establishment, it’s going to be a terrific wait. They’ve ordered one before, and by golly they’re not gonna make that mistake again. But if you had, say, a Prince Castle- brand five-spindle Multimixer with patented direct-drive electric motor, you could greatly increase your ability to produce delicious, frosty milk shakes fast. And before long, mark my words, dollars to donuts, you’d be selling more of those suckers than you can shake a stick at. Increase supply, demand will follow. Chicken and the egg. You follow my logic? Of course you do. You’re a bright, forward- thinking fella who knows a good idea when he hears it. (BEAT) So whaddaya say? ON THE OWNER-- pondering thoughtfully. OWNER Nah.   (BEAT) Thanks anyway.",
      "characters": [],
      "action_text": "EXT. ED’S DRIVE-IN - PARKING LOT - SHORT TIME LATER Kroc lugs the heavy Mulitmixer back to his car. He lifts it into the trunk, wincing from his bad back. INT. KROC’S CAR - MOMENTS LATER Kroc sits in his car checking his APPOINTMENT BOOK. His next sales call:   DEE DEE’S DRIVE-IN - 1 P.M.  He checks his watch. It’s   12:05 . He turns on the car, pulls into a customer spot in front of Ed’s Drive-In. He looks at the MENU BOARD, taking in the vast, seemingly random assortment of items: BBQ beef sandwiches, hot tamales, peanut butter and jelly sandwiches, chili dogs, etc. INT. KROC’S CAR - SHORT TIME LATER Kroc sits in his car, waiting for his food. He looks at his watch. It’s   12:50 . He lets out a heaving, exasperated sigh. KROC’S POV, the view out his windshield: a rowdy TEEN-HANGOUT SCENE. Rock-and-roll blasting from cars; female CARHOPS on rollerskates dodging grabby male patrons; leather-jacketed, cigarette-smoking hoodlums smacking each other around. Kroc is the oldest customer by a mile--and seemingly the only one with anywhere to be. He HONKS his horn, summoning his CARHOP. She comes skating over holding a tray of Cokes. RAY KROC Miss, how much longer? CARHOP GIRL Should be any minute. RAY KROC You said that 20 minutes ago. CARHOP GIRL I’m sorry, we’re real-- She JUMPS-SQUEALS, startled. The tray of Cokes goes flying into the car, SPILLING ALL OVER KROC’S LAP. Several glasses and plates fall on the ground, SHATTERING. Carhop Girl spins around, sees a GUY behind her cracking up. He just pinched her butt.  2. CARHOP Dennis! (re: Kroc, soaked) Look what you made me do! DENNIS Sorry, gramps. Dennis scampers off toward his pack of laughing friends. The carhop goes chasing after him, mad but not actually mad. ON KROC-- looking down at the pool of bubbly brown liquid in his lap. He HONKS, leans out the window. RAY KROC Could I get some napkins? No one hears him. INT. MOTEL ROOM - NIGHT ANGLE ON the pants drying on the shower’s curtain rod. RAY KROC (O.S.) It’s going ",
      "dialogue_count": 0,
      "word_count": 1052
    },
    {
      "scene_number": 2,
      "slugline": "INT. KROC’S CAR - SHORT TIME LATER Kroc is pulled up to a customer spot in front of Joe’s Drive- In. The scene before him is very much like the one at Ed’s Drive-In, a riot of teenage rowdiness. He looks at his watch. It’s   12:45 . He HONKS, shouting out to no one in particular: RAY KROC Could someone tell me when my... He trails off as a female CARHOP approaches with a tray. She hooks the tray onto his car door. CARHOP Enjoy. She heads off. He lifts the cover off his plate, primed to dig in. His face falls at the sight of the hamburger beneath. He leans out the window, honks. RAY KROC I ordered the barbecued beef! He’s howling into the void. EXT. MERRIMAN’S DRIVE-IN - LATER Another drive-in. Kroc with the OWNER. RAY KROC Mr. Merriman, are you familiar with the notion of the chicken and the-- OWNER No, thank you. The Owner disappears into the restaurant. Kroc, shut down, lugs the Multimixer over to his nearby car, heaves it into the trunk. He takes a swig from his FLASK. EXT. MERRIMAN’S DRIVE-IN - MOMENTS LATER Kroc at a pay phone, dialing a long-distance number. JUNE MARTINO (O.S.) Prince Castle, how may I help you? RAY KROC Hi, June.  6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 217
    },
    {
      "scene_number": 3,
      "slugline": "INT. PRINCE CASTLE SALES - CONTINUOUS A modest office in a Chicago high-rise. At the reception desk is secretary JUNE MARTINO. (Intercut as necessary.) JUNE MARTINO Ray. How’s it going down there? RAY KROC Fine, swell, lot of interest. JUNE MARTINO That’s terrific. Hold on, I’ll fetch your messages. She grabs a pile of messages off the desk. JUNE MARTINO (CONT’D) Let’s see: Gene Rafferty from United Aluminum, says he needs to reschedule Friday... Ed Nance calling again about the refund... a lady from March of Dimes about a donation... oh, and we got an order. Six. RAY KROC Six? JUNE MARTINO Some drive-in out in California. RAY KROC One place? That’s impossible. JUNE MARTINO I’ve got the slip right here. RAY KROC You must’ve misunderstood. Give me the number, I’ll straighten it out. EXT. MERRIMAN’S DRIVE-IN - SHORT TIME LATER-- Kroc pours a few nickels into the pay phone, dials a number off his wrist. YOUNG EMPLOYEE (O.S.) Hello? RAY KROC Good afternoon. May I please speak to the owner?  7.",
      "characters": [],
      "action_text": "YOUNG EMPLOYEE (O.S.) Which one? RAY KROC I’m sorry? YOUNG EMPLOYEE (O.S.) Dick or Mac? RAY KROC Um, whomever’s available. The guy puts the phone down, heads off. Through the receiver, Kroc hears the sounds of an insanely busy--and efficient-- kitchen.   “Order up!”... “I need six fries!”... “Patties up!”  DICK MCDONALD (O.S.) This is Dick. RAY KROC Hello Dick, this is Ray Kroc from Prince Castle Sales. I’m phoning because someone there placed an order with us for some Multimixers. DICK MCDONALD Yes, yes, that was me. How soon can you get ‘em out here? RAY KROC Well, that’s actually why I was calling. I believe there may have been a miscommunication between-- In the background, someone SHOUTS SOMETHING to Dick. DICK MCDONALD Freezer! Top shelf, left side! (back to Kroc) Sorry. RAY KROC My secretary’s under the impression you wanted six. DICK MCDONALD You know what? I think that’s a mistake. RAY KROC That’s what I figured. What kind of drive-in would be making 30 shakes at a--  8. DICK MCDONALD Better make it eight. ON KROC-- flabbergasted. Another background SHOUT. DICK MCDONALD (CONT’D) What’s that, Al? There’s a brand- new box in the storeroom! (to Kroc) Look, now isn’t the best time. RAY KROC I’m sorry, I’m still a bit-- DICK MCDONALD You know where to send ‘em, right? San Bernardino, California. Corner of 14th and E. RAY KROC To anyone in particular? DICK MCDONALD Just the store is fine. McDonald’s. Another BACKGROUND SHOUT distracts Dick. DICK MCDONALD (CONT’D) I gotta go. Just get those mixers out here ASAP, okay? Thanks!  Click . Kroc stares at the receiver. What the hell was that? EXT. MERRIMAN’S DRIVE-IN - MOMENTS LATER Kroc stands over a U.S. ROAD MAP on the hood of his car. He unfolds it, opening the map westward. (Note: This part of the map is not well-worn like the Midwest; it’s virgin territory for Kroc.) Kroc’s eyes drift westward to California. They land on a small town 60 miles east of Los Angeles: San Bernardino. Kroc looks at the whole country. He",
      "dialogue_count": 0,
      "word_count": 556
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ROUTE 66 - DAY Kroc driving west on Route 66. Cars, the open road, a limitless horizon. The sky, the country, the whole world seems to open up. His heart swells with possibility. The vastness excites his brain. This must be how Lewis & Clark felt. And then... EXT. SAN BERNARDINO CITY LIMITS - ROUTE 66 - DAY Kroc arrives in San Bernardino. A drab, dusty little town on the edge of the desert. Hardly the pot of gold at the end of the rainbow he was expecting. He continues along Route 66, heading toward the center of town. SHORT TIME LATER-- Kroc driving. He sees the line before he sees the restaurant. A long line, hundreds of people, snaking toward a HAMBURGER STAND in the distance. ON KROC-- taking in the strange sight of people out of their cars, queued up in a line leading toward a self-service window. It’s a distinctly FAMILY CROWD, lots of parents with their children. Not a teenage delinquent in sight. He parks, gets out. Unsure what to do, he gets in the line. He looks off at the restaurant, checks his watch. It’s   1:15 . WOMAN (O.S.) Don’t worry. It moves fast. ANGLE ON the WOMAN in front of him. No sooner does she say this than the line moves. Kroc shuffles forward 10 feet. SHORT TIME LATER-- Kroc in line, significantly further along. He looks at his watch. It’s   1:19 . EXT. MCDONALD’S - SHORT TIME LATER Kroc at the front of the line. He checks his watch.   1:23 . CASHIER (O.S.) Welcome to McDonald’s, may I take your order?  10.",
      "characters": [],
      "action_text": "Kroc looks up, sees a CASHIER looking at him with a friendly smile. Like all the other cashiers, he’s male and wholesome as apple pie. RAY KROC Um, yes... He looks at the MENU BOARD. It has just FOUR ITEMS: burgers, fries, shakes, and Coca-Cola. A radical departure from the typical sprawling drive-in menu. RAY KROC (CONT’D) Hamburger, fries, and a Coca-Cola. CASHIER 45 cents, please. Kroc hands him two quarters. CASHIER (CONT’D) And five cents is your change. Kroc barely has time to put the nickel away when-- CASHIER (CONT’D) Here you are. The cashier hands him a paper sack. Kroc looks at it with confusion. RAY KROC What’s this? CASHIER Your food. RAY KROC I just ordered. CASHIER (shrugs, smiles) And now it’s here. Kroc peers into the bag. Lo and behold, inside is a burger, fries, and a Coca-Cola. He sees it’s all wrapped in PAPER. RAY KROC (”Where are the”--) Silverware? Plates? CASHIER You just eat it straight out of the wrapper. Then throw it all out.  11. ON KROC-- bewildered. He takes the bag, unsure what to do. RAY KROC So now I bring it back to my car? CASHIER Most folks do. Or you could eat it in the park, at home... anywhere you like. Kroc nods. This is all so strange to him. He turns, heads toward his car. On the way, he spots an EMPTY BENCH. He impulsively takes a seat. Kroc reaches into the bag in his lap. He takes out the hamburger, noting the paper packaging. He unwraps the burger, looking at it, sniffing it. It looks and smells wonderful. As he’s about to take a bite, out the corner of his eye he notices in a nearby car... a GORGEOUS BLONDE. KROC’S POV: The blonde, biting into a hamburger. As she chews, a look of ecstasy comes over her face. She closes her eyes, her head tipping back a bit, borderline orgasmic. ON KROC-- staring at the blonde. MOTHER (O.S.) May we? Kroc is shaken out of his reverie by a FAMILY OF FOUR looking to sit on the bench. He slides over, making room. MOTHER (CONT’D) Thank you. Kroc’s attention shifts from the blonde to the fam",
      "dialogue_count": 0,
      "word_count": 4055
    },
    {
      "scene_number": 5,
      "slugline": "INT. KITCHEN - CONTINUOUS ETHEL (53) is at the table, eating dinner by herself. RAY KROC (O.S.) Ethel! Kroc comes bursting in, burning with excitement. RAY KROC (CONT’D) I’ve seen the future! Ethel’s face falls. ETHEL KROC Again? RAY KROC I saw a restaurant, Ethel. It’s like nothing you’ve ever seen. They’ve got this system, the Speedee System... ETHEL KROC Ray... RAY KROC Just hear me out. ETHEL KROC I’m too old for this. RAY KROC This place, it’s like something sprung from the mind of Henry-- ETHEL KROC I can’t do it. Not again. RAY KROC Don’t you want to be a part of greatness? ETHEL KROC I want to be part of a cruise. (BEAT) All our friends are taking trips, enjoying their golden years. And us, we’re still scrapping and scraping like a couple of 25-year- olds. When do we get to start living, Ray? When do we finally get to start enjoying our lives?  31.",
      "characters": [],
      "action_text": "RAY KROC Ethel, this place-- ETHEL KROC It’s   revolutionary . RAY KROC (bristles at her sarcasm) As a matter of fact... ETHEL KROC It’s never going to get any better, Ray. We’re never going to have anything more than we have right now. And that’s okay. (BEAT) What’s not okay is us wasting our lives reaching for some brass ring we’re never going to grab. RAY KROC (flash of anger) Maybe if I had a wife who had an ounce of vision. Who gave me an ounce of support. ETHEL KROC Support? Support? This sets her off-- ETHEL KROC (CONT’D) All I’ve done is support you! I’ve had your back through thick and thin, through one cockamamie idea after another. The wax cups, the Fold-A-Nook, the Multi-Mixer, on and on, every last one. And you have the nerve to say I don’t support you? RAY KROC (backing off, chastened) I’m sorry. ETHEL KROC I’ve believed in you, Ray. Our whole marriage. Long past the point any rational, thinking person would’ve. RAY KROC You’re right.  32. ETHEL KROC I’ve sacrificed, I’ve saved. Made do, gone without. My belt’s so tight, I’m out of notches. RAY KROC You’re right. ETHEL KROC “Support”? (BEAT) How dare you? Kroc just stands there in shamed little-boy silence. EXT. MOVIE THEATER - SHORT TIME LATER Kroc steps to the ticket window. RAY KROC One ticket, please. The marquees reads   MAGNIFICENT OBSESSION . INT. MOVIE THEATER - SHORT TIME LATER Kroc sits in the theater, the light of the screen flickering off his face. In his hand is his flask. He takes a discrete swig. INT. PRINCE CASTLE SALES - KROC’S OFFICE - CONTINUOUS June Martino watches Kroc pace, ringing phone to his ear. EMPLOYEE (O.S.) McDonald’s Hamburgers. RAY KROC Dick McDonald, please. EMPLOYEE (O.S.) He’s not available at the moment. RAY KROC Mac, then. The employee puts the phone down, goes off to check. Through it, Kroc hears what sounds like a BIG CROWD.  33. EMPLOYEE (O.S.) I’m sorry, he’ll have to call you back. We’re real busy right now. Kroc glances at his watch, puzzled by the commotion. ",
      "dialogue_count": 0,
      "word_count": 4477
    },
    {
      "scene_number": 6,
      "slugline": "INT. KROC’S OFFICE - DAY Rosenblatt and his wife MYRA (22) sit across from Kroc. Kroc slides a pen and contract to them. ON LEONARD AND MYRA ROSENBLATT-- looking at each other. Excited, hopeful. A young couple, staking everything on a shared dream. Myra gives his hand a squeeze. MYRA ROSENBLATT I believe in you. LEONARD ROSENBLATT Us, Myra. ON KROC-- watching the interaction with admiration--and a touch of jealousy. EXT. MCDONALD’S (THE ROSENBLATTS’) - DAY (A FEW MONTHS LATER) The Rosenblatts’ new McDonald’s in Waukegan, IL. Festive bunting lines the front, a banner proclaiming   GRAND OPENING TODAY!   A line of the curious and hungry forms outside. INT. KITCHEN - CONTINUOUS The hustle and bustle of a smooth-running kitchen. It’s a model of cleanliness and professionalism, everything the country clubbers’ locations were not. ON KROC-- in the middle of it all, observing, highly pleased. LEONARD ROSENBLATT (O.S.) Let’s go, chop-chop! ON ROSENBLATT-- moving around the kitchen, barking out orders, making sure everything’s just so. MYRA ROSENBLATT (O.S.) Here y’go, champ! Kroc looks toward the front of the store, where he sees... Myra, handing out lollipops to children. She’s wearing a red apron that says   MCDONALD’S --and a big smile on her face. Kroc goes over. She hands him a lollipop. MYRA ROSENBLATT (CONT’D) It’s normally ten and under, but for you I’ll make an exception.  56.",
      "characters": [],
      "action_text": "Kroc looks at the lollipop. Tied to it is a ribbon with the store’s address on it. He couldn’t be more impressed. RAY KROC (PRE-LAP) You shoulda seen ‘em. INT. KROC’S HOUSE - BEDROOM - THAT NIGHT Kroc is getting undressed for bed, buzzing. RAY KROC You’ve never seen a pair of dynamos like these two. ON ETHEL-- in bed, half-listening, about to fall asleep. RAY KROC (CONT’D) He’s in back, running the kitchen, she’s up front, passing out suckers to the kiddies. Like a real team. (BEAT) It’s wonderful. Don’t you think? No reply from the sleepy Ethel. He gives her a poke. RAY KROC (CONT’D) Don’t you? ETHEL KROC Don’t I what? RAY KROC Think it’s wonderful. (angling) Two people, side by side, working together... ETHEL KROC Are you trying to hire me, Ray? RAY KROC You say you never see me anymore. This is a perfect way. ETHEL KROC I don’t want to work for you. RAY KROC With me. Husband and wife, united in labor and in life. You know? ETHEL KROC I mean...  57. ON ETHEL-- pondering, really struggling with the notion. ETHEL KROC (CONT’D) Not really. A stretch of tense, edgy silence. RAY KROC I made us supper plans for Friday. ETHEL KROC I don’t suppose you rejoined Rolling Green. RAY KROC No.   (gazes off) Someplace far better. INT. VFW HALL - EVENING ANGLE ON a big banner across a wood-paneled wall:   VFW POST 482 - FRIDAY NIGHT POTLUCK DINNER & BINGO  PAN DOWN to a long table lined with couples. Blue-collar types, several rungs down the social ladder from Rolling Green. And younger, average age closer to 30 than 60. In the midst of them, we find Ray and Ethel. They’re dressed deliberately “blue collar”, matching the people around them. ON ETHEL-- edgily pushing her meatloaf and mashed potatoes around her plate. RAY KROC (O.S.) So, Art, what do you do for a living? Kroc is chatting up the COUPLE (mid-20s) next to them. ART WOLODARSKY Well, I had a little plumbing business going for a while after getting out of the service. Now I sell vacuum cleaners. And give piano lessons on",
      "dialogue_count": 0,
      "word_count": 4650
    },
    {
      "scene_number": 7,
      "slugline": "INT. KROC’S OFFICE - DAY Kroc stares at the ever-growing mountain of bills on his desk. His gaze drifts to a letter from ILLINOIS FIRST FEDERAL marked   FINAL NOTICE . INT. ILLINOIS FIRST FEDERAL - DAY Kroc is sitting with Harvey Peltz, his home-mortgage officer. RAY KROC You’ve got to extend my line. HARVEY PELTZ Until you build more equity in your home or pay down the loan... RAY KROC My business is booming. HARVEY PELTZ Unfortunately, that’s immaterial. RAY KROC Thirteen locations in nine states! HARVEY PELTZ It’s a home-equity loan. RAY KROC Then give me a business loan. REVEAL, on the other side of a partition: a patrician, silver- haired BUSINESSMAN sitting across from an empty chair, listening in as he waits for his banker to return. HARVEY PELTZ These 13 locations. They’re yours? RAY KROC Meaning? HARVEY PELTZ You own them? RAY KROC I mean, not in the strict sense. HARVEY PELTZ So then what are your assets? RAY KROC Mine personally?  83.",
      "characters": [],
      "action_text": "HARVEY PELTZ It is your business, correct? You own it? RAY KROC Not technically, per se. The businessman cringes for the poor, floundering schlub on the other side of the partition. RAY KROC (CONT’D) I’m the head of franchising. I’m the one behind all the growth. HARVEY PELTZ That’s all well and good, but-- RAY KROC Have you ever been to a McDonald’s? The name catches the businessman’s ear. RAY KROC (CONT’D) We’ve got three stores right here in the Chicagoland area. Perhaps if you swung by, took a look. HARVEY PELTZ That’s quite alright. RAY KROC I’d be happy to give you a tour, give you a better sense of-- HARVEY PELTZ Thank you. I’ve got the gist. EXT. ILLINOIS FIRST FEDERAL - MOMENTS LATER Kroc exits the bank in defeat. He slumps off toward his car. BUSINESSMAN Mr. Kroc. Kroc turns, sees the man approaching. Kroc looks him over. Dressed in an impeccably tailored suit, he has the finished, cosmopolitan air of a New Yorker. RAY KROC Can I help you? BUSINESSMAN No. But perhaps I can help you.  84. He hands Kroc a business card. Kroc looks at it:  HARRY J. SONNEBORN - VICE-PRESIDENT OF FINANCE - THE TASTEE- FREEZ CORPORATION  RAY KROC Thanks. We’re perfectly happy with our current supplier. Kroc hands back the card, starts to walk off. HARRY SONNEBORN I’m not looking to sell you ice cream. RAY KROC Then what do you want? HARRY SONNEBORN I caught a bit of your conversation back there. Sounds like you’re having some financial troubles. RAY KROC Why don’t you mind your own business? HARRY SONNEBORN I’m a great admirer of your establishment. RAY KROC That’s very nice. HARRY SONNEBORN I lunch at your Waukegan location at least thrice a week. And not once have I ever failed to witness a large, avid crowd. RAY KROC Your point being... HARRY SONNEBORN If you’re not making money hand over fist, something is gravely amiss. This gets Kroc’s attention.  85. INT. PRINCE CASTLE SALES - SHORT TIME LATER Kroc enters the office with Sonneborn. As they pass the front desk: RAY KROC Ju",
      "dialogue_count": 0,
      "word_count": 3690
    },
    {
      "scene_number": 8,
      "slugline": "INT. KROC’S OFFICE - DAY Kroc is standing before the franchise map. There are nearly 50 PINS in it now. The intercom buzzes. JUNE MARTINO (O.S.) Dick McDonald. Kroc picks up, friendly and casual. RAY KROC Hiya, Dick. On the other end is Dick, in the KITCHEN in San Bernardino. DICK MCDONALD $2.7 million. (BEAT) A million for each of us after taxes. ON KROC-- taken aback by the staggering sum. DICK MCDONALD (CONT’D) And one percent of the company’s profits in perpetuity. INT. KROC’S OFFICE - DAY Kroc is pacing furiously before Harry Sonneborn. RAY KROC It’s outrageous! Borderline extortion! Sonneborn is holding a document. A PURCHASE PROPOSAL from the brothers. HARRY SONNEBORN And they want one other thing. RAY KROC What? HARRY SONNEBORN San Bernardino. Kroc is taken aback. HARRY SONNEBORN (CONT’D) To give to their longtime employees. As a gift.  104.",
      "characters": [],
      "action_text": "RAY KROC I need San Bernardino. I was counting on its profits to cover the debt on the purchase loan. HARRY SONNEBORN I’ve spoken at length about it with their lawyers. It’s unfortunately non-negotiable. ON KROC-- calmly absorbing. INT. LAW OFFICE - CONFERENCE ROOM - DAY Kroc and the brothers in a conference room, flanked by their respective teams of LAWYERS. KROC LAWYER Our client agrees fully to your conditions of sale. With one exception. Your one percent cut of future corporate earnings will have to be carried out on a handshake basis. RAY KROC On the insistence of my investor group. Their financing is contingent on leaving it out of the contract. It’s unfortunately a dealbreaker for them. Dick and Mac look at each other, extremely wary. RAY KROC (CONT’D) You have my word you’ll get your full due royalties. He extends his hand, holding it out to them. CONFERENCE ROOM - SHORT TIME LATER Mac and Dick sit alone in the conference room as their lawyers pack up. (Kroc and his team are gone.) ON MAC-- staring somberly at a check in his hands for $1,350,000. ON DICK-- staring somberly at a check in his hands for $1,350,000.  105. INT. MEN’S ROOM - MOMENTS LATER Kroc is at the urinal in the law office’s men’s room. He flushes, heads to the sink to wash his hands. The rest room door opens. In walks Dick. He freezes at the sight of Kroc. Kroc smiles amiably at him in the mirror. RAY KROC Hello, Dick. ON DICK-- gazing searchingly at Kroc. DICK MCDONALD I just have to ask you one thing. Something I’ve never understood. RAY KROC Alright. DICK MCDONALD That day we met, when we gave you the tour. RAY KROC What about it? DICK MCDONALD We showed you everything. The whole system, all our secrets. We were an open book. (Kroc nods) So why didn’t you just-- RAY KROC Rip you off? Run off and start my own place using your ideas? (Dick nods) Because it would have failed. DICK MCDONALD How do you know? RAY KROC Am I the only one who ever got the kitchen tour? I bet you invited loads of p",
      "dialogue_count": 0,
      "word_count": 1956
    }
  ]
}