{
  "slug": "the-man-who-fell-to-earth-101-hallo-spaceboy-2022",
  "title": "the man who fell to earth 101 hallo spaceboy",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 13532,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. AUDITORIUM - DAY - THE FUTURE  THAT SAME FACE.   Wild hair cut neatly now.   Lean, agile.  WE’RE CROSSCUTTING BETWEEN THE PRESENT AND FUTURE : The Man is standing on stage in a 10,000 person auditorium: THE MAN Like the first bridge-crossers, I followed the work.   The journey was ferocious.   And yes, it’s true -- (taps his head) My brain was injured.   I know that’s part of my lore -- “ What’d he do to his brain?”   T he infamous lore.   According to the   interwebs , I’m the hygienically challenged  recluse   who demands all his employees snort fire ants and hallucinate for nine straight days in my personal desert bunker, which is shaped like an egg.   And   the guy who demands all his girlfriends dress like Nikola Tesla’s mother -- when we’re seen in public -- which is never.   Apparently I‘m a Dionysian Tech God Willy Wonka, up to my neck in secrets. Laughter from the audience.   He prowls the space, radiating authority, humor --   enjoying himself:  THE MAN (CONT’D) It’s all true.   The secret part, anyway.   My immediate problem is, my friends at the CIA, NSA, and FBI think they’re the   only   ones entitled to secrets.   They’re desperate to figure out how I transformed World into the biggest corporation in the world.   And they certainly don’t want me to tell  you.  A LOGO OF THE PLANET APPEARS on a jumbotron behind him -- the emblem of WORLD ENTERPRISES, colloquially known as “WORLD.” Like “Apple.”   Rotating IMAGES suggest a multinational corporation embedded in every essential aspect of our lives. And beneath the planet, the slogan: “ MAKE IT BRIGHTER .” From his coat pocket, The Man pulls out a SUBPOENA -- 3.",
      "characters": [],
      "action_text": "THE MAN (CONT’D) In fact, five minutes ago I was handed this subpoena by two gentlemen from The Justice Department --   hi, fellas   -- He waves at the stage wings, where TWO SUITED MEN stand in silhouette, watching.   We can’t see their faces.   We don’t need to -- their body language screams hostility: THE MAN (CONT’D) -- which says that if   I stepped on  stage, I’d be, uh... (reading) ... Violating Title 18 of the Espionage Law for endangering National Security -- (tears off a page, TOSSES it in the air) -- and -- here’s my favorite part -- (tears off another page) -- breach of International Traffic In Arms Regulations because my words -- my work -- has been classified as a weapon.   Which carries a punishment of 20 years in prison and a fine of... all my money. Audible GASPS from the audience now.   Is he serious?  THE MAN (CONT’D) Fortunately, I don’t think anybody actually knows how much money I have, including me.   So I came out  anyway and here’s why: (beat) I want to tell you my story.   The real story.   About World, and why I had   to rebuild it -- and myself, along the way.   Would you like to hear? A SWELLING ROAR FROM THE CROWD.   He grins, a master showman -- turns his look back to the Suited Men in shadow.   Daring them, now, to remove him from the stage. They don’t.   He puts up his arms, quieting the crowd: THE MAN (CONT’D) Okay, okay... ready?   It’s simple: 4. He pauses, his eyes alive with memories lost... THE MAN (CONT’D) Because of all the things I left behind.   Family.   Community. People say that life, our lives, are really just a process of leaving things behind. (dramatic pause) Chew on that: we exist only in our own limited, human, bandwidth. His eyes shift now.   Angry.   Piercing. THE MAN (CONT’D) I say   that’s bullshit .   I say today, we change that.   I refuse to be what I’ve lost...  EXT. OIL FIELDS - NIGHT - PRESENT  Back where we left him in the oil field: The Man’s entire naked body slick with black ooze, he drags himself up,",
      "dialogue_count": 0,
      "word_count": 757
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ROUTE 2 - OUTSKIRTS OF TOWN - NIGHT - PRESENT  A bullet-pocked road sign: “ WELCOME TO WILLISTON, NORTH DAKOTA - BOOMTOWN, USA. ” Oil Towns like this are the modern Wild West -- and into this teeming sewer of humanity stumbles our alien. Describing him at this nascent stage of his development is like describing Buster Keaton, of the bad-ass-nickname Great Stone Face -- always gracing the room like some freaky prince with that face and body that transcended articulation: tornadoes, waterfalls, avalanches -- none of it mattered to The Great Stone Face who never stopped to take a bow, and you were so blown away by watching yourself in him?   Like a magic mirror?   That you didn’t even see he was fucking ruthless. That’s our Man. He stumbles past a graveyard of farm equipment, rusted propane tanks... an empty pumpkin patch where a deflated FUCK DOLL has been abandoned... sees now, up ahead... ... A CLUSTER OF HEAD LIGHTS.   Men and women sitting on the hoods of their cars, watching A MIDNIGHT RODEO that’s taken over the lonely High School football field. ON THE MAN Watching this strange human/animal ritual at a distance. The Rodeo Horse spins in and out of those roiling curtains of smoke from the oil fires... time seems to SLOW... In the headlight illumination, it’s like a Ghost Horse... The Cowboy hanging on for dear life, the horse kicking a crazy circle in the air with its hind legs... As the smoke wall lifts a little , the horse sees The Man and STOPS.   Just STOPS -- The Cowboy goes FLYING.   The Man stares.   The horse stares. The horse shakes his head and SNORTS.   The Man does the same.  Some kind of communication is occurring here.  A RODEO CLOWN jogs into frame and does a little dance for the horse.   The Horse still doesn’t move as -- The Man keeps his eyes locked on the horse, until the Rodeo Clown, in frustration, gives the reins a nasty YANK -- 6.",
      "characters": [],
      "action_text": "The Man’s head JERKS VICIOUSLY in tandem.  Whatever was between The Man and horse is now gone.  He recedes into the night, swallowed up by the smoke again. As Megadeth’s “Symphony Of Destruction” takes us to:  EXT. CHANEY’S TOTAL AUTO - NIGHT  The music’s coming from an AUTO GARAGE.   The Man stumbles towards the SOUND.   He responds with a vaguely musical bark. A GREEN HOSE hasn’t been entirely turned off, dribbling into an old sink. He FREEZES: Seeing THE WATER.  INT. CHANEY’S TOTAL AUTO - NIGHT  A MECHANIC is checking the undercarriage of a customized TOW TRUCK.   As he rises -- He SEES THE MAN out the window doing something and says in the same breath: AUTO GUY  God damn it.  SMASH TO: FLASHING LIGHTS A POLICE CRUISER pulls up in front of the garage.   In the front seat, two WILLISTON COPS (HAUGENOE and PEARSON) see, in the glare of the headlights, a naked and oil-covered man crouched and WRAPPED in the green hose, his back to us... HAUGENOE God damn it. Haugenoe flips the siren.   No movement from whatever the hell that is.   In back of the cruiser, behind the barrier, a WILLISTON GIRL (ALICIA), 17, is high out of her mind, picked up for prostitution: ALICIA The fuck is that?   Is it a turtle? HAUGENOE Quiet, Alicia. 7. The cops get out, flashlights and tasers up: HAUGENOE (CONT’D) Hands where I can see them.   Stand up and turn around.   Slow. The Man doesn’t move.   From the door of the garage, the MECHANIC shouts -- MECHANIC Get him off my property, Dave! Third tweaker this month! HAUGENOE Just stay inside and keep quiet. And then it’s all rapid fire YELLING: ALICIA -- Hey, can I have a soda?-- -- He keeps them in the cooler right there! PEARSON -- No you can’t have a soda -- MECHANIC -- Dave, how many goddamn tweakers am I gonna have to shoot on my property   this week?  HAUGENOE -- Everybody   SHUT UP.  The cops get closer to The Man, to SEE he has the business end of the hose IN HIS MOUTH -- which cracks Pearson up: PEARSON Jeez, Dave, must be Tuesday. HA",
      "dialogue_count": 0,
      "word_count": 1197
    },
    {
      "scene_number": 3,
      "slugline": "INT. SHOWERS - WILLISTON POLICE STATION - NIGHT  HARSH WATER SPRAYING THE MAN, getting hosed off.   Gulping at the water like a crazy beast who’s been in the desert. The oil runs off and SWIRLS down the drain... The Man cocks his head, fixated on THE SWIRL... One of his eyes begins to ROTATE in its socket, following the pattern.   Swirling... swirling... As we PRELAP CRAZY SHOUTING --  INT. HOLDING TANKS - WILLISTON POLICE STATION - NIGHT  Side-by-side Male and Female holding tanks: drunks, tweakers, and prostitutes.   And standing against the bars is: The Man, clean now but hair still wet, in a Williston Coyotes sweatshirt that’s too small for him.   He’s at the sink watching the water churn down the drain. He cocks his head slightly as he hears, from behind him, ONE SCARY GUY has cornered another SCARY GUY: SCARY GUY I don’t care about you.   I don’t care about you.   Just give me my money. In the Women’s Tank, Alicia BARKS at Pearson on the phone at a desk: ALICIA Oh my God, Trey, this is so illegal, my sister’ll sue you guys... The Man jerks his head towards her.   And speaks his FIRST WORDS ON EARTH -- MIMICKING her teen voice and exact posture: THE MAN Oh my God, Trey, this is so illegal, my sister’ll sue you guys... Alicia turns to The Man, startled.   Then bursts out LAUGHING: ALICIA That was really good! The Man bursts out LAUGHING and repeats in her voice: 11.",
      "characters": [],
      "action_text": "THE MAN That was really good! PEARSON (covering the phone) Quiet -- ALICIA I don’t sound like that! THE MAN (yes she does, exactly) I don’t sound like that! PEARSON I want some quiet. THE MAN I want some quiet. Like that, The Man’s voice just shifted from Alicia’s to a perfect copy of Pearson’s.   Alicia finds this hysterical, starts clapping and chanting: ALICIA I want some qui-et!   I want some qui-et! The Man CLAPS and CHANTS too, repeating.   One of the tweaking FEMALE CELL MATES behind Alicia is getting agitated: FEMALE CELL MATE Shut her up!   Shut her the fuck up! THE MAN Shut her up!   Shut her the fuck up! At this, the woman GRABS Alicia from behind and they get into a JAILHOUSE BRAWL.   It’s not pretty.   Women CHEER and JEER -- The Man watches clinically -- no concern, or empathy as -- Alicia gets her head BASHED IN, is now twitching on the floor.   The Cops break it up, hoist Alicia to her feet and just for a second, her bloody face is pressed against the bars, directly across from The Man: ALICIA  This... really hurts...  The Man just FALLS ASLEEP STANDING UP.   Right there.   Like a horse.   And starts snoring. 12.",
      "dialogue_count": 0,
      "word_count": 456
    },
    {
      "scene_number": 4,
      "slugline": "INT. BULLPEN - WILLISTON POLICE DEPARTMENT - MORNING  SNAP   -- a tube of AMMONIUM CARBONATE breaks under The Man’s nose. Nothing. Officer Pearson feels just fucking fine about SHAKING him violently, but The Man remains unconscious. Pearson finally snaps FOUR TUBES of ammonium under his nose. The Man wakes up COUGHING.   Realizes he’s HANDCUFFED to a chair, sitting across from a desk: PEARSON You’ll be processed in a bit.   Try not to be a freak for five minutes. As Pearson goes, The Man blinks against DAYLIGHT.   The flight across galaxies has taken an enormous physical and mental toll.   He has, up to now, only been able to   respond...  The next step in his   journey of light years begins here. Each new experience he digests in this room will build upon the one before it, until he absorbs enough to   activate...  As his VOICE OVER gently returns to us: THE MAN (V.O.)  Remember the way it was when you first absorbed something... a voice, a smell.   Pure.   Without any prism.   Experience... without refraction.  And so it BEGINS: the SIGHTS, SOUNDS and SMELLS in the room SHIFT to his disoriented P.O.V. as we experience this strange world like a newborn --  THE MAN (V.O.)  I opened my eyes, and my ears...  HIS EYES Darting, adapting to each new stressor in the environment at the rate of a card shuffling machine in Vegas -- HIS EARS The DIN of the room’s TECHNOLOGY seems to separate itself from everything else at decibels even a dog couldn’t detect: 13.",
      "characters": [],
      "action_text": "Computers, cell phones, texting, sexting...   a symphony of CLICKING, HUMMING, BUZZING that accelerates his revival...  THE MAN (V.O.)  And suddenly, the world around me was brand new again...  HE SEES: A COP patting the ass of another cop...   they WHISPER to each other far across the room...  A WOMAN in a WHEELCHAIR working as a SKETCH ARTIST...   we HEAR the SCRATCHING of her pencil on the page...  A butterfly landing on a computer monitor... we   HEAR its wings fluttering like thunderclaps ... Sound SPIKES as a frustrated officer BANGS the computer to shoo the butterfly -- The Man FLINCHES -- and now -- -- THUD!   A FEMALE INTAKE OFFICER plops down at the desk in front of The Man, right in his eye line: INTAKE OFFICER You were ingesting a hose?   In the municipality? He doesn’t answer, his eyes still consuming input like an algorithm -- INTAKE OFFICER (CONT’D) Hey.   Do.   You.   Know.   Why. You’re.   Here? Nothing.   The Officer rolls her eyes:   Intake is always a party .   Her cell RINGS.   The phone INTERESTS The Man.   She holds up a finger: INTAKE OFFICER (CONT’D) Scuze me. He holds up the same finger she does, mirroring her.   Shaking her head, she answers her phone: INTAKE OFFICER (CONT’D) Hey, Hon -- The Man’s focus NARROWS on her cell.   Like the other sounds, the CALLER’S VOICE is inaudible to anyone with human ears -- INTAKE OFFICER (CONT’D) I don’t think you’re right about that, Hon.   Can I call you back? 14. As she hangs up, The Man, in the DEEP VOICE of whomever she was just speaking to, says: THE MAN The 2013 XTS has the OooonnnnStar, Katie, I’m a hundred percent suuuuurre. The Officer looks at her phone a beat, confused... INTAKE OFFICER That’s interesting.   Cause there’s no way you could have heard that, and a good rule around here is mind your own business. But his focus is GONE again, consuming the   NOISE OF TECH --  INTAKE OFFICER (CONT’D) Pst? -- the clicks, tones, and beats getting LOUDER -- building to a CRESCENDO   until she SNAPS he",
      "dialogue_count": 0,
      "word_count": 2905
    },
    {
      "scene_number": 5,
      "slugline": "INT. OIL REFINERY - SHOWER  Justin scrubbing with anti bacterial soap... the dust running off her... FARADAY (V.O.)  She promised, promised never to aspire again.   To anything.  EXT. OIL REFINERY - DAY  WIDE SHOT of Justin waving idly at the guard in front of the refinery as she drives her pick-up off into the vast, empty desert: FARADAY (V.O.)  She was very tired of hoping.  INT. JULIUS’ HOUSE - NIGHT  The house of a HOARDER.   Piles and boxes of things, so many things, things everywhere, none of them useful.  JULIUS FALLS , her father from the photo, is in a bed in the living room.   Not well.   Justin takes a PRESCRIPTION BOTTLE from her pocket and hands him a pill and water, makes sure he swallows...  INT. JULIUS’ KITCHEN - NIGHT  Justin, surrounded by PILES OF DAD’S STUFF, is on his LAND LINE, negotiating with MEDICARE.   WE SEE a stack of paperwork.   Every page stamped in bureaucratic RED:   Claim denied.   Denied.   Denied.  Barely audible: JUSTIN (into the phone) ... No, that was-- Yeah, I’ll hold. She sighs, pops one of the pills herself... FARADAY (V.O.)  She promised to forget her own majesty, like a boat too big for its own canals.   She sold herself out.   Every day...  25.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 209
    },
    {
      "scene_number": 6,
      "slugline": "INT. SHUTTERED SUPERMARKET - DAY  Upended grocery carts, covered in dust.   Justin again in the HAZMAT, pulling insulation... FARADAY (V.O.)  Every minute...  INT. OIL REFINERY - SHOWER  Rinse, repeat: Justin at the sink after another shower, pops open the prescription bottle -- FARADAY (V.O.)  She wanted the anesthesia.  -- and discovers she has only TWO PILLS LEFT: JUSTIN Shit. She pops one, eyes herself in the mirror -- FARADAY (V.O.)  What would the world be like if each of us had the courage to accept ourselves, fully?  She walks away from herself.   HOLD on the empty mirror... FARADAY (V.O.)  What would the world be like if we accepted each other ?  INT. JUSTIN’S PICK UP - DAY  Justin in her red pickup, wearily driving home.   Up ahead, she notices something on the side of the road... FARADAY (V.O.)  But there was one thing she still held on to...  Two thugs beating the shit out of someone: that someone is FARADAY.   And we realize we are back where we left him -- He is LOSING the fight and getting his ass robbed blind. Is that actual   money   flying out of his pockets? This is the last thing she needs.   She’s got her own problems...   and yet : 26.",
      "characters": [],
      "action_text": "FARADAY (V.O.)  Her mercy.   It lingered on her like perfume.   It worked on my brain although, at the time, I couldn’t recognize it.  With a heavy inhale, Justin makes a decision.   And this decision will change her life forever...  FARADAY (V.O.)  She helped me understand that mercy exists -- at its essence -- in small, human choices.  She pulls over, pops the glove box, grabs a PISTOL and tucks it in her jacket --  EXT. HIGHWAY ROADSIDE - DAY  -- even as he’s getting the shit kicked out of him, Faraday is ALERTED to the woman’s presence by her smell as she hops out of her truck.   A chemical smell. Thug #2 PUNCHES him again.   Justin pulls out the gun and with practice and facility, FIRES a round into the air --   BANG!  Faraday cranes his neck up to follow the TRAJECTORY of the bullet, calculating its arc -- A CAR whizzes by and sends a TORNADO OF MONEY swirling into the air.   A Thug snags a fluttering fifty: THUG 1 Shit! Thug #1 leaps for her.   Justin ducks low, puts her shoulder into his hips -- SCUFFLE -- he has facility here too -- STRIKES Thug #1 with her pistol, but he KICKS her in the stomach -- her gun flies out of her hand, lands near Faraday... He picks it up.   Runs his eyes over it, digests it   --   then, repeating what she did, Faraday FIRES over their heads, SIX ROUNDS --   BANG BANG BANG BANG BANG BANG!  The thugs turn and run, one jumping back into frame to grab a fifty, then they’re off. Faraday, who doesn’t express pain the way we do, doesn’t understand why she is on her hands and knees, GASPING. 27. He closes the distance between them, his finger on the trigger, and stands over her, the gun barrel near her head. A drop of his BLOOD hits her cheek. One of his FINGERS IS BROKEN, sticking 45 degrees in the wrong fucking direction. Faraday can see the barrel reflected in her dilated pupils, which are huge -- adrenalized.   She closes her eyes, thinking she’s about to die... Beat.   Beat.   Her eyes open. He lets her reach up slowly... and take ",
      "dialogue_count": 0,
      "word_count": 2477
    },
    {
      "scene_number": 7,
      "slugline": "EXT. GAS STATION - ACROSS THE ROAD - DAY  Over a fence across the road from the station, THREE BRIDLED HORSES in a corral.   A BOY is picking a stone out of one of their horse shoes -- As one, suddenly, they lift their heads -- Faraday is approaching, purposefully, carrying his cooler, still dripping.   The horses watch him come.   To the boy... FARADAY Are these your horses? BOY You wanna move away?   I’m working, and she’s skittish. Faraday ignores him, runs his hand over the horse.   It lets him. BOY (CONT’D) Hey. The position of the horse’s eye sockets interest him... FARADAY Millennia ago, she had the eyes of a predator.   She saw depth.   Her eyes are on the sides of her skull, now.   She’s prey.   The predator has evolved right out of her. BOY (laughing) Predator?   They’re paintball practice if they ain’t fast enough. Across the road behind him, Justin emerges from the restroom, SEES Faraday across the road --   dammit   -- jogs over -- FARADAY They have a speed that they use around humans and a speed that they use for themselves.   In their truest state, they’ll only stop when their energy’s fully released, like a wave. BOY You one of those animal people, making sure my horses are all like, fulfilled in their experience?   You want to stand here and talk with my horse? 38.",
      "characters": [],
      "action_text": "As Justin arrives, wary of whatever this exchange is -- FARADAY I don’t talk, I listen.   When you made them slave animals, they lost their bandwidth for predation. (then, curious) Paintball? BOY Like she’s a target. Faraday is oddly gentle with the horse.   It isn’t lost on Justin. FARADAY Don’t do that anymore.   It’s not what she’s meant for. Justin’s surprised by what she’s hearing.   Is this a display of compassion?   Or a statement of fact.   Hard to tell. Faraday turns and walks away, back to the truck.   She follows... gently... JUSTIN What’s she meant for? FARADAY Very soon she’ll relearn that she can kick that boy to death anytime she wants. She stops in her tracks.   Faraday continues on.   Hold on Justin -- no, it wasn’t compassion.   As we PRELAP: FARADAY (V.O.) Imagine -- and here’s two beautiful words -- a   first   encounter ...  INT. AUDITORIUM - DAY - THE FUTURE  Faraday takes a beat on the stage.   A wistful reverie.   He allows his audience in, to make this connection with him... FARADAY The first time, say... you saw a horse.   Touched it.   Easy enough. Of course, we’d all imagine something different... 39. INT./EXT. JUSTIN’S PICK UP - DAY - PRESENT  Justin drives: the country highway is ruler straight and goes on forever.   Faraday with the COOLER on his lap, sloshing water.   He scrolls the radio, listening for something. She watches him quizzically... FARADAY (V.O.) But what if the person next to you somehow understood everything that touching the horse inspired in you? Awe.   Fear.   Love.   Love!   You’d really see each other.   You’d have each other.   Shared perception.  INT. AUDITORIUM - DAY - FUTURE  On the Jumbotron behind Faraday, the image of THOMAS JEROME NEWTON appears (yes, David Bowie, as we saw him in the film): FARADAY Did you know Thomas Newton -- the founder of World, the man who laid the foundation years ago -- went blind halfway through his life? He throws a glance to the two SUITED AGENTS still hovering in the stage wings",
      "dialogue_count": 0,
      "word_count": 2575
    },
    {
      "scene_number": 8,
      "slugline": "EXT. DINER - CONTINUOUS  -- BAM: the door flies open as Justin pushes him out, looking over her shoulder, drags Faraday by the elbow to the truck -- Cops exiting behind them, getting in their SQUAD CAR.   The Dealer coming out of the diner too. She throws Faraday into his side, then climbs in herself --  INT. JUSTIN’S PICK UP - CONTINUOUS  She PINS the gas and they peel out of the parking lot.   Her eyes keep flitting to the rear view -- the COPS have pulled out behind her and are following -- JUSTIN (under her breath) Shit. Her eyes pinball between the cops and Faraday -- she shakes her head, tense as hell -- Faraday doesn’t care -- FARADAY Did you research soil structure and matrix composites in underground tanks? Her eyes keep going to the rearview, trying not to look suspicious -- then -- the cops hit their LIGHTS and SIRENS --  shit   -- they GUN forward toward her pickup -- -- then right PAST it, speeding off down the highway toward something else.   Justin lets out an AUDIBLE, ANGRY sound... FARADAY (CONT’D) Did you? She turns to him and glares -- FARADAY (CONT’D) Why are you looking at me?   What is it you’re trying to... JUSTIN  Understand?   Why you’re willing to die.   Or let me die. FARADAY I’m not willing to die. The rest of it just hangs there.   Justin gathers herself: 50.",
      "characters": [],
      "action_text": "JUSTIN Who are you?   And give me an answer that makes sense.   For real.   Like what the fuck? Measuring what he can explain to her, this Earth woman.   No. There’s nothing.   He doesn’t answer. She slows the truck -- FARADAY Please don’t slow down. She doesn’t speed up, just stares: JUSTIN Answer me. FARADAY I come from a place where everyone produces to the limit of what they are balanced for.   I exceeded my balance. JUSTIN And? FARADAY (beat) There was an error.   With something I built. JUSTIN Like... a machine? FARADAY Yes. Her eyes narrow: JUSTIN There was an error or you made an error? Nothing.   Beat.   She slows more -- FARADAY -- Please.   I made an error. JUSTIN Did... anyone die? Faraday chooses silence.   She slows, merciless in this moment.   Finally -- 51. FARADAY Many. His stone face appears to grow microscopically heavier: FARADAY (CONT’D) I’m here to correct my error. Faraday can’t understand her gaze.   Her eyes appear to shine as they travel over his face.   Despite her ebbing adrenaline, they’re full of everything he doesn’t understand -- sympathy. Her hands loosen on the wheel, she speeds up.   Her shoulders drop.   Big exhale... JUSTIN That would... make me crazy, too. Beat.   Justin takes this moment to open the windows of the truck.   To let the air in, and to accelerate.   There’s wind in Faraday’s hair as he holds his hand out the window and lets the air lift it... Like a little kid, or a scientist from another planet. She looks at him, meaning it when she says: JUSTIN (CONT’D) I don’t think you’re going to make it out here.   I really don’t. He just stares out the window, watching the horizon.  EXT. HIGHWAY - SUNSET  Magic hour.   A road sign: two giant wagon wheels and a wooden man on a wooden horse, under: “ WELCOME TO CULBERTSON, MONTANA.”  Justin’s pick up pulls to the side of the road:  INT. JUSTIN’S PICK UP - CONTINUOUS  She parks.   Looks at him. JUSTIN I can’t take you any farther. FARADAY Why not? 52. JUSTIN I can’t cross state",
      "dialogue_count": 0,
      "word_count": 2956
    }
  ]
}