{
  "slug": "the-invitation-2015",
  "title": "the invitation",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 17510,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. ROAD - DUSK 6   6  The car sits idling. Will gets out, moves toward the front of the car. The hazard lights blink. WILL’S POV - we slowly round the front of the car. Closing in. A glimpse of an animal’s leg. ON WILL as he sees what it is. He recoils. ON THE GROUND, in front of the car-- a twisted shape. A mangled coyote. It’s in its death throes, its cries a raspy gurgle. One bent leg twitches involuntarily. The sound of a car door opening. WILL Don’t come up here. Will walks to the trunk. He reaches in and pulls out a TIRE IRON.   Closing the trunk, he sees Kira standing over the coyote, staring at it. He walks toward the front of the car, puts a hand on her shoulder. KIRA What are you going to do? WILL We can’t leave it like this.  KIRA We can call someone. The city. WILL Just go back to the car, okay?  She looks down, sees the tire iron. She knows what’s coming... heads back to the car. Will looks down at the bloody, dying animal. THROUGH THE WINDSHIELD 6.1   6.1  Kira watches as Will lifts the tire iron and brings it down on the coyote, which is obscured by the hood of the car. Even in the car, the impact is audible. She flinches at the sound. He strikes it again. Again.  5.",
      "characters": [],
      "action_text": "IN FRONT OF THE CAR 6.2   6.2  Will drops the tire iron. He looks down at what he’s done. Then, steeling himself, he grabs the dead animal by its feet and drags it to the side of the road. INT. CAR - CONTINUOUS 7   7  Kira watches as Will comes around the front of the car and gets inside. They sit there for a moment. Will is a little out of breath. Kira looks at him, then forward. Shocked. She puts a hand on his arm. Will, both hands on the wheel, doesn’t answer. Finally... WILL How the fuck can she go back to that house? KIRA People deal with things in different ways. She’s trying. WILL And I’m not. KIRA You said that, not me. (pause) Maybe she wants to let people in. Maybe she wants to make some new, good memories in that place... WILL I don’t think things work that way. EXT. ROAD - DUSK 8   8  The car moves up the narrow road in the hills, headlights glinting off parked cars. Everything seems precarious, somehow. Dark and twisted. They drive past lines of parked cars, closely packed on the side of the road. Just a glimpse, unseen to Will and Kira... ...   in one of the nearly identical BMW’s, a man is sitting there, still and waiting ...  6. They continue up the street, pulling up to house on street 8.1   8.1  and stopping behind three other cars. The house above is a modernist masterpiece, hanging off the side of the hill. Sprawling, beautiful, a classic. Will cuts the engine. KIRA This was   your   house? WILL Lot of money in Eden’s family. KIRA No kidding. WILL Wasn’t ever mine. EXT. DRIVEWAY - CONTINUOUS 9   9  As they walk up the driveway, Will stops. The house, glowing from within, has an obvious hold on him, a power over him. Kira unconsciously makes a move to take his hand, but stops herself. They walk up the steps to the house. EXT. PORCH - CONTINUOUS 10   10  Conversation spills out from inside. The door is ajar.  A FLASH, Will’s POV, the same house, YEARS AGO. A young boy 10.1   10.1  is visible in the window, doing a puzzle on a low table...  BACK IN ",
      "dialogue_count": 0,
      "word_count": 12155
    },
    {
      "scene_number": 2,
      "slugline": "INT. HALLWAY- SAME 27   27  Will opens the door, moves into the hallway. Looks down the hall toward the light and sound of his friends talking. And quickly, Kira stands up-- he hadn’t seen her, sitting back to the hallway wall. They stand, looking at each other, for a long moment. He goes the other way, out onto the deck. She follows him. EXT. DECK - CONTINUOUS 28   28  KIRA Let go of it. We’re with our friends. We’re fine. Just breathe. It’s okay.  He doesn’t respond.  KIRA What’s going on? What have you been seeing?  (pause) We should go.   Let’s go then. Let’s just get out of here. WILL I can’t. KIRA What do you mean you... She shakes her head. KIRA I don’t know how to do this. You can’t go and you can’t stay... WILL I’m just... Kira, I’m not okay. He gestures to the other room, trailing off. KIRA These people care about you, Will. Eden wanted you here to try to break through to you. Maybe it’s good this has come out. Maybe... WILL It isn’t good. This is not good.  73.",
      "characters": [],
      "action_text": "KIRA You need help, Will, and... WILL I’ve had help. It doesn’t work. Nothing works. He looks away from her for a long moment. WILL My son is dead. Where do I put that? KIRA I don’t know. WILL Neither do I. There’s no way to fix it. It’s like a scream trapped inside of me. (pause) And there’s no changing the fact that I wasn’t watching carefully enough that day. She comes closer to him, tentatively. KIRA You couldn’t have known. You couldn’t be looking out for that, you just can’t expect that of yourself. What happened to your son wasn’t anything that could be predicted or changed or... it just happened. WILL I can’t live with that. I can’t...  (pause) Another kid. I can’t even feel... Ty loved him. They were just playing. Just messing around. I shouldn’t have let them have the bat. But he’s just a kid. So I can’t even.. I can’t... (pause) It was just a kid.  KIRA I’m scared for you. I really am. I want to help. Just let me.  74. WILL I’ve been waiting to die since the moment it happened. A long moment. KIRA Moving forward isn’t a betrayal. WILL Look at Eden. That’s what letting go looks like. KIRA You aren’t letting him go. I’d never ask you to. You know that. We can help each other. That’s the only answer. It’s   worth   living. (pause) Please just let me help. WILL I love you, Kira. But I don’t think you can help. KIRA That hurts so much, Will. Every time you say that. (pause) I’ve tried so hard. Nothing works, but I keep trying. WILL I’m sorry. Kira shakes her head. She looks very alone. She starts to say something else, but can’t put it together. She leaves, gone quickly, back to the others. FROM FAR AWAY 29   29  We see Will leaning against the railing, looking out into the night. It’s quiet. Only the sound of a gentle wind, muted voices of people inside. In the distance, the whole of the L.A. basin is spread out before him, a net of lights. We notice that there’s another sound. A faint rustling in the brush far below. Will doesn’t react. He doesn’t seem to he",
      "dialogue_count": 0,
      "word_count": 778
    },
    {
      "scene_number": 3,
      "slugline": "INT. STUDY - CONTINUOUS 32   32  He locks the door behind him. He sinks down against the door, sitting on the floor. He closes his eyes, opens them again.  A flash: the room as it was. A child’s room, in the blinding 32.1   32.1  sunlight.  The same POV, the room as it is now. A tidy, well kept study. 32.2   32.2  All traces of his son, erased. A nother flash: his son, sleeping. 32.3   32.3  WILL 32.4   32.4  God. Oh god. Oh god.  Flash: Will looks at his sleeping child. The boy opens his eyes slowly, recognizing his dad. Smiling.  Will puts his head in his hands.  He breathes.  Muffled but loud laughter can be heard from down the hall. Will looks up... And sees DAVID WALK PAST THE WINDOW, across the backyard. Will gets up slowly and goes to the window, craning his neck to see into the yard. THROUGH THE WINDOW 32.5   32.5  We see that David is standing at the far end of the yard, looking out over the city. He has a long match, is lighting something. It’s a decorative RED LANTERN. David finishes lighting it, replaces the glass, and looks at the light for a moment, then he looks out into the canyon, breathing in the night air. David walks away around the other side of the house. IN THE ROOM - CLOSE ON WILL 32.6   32.6  He looks around the room. Searching, opening drawers. His eyes fall on David’s laptop.  He opens it. He can’t stop now.  ON THE SCREEN 32.7   32.7  77.",
      "characters": [],
      "action_text": "An image of DOCTOR JOSEPH. Still very good looking, but it looks like he hasn’t slept in days. There’s a glass of wine in front of him. He looks very calm. IN FRONT OF THE LAPTOP 32.8   32.8  Will turns the volume down, leaning forward to hear. ON THE VIDEO 32.9   32.9  Joseph begins to speak. He is hypnotic. He is speaking directly to Will. To us. JOSEPH I know you have doubts. Skepticism can be contagious. I wouldn’t have known either, before I saw the new truth and I shared it with you. I would not have believed, but it was revealed so clearly. Remember the reward. This beautiful moment is upon us. Tonight is the night our faith is made real. There is a SUDDEN, LOUD KNOCK on the door. A voice from the hallway. PRUITT (O.S.) Hey, Will. You in there? But Will is transfixed by what is on the screen. JOSEPH Remember that God is great, and that our pain will be sanctified, and that we will be made whole again. You are giving a gift. Each one you gather to us increases your blessing. They’ll rejoice to be with us. The hardest thing is starting. Just take that step, believe, and give yourself over. The knocking, even louder now, rattling the door. Pruitt’s voice is shedding any cover of the collegial. It’s forceful. PRUITT (O.S.) Will, let’s go. Everyone is waiting for you. On screen, Joseph raises the glass. Tears stream down his cheeks, but he is smiling.  78. JOSEPH I love you. I love you so much my heart is breaking. I can’t wait to see you. To meet our new brothers and sisters. We’ll all be together soon. I’m waiting for you. The screen goes black. The knocking is now a pounding. Will is still transfixed. The pounding is louder and louder 32.10   32.10  and we CUT TO... INT. HALLWAY 33   33  The door opens. Pruitt and Will stand face to face. A long moment as they look at each other. Pruitt puts a hand on his shoulder, gently but firmly. PRUITT Okay? He walks Will back toward the dining room, standing close behind him. Will walks in front of him, up the stairs. Pru",
      "dialogue_count": 0,
      "word_count": 4577
    }
  ]
}