{
  "slug": "the-maze-runner-2014",
  "title": "the maze runner",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 22621,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. EASTERN FIELDS - LATER   *  In the shadow of the Wall, THOMAS, drenched in sweat, heaves   *  a shovel of dirt into a nearby pile.   Out the corner of his   *  eye, he notices ZACK and some other FIELDHANDS in the   *  distance, watching him.   *  And then, a few feet away, CHUCK collapses, panting.   THOMAS   *  turns to him...   *  THOMAS   *  Follow your lead, huh?   *  Laying on his back, CHUCK smiles...   *  CHUCK   *  I got this down to a science.   *  Somewhere in the Glade, a bell   clangs .   *  CHUCK (CONT’D)   *  Especially the quitting part.   *  All around, the other FIELDHANDS drop their tools and head   *  back toward the forest.   *  EXT. NORTH GATE - THE GLADE - DUSK   *  THOMAS follows CHUCK and a stream of GLADERS down a wooded   *  path, finally emerging into a clearing...   *  ...and stares, captivated, at one of the entrances to the   *  Maze.   He tries to push through the crowd, but before he can   *  get close...   *  MINHO (21) and ARON (20)...   Both over six feet tall, not an   *  ounce of body fat on them, come bounding out of the Maze at a   *  full sprint, and stop to catch their breath just inside the   *  Glade.   *  MINHO is wearing an   armband , and they’re both carrying packs   *  strapped to their shirtless backs, animal skin canteens,   *  cross-bows, and razor-sharp spears.   *  THOMAS stares at them, awestruck.   CHUCK whispers...   *  CHUCK The Runners.   They’re the strongest, the fastest.   *  The gathered GLADERS move aside so the RUNNERS can pass,   *  patting them on the back, offering to carry their gear,   *  offering words of encouragement.   *  Blue (mm/dd/yyyy)   9.",
      "characters": [],
      "action_text": "CHUCK (CONT’D)   *  They’re looking for a way out of   *  the Maze.   *  THOMAS can’t take his eyes off them...   *  THOMAS   *  Why do they need weapons?   *  And then, suddenly a THUNDEROUS CLAP, as the Walls   SLAM   shut,   *  closing off the Maze, as the last light of day vanishes.   *  EXT. HOMESTEAD CLEARING - THE GLADE - NIGHT   *  A boisterous scene in the Glade’s central clearing, the   *  Homestead -- a large open space filled with wooden tables, a cook shed, a few fire circles, and what looks like a make- shift playing field. CHUCK You want something to eat? The Glade cook, WINSTON, and his KITCHEN HANDS are handing out bowls of steaming chili to a long line of takers.   The food looks good enough, but after what he’s just seen... THOMAS Not hungry. Everywhere THOMAS turns, small groups of GLADERS are talking loudly.   Some are gathered around what looks like an arm- wrestling match, and others are kicking around a ball of vines and tree rubber. AS THOMAS takes in the rowdy atmosphere... CHUCK (O.S.) Alby always says...Gotta keep up   *  our spirits.   The guys know they   *  get caught moping, Newt and Atlas are gonna give ‘em a pep talk. A rough one. THOMAS Yeah, well, I’m not so sure about your fearless leaders. (biting) How long they been stuck here? THOMAS glances up at the sky -- it’s a charcoal grey, with a few pinpoints of light.   He studies it... THOMAS (CONT’D) I guess the sky looks familiar. (beat) Sort of.  Blue (mm/dd/yyyy)   10. CHUCK Took me a week before I stopped shaking.   Just had this terrible ache inside.   Like there were family, friends...Who knows? People I was missing. THOMAS I’m not sure what’s worse.   I keep trying... But I feel nothing. Suddenly, a ball comes flying at them and THOMAS barely dodges it.   There’s laughter from the playing field...   *  THOMAS (CONT’D) (to Chuck) This place blows, you know that? There’s not much CHUCK can say. THOMAS (CONT’D) I’ll see you tomorrow.   *  EXT. HOMESTEAD GROVE - THE GLADE - NIGHT",
      "dialogue_count": 0,
      "word_count": 3739
    },
    {
      "scene_number": 2,
      "slugline": "EXT. BOULDER ROOM - THE MAZE - CONTINUOUS ...landing hard on an irregular, rocky surface.   *  A loud SHRIEK as the GRIEVER’S head is squeezed, and the Wall   *  comes off its tracks, coming to a stop. The pinned GRIEVER violently thrusts its STINGER at THOMAS and MINHO, who scramble out of range. For a beat, they stare at its RED EYES, which seem to be studying them.   And then, the GRIEVER gathers all its strength and pulls   back , disappearing into the darkness. Finally, it’s quiet.   Both MINHO and THOMAS slowly peel themselves up. A long beat, as MINHO studies THOMAS... MINHO That was a nice move back there.   *  THOMAS nods, numb with fear and exhaustion.   He looks around and sees they’re in an enclosed space the size of two football fields.   It’s filled with black, volcanic BOULDERS, some piled high, others scattered alone like they were forgotten.   MINHO notices THOMAS taking it in... MINHO (CONT’D) Chambers and corridors get bigger the farther out from the Glade you go. THOMAS So, you know where we are? MINHO Roughly.   We map this section pretty regularly. And then MINHO realizes... MINHO (CONT’D) But   this   room’s always been closed off to us. THOMAS gestures back to the disabled Wall behind them... THOMAS Not anymore.   *  EXT. BOULDER ROOM - THE MAZE - LATER MINHO and THOMAS carefully traverse the blackened rocks, now halfway toward the far wall. THOMAS Is it some kind of animal?  Blue (mm/dd/yyyy)   24.",
      "characters": [],
      "action_text": "MINHO Everyone’s got a theory.   *  Another few steps, then MINHO stops dead. A round cloud of mist floats up and hangs in the air,   *  swirling. And then, VROOM! it EXPLODES in a burst of FIRE, and THOMAS   *  recoils from the rush of heat.   *  MINHO (CONT’D) Just watch for the gas clouds.   You have a couple seconds before they’re ignited. THOMAS   *  How do you come out here every day?   *  MINHO keeps walking. He’s spotted a small archway ahead, not   *  on the ground, but twenty feet up the Wall, like some kind of window. MINHO Now, that’s a first... MINHO leads THOMAS up a nearby hill of boulders, climbing til they’ve reached the porthole.   MINHO pulls himself up on the ledge and THOMAS comes up beside him.   *  THOMAS’ POV... Below them is a long, narrow room unlike the other corridors of the Maze.   Every surface is smooth and polished.   *  THOMAS What’s down there? MINHO No idea. Never seen anything-- And, then in the darkness, the GRIEVER slithers directly   *  below them.   THOMAS and MINHO hold their breath, but the   *  creature keeps moving disappearing at the other end of the   *  passage. THOMAS and MINHO slowly exhale. THOMAS That lead to another part of the Maze? MINHO starts climbing down... MINHO We’ll check it out tomorrow.   Right now, it looks like we pulled off a miracle.   It’s almost morning... THOMAS takes one last look at the strange corridor and turns to follow.  Blue (mm/dd/yyyy)   25.",
      "dialogue_count": 0,
      "word_count": 499
    },
    {
      "scene_number": 3,
      "slugline": "EXT. INTERNAL CORRIDOR ONE - EAST JUNGLE - THE MAZE - DAWN The sky above the Maze has begun to glow with the early light of dawn.   THOMAS and MINHO come jogging down the corridor where THOMAS left ALBY, fruitlessly scanning the Vines above them. They’re about to give up when... THOMAS There! MINHO looks to where THOMAS is pointing.   ALBY’S foot is barely visible through the vegetation.   But it’s still. MINHO At least it didn’t drag away his body. Then, from above... ALBY (faint) Min... MINHO looks at THOMAS.   He can’t believe it. MINHO Alby! And MINHO starts climbing... EXT. EAST GATE - THE GLADE - MORNING The Wall’s bolts retract, and they slowly split open,   *  revealing... ALBY draped between MINHO and THOMAS, his gash still oozing, barely conscious. GALLY is waiting just inside the Glade, along with NEWT,   *  ATLAS, CLINT and the other RUNNERS.   *  GALLY I don’t believe it... The RUNNERS rush to help carry ALBY.   *  They lay ALBY down and gather around. CLINT approaches   *  carrying a strange CRYSTAL TUBE...   *  MINHO   *  He’s not stung.   You can put away   *  the Serum.   *  CLINT nods and slides the tube back into his satchel.   He   *  kneels and examines ALBY...   *  Blue (mm/dd/yyyy)   26.",
      "characters": [],
      "action_text": "CLINT The cut’s not as bad as it looks,   *  but we gotta get him to a bed... GALLY (to Aron) You heard him! ARON, still steaming from the altercation the night before, makes a point of first looking to MINHO, who nods his assent. Only then do the RUNNERS begin loading ALBY onto a stretcher. MINHO When he’s settled, regroup in the Map Room.   *  As the RUNNERS lift ALBY and begin carrying him off, CLINT passes THOMAS who stands dazed, unsure what to do. CLINT Incredible.   A night in the Maze. And a Field Hand’s one of the first to survive it... THOMAS tries to smile, appreciative.   And then... GALLY signals NEWT, who roughly grabs THOMAS by the arm... THOMAS Hey! ...drawing MINHO’s attention... MINHO What are you doing? GALLY starts limping away, no interest in arguing. GALLY He violated the Laws and entered the Maze. (to Thomas) You’re going to the Pit until we decide what to do with you. MINHO can’t believe it... MINHO After what happened out there? He saved Alby’s life! GALLY stops to face MINHO... GALLY  I’m   calling the shots right now. And the Laws   will   be enforced.   For all we know, he made it worse, angered the Griever...  Blue (mm/dd/yyyy)   27. MINHO When Alby hears...he’ll never allow this! GALLY explodes... GALLY Alby’s got much bigger problems! (beat) The girl’s the beginning of something.   And the Greenie... You’re all too arrogant to see what’s happening! MINHO grabs GALLY and pulls him close...   *  MINHO I remember what you did in the First Days.   Alby and I may be the only one’s left who do.   But that was a long time ago.   And I’m starting to think the guys are right.   You belong in an asylum. Finally... THOMAS Please! Both of you! GALLY and MINHO turn to him.   A beat, then, THOMAS looks at GALLY... THOMAS (CONT’D) You don’t trust me for some reason. Fine. (beat) Then I assume you won’t care if I die looking for a way out of here. To MINHO... THOMAS (CONT’D) I want to be a Runner.   *  INT. THE PIT - THE GLADE - LATER A cell door slam",
      "dialogue_count": 0,
      "word_count": 1075
    },
    {
      "scene_number": 4,
      "slugline": "INT. HALLWAY - ALBY’S DWELLING   *  THOMAS follows MINHO down a long hallway inside ALBY’S   *  dwelling.   *  He passes a closed door, and feels compelled to stop outside   *  it.   *  MINHO is a few steps ahead, and THOMAS checks to see no one   *  else is watching.   He pushes the door slightly open...   *  ...and finds THERESA in bed, still unconscious.   THOMAS   *  stands frozen, and then SUDDENLY...   *  FLASH TO:   *  EXT. OUTDOOR HOLDING PEN - DAY   *  ...once again, that little BOY staring at the silhouette of   *  the LITTLE GIRL in that second-story window.   *  One of the falling white flakes catches in the BOY’s eye. He   *  wipes it away, leaving a black streak across his cheek.   It’s   *  not snow.   It’s ash.   *  And then suddenly, the GIRL is pulled out of view.   An older   *  WOMAN, her mother, looks down at the BOY with a stern glare   *  and the BOY takes off running...   *  INT. KITCHEN   *  ...arriving, out of breath, in a small kitchen which appears   *  to have been ransacked.   His FATHER is frantically stuffing   *  CANNED FOOD and aluminum wrapped ENERGY BARS into a suitcase   *  thrown open on the dining table.   He looks up...   *  FATHER   *  Where the hell have you been?!   *  BOY   *  I wanted to say goodbye...   *  A beat, as his FATHER looks furious, about to explode.   *  Instead, he pulls the BOY close and smothers him in a hug.   *  FATHER   *  You’ll see each other again.   *  They’re taking all the kids from   *  the neighborhood to the same Camp.   *  Blue (mm/dd/yyyy)   31.",
      "characters": [],
      "action_text": "BOY   *  And, we’re all coming home in a few   *  months anyway, right?   *  The FATHER looks at the BOY, profound sadness in his eyes.   *  FATHER   *  Right.   Just in time for soccer.   *  FLASH BACK TO:   *  THOMAS.   His heart now pounding.   He has no idea how many   *  seconds have passed during his vision, but MINHO is now at   *  the other end of the Hallway.   *  THOMAS closes the door as MINHO barks...   *  MINHO   *  C’mon! Don’t keep him waiting.   *  INT. STUDY - ALBY’S DWELLING   *  ALBY’S stands at his window, his head bandaged, looking out   *  over the Glade.   He turns to face THOMAS, and it’s   *  immediately clear he has no plans to say thank you.   *  ALBY   *  What did I tell you?   *  THOMAS doesn’t know how to reply...   *  ALBY (CONT’D)   *  We have laws here.   *  (beat)   *  But you chose to ignore them.   *  THOMAS   *  I was trying to help...   *  ALBY studies THOMAS.   *  ALBY   *  As much as Gally would like, we   *  can’t keep you locked up forever. And with all that’s going on, the   *  last thing I need is you loose in   *  the Glade looking for trouble.   *  THOMAS turns to MINHO...   *  Blue (mm/dd/yyyy)   32. MINHO   *  You showed promise out there.   Good   *  instincts.   But right now, you’re   *  still a liability.   *  THOMAS   *  Does this mean--?   *  ALBY   *  You’re a Maze Runner, Thomas.   *  (beat)   *  Don’t make me regret this.   *  Off THOMAS face, both nervous and excited...   *  INT. GEAR LOCKER ...the Gear Locker -- a small equipment shed -- where MINHO hands THOMAS a spear... MINHO For self-defense   only .   If you have to use it, you’re probably a dead man anyway. ...canteen... MINHO (CONT’D) Runners get extra rations of water, so no excuse for dehydration... ...and a lump of charcoal, which THOMAS eyes skeptically... MINHO (CONT’D) Trust me. MINHO keeps moving... INT. MAP ROOM ...to the Map Room, a large cabin lined with cubby holes around the periphery.   Each cubby is overflowing with rolled scrolls of par",
      "dialogue_count": 0,
      "word_count": 2385
    },
    {
      "scene_number": 5,
      "slugline": "INT. BEDROOM - ALBY’S DWELLING - CONTINUOUS The GIRL, her face streaked with tears, is sitting up in a cot.   GALLY stands against the wall, ALBY is beside her. ALBY Meet Theresa... THOMAS is transfixed as THERESA turns to the doorway slowly, still groggy.   Her eyes are slightly downcast as her gaze settles on him, and THOMAS is drawn into her sad visage.   For a beat, they are the only two people in the room. But GALLY is eager... GALLY You recognize him? THERESA I don’t know why, but... It’s the VOICE THOMAS has been hearing in his head... THERESA (CONT’D) How do I know you? THOMAS hesitates.   *  THOMAS I-- The stares intensify.   ALBY.   GALLY.   MINHO.   And THOMAS makes a decision... THOMAS (CONT’D) I have no idea who she is. (beat) Nothing about her is familiar. For a beat, his denial hangs there.   THERESA seems hurt, confused... THERESA That can’t be true. (beat) I’m sure... THOMAS ignores her, looks pleadingly to the other men... THOMAS I swear!   My mind’s a blank slate, just like the rest of you. Then harshly, back to THERESA... THOMAS (CONT’D) Why are you doing this? THERESA leans forward, growing in anger...  Blue (mm/dd/yyyy)   42.",
      "characters": [],
      "action_text": "THERESA I just woke up alone, surrounded by guys in some kind of nightmare with no memory... Your name is the only thing in my head!   I can’t help that! ALBY eases her back on the pillows... ALBY Calm down, please.   I know this is overwhelming. GALLY steps forward... GALLY I say the Greenie’s lying.   He’s been hiding something from the beginning!   We need to lock him back up until we get to the bottom of this! THOMAS is about to defend himself, when... ALBY That’s enough! ALBY glares at GALLY, then turns to THOMAS... ALBY (CONT’D) (to Thomas) This can’t be a coincidence.   You need to think long and hard how it’s possible. (beat, to Theresa) Both of you. GALLY, enraged, storms out of the room. A beat, as the others watch him go, and ALBY and MINHO share a concerned look.   Then... MINHO I’ve got more bad news. (beat) The Griever...it’s not alone out there.   There are two of them. ALBY’S eyes go wide, but before he can respond, NEWT comes to the door.   He sneaks a curious glance at THERESA, who looks away embarrassed. ALBY What? NEWT Zack and some of the guys are heading this way.   They’ve heard the girl’s awake. THERESA looks to ALBY, frightened.   He assures her...  43. ALBY You’re perfectly safe here.   I promise.   Get some rest, and we’ll talk more tomorrow. ALBY gets up and approaches NEWT. ALBY (CONT’D) Take Atlas and the other Baggers to head them off.   Anyone steps foot in my clearing, beat them unconscious. ALBY walks out, brushing past THOMAS. THERESA looks at THOMAS again, her expression pleading.   A beat, then he turns his back and walks out on her. EXT. HOMESTEAD GROVE - NIGHT THOMAS walks through the trees with CHUCK, who’s updating him on the latest gossip... CHUCK Everyone’s saying she asked for you by name!   How’s that possible? THOMAS shakes his head, disgusted... THOMAS It’s not. (beat) These guys really have nothing better to do than spread rumors? CHUCK tries to assure him now... CHUCK Don’t worry. They’re all just jealous. (beat) So, ",
      "dialogue_count": 0,
      "word_count": 5432
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ALBY’S CLEARING - THE GLADE - MOMENTS LATER Led by GALLY, NEWT and a crew of BAGGERS hauls THOMAS and THERESA out of the clearing, through the shouting, heckling CROWD... CHUCK is running alongside them, shouting at NEWT... CHUCK You can’t do this!! Until one of the BAGGERS violently shoves him to the ground. Then, THOMAS spots MINHO and the other RUNNERS heatedly arguing. MINHO is about to step forward into GALLY’S path, who braces himself for a confrontation. But THOMAS looks MINHO in the eye. THOMAS Don’t.   The Glade needs you.   Save as many of them as you can. MINHO reluctantly holds back, and the BAGGERS drag away   *  THOMAS and THERESA.   *  EXT. THE PIT - THE GLADE - NIGHT As they approach the Pit... THOMAS (whispers) I won’t let anything happen... THERESA Why are they doing this?   We’ve only tried to help them... GALLY and the BAGGERS stop. GALLY Just him. NEWT starts pushing THOMAS into the Pit... THOMAS Wait! ...tearing him away from THERESA.   THOMAS screams... THOMAS (CONT’D) Where are you taking her?! ...as he disappears into the darkness.  Blue (mm/dd/yyyy)   67.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 188
    },
    {
      "scene_number": 7,
      "slugline": "EXT. WEST GATE - THE GLADE - NIGHT MINHO stands watch by the open West gate.   He’s pacing with a spear and cross-bow strapped across his back.   A lit torch is planted in the ground, illuminating the first few feet of the Maze... MINHO stops.   The low   rumble   of what sounds like an oncoming train is approaching. PRELAP... a CLANGING BELL, as... INT. DARK ROOM THERESA sits on the edge of a cot, in a dark, windowless room, somewhere in the Glade.   She stands, startled. INT. THE PIT - THE GLADE THOMAS also hears it.   He gets up from the tiny cot in his cell and strains to look down the empty hallway... EXT. HOMESTEAD CLEARING - THE GLADE MINHO, ARON, and TIM converge from all directions in the   *  Homestead Clearing, which is totally abandoned. NEWT walks out of the trees to greet them... MINHO Gally? NEWT Wanted to ride it out with his Boys. MINHO nods. NEWT (CONT’D) Which Gate? MINHO All of them. EXT. NORTH, SOUTH, EAST, & WEST GATES - THE GLADE QUICK CUTS... Long lines of glistening GRIEVERS barrelling   *  out of the Maze and into the Glade... EXT. HOMESTEAD GROVE - THE GLADE Pure chaos as all the GLADERS crowd into a central cluster of three large tree-houses, connected by elevated walkways.  Blue (mm/dd/yyyy)   68.",
      "characters": [],
      "action_text": "MINHO is the last to climb up, and NEWT pulls up the ladder after him. The BAGGERS and RUNNERS are spreading out along the walkways, armed with a combination of spears, cross-bows, and clubs. Mixed among them are ZACK and several FIELD HANDS, brandishing their tools as weapons. Even WINSTON the cook is wielding a butcher’s knife. ALBY takes it all in, clearly sidelined, as CLINT approaches, struggling under the weight of a large satchel.   He opens it to reveal the CRYSTAL TUBES that contain the Serum... CLINT What little that’s left... ALBY nods, then turns to look inside one of the tree- houses... INT. CENTRAL TREE HOUSE - HOMESTEAD GROVE - THE GLADE ...Twenty of the youngest GLADERS, including CHUCK, are huddled in the crowded space.   They look up at ALBY, sheer terror in their eyes. ALBY offers a half-hearted nod of assurance, and closes the door. EXT. EASTERN FIELDS - THE GLADE A long line of GRIEVERS tears through the Eastern Fields,   *  crushing stalks of wheat, uprooting tomato vines, and sending chunks of soil flying through the air in a maelstrom of destruction... EXT. HOMESTEAD GROVE - THE GLADE MINHO, NEWT, and ALBY are side-by-side, waiting.   ALBY is resigned, detached.   NEWT, adjusting his weapons nervously. MINHO primed and ready. And then, the CRACK, SNAP, and BOOM of nearby trees being mowed down... MINHO Let’s take a few of the bastards with us. ...as the GRIEVERS converge from every direction.   *  INT. DARK ROOM THERESA backs away from the door of her tiny room as,   *  somewhere outside, one of the creatures grows closer,   *  louder...  Blue (mm/dd/yyyy)   69. EXT. HOMESTEAD GROVE - THE GLADE As the mass of GRIEVERS crowd the base of the tree cluster... A panicked ATLAS turns to NEWT... ATLAS Now? But NEWT hesitates.   MINHO steps forward... MINHO Only when they start to climb!   Aim for their eyes and their stomachs! INT. THE PIT - THE GLADE THOMAS has flipped over the cot in his cell and is bracing the frame against the wall, furiously tr",
      "dialogue_count": 0,
      "word_count": 2983
    },
    {
      "scene_number": 8,
      "slugline": "EXT. JUNGLE CORRIDOR - THE MAZE - MORNING The surviving GLADERS march through the Maze, THOMAS and MINHO in the lead.   NEWT and ATLAS guard the rear, while THERESA and CLINT help along the most severely wounded. The GLADERS, inside the Maze for the first time, stare in awe at its massive Walls and endless corridors. Only GALLY, limping along, keeps his eyes down, blocking out his surroundings... EXT. MAZE REFUGE - THE MAZE They finally arrive at a large circular room in the Grasslands, with four passages leading off in the cardinal directions.   As THOMAS looks around... MINHO Good chance they won’t find us here.   At least, not for a while. If they do, we’ve got options. The others spread out, finding soft spots on the mossy ground.   THERESA approaches WINSTON... THERESA Water now.   I think most of them can hold out on food for another few hours. MINHO, still beside THOMAS, points to one of the passages... MINHO That’s a dead end. (beat) I don’t think the others should see- - He trails off... THOMAS nods.   MINHO takes one last look at him and turns to NEWT... MINHO (CONT’D) C’mon.   Let’s work out a watch schedule. Now GALLY approaches... GALLY The process can take hours... THOMAS surveys the GLADERS, lingering on THERESA, who’s busy passing a canteen. THOMAS Let’s get started.  81.",
      "characters": [],
      "action_text": "EXT. CHANGING CHAMBER - THE MAZE The Walls of the Maze form a small, square room, where GALLY is driving the last of four spikes into the ground, at the corners of a blanket.   Each spike is attached to a rope that will tie down THOMAS’ hands and ankles... A CRYSTAL TUBE of SERUM is laid out on a rag, alongside the Griever’s STINGER. THOMAS watches as GALLY finishes... THOMAS What’s it like?   Really... GALLY looks up at him. GALLY You’re wondering if it’s worse than death. (beat) Your own?   Definitely. THOMAS turns away.   Then... GALLY (CONT’D) But, worse than watching your friends slaughtered?   Men you’ve lived beside and cared for?   I guess that depends on what kind of man you are. A beat as THOMAS absorbs GALLY’s words.   Then... THOMAS And, what if I’m not as strong as you? GALLY thinks, and for a moment, seems to soften. GALLY Strength comes from purpose. (beat) Alby knew that better than anyone. It’s why we followed him.   Loved him.   At least why I did. Suddenly, THERESA emerges at the threshold of the room... THERESA Can I have a minute? GALLY gives THOMAS one last look, his face pained and hard again, before he exits. THERESA sees the spikes in the ground and, under her breath... THERESA (CONT’D) Looks cozy...  82. THOMAS is not sure what to say. THERESA (CONT’D) What are you hoping to see, exactly? THOMAS A big ‘Exit’ sign too much to ask for? She doesn’t even smile. THERESA Don’t do it Thomas. (beat) There’s no guarantee it’ll help, and you could lose your mind like the rest of them.   Best   case, you’ll end up like Gally! THOMAS I don’t know...The whole bitter lunatic vibe is growing on me. THERESA begins to tremble, and he realizes how upset she is... THOMAS (CONT’D) I’m sorry.   I didn’t mean to-- THERESA We can hear each other’s thoughts Thomas!   That means something!   If you do this, we might never find out how, or why... THOMAS can’t bring himself to lie and reassure her.   He looks at the ground... THOMAS I have to try.   This is bigger th",
      "dialogue_count": 0,
      "word_count": 6320
    }
  ]
}