{
  "slug": "the-babysitter-2017",
  "title": "the babysitter",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 14152,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. NURSE’S OFFICE - DAY COLE   is twelve years old and losing his mind. He stands with his back against the wall, hands raised. COLE I don’t need it! I’m telling you. The   SCHOOL NURSE   is not convinced. And also not happy. SCHOOL NURSE Cole. Just because you don’t feel sick   right now   doesn’t mean you don’t need the shot. COLE I   never   get sick. So you can take that- He points to the   DISPOSABLE SYRINGE   she’s holding. COLE (CONT’D) And give it to Barry. His nose is always running- SCHOOL NURSE There’s nothing to be scared of. Cole freezes. COLE I am not scared.  INT. BOY’S STALL - TWO MINUTES LATER  Cole tries his best not to cry while he inspects the little band-aid on his arm. His best is not good enough. He’s in that perfectly awkward stage between being a cute kid and a handsome teen.  SOME ASSHOLE   bangs on his stall door- Cole jumps hard-  SOME ASSHOLE (O.S.) PUSSSSAYYYY.  And the asshole walks out of the bathroom laughing.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 173
    },
    {
      "scene_number": 2,
      "slugline": "EXT. SCHOOL ENTRANCE - DAY  Cole is waiting for the school bus beside   MELANIE , another twelve year old. Also his neighbor. Also definitely not a potential love interest for Cole so whoever told you that is an idiot and a liar and loser and a- MELANIE Did you know that only one baby was born on the Mayflower? How crazy is that shit. His name was, literally,  Oceanus . He didn’t even have a nationality. He was a citizen of the sea, I guess. COLE What class did you learn that in? MELANIE No one learns anything in class, Cole. That’s why we have the internet. A new SUV pulls up and Melanie waves to her   ANNOYING DAD.  MELANIE (CONT’D) We just got it. It’s pretty sweet. Has DVDs in the back, and like, a million horse power. COLE Cool. She climbs into the passenger seat. MELANIE Dad, can we give Cole a ride too? MELANIE’S ANNOYING DAD Cole, are your parents expecting you to take the bus? COLE (shrugs) I guess so. Melanie’s Annoying Dad shrugs back annoyingly. MELANIE’S ANNOYING DAD Then you gotta take the bus, sport! Sorry about that. 2.",
      "characters": [],
      "action_text": "COLE I didn’t even ask to- They start pulling away. Melanie waves bye and-  EXT. SUBURBAN STREET - DAY  Cole walks home alone from the bus stop. He turns around when the familiar sound of bicycles emerge from behind him.   THREE KIDS   on bikes. He hates these jerks, but what are you gonna do.  JEREMY   is the leader. He’s fourteen. So he’s cool as shit. Don’t even worry about his friend’s names. They’re not important, because they’re not Jeremy. JEREMY Colenoscopy! How’s it hanging? COLE I dunno. Okay. JEREMY Speaking of hanging, have your balls dropped yet? No-name Kids cackle. Cole mumbles something. JEREMY (CONT’D) Sorry man, I didn’t catch that. COLE I said why are you so interested in my balls. One of the other bikers slaps Cole upside the head. He was expecting that. JEREMY Dude, the last thing I care about is balls. On Saturday, I hooked up with Shelly MacEntyre. COLE ...The sophomore? JEREMY The sophomore. But in many ways, she was a senior. 3. COLE I don’t believe you. Cole gets smacked upside the head by a different biker. JEREMY It doesn’t matter if you believe me. It’s not like your belief in me will validate what happened to my dick. Ya wanna know how it was? COLE (kinda) No, not really. JEREMY I won’t lie. As a fourteen year old, in that kind of situation with a sixteen year old that looks like Shelly MacEntyre, it was overwhelming. I mean, she’s a woman.   Fully. Developed.   I really had to focus so as not to disappoint, ya know what I’m saying. The other bikers apparently know what he’s saying. Cole’s not quite sure, so he doesn’t say anything. JEREMY (CONT’D) I said do you know what I’m saying. COLE I guess. Jeremy blocks Cole’s path with his bike. JEREMY I guess isn’t good enough. I feel like you’re doubting me and I find that insulting. COLE But you just said it didn’t matter if I believed you- JEREMY I changed my mind, bitch. Cole stares at his shoes sheepishly. COLE Jeremy, I’m not trying to insul- 4. Jeremy suddenly pushes Cole in the chest. ",
      "dialogue_count": 0,
      "word_count": 2281
    },
    {
      "scene_number": 3,
      "slugline": "INT. SCHOOL BUS - MORNING  Cole sits beside Melanie on the way to school. COLE So I think they go to have sex but it just makes me feel like they go to get away from me. MELANIE They are definitely having sex. But they probably have sex when you’re at home too. COLE They don’t. They just watch TV. MELANIE Hotels have TVs. Cole had never thought of this. COLE I never thought of that. MELANIE Besides, I bet Bee has boys over at your place all the time.   Doing it . This makes Cole much more uncomfortable than the previous topic. COLE No way. Not a chance. MELANIE Dude, that’s what babysitters do! They put the kids down, sneak their boyfriends in.   Doing it . I mean seriously, have you ever been awake after she’s fallen asleep. Cole thinks about this. The answer is NOPE. MELANIE (CONT’D) Did you hear that Jeremy told everyone that she threatened to cut his mom’s throat and force feed him her spleen? Cole is blank for a moment. 15.",
      "characters": [],
      "action_text": "COLE That’s the best thing I’ve ever heard. MELANIE I know, right!  EXT. SCHOOL YARD - DAY  Cole eats a sandwich by the school gate. Across the street is the high school. He glances up and sees Bee with a group of fellow students. Even from across the street, Cole can see that her head is suspiciously resting on a   NERDY GUY’S SHOULDER . Cole tries to mask how much this upsets him.  DAD (V.O.) Oh my Goddddd.  INT. COLE’S HOME - DAY  Dad anxiously waits by the door as Mom parks and heads inside. Cole watches TV behind him. DAD We said we were gonna leave at five, didn’t we? COLE Please don’t involve me. DAD It’s almost five thirty. This is the problem! Mom walks in. Sees Dad’s WTF face. MOM Uh oh. DAD Five thirty! MOM So? DAD We were supposed to leave at five! 16. MOM Six. DAD Five! MOM If we were leaving at five, where’s Bee. Bee is nowhere. Dad notices this. Sighs. MOM (CONT’D) Well this trip’s off to a great start.  The door bell rings.  INT. COLE’S HOME - FIFTEEN MINUTES LATER.  Cole hurries to the door. Before he opens it, smooths out his hair and- Opens the door to reveal BEE. BEE WHAT UP, DAWG. COLE WHAT UP, GEE. They do their E.T. Finger move and Bee comes in. Mom and Dad bustle out, ready to leave. MOM Hiya, Bee. BEE Hi, Mrs. Johnson. Mr. Johnson. Where you guys heading tonight? DAD It’s a surprise! MOM The Hyatt. DAD Oh. Well, there will be more surprises! 17. MOM Probably not. You guys be good! BEE Oh, we will. Mom kisses Cole’s head goodbye. He hates it. MOM Bye, buddy. COLE Bye, Mom. Dad holds out his hand for a manly handshake. Cole hates it. DAD Remember son, you’re the man of the house. Protect her from all enemies. COLE Okay, Dad. Mom and Dad walk out to the car. They get in. Bee and Cole wait by the door. Mom and Dad drive off. Beeping a few times. Cole and Bee look at each other.  IT’S ON, BITCHES. INT. KITCHEN - NIGHT  DOUGH. PIZZA SAUCE. PEPPERS. ALL THE MEATS. ALL THE CHEESES. COOKING. BEE So you’re basically saying, intergalactic dream team. C",
      "dialogue_count": 0,
      "word_count": 3225
    },
    {
      "scene_number": 4,
      "slugline": "INT. COLE’S BEDROOM - CONTINUOUS  Cole very, very, very, very gently closes the door- And dashes for his phone. He ignores all the texts from Melanie and goes straight for-  911  He waits anxiously as it rings. Through his window, we see a light come on at the house next door, and see Melanie eagerly trying to get his attention- Wanting the scoop on all the sex she presumes is happening- Until she sees how utterly terrified he is. And becomes utterly terrified herself. 911 (CONT’D) 911, what is your emergency? He speaks very softly. COLE Hi, my name is Cole Johnson and a.a.a. guy was just murdered in my living room? He, uh, the address is 2455 Bigby Drive. Can, can you please send someone?  911 You’re doing great, Cole. Can you speak a little louder?  Cole shakes his head.  911 (CONT’D) Cole, are you shaking your head?  COLE Y.yes.  911 That’s okay. We’re sending some help over right now. Can you answer some more questions for me?  He nods. 37.",
      "characters": [],
      "action_text": "911 (CONT’D) Okay, I can guess you’re nodding so I’ll continue. Was the victim a family member?  COLE No he was a high school student boyfriend person.  911 And the attacker is still in the house?  COLE Yes. They are downstairs and having a blast.  911 How many are there, Cole?  Cole tries to remember. COLE Too many. Can you get my mom? She’s at the Hyatt in the city.  911 Of course Cole. Now listen to me. It’s important that you stay hidden-  COLE What if they come for me?  911 Then don’t-  A DING goes off in Cole’s twelve year old head. COLE I gotta protect myself. Thanks.  911 Nonono-  He hangs up the phone and takes a deep breath. Scans the room. Quietly as he can, he begins searching the room for something. In drawers. Under the bed. 38. Behind books. Until- He finds it-  THE POCKET KNIFE.  He opens it up quickly and tests it for sharpness on his finger. It   barely   breaks the skin. His cellphone rings back silently. 911. He answers it. COLE I found a knife. And hangs up again. He quickly throws on a pair of jeans. Socks. Shoes. Pockets the knife in his... pocket. Then goes over to the window. He pushes it open as quietly as he can. Melanie opens her window as well. MELANIE WHAT’S GOING ON?! COLE (FREAKING OUT)  SHHHHH!!!!  She gets it. MELANIE (silently, subtitled) WHAT’S GOING ON?! Cole doesn’t answer her. He looks out the window- It’s a long way down. FUCK. Cole looks up at Melanie. She moves her arm up and down: LADDER? 39. He looks around his room... And that’s when- Cole hears a bunch of FEET ON THE STAIRS. He looks at Melanie, waving her away from the window. He throws the curtains closed and- And dives on top of the bed. He roles over so he is facing the wall- Pulls the blanket over him so his jeans and shoes aren’t visible as- Bee, Max, Sonya and Allison enter the room. Again, they don’t particularly talk quietly. SONYA Ohmagod, this room is ADORABLE. BEE He’s so cute. You have no idea. Max flips through some of Cole’s books. MAX Oh man, Jules Verne!",
      "dialogue_count": 0,
      "word_count": 7595
    },
    {
      "scene_number": 5,
      "slugline": "INT. THE CLOSET - NIGHT  It is totally dark. And totally quiet. Totally, that is, except for the soft breathing. As your eyes get used to the darkness, you realize you are not alone here. A little girl,   TAMMY   (10), is hiding here. She does her best not to make a peep. She peeks through the closet doors and- Sees   THE SHAPE OF SOMEONE   searching the room. Wielding a flashlight. Tammy holds her breath. As the person with the flashlight leaves the room. She exhales just a little-  AND THE PERSON CHARGES BACK INTO THE ROOM- FLASHLIGHT IN OUR EYES- THE CLOSET IS PULLED OPEN AS- TAMMY SCREAMS AND- INT. THE KITCHEN - MORNING  A teapot whistles as-  MR. AND MRS. MORGAN   return home from their night away. MR. MORGAN Tammy-baby! We’re- MRS. MORGAN (screaming) OH MY GOD!! She runs into the kitchen where- Tammy is unconscious on a kitchen chair- Tied up with a LOT of rope. 88.",
      "characters": [],
      "action_text": "VOICE (O.S.) Uh-uh-uh.  Mrs. Morgan and her husband freeze and- Slowly turn to see someone pouring themselves some tea. VOICE (CONT’D) I’d get you some tea, but I’m actually pretty pissed off with you both. So... She turns around and faces them, revealing, of course: BEE No tea for you.  FIVE MINUTES LATER.  Bee sits beside the still sleeping Tammy, while Mr. and Ms. Morgan watch in terror. Bee slowly drinks her tea. Puts it back on her plate.. BEE Naw, I’m just fucking with you, I don’t drink tea. They continue staring at her in terror. BEE (CONT’D) I just liked the idea of you guys walking home, a kettle going off, your little Regan MacNeil tied to a chair, and me drinking tea calmly. MR. MORGAN ...Like... Ronald Regan? Bee nonchalantly   THROWS THE TEA CUP ACROSS THE ROOM.  Where it shatters. Mr. and Mrs. Morgan jump in their seats. BEE But I am not calm, David and Mallory, am I. They shake their heads as if they were five years old. 89. BEE (CONT’D) I’m pretty far from calm. I am light years away from calm. Because I am   so sick of this shit.  She points at them. BEE (CONT’D) You had one job. We agreed to this. In fact, what did I say when I sought you out? MR. MORGAN (whisper) Nothing. BEE Excuse me, David? MR. MORGAN You said nothing. BEE Why did I say nothing. MR. MORGAN Be...because we sought you out and asked you to help. Bee sits back in her chair, satisfied. BEE Ding ding ding! So you can imagine how super annoying it is when, the kid and I are hanging out, the kid goes to bed, I go to do my thing and- She slams forward- BEE (CONT’D) You didn’t tell her to take the pills I gave you. MRS. MORGAN We did tell her! BEE Well then you’re a terrible parent, because now here you are, here I am, angry, and here is your daughter.   (MORE)  90. Should I wake her up and be like, mommy and daddy signed you up for this so they could have happier lives? MR. MORGAN No! MRS. MORGAN Please! Bee turns Tammy’s head so she’s facing her parents. BEE  Mommy, why don’t you love",
      "dialogue_count": 0,
      "word_count": 878
    }
  ]
}