{
  "slug": "the-hitmans-bodyguard-2017",
  "title": "the hitmans bodyguard",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 19,
  "characters_count": 0,
  "characters": [],
  "total_words": 25587,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MASTER SUITE - MORNING  Fresh steam from a shower fills the air. Dvorak’s “Tempo di  Valse” plays on the sound system with digital clarity.  MICHAEL BRYCE is getting ready for his day. Mid-thirties,  handsome, very much in shape. This is a man at the height of  his powers.  He uses a shaving brush and real cream, not foam. He hums  along with Dvorak as he whisks the blade over his skin.  He quickly makes the bed -- the sheets are barely mussed.  He’s a good-looking guy to be sleeping alone.  Now onto the clothes. If you know suits, you can tell Bryce’s  is handmade. So are his shoes. He completes the outfit --  cufflinks, wristwatch, double-windsor on the necktie.  Bryce’s cell phone BUZZES. Text message. It’s urgent. His  movements become sharper, faster. He straps on two matching  GLOCK 18 MACHINEPISTOLS -- one holstered above each hip.  Bryce slips on an overcoat of fine vicuna wool. He takes a  final look in the mirror -- the concealed guns don’t break  the line of the coat. Perfect.  INT. HOLDING CELL - MORNING  Darkness.  The LIGHTS snap on. The fluorescent hum is loud in the  confined space. Time to wake up.  SEAN KIERNAN, mid-thirties, is already awake. And already  dressed. He sits on his bare cot, staring straight ahead. He  hardly even winces at the sudden bright light.  Under the jailhouse scruff, Kiernan’s a handsome guy. But his  clothes are drab, carefully chosen not to stand out. And his  expression is dark -- a black cloud hangs over him.  The cell door buzzes open. Four armed GUARDS enter. Kiernan  rises from his cot. With just a hint of an Irish brogue:  KIERNAN  Morning, lads.  Kiernan politely complies as the Guards put him in leg irons,  a waist chain, and handcuffs.  They lead him into the hall. Even in the restraints, Kiernan  moves with a fluid grace.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 315
    },
    {
      "scene_number": 2,
      "slugline": "INT. BRYCE’S JAGUAR (MOVING) - DAY  TITLE:  Geneva, Switzerland  Bryce is behind the wheel of his Jaguar XFR, gliding through  the business district. Fast but controlled.  He’s downloaded a set of architectural BUILDING PLANS to his  phone. He scans through them as he drives, while also doing a  call through his Bluetooth:  BRYCE  Tell him I’ll be there shortly. And  that he should relax. There’s  nothing to worry about.  MALE VOICE (ON PHONE)  Um...?  BRYCE  I know. Tell him anyway.  Bryce hangs up. Turns on the stereo. Classical MUSIC plays.  INT. A CONFERENCE ROOM - DAY  Recessed lighting. A long, polished table. Frosted windows of  bulletproof glass.  TITLE:  INTERPOL Global Headquarters -- Lyon, France  Kiernan, still shackled, sits at the table with his lawyer,  HARR. They’re facing a line of three ATTORNEYS. Several other  PEOPLE sit in shadow against the wall.  Everyone tries not to stare at Kiernan, but they can’t help  it -- they’re fascinated by his presence. The lead attorney  on the other side, MORENO, begins.  MORENO  Mr. Kiernan. Following negotiations  between the International Criminal  Court and all of the relevant  nation-states, we now have a formal  and binding offer.  Paperwork is slid across the table.  2.",
      "characters": [],
      "action_text": "MORENO  If you testify against President  Demidov -- and if your testimony  results in a conviction -- your  wife will receive a full pardon  from all jurisdictions.  KIERNAN  Ex.  MORENO  Pardon?  KIERNAN  Janet’s my ex-wife.  MORENO  Of course. Apologies.  KIERNAN  Also, she’s completely innocent and  you people have no business  charging her with anything. You  want to apologize for that?  Harr motions Kiernan to settle down. He skims the document.  HARR  That will suffice for Janet, very  good. And now -- what will my  client receive?  Another document is slid across the table. A single sheet.  MORENO  This letter, signed by myself and  the leadership of the ICC, praising  Mr. Kiernan’s cooperation and  strongly recommending leniency.  Harr is appalled. This one, he doesn’t even bother reading.  HARR  My client is about to give you the  most reviled war criminal on the  planet. And in return, you want to  give him a thank-you note?  MORENO  It will be a mitigating factor--  3. HARR  There is no mitigating. My client  is a contract killer, facing two  dozen counts of murder in ten  countries. Absent a deal, he will  never breathe free air again. We  all know that. Now--  A SOUND stops them. Pen scratching paper. Kiernan is signing  the document.  Harr starts to protest -- but a look from Kiernan tells him  it’s pointless. Kiernan slides the papers back.  One of the people along the wall stands. He’s INTERPOL DEPUTY  DIRECTOR RAFAEL CASORIA. Fifties, with an old-world elegance.  CASORIA  Let’s get this man to the Hague.  INT. UNDERGROUND GARAGE - DAY  Kiernan, now in a protective vest along with his restraints,  is brought in by the Guards.  CASORIA  This is Agent Ryder.  INTERPOL AGENT AMELIA RYDER, thirty, attractive, falls into  step with them. This is a big assignment for her.  AMELIA  Sean, I’ll be accompanying you,  along with your security detail --  -- a dozen OFFICERS, clad in all black, wearing full body  armor and carrying ASSAULT RIFLES. They’re standi",
      "dialogue_count": 0,
      "word_count": 1384
    },
    {
      "scene_number": 3,
      "slugline": "INT. LOBBY - DAY  Bryce gets off first. All clear. He motions Seifert to  follow. The doors close behind them. Bryce takes out his cell  phone. It’s receiving a CAMERA FEED. A view of --  THE ELEVATOR  The cylinder Bryce placed on the ceiling is a CAMERA. The  elevator doors open --  -- and now the camera has a view of the garage. Rows of cars,  nothing unusual. The Maintenance Guys are gone.  Bryce studies the feed, then leads Seifert towards the  stairs. Bryce knows right where they are -- he’s got the  building layout memorized.  INT. PARKING GARAGE - DAY  Bryce and Seifert exit the stairwell.  BRYCE  Where are you parked?  Seifert points out his car. Bryce aims his phone at it --  camera mode, then he switches to an INFRARED VIEW.  There’s a HEAT SIGNATURE on the underside of Seifert’s car.  BRYCE  Let’s take my car.  SEIFERT  Why?  BRYCE  Because they put a bomb on yours.  Keep walking. Everything’s fine.  They go to the Jaguar. Bryce puts Seifert in the backseat. As  he’s about to start the engine --  BRYCE  Put your head down.  SEIFERT  Why?  BRYCE  They put a bomb on my car, too.  Before Seifert can protest, Bryce calmly turns the ignition --  9.",
      "characters": [],
      "action_text": "-- PHWOOOOM -- the CAR BOMB detonates --  -- the Jag is hurled straight into the air --  -- then slams back down to the ground.  The Jag is scratched up, smoking, but otherwise --   intact.  Seifert, who didn’t put his head down like he was told, is  dazed from bumping against the roof. And shocked to be alive.  BRYCE  Custom vehicle.  Bryce throws the Jag into gear, guns it towards the exit --  EXT. SEIFERT’S BUILDING - DAY  The two “Maintenance Guys” appear on either side of the ramp,  both with SUBMACHINE GUNS -- FIRING at the Jag.  This time, Bryce doesn’t have to tell Seifert to get down.  The fusillade of BULLETS chips away at the Jag’s armored  paneling and ballistic glass. Bryce tears past the attackers,  they’re almost to the street --  -- a GARBAGE TRUCK slams to a stop, cutting off their escape.  Bryce brakes, cuts the wheel hard, comes to a stop broadside  of the truck.  Terrified PEDESTRIANS up and down the sidewalk. No clear  escape path. The attackers are still FIRING, the ballistic  glass is starting to give...  There’s just enough space between the Jag and the truck for  Bryce to open his door, drawing one of his MACHINEPISTOLS --  -- a half-second faster than the truck’s PASSENGER, leaning  out the window with a SUBMACHINE GUN. Bryce FIRES -- the  Passenger ducks back in.  Bryce pulls a small BLACK OBJECT from his coat, throws it in  the truck’s cab --  -- it’s a STUN GRENADE. It explodes with a burst of blinding  LIGHT and a concussive BOOM.  Bryce draws his other MACHINEPISTOL -- turns and FIRES over  the hood of the Jag at the Maintenance Guys. He has excellent  cover, they’re on exposed ground -- he kills them both.  10. Back to the truck. The Passenger and DRIVER are still  disoriented, trying to recover --  -- too late. Bryce SHOOTS them, too. Silence. Bryce scans the  environment. No further threats.  He gets back in the Jag. GUNS it. Checks the mirrors. No  pursuit, no second wave. Bryce whips --  AROUND THE CORNER  then pulls over. Seifert",
      "dialogue_count": 0,
      "word_count": 1714
    },
    {
      "scene_number": 4,
      "slugline": "INT. KIERNAN’S SUV - DAY  Just Amelia and the final Officer in here. She’s trying the  radio --  AMELIA  We’re under attack--!  No reply, no static, nothing. Radio’s dead. The Officer draws  his weapon and races into the  STREET  and right into a barrage of GUNFIRE. He doesn’t have  Kiernan’s speed -- he’s immediately cut down.  The final two Attackers move in on the SUV --  -- Kiernan emerges from the smoke, SHOOTS them both --  -- just as a THIRD ATTACKER rises from behind a car --  -- Kiernan spots him -- almost in time. They both FIRE --  Kiernan makes a perfect killshot, but also gets HIT.  The shooting stops. Silence. Charming, historic Lyon is now a  graveyard.  Kiernan checks his body. Grazed in a few places -- and a  direct hit, just below his knee. BLOOD flows from it. Kiernan  stands -- he can put weight on the leg, at least.  Amelia calls from inside the wrecked SUV:  AMELIA  Sean?  KIERNAN  I’m fine. Check the others.  Kiernan’s not fine. His leg is bleeding heavily. But he’s got  work to do:  He rifles through the corpses of the Attackers. He digs  through pockets, rips off masks, checks tattoos. He does this  roughly, quickly. No respect for the dead.  Amelia finds the SUV’s med kit and starts checking the GIPN  team for survivors. None to be found. She’s shaken -- this  kind of carnage is beyond her experience.  Kiernan rips the sleeve of one of the Attackers -- there’s an  intricate TATTOO of a CHURCH on his forearm.  16.",
      "characters": [],
      "action_text": "Kiernan pulls a CELL PHONE from the Attacker’s pocket. He  hits SEND. The call connects. Kiernan acts scared, desperate:  KIERNAN  (Russian, subtitled)  (We took fire. I’ve been hit... I  can’t find anyone. I need the key.)  MALE VOICE (ON PHONE)  (Russian, subtitled)  (Did you kill Kiernan?)  KIERNAN  (I’m... not sure. I’ve been shot. I  need the key. Please.)  MALE VOICE (ON PHONE)  (beat)  (Eight seven two. Good luck.)  The call disconnects. Kiernan uses the phone’s camera to take  a few pictures of the church tattoo, then --  AMELIA  Drop the weapon.  He turns. Amelia’s holding the med kit -- and her SIDEARM,  aimed right at him. He shrugs, kicks his gun to her.  The blood from Kiernan’s leg is pooling on the ground around  him. She tosses him a set of handcuffs.  AMELIA  Put these on. I’ll dress your leg.  Kiernan hurls the cuffs away. Forget it. A brief stare-down.  He wins.  KIERNAN  We’re exposed out here.  Kiernan limps away. Amelia follows him into an  ALLEY  He digs through the med kit. He pockets a needle and surgical  thread, then starts field work on his leg. Alcohol, pressure  bandage, the basics.  Keeping her gun on Kiernan, Amelia takes out her phone --  KIERNAN  No calls.  17. AMELIA  I have to tell Interpol--  KIERNAN  You can’t trust Interpol. After  this?  AMELIA  I’ll take precautions. But we’re  the only agency with transnational  jurisdiction. It’s still my only  way of getting you to the Hague.  KIERNAN  I can get there on my own.  Amelia ignores that, dials --  INT. INTERPOL - CONFERENCE ROOM - DAY  Casoria, Fowler, and other AGENTS are gathered. Casoria  lunges for the phone. Puts her on speaker.  CASORIA  We lost radio contact. What’s  happening--?  INTERCUT  AMELIA  We got hit. Everyone’s down.  CASORIA  Dear God. And Kiernan?  KIERNAN  Don’t tell them--  AMELIA  Kiernan’s alive.  CASORIA  Where is he now?  She’s got the gun -- Kiernan will have to convince her.  KIERNAN  I’m not going to run, alright?  Testifying is how I get Janet free",
      "dialogue_count": 0,
      "word_count": 1026
    },
    {
      "scene_number": 5,
      "slugline": "EXT. LYON BACKSTREETS - DAY  Kiernan slips through the streets, making his getaway,  talking on the cell he took off the Attacker.  KIERNAN  (heavy Irish accent)  Aye, it’s urgent. Did you not hear  me say I’m her lawyer?  A few moments later --  INT. DOCHAS CENTRE PRISON - PHONE ROOM - DAY  Nothing but a table, chair, and phone. A Guard leads JANET  KIERNAN inside. She’s thirty, a soft beauty. Doesn’t belong  in this place. The Guard leaves. Janet picks up.  JANET  (Irish accent)  This is Janet.  INTERCUT  KIERNAN  It’s Sean.  Her breath catches. Conflicting emotions.  KIERNAN  They’re treating you well enough?  You’re getting by, are you?  JANET  Aye. Well enough.  KIERNAN  I am going to get you out. I  promise you that. I know I’m not  someone you ought to believe, but I  will fix this. I ruined your life  once, Janet. But just the once.  JANET  Sean... how are you calling me?  What’s happened?  KIERNAN  Don’t ask. I don’t want to lie to  you again. Be well.  JANET  Sean--?  21.",
      "characters": [],
      "action_text": "He hangs up. After the line has gone dead --  KIERNAN  Love you, dear.  Kiernan turns the phone off. Removes the SIM card.  EXT. AMELIA’S BUILDING - DAY  Kiernan, looking ashen, goes in through a side entrance.  INT. AMELIA’S APARTMENT - BATHROOM - DAY  Bloody towels all over the floor. Kiernan is suturing the  wound on his leg. His stitching job is adequate but a little  jagged -- first aid isn’t his strong suit.  He’s using vodka as a disinfectant. He wants a drink, but the  bottle’s almost empty. Hmm. He pours a little more on his  leg, then gulps the rest. It goes down like water.  LATER  Kiernan tests his leg -- putting weight on it, springing off.  Like a mechanic running diagnostics.  INT. AMELIA’S APARTMENT - GUEST ROOM - DAY  Kiernan is laid out on the bed. Trying to conserve energy.  He scrolls through the cell-phone PHOTOS he took of the  Attacker’s tattoo. Zooms in. In the detailed inkwork, now we  see something more -- tiny NUMBERS hidden in the church.  On a notepad, Kiernan has written “8 2 7.” He copies down  numbers from the tattoo, then begins transposing the digits.  Some kind of code.  INT. AMELIA’S APARTMENT - KITCHEN - DAY  Kiernan burns the notepad in the kitchen sink, then runs the  garbage disposal. Destroying it completely.  INT. DEMIDOV’S CELL - DAY  Except for the heavy metal door, this feels more like a hotel  suite than a prison cell. The inmate is the man himself:  ALEXANDER DEMIDOV, fifties.  22. TITLE:  ICC Detention Centre -- The Hague  Demidov has lost none of the imperiousness of power. He wears  a suit and tie, and looks ready to retake command at any  moment. The news plays on a small TV:  NEWSCASTER (ON TV)  The trial of Alexander Demidov  continues. Demidov, the former  president of Kajekistan, is accused  of selling black-market arms on a  massive scale to terrorist groups  and fellow dictators across the  globe. Fueling genocides in Africa  and Asia, as well as terror attacks  against western democracies...  Demidov is unfaz",
      "dialogue_count": 0,
      "word_count": 1098
    },
    {
      "scene_number": 6,
      "slugline": "INT. AMELIA’S APARTMENT - NIGHT  Amelia lets Bryce in. She has a few bruises and scratches  from the day’s attack. He pulls her close, concerned.  BRYCE  What happened?  AMELIA  Work. Just banged up. I’m fine.  BRYCE  Are you sure? You need to put  ointment on this.  AMELIA  Michael, I’ve had full medical  attention. I promise you, I am in  perfect health.  BRYCE  Not for long.  Satisfied that she’s alright, Bryce sweeps her up and puts  her on the table. She laughs, playfully fighting him off. As  they make out --  AMELIA  No, Michael, focus. I brought you  here for work.  BRYCE  You’re going to start paying me?  That’s really not necessary.  She’s trying to break it off before they’re too far gone --  AMELIA  Seriously, we can’t. This is  important. Get up. Up.  One last deep kiss before they break.  AMELIA  You brought the blood, good --  She opens the cooler. Inside: a half-dozen RED ROSES.  AMELIA  I told you this was business.  BRYCE  They’re short-stem. They’re  business roses.  26.",
      "characters": [],
      "action_text": "AMELIA  And they’re lovely.  She digs deeper in the cooler -- several packets of BLOOD.  AMELIA  O-neg, even more lovely. Come on. I  want you to meet someone.  Amelia leads Bryce down the hall to the guest bedroom. She  knocks lightly on the door, opens it --  -- but the bed is empty. Kiernan’s gone. Amelia turns --  -- Bryce is gone, too.  From the kitchen: CLICK. CLICK. Two GUNS being cocked almost  simultaneously.  Amelia runs into the  KITCHEN  Bryce and Kiernan have their guns leveled at each other.  AMELIA  Guys. Easy.  BRYCE  What is he doing here?  KIERNAN  I’ve got the same question.  AMELIA  You two know each other?  BRYCE  We’ve never been formally  introduced.  KIERNAN  But I’ve shot him a few times.  BRYCE  Shot at, I think you mean.  KIERNAN  I winged you in Tangiers. I know I  did.  BRYCE  Mmm, sorry. But at this range, you  might have a chance.  27. AMELIA  Guys. I’m sorry for the surprise. I  will explain. Guns down.  Neither man complies. No one wants to back down first.  Amelia steps right between them. She stares hard at Bryce. He  lowers his gun. Kiernan follows.  AMELIA  Now you’re being formally  introduced. Michael Bryce, meet  Sean Kiernan. Your new client.  They stare at each other. What the hell...?  AMELIA  We are going to go in the other  room and speak politely. Make  yourselves comfortable.  Bryce and Kiernan are not at all comfortable.  INT. AMELIA’S APARTMENT - LIVING ROOM - NIGHT  The roses have been put into a vase.  Bryce comes out of the kitchen with a cappuccino. Kiernan is  propped up on the couch, getting a transfusion of the blood  from Bryce’s cooler.  Amelia adjusts the pillows for Kiernan. Bryce’s eyes narrow.  BRYCE  Amelia, I can’t say I approve of  your new friends.  KIERNAN  Not that I care about your  approval, but I’ve never killed  anyone who didn’t have blood all  over their own hands. If a job’s  not right, I turn it down. You  should try that sometime.  BRYCE  Forgive me. Did I just receive  moral guidance from ",
      "dialogue_count": 0,
      "word_count": 5579
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BEHIND SPUISTRAAT 294 - DAY  Bryce and Kiernan stand in the alleyway, with a view of the  back door. Bryce points his phone at the house.  BRYCE  No heat signatures. I’ll go in  first and clear the structure. Once  I know it’s safe, you can come in.  As Bryce starts for the back door --  KIERNAN  You have a lot of experience  breaking into places, do you?  Bryce considers that. He stands to the side, keeping watch.  Kiernan examines the back door.  KIERNAN  No cameras, no tripwires, no  pressure plates. These boys really  want this place to blend in.  Kiernan balls up his coat and smashes the back windowpane.  Reaches in and unlocks the door. Easy enough.  Bryce steps forward -- I go in first. Kiernan relents.  INT. SPUISTRAAT 294 - DAY  The house is sparsely furnished. Everything is orderly and  untouched. This looks more like a model home than a place  where someone actually lives.  Bryce does a sweep through the rooms. Kiernan tries to hang  back, but it’s not in his nature -- he keeps moving ahead,  getting in Bryce’s way. They’re still working out the kinks.  Fortunately, there’s no threat in the house. The only  remarkable thing is a heavy deadbolt on the basement door.  As a loud BUS rolls past outside, Kiernan FIRES a single  shot, blowing out the deadbolt.  They descend the stairwell into --  INT. BASEMENT - DAY  Virtually the entire basement is glistening WHITE. All the  surfaces are surgically clean.  54.",
      "characters": [],
      "action_text": "The main area is dominated by a full OPERATING ROOM --  surgical table, biomonitor, implements -- they’re equipped to  perform major surgery down here.  A row of empty beds, a generator, stores of food and water.  This is a miniature hospital, entirely self-contained.  KIERNAN  If I’d left any survivors in Lyon,  they’d be here getting patched up.  Kiernan starts combing through the basement. Bryce joins him.  The men quickly tear the place apart. And...  ...they find nothing. There’s nothing here that isn’t for  medical or survival purposes.  Kiernan is getting more and more frustrated.  KIERNAN  Dammit, dammit...  Kiernan keeps searching -- going back over places he’s  already checked. Bryce knows it’s hopeless.  BRYCE  This place has been scrubbed. We  should go.  Bryce moves for the stairs. Kiernan is fuming.  KIERNAN  And do what, then? This is our only  lead.  BRYCE  I guarantee you we activated some  sort of alarm when we came in.  Think we’ll be alone much longer?  KIERNAN  You’re right. Good. Good thinking.  BRYCE  What?  Kiernan checks his gun.  KIERNAN  Whoever comes, we kill all but one.  We get what we need out of him.  55. BRYCE  My job is to keep you alive, I’m  not going to let you--  KIERNAN  --let me? Alive’s not good enough.  Without evidence, I can do nothing  for her.  BRYCE  We have no idea what’s coming. This  position is impossible to defend.  Bryce starts up the stairs, like he’s leaving --  BRYCE  Let’s hide upstairs.  On Kiernan. Good.  INT. SPUISTRAAT 294 - FIRST FLOOR - DAY  Kiernan and Bryce leave the back and basement doors ajar,  then scatter SYRINGES on the ground. Now it looks like  junkies broke in and left in a hurry.  They take up hiding places, Bryce with a view of the street.  They settle in to wait.  Nothing yet. Calm before the storm.  BRYCE  Understatement, but you’ve gone  above and beyond. For the court,  for your ex. Maybe they’ll cut your  sentence after all.  KIERNAN  Wouldn’t count on that. Got a bit  of a record, you ",
      "dialogue_count": 0,
      "word_count": 1252
    },
    {
      "scene_number": 8,
      "slugline": "INT. SPUISTRAAT 294 - FIRST FLOOR - DAY  Kiernan struggles to keep Taras on his feet. Bryce joins them  at the door. SIRENS already closing in. Bryce runs out to --  EXT. SPUISTRAAT 294 - DAY  CARS waiting at a light. Most of the vehicles are small and  underpowered, but there’s a BMW M3 --  -- Bryce aims his machinepistol at the M3’s DRIVER.  BRYCE  Out.  The Driver bails. Bryce takes the wheel.  INT/EXT. BMW M3 (MOVING) / AMSTERDAM STREETS - DAY  Bryce pulls the car around. Kiernan gets in the back, pulling  Taras in with him.  As Bryce drives away, Kiernan digs into the medical supplies.  Rips Taras’s shirt open to treat him.  Taras tries to push Kiernan away -- Kiernan calmly holds up  his gun in one hand, the bandages in the other.  KIERNAN  (Pick one.)  Taras relents. Kiernan starts dressing his wounds.  They didn’t get out of there fast enough -- the POLICE have  already locked onto them. TWO CARS in pursuit and closing.  Bryce tears through the cobbled streets and over the bridges  of the Canal Loop -- fast, but not flooring it. Staying in  control, trying not to kill any PEDESTRIANS and CYCLISTS.  In the backseat, Kiernan tries to dress Taras’s wounds -- but  he’s having a hard time with it. Blood everywhere. Bryce  sneaks a look in the rearview.  BRYCE  I realize this goes against your  nature, but the idea is to keep the  blood   inside   the body.  KIERNAN  I’m working on it --  60.",
      "characters": [],
      "action_text": "Kiernan glances up -- sees the POLICE CARS closing in --  KIERNAN  Oh Jaysus, maybe try the gas pedal,  why don’t you?  BRYCE  It’s not a getaway if we crash.  Kiernan rips open a packet of CELOX (clotting powder) and  dumps it over one of Taras’s wounds -- Bryce watches --  BRYCE  Don’t just sprinkle it, you’ve got  to pack it in --  KIERNAN  Will you shut up! And stop driving  in circles. You stay in one area,  the cops will converge --  BRYCE  I know what I’m doing --  Bryce rounds a corner, a POLICE CAR has pulled into the  middle of the street ahead of them, blocking the way --  -- Bryce brakes hard.  KIERNAN  No, ram him!  Bryce ignores Kiernan. Stays on the brake. Once he’s almost  to a full stop -- he hits the gas again --  -- and drives right into the cop car. At this low speed, it’s  not a crash; he’s just pushing the other car out of the way.  BRYCE  Why ram when you can nudge?  Bryce pushes through -- they’re in the clear again, racing  down  KERKSTRAAT  It’s a long straightaway, coming up the Magere Brug bridge.  But there are more POLICE CARS bearing down on them.  BRYCE  Think you can drive better? Because  I know I can do what you’re doing  better.  61. KIERNAN  Give me the wheel.  Bryce opens the sunroof -- throws the car in neutral -- leaps  up to give Kiernan space to crawl in below him --  -- now Kiernan has the wheel.   And he absolutely floors it.  Bryce is almost thrown from the car -- he barely manages to  climb into the backseat.  Kiernan drives exactly how you’d expect him to. He’s fierce.  He drives straight at the oncoming cop cars -- then cuts at  the last second, weaving around them, blasting down the road.  Almost to the Magere Brug -- it’s a pedestrian-only bridge,  but not today -- Kiernan tears down it -- miraculously not  killing anyone --  -- in back, Bryce works on Taras. His hands are sure --  expertly packing in the Celox clotter, applying pressure, and  putting on bandages even as the car weaves back and forth.  Bryce keeps hi",
      "dialogue_count": 0,
      "word_count": 2178
    },
    {
      "scene_number": 9,
      "slugline": "INT. ICC - SIDE OFFICE - DAY  Amelia’s alone. Door closed. She picks up in half a ring.  INTERCUT AMELIA & BRYCE  AMELIA  Are you alright and where the hell  are you?  BRYCE  We’re both fine. Slight change of  plans, but all is well.  AMELIA  Thank God. You’re not talking to  Amelia now. This is Agent Ryder.  Where are you?  BRYCE  (beat)  Amsterdam.  AMELIA  Really? That is so wonderful. And  how are the hookers, Michael?  BRYCE  Long story. We’ll be there soon.  Kiernan grins -- it’s fun watching Bryce take a scolding.  AMELIA  There is too much riding on this. I  need to know what is going on and I  need to be there with you.  BRYCE  Absolutely not. It’s too dangerous.  AMELIA  The other option is, I tell Casoria  to put a red notice out on both of  you. That’s you on every wire all  over Europe. What’s it going to be?  BRYCE  Can you put Amelia back on?  AMELIA  Michael.  Bryce gives Kiernan a sour look. He’s stuck.  70.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 172
    },
    {
      "scene_number": 10,
      "slugline": "INT. ICC - HALLWAY - DAY  Amelia emerges from the side office and heads for the exit,  slipping through the milling CROWD.  No one takes any notice of her, except --  Ivanov.  He signals to Oleg and Petr. They start tailing her.  INT. ICC - TRIAL CHAMBER 1 - DAY  Casoria is taking his seat. His cell phone BUZZES. An email  from Amelia:  “Trust me for one day more.”  Casoria sees she’s not in the gallery. Considers his options.  Starts to say something to the AGENT next to him -- then  holds off. He settles in to wait. Not thrilled about it.  INT. AMSTERDAM STATION CENTRAAL - DAY  Amelia gets off the NS train. Heads right for the lockers.  Oleg and Petr get off the train a few moments after her. They  shadow Amelia, switching off to avoid being spotted. They’re  both wearing earpieces.  AT THE LOCKERS  Amelia sits on a bench, feels under her seat -- a LOCKER KEY  is taped there. She goes to the locker, opens it. Inside: a  CELL PHONE. She hits redial.  KIERNAN (ON PHONE)  Buy a Metro ticket for the fifty-  three line towards Gaasperplas. You  need to be on the next train.  She’s already moving --  -- Oleg, seeing Amelia on a cell, pulls a small DEVICE from  his bag. Jacks it into his earpiece.  As Oleg scrolls through his display, We HEAR snippets of  PEOPLE TALKING -- he’s tapping into all the cell-phone  conversations around him. His device is an IMSI CATCHER.  Oleg keeps scrolling, finds the call he wants:  71.",
      "characters": [],
      "action_text": "AMELIA (ON PHONE)  I see it. I’m going there now...  Oleg follows after her.  INT. AT THE TICKET KIOSK - DAY  Ticket in hand, Amelia rushes towards the network of tunnels  leading to the Metro trains.  Oleg trails her, farther back in the crowd of TRAVELERS.  KIERNAN (ON PHONE)  Take a seat in the center car.  You’ll lose service. But keep this  phone on you.  As Amelia goes  AROUND A CORNER  someone falls in next to her -- BRYCE. He puts a finger to  his lips. Squeezes her hand, a silent hello.  As he leads her towards the wall, he plucks the phone from  her hand. Kiernan is still giving instructions:  KIERNAN (ON PHONE)  Redial this number at every stop  and every time the train goes above  ground...  Bryce drops the phone into a PASSERBY’s shoulder bag -- then  guides Amelia through a SIDE DOOR --  -- just before Oleg comes around the corner. Oleg scans the  crowd -- he’s lost sight of Amelia for the moment, but  Kiernan’s VOICE is still in his ear --  -- Oleg continues walking calmly along.  INT. SERVICE CORRIDOR - DAY  Bryce shuts the door. Kiernan is here, on a cell. He  continues giving decoy instructions into the phone:  KIERNAN  ...if we haven’t made contact  again, get off at Gaasperplas. Wait  at the south end of the terminal.  72. Bryce wands Amelia with an electronic SENSOR -- sweeping for  tracking beacons. She’s clean.  Kiernan dumps the cell. The three of them run down the  corridor, vanishing into the bowels of the station.  INT. AMSTERDAM STATION CENTRAAL - DAY  Oleg and Petr are standing outside the 53 train. Frantically  scanning the PASSENGERS -- no Amelia.  As the train doors close, Ivanov comes down the escalator.  Sees the look of defeat on Oleg and Petr. His eyes narrow.  INT. BUILDING UNDER CONSTRUCTION - DAY  The Amsterdam outskirts. Skyscrapers going up everywhere.  We’re in the shell of a new building -- high up, with a  stunning view of the old city.  The floor is covered with Bryce’s usual exhaustive advance  work -- architectural blue",
      "dialogue_count": 0,
      "word_count": 2128
    },
    {
      "scene_number": 11,
      "slugline": "INT. SECURITY ROOM - NIGHT  The FLASH of the exploding bulbs draws the Operator’s eye to  that screen, so he’s not watching --  INT. STAIRWELL - NIGHT  -- Kiernan quickly kills both Commandos. Bryce and Kiernan  each grab a corpse and haul them up a few more steps to --  INT. FIFTH FLOOR - NIGHT  They dump the Commandos’ bodies in a blind spot.  Glassed-in offices ring the perimeter of the warehouse,  connected by walkways. Bryce and Kiernan head for a small  office. They’re almost running now.  INT. SECURITY ROOM - NIGHT  The Operator scans the hall where the light bulbs popped. He  completely missed Bryce and Kiernan killing the Commandos.  INT. FIFTH-FLOOR OFFICE - NIGHT  Bryce and Kiernan slip inside. A couple of desks and a heavy  SAFE in one corner. Jackpot. Kiernan quickly examines it.  Bryce stands guard, checking his phone --  -- two more COMMANDOS have entered the stairwell where they  just killed the other two. Bryce can only watch as they take  a look around --  INT. STAIRWELL - NIGHT  Bryce and Kiernan cleared the bodies, so the Commandos don’t  see anything unusual. But as they start down the stairs --  -- one notices a dark stain on the floor. He touches it --  --   fresh blood.   He fumbles for his radio.  INT. FIFTH-FLOOR OFFICE - NIGHT  The radios Bryce and Kiernan took off the Commandos start  CRACKLING. Yelling in RUSSIAN, overlapping voices.  They just got made. Bryce hits a button on his phone --  80.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 251
    },
    {
      "scene_number": 12,
      "slugline": "INT. SECURITY ROOM - NIGHT  On the MONITORS, we see COMMANDOS racing around -- the whole  warehouse is going into battle mode. Then -- all the screens  go BLACK. Bryce just killed their feed.  INT. WAREHOUSE - GROUND FLOOR - NIGHT  Ivanov is here among the crates, flanked by Oleg and Petr. As  the ALARM sounds, he gets very still. Thinking, calculating.  INT. FIFTH-FLOOR OFFICE - NIGHT  Kiernan has checked out the safe --  KIERNAN  This would take hours to crack.  Going to have to blow it.  Bryce doesn’t like that, but there’s no choice. Kiernan packs  C-4 EXPLOSIVE around the safe’s hinges -- they stand back --  -- BOOM.  ON THE LOWER FLOORS  There was no missing the EXPLOSION. The Commandos zero in on  Kiernan and Bryce.  INT. FIFTH-FLOOR OFFICE - NIGHT  Bryce extinguishes the last of the FLAMES -- Kiernan kicks  away the charred, mangled door -- digs through the safe --  KIERNAN  Got em. Got em.  Kiernan pulls out a sheaf of documents -- END-USER  CERTIFICATES, like what he showed Amelia. He flips through --  BRYCE  We’re good?  KIERNAN  We’re perfect.  Kiernan opens a thin METAL CASE -- slips the certificates  inside, then straps it to his chest.  They move back into the  81.",
      "characters": [],
      "action_text": "HALLWAY  and dump their silenced weapons. Bryce draws his  machinepistols, and Kiernan hoists a SUBMACHINE GUN.  The stealth portion of the evening is now over.  They encounter resistance right away. Several COMMANDOS pour  out of the stairwell --  -- but Bryce is still wired into the security cameras through  his phone, he can see the attacks coming --  -- he and Kiernan tear the Commandos apart. Once everyone is  dead, they step over the bodies and run into the  STAIRWELL  both FIRING, dropping more Commandos.  Then it gets quiet for a moment. The rest of the Commandos  haven’t gotten to them yet. And Bryce and Kiernan --  -- do nothing.  They’re on the fifth floor of an eight-story building, with  several dozen armed men racing up towards them, and --  -- they just wait.  They calmly reload, listening to the FOOTSTEPS pounding up  towards them, getting closer... and... now.  Bryce and Kiernan run up the stairs --  INT. EXIT STAIRS - NIGHT  They’re one flight below the roof.  Kiernan lays more C-4 EXPLOSIVE at the base of the final  staircase. He and Bryce run up to the  EXT. ROOFTOP - NIGHT  and get the drop on the two COMMANDOS still at their posts,  killing them both.  They’re alone on the roof. But not for long, because the  Commandos are almost to the final stairwell --  -- Kiernan pulls out a DETONATOR, punches the button --  82. -- BLOWING THE STAIRCASE beneath them. There’s no way to get  onto the roof now. Or to get off it.  The BOATS have drawn in closer -- their SEARCHLIGHTS  illuminate the inlet. A water escape’s no good.  But Bryce and Kiernan are already running to the other side  of the building -- solid ground below. They put on CLIMBING  HARNESSES, uncoil ROPES, and fix an ANCHOR into the roof.  INT. WAREHOUSE - NIGHT  Ivanov was in the crowd of Commandos going for the roof -- as  the SMOKE clears from the explosion, his Commandos are  confused, YELLING --  IVANOV  (Quiet! Everyone quiet.)  He listens. Nothing.  IVANOV  (No helicopter... everyone ",
      "dialogue_count": 0,
      "word_count": 1482
    },
    {
      "scene_number": 13,
      "slugline": "EXT. CANAL - NIGHT  and leaps into the speedboat. Amelia guns the ENGINE --  BRYCE  He’s got the certificates.  AMELIA  Where the hell is he going?  BRYCE  I’ll tell you in a second.  Bryce opens a compartment, pulls out a GPS TRACKER -- we saw  it in his storage unit. He powers it up.  BRYCE  I put a beacon on him in case he  did something incredibly stupid.  Like exactly this.  Bryce takes the helm. Turns them to follow Kiernan.  EXT. AMSTERDAM STREETS - NIGHT  Kiernan knifes through the narrow streets, trying to  disappear into the city. If he was healthy, he could do it --  but now he’s down a step.  FOOTSTEPS and car ENGINES are all around him. The Commandos  closing in.  EXT. SPEEDBOAT (MOVING) - NIGHT  Bryce tries to stay close to Kiernan, following the BEACON  display on his tracker.  But the two KAJEKI SPEEDBOATS are coming up from behind --  BRYCE  Get down!  Amelia hits the deck as GUNFIRE from the pursuing boats  caroms off the canal walls.  Bryce evades, whipping under a bridge. He rips something from  his belt -- chunks of C-4 and DETONATORS.  BRYCE  Rig these.  As Amelia jams a detonator into each chunk of C-4 --  87.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 206
    },
    {
      "scene_number": 14,
      "slugline": "EXT. AMSTERDAM STREETS - NIGHT  Kiernan runs up a staircase, starts racing across the  ROOFTOPS  The Commandos are everywhere, swarming, trying to get a bead  on him from the street.  Kiernan ignores the pain -- through sheer force of will --  somehow, he’s almost at a full sprint.  EXT. CANALS - NIGHT  Bryce is still cat-and-mouse with the Kajeki speedboats.  Amelia’s wired each chunk of C-4 with a detonator.  They’re coming up on a tight turn -- a line of ROWBOATS is  tied up by the wall.  BRYCE  Throw them in.  As Bryce whips through the turn, Amelia hurls chunks of C-4  into the empty boats.  Bryce grabs the REMOTE DETONATOR -- as the pursuing boats  come around the turn, he hits the button --  --   all the C-4 charges go off at once.  The BLAST engulfs the pursuing speedboats --  -- both Kajeki boats are now dead FIREBALLS on the water.  Bryce checks the tracking beacon. He guns the engine -- back  in pursuit of Kiernan.  EXT. ROOFTOPS - NIGHT  Kiernan comes to a gap in the roofs, he’ll have to jump it --  he forces himself to sprint even faster, ignoring the pain --  -- Kiernan reaches the edge of the roof, springs off, JUMPS --  -- and makes it. Just barely. He almost cries out from the  pain in his leg -- but he’s still going.  88.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 231
    },
    {
      "scene_number": 15,
      "slugline": "EXT. CANALS - NIGHT  Bryce checks the beacon -- Kiernan’s close. He brings the  boat to a stop by the wall.  BRYCE  Get clear of here. We’ll meet you  at the rendezvous.  Bryce climbs onto solid ground. Amelia takes the helm and  speeds off into the darkness.  Bryce runs down the street, GPS tracker in hand. Hunting.  EXT. ROOFTOPS - NIGHT  Kiernan, still going. He comes to another gap in the roofs,  makes another jump --  -- but as he’s in midair --  ON THE STREET BELOW  -- Petr is there, waiting, he has a clear shot, FIRES --  -- the BULLET tears into Kiernan’s arm, the one holding the  metal case --  -- Kiernan lands on the far roof, he made it -- but the  impact JARS THE CASE LOOSE --  -- Kiernan is still rolling forward, the case is sliding away  from him, he tries to turn, counter his momentum --  -- the case now skittering towards the edge of the roof --  -- Kiernan diving for it -- almost to it --  -- no --  -- THE CASE GOES OFF THE ROOF.  Kiernan runs forward, peers over the edge -- and almost gets  torn apart by a fusillade of BULLETS from below.  The case has fallen into a group of COMMANDOS. They unload on  Kiernan -- it’s a wall of lead. Nothing he can do.  More Commandos are racing across the rooftops, closing.  Kiernan runs to another edge of the roof, leaps onto a  BALCONY  89.",
      "characters": [],
      "action_text": "with a view of where the case fell. Petr has already scooped  it up -- throws it into a waiting SUV -- the ENGINE guns --  -- gone. The case is gone.  Kiernan just stands there. Shattered. Oblivious to the danger  around him. For the moment, he just does not care.  INT. SUV (MOVING) - NIGHT  Ivanov is in the back seat. He opens the case. Flips through  the end-user certificates. On his cell:  IVANOV  (I’ve recovered the items.)  INT. LIVITIN’S HOTEL ROOM - NIGHT  Livitin, on his cell.  LIVITIN  (Now clear the warehouse. And get  both men. I want this done with.)  INT. WAREHOUSE - NIGHT  KAJEKIS are securing the weapons for transport. Loading them  onto trucks. Frantic, working double-time.  EXT. ROOFTOPS - NIGHT  The Commandos race to the edge of the roof, reaching the  BALCONY  where we last saw Kiernan. But now he’s gone.  EXT. AMSTERDAM STREETS - NIGHT  Kiernan hobbles down the street, making his escape. Numb.  He stops. Leans against a building. Even with his phenomenal  conditioning and pain tolerance... he’s spent.  SIRENS, but far away. And no sign of the Commandos.  There’s a church across the street. Kiernan tries the door.  It’s open. He goes in.  90.",
      "dialogue_count": 0,
      "word_count": 452
    },
    {
      "scene_number": 16,
      "slugline": "INT. CHURCH - NIGHT  Kiernan’s not a religious man. Just needs a quiet place. He  sits in a back pew. Stares at nothing. Closes his eyes.  When he hears a GUN being cocked, he doesn’t even react.  Maybe he’s hoping it’s over.  Bryce has come in. Kiernan is mildly surprised to see him.  Bryce is about to ask -- but he can see Kiernan’s empty  hands. The expression on his face. The question isn’t even  necessary.  Bryce sits. Both men are on empty.  BRYCE  By now, they’ve rolled up the whole  operation. Cleared the warehouse.  KIERNAN  Yeah.  BRYCE  That was our shot.  KIERNAN  Yeah. How did you find me?  Bryce touches the back of his neck. Kiernan reaches -- finds  the tiny TRACKING BEACON hooked into the back of his shirt.  A tired smile from Kiernan. It’s almost funny to him.  BRYCE  What now? Do you testify?  KIERNAN  Might as well. I’ll be at the hotel  for awhile, working on my leg.  BRYCE  I’m going to the rendezvous. I need  to tell Amelia what’s happened.  KIERNAN  I can get to the Hague by myself.  BRYCE  (beat)  Is that how you want it?  KIERNAN  Put you through enough, haven’t I?  91.",
      "characters": [],
      "action_text": "Bryce goes to Kiernan. Hands him something: the five-euro  note. That’s their goodbye. As Bryce heads for the door --  KIERNAN  Michael.  (Bryce stops)  My life got set on a path early. By  the time I was old enough to know  what I wanted for myself, I was  already a fugitive on three  continents. Janet and I never had a  chance. My life was always going to  catch up to me someday.  (beat)  You found a good girl. Don’t screw  it up. That’s the last of the moral  guidance from Sean Kiernan.  Bryce leaves.  EXT. AMSTERDAM STREETS - NIGHT  Bryce walks through the empty streets. No need to hurry now.  On the horizon -- FIRST LIGHT.  The city is just starting to glow under the sun.  As Bryce takes in the beauty of it all... there’s almost no  change in his stride or expression -- he’s careful not to  betray a reaction, but --   he knows he’s not alone.  The threat is close. Bryce scans the streets and alleys,  mapping escape routes. And now --  -- he breaks into a sprint, MACHINEPISTOLS out -- he SHOOTS  the two KAJEKIS lying in wait ahead of him --  -- but MORE KAJEKIS pour out of the alleys, he’s surrounded --  -- a soft POP, a BUZZ -- Bryce is struck by two TASER DARTS --  he goes down. His guns go flying.  SIX KAJEKIS descend on him. Bryce recovers, draws a KNIFE,  kills one but then loses his blade, now it’s hand-to-hand,  Bryce is a blur, a machine --  -- it takes all five Kajekis to finally bring him down.  Zipcuffs. Duct tape. Captured. An SUV tears out of the alley,  they bundle Bryce inside, flooring it --  92.",
      "dialogue_count": 0,
      "word_count": 488
    },
    {
      "scene_number": 17,
      "slugline": "INT. SUV (MOVING) - CONTINUOUS  Ivanov sits across from Bryce. Holding the metal case.  Bryce only has a moment to appreciate the irony -- the  certificates are right in front of him -- before the hood is  pulled down over his head.  INT. BUILDING UNDER CONSTRUCTION - MORNING  The rendezvous point. Kiernan limps up the stairs. He’s  carrying a nearly-empty bottle of whiskey. He’s hammered.  KIERNAN  Hey. Guys? Hello?  But he’s the only one here. To the empty space:  KIERNAN  I’m sorry. I am really sorry.  There, I said it. Can I go now?  He wanders over to the edge to catch the view. Spots a large  PACKAGE tucked behind a pillar, wrapped in plain brown paper.  A note on top: “Sean.” He opens it, reads:  “I doubt they’ll let you keep this in your cell. But I want  you to have it. Michael.”  Kiernan unwraps the paper -- it’s Bryce’s SNIPER RIFLE.  Footsteps on the stairs. Amelia.  KIERNAN  Ah, Amelia. It’s a long story. With  an unhappy ending.  That hits her hard. But even worse --  AMELIA  Michael’s not with you--?  KIERNAN  I’m sure he’ll be along soon.  AMELIA  He’s never late. For anything.  Fear in her eyes.  93.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 201
    },
    {
      "scene_number": 18,
      "slugline": "INT. BASEMENT - DAY  The hood is pulled off Bryce’s head. A bright LIGHT shines  down on him. He’s tied to a table, spread-eagle.  Ivanov, Oleg, Petr, and a few other KAJEKIS all around him.  Ivanov pulls up a chair so they can chat.  IVANOV  You know what these are, yes?  Of course -- Ivanov is holding up the stack of end-user  certificates, tucked in the metal case.  IVANOV  I believe we have all of them back.  Am I correct?  (Bryce nods)  Good. Then we have only one more  small piece of business. Where is  Sean Kiernan?  BRYCE  I have no idea.  Bryce is a good liar. But not good enough to beat Ivanov.  IVANOV  You are Michael Bryce, formerly of  the Central Intelligence Agency. I  showed your picture to some  associates. You are well-known in  certain circles.  Ivanov gestures for Oleg to come over. He’s carrying  something. Bryce strains, trying to see...  IVANOV  I heard a story about you being  interrogated.  Oleg is carrying a CAR BATTERY.  Bryce goes white. He’s been through this before. He tries to  put on a brave face, but finds himself pulling desperately at  his bonds.  IVANOV  Memories, yes? A bit old-fashioned,  but so effective.  (Russian, to the others)  (This won’t take long.)  94.",
      "characters": [],
      "action_text": "The others LAUGH. Bryce’s breathing is fast, jagged. He’s  almost hyperventilating. He knows exactly what’s coming.  Oleg wraps a leather strap around Bryce’s head. Connects the  wires at his temples. Two more wires go around his feet.  Ready to go.  IVANOV  Where is Sean Kiernan?  Bryce doesn’t answer. Trying to prepare himself. Ivanov  signals. As Oleg brings the wires to the battery --  BRYCE  Wait. Wait wait wait.  Oleg stops. A faint smile from Ivanov.  BRYCE  Kiernan needed the certificates  because he has no testimony. Do you  understand? He’s not dangerous to  you now. He doesn’t matter.  IVANOV  I see. This is good. If Kiernan  does not matter, then you can tell  me where he is. It’s of no concern.  So. Where is he?  BRYCE  (beat)  Don’t.  Ivanov signals -- Oleg touches the wires to the battery,  COMPLETING THE CIRCUIT --  -- Bryce HOWLS. He shakes and thrashes against his bonds. His  body convulses as the CURRENT surges through him.  This goes on for some time.  At last, Oleg turns off the power.  Bryce pulls in huge, teary panic breaths.  This isn’t a hardened operative absorbing punishment. The  agony is instant and overwhelming.  Bryce just wants it to stop.  IVANOV  Where is Sean Kiernan?  95. Bryce almost gives him the answer. He almost does. But he  holds back. Ivanov signals -- the CURRENT is turned back on.  Bryce SCREAMS. Ivanov watches, impassive. Oleg starts to turn  the power off -- Ivanov signals him to keep going.  Thin tendrils of SMOKE begin to rise from Bryce’s temples.  The other Kajekis turn away. Even for them, this is hard to  watch. Finally, the power is turned off.  IVANOV  Where is Sean Kiernan?  BRYCE  He’s... somewhere safe.  (beat)  He’s very, very safe.  Ivanov is surprised. They all are. It looked like this was  over. But Bryce just went deeper inside himself. And found  something more.  Ivanov motions Petr to come over. He’s wearing heavy rubber  gloves. Carrying something.  It’s nothing out of the ordinary -- just a plastic b",
      "dialogue_count": 0,
      "word_count": 872
    },
    {
      "scene_number": 19,
      "slugline": "INT. A VAN (MOVING) - DAY  They’re on their way to the Hague. Amelia’s driving. Kiernan  is riding shotgun and pounding coffee. Bryce is laid out in  back, still recovering.  Kiernan flips on the RADIO and finds a classical station. A  gesture for Bryce.  BRYCE  Oh, this is a great piece. It’s  Beethoven’s third symphony, the  maturation of his middle period.  It’s also known as the “Eroica”--  Kiernan turns around and stares hard at Bryce: don’t push it.  Bryce stops talking.  To Kiernan, quietly, so Bryce doesn’t hear:  AMELIA  Thank you.  INT. ICC - SIDE ROOM - DAY  Livitin and Demidov. Livitin closes his cell phone. Furious.  Wants to punch the wall.  LIVITIN  (He hasn’t gotten here yet. We  still have a chance to stop him.)  Demidov is calm. And still. A coiled serpent.  EXT. ROADSIDE - DAY  Bryce and Amelia standing outside the van. They’re on a hill  overlooking a broad plain.  TITLE:  The Hague, Netherlands  The coastline is visible in the distance. The Hague is  dominated by a huge building, angular and gleaming white:  The HAAGSE ARC.  This is the seat of the International Criminal Court.  98.",
      "characters": [],
      "action_text": "Blue-helmeted UNITED NATIONS TROOPS have established a  security perimeter all around the Arc. Most of the  surrounding roads have been closed down.  Everything looks quiet. Under control.  Bryce has cleaned up and changed into a fresh suit. He’s got  a FOLDER full of blueprints and building diagrams -- advance  work on the Arc. He watches the plain below with binoculars.  THROUGH THE BINOCULARS  Bryce observes several VEHICLES doing patrols just outside  the security perimeter. They’re definitely not UN personnel --  KAJEKI COMMANDOS. Demidov’s final line of defense.  Bryce observes the pattern of the patrols -- in particular, a  BLACK VAN with tinted windows.  Kiernan climbs out of the van. He’s sobered up. Surprisingly,  he’s now wearing a sportcoat. It looks good -- but he hates  it. He rips the coat off. Sticking with his usual look.  BRYCE  Let’s go to court.  Amelia dials a cell phone.  INT. HAAGSE ARC - HALLWAY - DAY  Casoria steps out of the trial chamber to answer his cell.  CASORIA  Casoria.  INTERCUT CASORIA & AMELIA  AMELIA  It’s Ryder. Call me back from a  landline. We need to discuss the  plans for my very large office.  Casoria breaks into a huge grin.  INT./EXT. KAJEKI VEHICLE/HAAGSE ARC - DAY  Two Kajeki COMMANDOS drive slowly down the street in front of  the Arc’s main entrance.  On the adjoining streets, other Kajeki VEHICLES also circle  the building. Including the BLACK VAN.  99. They’re just waiting. Nothing yet.  INT. BACK OF A VAN (MOVING) - DAY  Amelia is on her cell.  AMELIA  We’re ready. Go.  INT./EXT. KAJEKI VEHICLE/HAAGSE ARC - DAY  Motion -- suddenly, UN TROOPS start massing in front of the  main entrance. The Kajekis go on alert. The PASSENGER gets on  the radio:  PASSENGER  (Watch the front.)  The other Kajeki vehicles begin moving to cut off access to  the front. Including the BLACK VAN -- it starts coming around  from the side --  -- but then a UN SUV pulls out in front of it, cutting it  off. The black van has been made.  PASSENGE",
      "dialogue_count": 0,
      "word_count": 4558
    }
  ]
}