{
  "slug": "the-peanut-butter-falcon-2019",
  "title": "the peanut butter falcon",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 18421,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CHANNEL THROUGH MARSH - DAY - TRAVELING  Tyler slows his boat upon seeing a North Carolina Fisheries Warden who has stopped to check another fisherman’s catch. Tyler then turns his boat and speeds away in the opposite direction.  EXT. RETIREMENT HOME - ZAK & CARL’S ROOM - DAY  The two male nurses screw small gauge aluminum bars onto Zak’s window then shake them to make sure they are attached securely.  INT. RETIREMENT HOME - ZAK & CARL’S ROOM - DAY  Zak, still with remnants of dirt on his face, inspects an old VHS tape carefully. He lifts the cover flap, and blows on the magnetic strip. Zak places the tape into the player; it is labeled: “THE SALT WATER REDNECK.” Sitting at attention on the edge of his bed, Zak watches old footage of his favorite wrestler.  THE SALT WATER REDNECK(34)   wears blue camouflage briefs and matching face paint. His hair is long, luscious, blonde, and held back by a rolled bandana that matches his briefs.  Carl sits close by, with an afghan blanket draped over him. CARL Lord knows if I had a nickel for every time you watched that video tape I would be a rich man. The video has high production value from the ‘80s, complete with star wipes and laser noises.  Fans cheer as The Redneck roars like a lion and flexes in slow motion. The camera is close up on his sweaty face as he throws a full grown man from the ring and a title flashes on the screen: “ATOMIC THROW!”  Zak opens and closes his hands in excitement.  INTERVIEWER ON TAPE Some people claim the move is impossible.  3.",
      "characters": [],
      "action_text": "SALT WATER REDNECK I challenge those people to define what possible is? I believe in myself. I know I’m the best, that’s why I’m the only wrestler that can do it. Simple as that.  Zak looks pleased. CARL We have watched that throw ten times today already.  ZAK  I love The Salt Water Redneck. He is my hero, and he is a badass, and he is the greatest person ever. CARL And you will be the next badass!  SALT WATER REDNECK (Directly to camera) Come to my wrestling school and you can learn the skills that it takes to be like The Salt Water Redneck!  ZAK (To Carl) I want to have the skills. Carl nods.  On screen The Salt Water Redneck does a flip from the top rope and lands elbow first into the chest of his opponent.  Eleanor enters heated, carrying a clipboard. She turns the TV off and sits, balancing frustration and love in her demeanor.   Although her words seem cutting they are delivered tenderly.   She loves Zak wholeheartedly. ELEANOR You and Rosemary both lost all your privileges for the week. CARL Move Rosemary in here and I’ll keep an eye on both of them. Carl winks at Zak. 4. ELEANOR This isn't a joke Zak, I'm labeling you a flight risk. Eleanor makes a note on her clipboard. ELEANOR (CONT’D) That’s twice now, two times. And you’re getting other people in trouble with you. (beat) It's my job to keep you safe and you’re making my job hard. Eleanor holds up a drawing in front of Zak. It’s an energetic and colorful self-portrait that depicts Zak with rippling muscles busting through a brick wall like the Kool-Aid man. On the bottom it says, “pudding?” ELEANOR (CONT’D) Is this what you gave to Rosemary to convince her to fake choking? ZAK Yes it is. ELEANOR It’s really creative. CARL Not just creative, it’s genius! You know why?   That’s an advertisement for what he wants to do with the rest of his LIFE! ELEANOR (easing a bit) You're a dreamer Zak, and I admire that, but the reality is-- ZAK --Eleanor, I am young and I am not old. Carl is old and we are different. Ca",
      "dialogue_count": 0,
      "word_count": 4298
    },
    {
      "scene_number": 2,
      "slugline": "EXT. MANTEO WATERFRONT - DAY  Children are playing at a redneck water park. The structure is a huge mess of scrap wood rising sixty feet above the water. It has a handmade   Water World   vibe. A boy of 14 does a back flip from the top platform. TYLER End of the road. Zak watches another boy do a gainer off the top. TYLER (CONT’D) You know my name? ZAK No. TYLER Good. You never saw me, OK? ZAK OK. ZAK (CONT’D) Hey... Can I come with you? TYLER Why would I need you to come with me? ZAK Maybe we could be friends, buddies, roll dogs? And hang, and chill, and have a good time. TYLER (over his shoulder) Don’t go getting yourself killed. A brief but warm moment is shared here. Zak waves as Tyler walks away. Zak walks toward the group of boys on the dock. ZAK Do you guys like birthday parties?  EXT. ROAD - DAY  Tyler walks alone beside a cornfield and picks a cigarette butt off the ground. 23.",
      "characters": [],
      "action_text": "He hears the sound of an engine approaching and puts his thumb out. A truck pulls over just in front of him and Tyler picks up his pace to get in.  INT. PICKUP TRUCK - DAY - TRAVELING  Tyler rides along side of a   TRUCKER (54)   in an older model Chevy pickup truck. There is a happy, beat-up, mangy, one- eyed dog sitting in between them. The two men sit in silence for a while. The mangy dog pants comically close to Tyler’s face. TYLER He a good dog? TRUCKER She’s good enough. (beat) She don’t run away, so I guess that makes her mine. Wife’s long gone, and my kids are grown. (beat) We look out for each other. TYLER What’s her name? TRUCKER She ain’t got one. I just... The trucker whistles three short notes. TRUCKER (CONT’D) ...and say, “Come here dog!” And, she comes. TYLER Seems like a good dog. TRUCKER She’s good enough. The trucker rubs the dog’s head. TRUCKER (CONT’D) Crazy ain’t it? That fire down at the docks? Tyler takes notice but tries to hide his concern. 24. TYLER I didn’t hear much about it. (beat) What are people saying? TRUCKER Started off small, got out of hand pretty fast. (beat) Some of them boys are out right now looking for the guy that lit it. They set up a road block on 158. Tyler soaks this in. Red lights flash below the railroad crossing sign ahead and the gate lowers. The truck comes to a stop. Tyler plots his next move as the train passes by. After a moment he opens the door and exits the truck. TRUCKER (CONT’D) Sure you don’t want a ride all the way into town? I’m going right there. The dog licks toward Tyler’s face through the window. TYLER (beat) Nah, I left something back there. Tyler watches the truck drive away. He then turns and ducks into the cornfield.  EXT. MANTEO WATERFRONT - DAY  Tyler walks toward the docks where the boys were playing earlier; he hears taunting. Zak has climbed up to the tallest platform and the older boys are causing a scene. A   FAT BULLY (12)   stands next to Zak on the platform fifty feet above the water. FA",
      "dialogue_count": 0,
      "word_count": 5453
    },
    {
      "scene_number": 3,
      "slugline": "EXT. DOCK  Rain pours down as Mark and Tyler sit side by side with their legs hanging off the end of a boat dock. They laugh and have a conversation but no words can be heard.  End flashback music.  BACK TO PRESENT  TYLER Thank you. ZAK You’re welcome. Tyler begins to break down and caves into Zak’s embrace.  EXT. JUNKYARD - DUSK  Eleanor knocks on Jasper’s front door. He answers she holds up a photo of Zak. ELEANOR Excuse me sir, I was wondering if you’ve seen-- BLIND JASPER JOHN I ain’t seen shit, girl! Eleanor notices the cataracts in Jasper’s eyes. ELEANOR Well, maybe you might have heard... Eleanor is searching for the words. BLIND JASPER JOHN You God fearing? Eleanor looks confused.  EXT. SAND PENINSULA - DUSK  Tyler hops off the raft followed by Zak, who winces in pain when he steps down in the sand. ZAK Ouch, my ankle! 53.",
      "characters": [],
      "action_text": "TYLER You hurt your ankle? Tyler takes a sip of whiskey from the dirty brown jug then hands it to Zak. TYLER (CONT’D) Here, this’ll numb it down. Zak takes the liquor and chugs. Tyler watches and nods his head in approval. Zak smiles at Tyler and hands him back the whiskey. TYLER (CONT’D) OK. Tyler matches Zak’s chug, gulp for gulp.  EXT. SAND PENINSULA - BONFIRE - NIGHT  Zak has his shirt off, he is doing jumping jacks in the sand beside a bonfire.   The jug of whiskey, noticeably lighter than before, rests near by. Tyler counts reps from a reclined position across the fire. TYLER 14. 15. 16. 17. 18. Zak stops doing push-ups, tired now from the effort. ZAK I definitely can not feel my ankle anymore! Or my legs! Or my head! Zak raises his hands in the air. ZAK (CONT’D) I CAN’T FEEL MY HANDS! Tyler laughs. Zak swigs the whiskey, then stands and tries to lift a large piece of driftwood laying nearby. He can’t do it. ZAK (CONT’D) I’m not strong enough. TYLER Who is strong enough? 54. Zak looks confused. TYLER (CONT’D) Don’t you need, like another name. An alter ego? The Salt Water Redneck wasn’t born with that name. ZAK Are you sure that wasn’t his name when he was born? TYLER Nah, I bet his name was Frank or Beau or something. (beat) If you can’t do it, then who can? Zak thinks on this. ZAK THE FALCON CAN DO IT! Tyler gets up and walks into the darkness. He comes back with two large branches filled with leaves. He attaches the branches with duct tape to the back of Zak’s body like wings. TYLER OK. Let’s see it Falcon. Zak tries to lift the driftwood and gets it a little higher but fails again. He drops the wood. TYLER (CONT’D) War paint. Zak nods in approval. Tyler grabs some charcoal from around the fire and rubs it on Zak’s face in four even lines like a warrior football player. Zak smiles. Zak dips his hand in the jar of peanut butter and smears a handful on his face to complement the charcoal lines. ZAK The Peanut Butter Falcon. Tyler smiles. 55. TYLER The Peanut ",
      "dialogue_count": 0,
      "word_count": 730
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SAND PENINSULA - MORNING  A van arrives, tires on gravel; a door opens and closes, followed by the chirping sound of a car lock engaging. Footsteps approach, a purse drops onto the ground beside Zak, keys on a “Britthaven Retirement” keychain jingle inside. A hand wipes peanut butter off of Zak’s face. Eleanor is crouching over him, she looks relieved. ELEANOR Oh Zak, thank God you’re okay. Zak begins to stir and sits up, hungover. Tyler stands fifty yards away peeing into the bay. ELEANOR (CONT’D) (to Tyler) Haven’t seen him, huh? Tyler smiles wryly and yells in a low, mocking voice. TYLER ELEANOR! I FOUND HIM, HE’S RIGHT HERE! ELEANOR! ELEANOR Is that funny to you? You think this is a game? (to Zak) Get up Zak; we are leaving. TYLER He’s not going anywhere. Zak, stay put. ELEANOR I had to drive for twelve miles down a dirt road to find you, twelve miles and my cell phone battery is dead now! What if there was an emergency? What if he got hurt? TYLER He did get hurt. ELEANOR (to Zak) Are you hurt?! 57.",
      "characters": [],
      "action_text": "ZAK My ankle hurts. ELEANOR Exactly my point! (to Tyler) You’ve got a boy with Down syndrome out here in the middle of nowhere, doing God knows what! TYLER He’s not a child, he’s damn near twenty-two years old! ELEANOR He needs someone to take care of him! Who are you anyway!? TYLER I’m the guy taking care of him because you can’t do it without keeping him in a cage. ELEANOR That’s cute. So you two are in some sort of primitive gang?! This isn’t  Lord of The Flies ! There are rules and regulations and red tape and paperwork-- TYLER While you were talking about eventually doing some paperwork we were doing a little thing called living. ELEANOR Living?! You call this living!? You two look like cave men! Tyler and Zak look at each other and take in their bodies; unkempt, stinky, dirty, half naked, covered in peanut butter and soot. They both grin. TYLER I know. It’s awesome. ZAK It really is awesome, Eleanor. ELEANOR Get up, Zak! Zak starts to stand up. 58. TYLER Stay where you’re at, Zak! Zak sits down. TYLER (CONT’D) (to Eleanor) Can I talk to you in private for a moment? Tyler grabs Eleanor’s arm and walks her away from where Zak is sitting. ELEANOR I should have you arrested for kidnapping! TYLER You can’t kidnap someone who ran away, genius. ELEANOR This isn’t some-- TYLER What do you want for Zak? ELEANOR I’m not going to sell him to you! TYLER No, what do you WANT FOR Zak? For his life. ELEANOR I’m taking Zak with me. TYLER No you’re not. (beat) Do you know about the wrestling thing? ELEANOR How do you think I found you? TYLER I made him a promise to get him to that wrestling school, and I don’t break my promises. I see you care about Zak, so I’ll do you a favor. You can ride on the raft with us, that way you can watch out for him. (MORE) 59. I’m getting him to that wrestling school with or without you. What happens after that... well, that’s your business. ELEANOR No. I have to go back to work. I’ve got my hours to account for, I can’t just get on your little r",
      "dialogue_count": 0,
      "word_count": 1007
    },
    {
      "scene_number": 5,
      "slugline": "EXT. UNDERWATER - UNDER THE RAFT - DAY  Zak’s head is underwater, his eyes are open wide and his cheeks are puffed as he holds his breath. The voices above on the raft are muted by the sound of bubbles and chop lapping against the makeshift boat’s hull.  EXT. RAFT ON OPEN WATER - CONTINUOUS  ELEANOR The nerve you must have to even think-- TYLER People that call Zak a retard are only saying that he can’t do something they can. So you might not be saying the word retard but you’re sure as shit making him feel retarded. ELEANOR Are you kidding me? TYLER No. I’m not kidding you. You’re just as bad as they are. You make him think he is completely incapable of doing anything on his own. Zak comes up, gasps for air and interrupts them. ZAK Time! TYLER Nice work dude! ZAK How long was that? TYLER Pretty long. ELEANOR Not long enough. Do it again, Zak. ZAK OK!! Zak slams his face back into the water. 63.",
      "characters": [],
      "action_text": "ELEANOR Do you even know what I do? I’ve spent the last two years of my life volunteering to hold widows’ hands as they slip from this world to the next. I’m the one they look at when they take their last breath--  EXT. UNDERWATER - UNDER THE RAFT - DAY  Zak holds his breath and surveys the water below. His eyes open wider as a large fish swims close.  EXT. RAFT ON OPEN WATER - CONTINUOUS  Eleanor speaks with more conviction, she and Tyler are polar opposites but share a common goal, Zak’s best interests. ELEANOR Don’t pretend because you took Zak on a camping trip for a night or two that you know anything about my life. I didn't ask for Zak to be placed in a retirement community. I didn’t choose that for him. But that’s what happened, and now I’m doing what needs to be done. Tyler’s frustration turns to admiration for Eleanor’s passion. He is beginning to understand her point of view. Zak explodes out of the water holding large fish by the gills. ZAK YEEEEEAAAAAAHHHHH!!!!  EXT. RAFT ON OPEN WATER - AFTERNOON  Tyler, Eleanor, and Zak all sit in a circle around the fish roasting on a ramshackle spit over a small burn barrel. TYLER Three options today for lunch. ZAK Three options! Yeah! Eleanor, warmer than before, looks like she is enjoying this because Zak is so happy. 64. TYLER Option one. Hot water we boil from the sound. ZAK BLECK! I don’t want to drink more sound water, Tyler! TYLER Option two is plain fish. ZAK You know what I want, Tyler. Eleanor smiles at how much fun Zak is having. TYLER Option three is...FISH with PEANUT BUTTER! ZAK FISH and peanut butter!! I want to eat the fish with the peanut butter! TYLER (to Eleanor) We gotta give the guy what he wants! ZAK Yes you do! Tyler tears the fish apart with his bare hands and passes a chunk to Zak who already had a handful of peanut butter ready. He rubs the peanut butter all over the flaky white meat and immediately starts eating. Tyler then rips off another piece and hands it to Eleanor. TYLER Try to eat ar",
      "dialogue_count": 0,
      "word_count": 949
    },
    {
      "scene_number": 6,
      "slugline": "EXT. SAND PENINSULA - LATE AFTERNOON - SIMULTANEOUS  Duncan and Ratboy stand at the camp fire Zak and Tyler danced around the night before. Ratboy is trying on Zak’s makeshift falcon wings. Duncan picks up the empty peanut butter jar and smells it.  EXT. RAFT FLOATING THROUGH SWAMPY CREEK - NIGHT  Eleanor and Zak slow dance on the raft as it floats slowly down a glassy creek lined with 1,000 year old cedars. The fire in the small burn barrel beside them casts flickering light on the knotted stumps and twisted branches of the trees that surround them. Tyler watches happily, using a 12 foot push-pole to guide them forward through the water. His movements are fluid and smooth, and the raft glides along almost effortlessly. The energy between the three of them has fully shifted, Eleanor is now a part of the team. For the first time she is doing what she thinks is right and not what she’s been told to do. Eleanor places Zak’s hand on her hip as they move. ELEANOR Good. That’s it. (beat) How does your ankle feel? ZAK Ummm...it is really great now Eleanor, thank you. Zak looks down at his feet. He counts with her. ZAK (CONT'D) One. Two. Three. One. Two. Three. ELEANOR One. Two. Three. One. Two. Three. The sun sets behind them. ELEANOR (CONT’D) Look into my eyes. ZAK But, I need to look at my feet. 68.",
      "characters": [],
      "action_text": "ELEANOR No you don’t. You can do it. Zak and Eleanor look into each others eyes as she counts. ELEANOR (CONT’D) One. Two. Three. Good Zak, good. Zak smiles wide. ZAK This is a good story that we will tell. ELEANOR Yes it is. ZAK I like when we are all together.  EXT. ABANDONED DUCK HUNTING CABIN - NIGHT  One man’s voice hushes another. The sound of liquid being poured in the darkness. A match is struck.  INT. ABANDONED DUCK HUNTING CABIN - NIGHT  Tyler, Eleanor, and Zak sleep peacefully on the dusty floor of a room filled with duck calls and decoys. Tyler’s sleeping face is abruptly illuminated by a harsh flickering light. The raft is on fire! Tyler wakes up and runs toward the shore.  EXT. ABANDONED DUCK HUNTING CABIN - NIGHT  Tyler looks at the burning raft in disbelief, powerless. Duncan enters the frame. DUNCAN We’ve been looking for you. A gun cocks. 69. Ratboy stands 10 feet to the side of Tyler, holding a pistol aimed in his direction. Tyler puts his hands in the air. DUNCAN (CONT’D) Get on your knees. Tyler lowers to his knees. Zak peeks out fearfully from the hunting cabin window, the burning raft illuminates his face. Eleanor is still asleep behind him. Duncan stares at Tyler; and then leans in closer. DUNCAN (CONT’D) That’s twelve thousand dollars of gear that’s burnt up. You know how many hours I’m gonna spend braiding wire. I got mouths to feed. (beat) What’s gonna stop people from thinking they can cut the buoys off our pots now that you’ve done it? Or burn our gear up? (beat) Them Vietnamese are looking for an excuse to start pulling pots again, and you know how that got handled. Tyler listens. DUNCAN (CONT’D) I’m glad it wasn’t me that had to put that hammer down, but someone did. And it’s better now. Ratboy squirms with pride and discomfort. DUNCAN (CONT’D) Cops aren’t gonna do anything and you know it. A few month’s probation and that’s it? Nah, you gotta get what’s coming to you; not revenge for revenge sake, but for the rest of us, for our liveli",
      "dialogue_count": 0,
      "word_count": 2585
    },
    {
      "scene_number": 7,
      "slugline": "EXT. WRESTLING RING - SALT WATER’S FRONT YARD - DUSK  Salt Water enthusiastically teaches Zak wrestling moves in a homemade ring comprised of ropes strung between a few shovels stuck in the ground and a lawn mower handle. Salt Water briefly introduces Zak to his roommate,   SAM (51) , an intimidatingly large man who sports a mullet haircut and wears a faded work-issued, pest-control shirt. Sam watches intently beside the ring with his arms crossed. He enjoys watching the two wrestle, but for different reasons. Salt Water feels good to be back in the makeshift setup. He has fun with Zak as he shows off. Salt Water teaches Zak to stomp his foot when he pretends to hit someone. Sam watches with focus but doesn't say much. Salt Water rolls on the ground showing Zak how to properly take a fall. ZAK Ummm... What about the “Atomic throw?” SALT WATER REDNECK Oh.   (beat) We made that move up just for the videos. It was smoke and mirrors, you know, it was just a camera on my face so it looked like I was holding someone over my head. It’s not possible. See, try to pick me up. Zak tries to pick up Salt Water, but his weight is too much. He stops and sighs. Salt Water notices Zak getting upset. SALT WATER REDNECK (CONT’D) My manager thought a gimmick might sell more mercy. The “Atomic Throw” was just a publicity stunt. Zak looks disappointed. 82.",
      "characters": [],
      "action_text": "Salt Water takes a deep breath. Back to reality. SALT WATER REDNECK (CONT’D) Now grab the back of my neck like this and pull me toward you. Tyler and Eleanor watch Zak and Salt Water from an old couch that looks as if it has been sitting outside for years. ELEANOR Where are you going? TYLER Huh? ELEANOR After today, after all this, where are you headed? Tyler smiles at the thought of the future prospect. TYLER Florida. (beat) A fresh start. I’m gonna get my own boat and run charters. Take people sport fishing. Make a few bucks while living the good life. It’s gonna be great. (playfully) If you don’t have any plans you can come with me. Eleanor flashes Tyler a look: “Yeah right.”  EXT. SALT WATER REDNECK’S TRAILER - NIGHT - LATER  Salt Water, Zak, Eleanor, Tyler, and Sam all sit at a picnic table, eating boiled corn and hamburger helper off paper plates. Christmas lights, casually strung, help set the mood. SALT WATER REDNECK It takes years to learn certain things, like how to take a fall. You get better with time. If you just apply that stuff in a match, change it up here and there, try not to do the same move twice or whatever, you’re pretty good to go. ZAK OK, yeah? OK. 83. SALT WATER REDNECK Alright, let’s try it for real. Sam takes notice of what Salt Water is saying. ZAK Try it for real? SALT WATER REDNECK Yeah, let’s get you in a ring. Not just practicing moves here with me. I’m talking about a backyard brawl, a real match with real moves. SAM I don’t know if he’s ready-- ELEANOR Yeah, that seems a bit fast-- TYLER (to Eleanor) It’s not like he’s got all the time in the world. ZAK I want to do the wrestling match. SALT WATER REDNECK Sink or swim as far as I see it. Let’s do it tomorrow in Jacob’s backyard. (to Sam) You’re on the bill, right? SAM (begrudgingly) Yeah. SALT WATER REDNECK Great, you two can fight.  INT. FIREBIRD - DAY - TRAVELING  Salt Water drives; Zak rides shotgun. Eleanor and Tyler are squeezed into the back with Sam uncomfortably wedged betwe",
      "dialogue_count": 0,
      "word_count": 1165
    },
    {
      "scene_number": 8,
      "slugline": "INT. SALT WATER REDNECK’S FIREBIRD - DAY  In the parking lot, Tyler and Eleanor speak in private inside of Salt Water’s Firebird. The sounds of Samson’s wild howls, grunts, and yells punctuate their conversation. ELEANOR No. TYLER Clint said Sam is going to go easy on him. It’ll be simple, a couple moves and he will lay down and let Zak win. ELEANOR No. No, this is different Tyler-- TYLER You said I could have all of him. A savage howl followed by a shriek causes Eleanor to pause. ELEANOR Not this much. TYLER (beat) OK. Eleanor takes the ‘OK’ as a win, and that Tyler has agreed to her terms. Tyler moves Eleanor’s hair softly with his hand. (Alternate) Tyler kisses Eleanor. ELEANOR What are you doing? With the fuzzy pink handcuffs that were dangling from the mirror, Tyler uses slight of hand to lock Eleanor to the Firebird’s steering wheel. As he exits, he looks back and smiles. TYLER No one is going to die today.  INT. BARN - BEHIND THE SCENES OF THE MATCH - DAY  Zak sits in a metal folding chair paying close attention as Salt Water coaches. 87.",
      "characters": [],
      "action_text": "SALT WATER REDNECK You have to be aggressive, steer the match where you want it to go. Zak nods his head, not confident. SALT WATER REDNECK (CONT’D) You can talk to Sam, but just keep it small and quiet. Don’t let the audience in too much. Just remember to roll with it, take the punches and then come back harder. As far as your smack talk goes, the moment you get in the ring say the meanest most evil thing you can think of to get in his head and rile the audience up good. (beat) You gotta say the most MANIACAL thing you can possibly think of. Zak looks scared. Tyler approaches, having left Eleanor in the car. SALT WATER REDNECK (CONT’D) If you start to bleed use it to your advantage, play it up. Maybe wipe it all over your face. (beat) OK, I’ll be in the stands watching. Salt Water pats Zak on the shoulder and walks away. As he is leaving, he slaps Tyler on the chest once and excitedly screams in his face. Tyler salutes. Zak sits, still shaken by Salt Water’s words. ZAK Tyler? TYLER No. Don’t you do that. Not now. ZAK I’m scared. TYLER You know you can do this, you’ve got this.   (MORE) 88. (beat) Say “I’ve got this.” ZAK What? TYLER Say “I’ve got this!” Say it to me. ZAK I’ve got this? TYLER No. Not like you’re asking me if you’ve got it, say it like you know it’s true. Zak doesn't respond. Tyler grabs him by the collar. TYLER (CONT’D) Say it! Say it to me! Make me believe it! (beat) Make me believe. Long pause as they look at each other. ZAK I’ve got this. TYLER I don’t believe you. ZAK I’VE GOT THIS! Tyler smiles. TYLER Good. I knew you did. I just needed you to know. (beat) Let’s find something to dress you in.  CUT TO: EXT. BACKYARD WRESTLING MATCH - CONTINUOUS  Craig speaks into his flip phone. TYLER (CONT'D) 89. CRAIG Nah, man I’m telling you he’s here. (beat) Yeah, I saw him plain as day!  EXT. BOAT DOCK - DAY  Ratboy watches Duncan who is lost in thought. RATBOY Whatcha gonna do? Duncan takes off his hat and tosses it aside with purpose.  EXT. BACKYARD WRES",
      "dialogue_count": 0,
      "word_count": 2234
    }
  ]
}