{
  "slug": "the-good-place-101-everything-is-great-2017",
  "title": "the good place 101 everything is great",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 2,
  "characters": [
    "CHIDI",
    "ELEANOR"
  ],
  "total_words": 3429,
  "total_dialogue": 3,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CALL CENTER - ATLANTA - SIX YEARS AGO - FLASHBACK Eleanor interviews for a job with WALLACE, 40s.   She is looking at a BOTTLE OF MEDICINE. WALLACE It’s called “Breathe-Well,” and you just cold-call these seniors and try to hawk it.   (conspiratorial) Between us, it’s not FDA-approved, and it doesn’t technically “work.”   So...try to... ELEANOR (”yeah yeah yeah”) You need me to lie to the old people and scare them into buying faulty allergy medicine.   I get it.   Which one is my desk? INT. ELEANOR’S HOUSE - BACK TO SCENE - CONTINUOUS CHIDI You...defrauded the elderly.   Sorry -- the sick and elderly. ELEANOR I was good at it too.   Top salesperson five years in a row. CHIDI That’s worse.   You get why that’s worse, right? (rubs his forehead) Can we take a walk, or something? ELEANOR Good idea.   I gotta get out of this awful house.   Everything is so wooden and hard - - it’s like it was built for a marionette family. They head out... EXT. THE GOOD PLACE - OUTDOOR CAFÉ - AFTERNOON They sit and eat frozen yogurt.   All around, small groups of PEOPLE are smiling and introducing themselves. ELEANOR Even here, frozen yogurt is just like “okay.”  The Good Place   “PILOT”   [0101x]   15. Writer's 1st Draft   xx/xx/15 (CONTINUED)",
      "characters": [
        "CHIDI",
        "ELEANOR"
      ],
      "action_text": "ELEANOR Does everyone have an awesome house except me?! (sigh) Okay, I say we just lie low, and hope they don’t notice me. CHIDI I don’t think I can help you. (off her look) I don’t like being dishonest, and I can’t advise you to be dishonest either. ELEANOR Come on -- you don’t have to be such a boy scout. CHIDI I was a boy scout, actually.   Highly decorated.   Until I resigned on principle because of their stance on homosexuals. ELEANOR Oh buh-rudder, you’re a real do-gooder, aren’t you? CHIDI Yes!   Everyone here is, except you! ELEANOR I’m just asking you to fudge a little. You must have told a few white lies in your life, right?   What was your job? CHIDI I was a professor of Ethics and Moral Philosophy. ELEANOR Son of a birch. They arrive at Eleanor’s house.   Chidi grabs his stomach. CHIDI I’m getting a stomach ache.   I’m in a perfect utopia, and I have a stomach ache.   This is awful.   I think I have to tell Michael about this. MICHAEL (O.S.) Tell Michael about what? Michael walks up, with TEHANI and JIANYU, holding hands.  The Good Place   “PILOT”   [0101x]   18. Writer's 1st Draft   xx/xx/15 CONTINUED: (CONTINUED) TEHANI I do!   Truly!   Jianyu here was a Buddhist monk, so entertaining on a grand scale is new to him, but don’t worry because I adore it.   We’ll see you both there! (as she goes) Toodles! They walk off... ELEANOR Oof.   No one who says “toodles” should get to go to heaven. CHIDI It’s not “heaven.”   It’s The Good Place, and it’s for good people, and good people don’t lie.   I’m gonna tell Michael.   It’s the right thing to do. He starts to walk after Michael.   She grabs his arm-- ELEANOR (quietly) Just...hang on, before you go ratting me out to the feds, remember: you promised you would never do anything to hurt me. And unlike me, you're a good person, so you have to keep your promises!   Ha! Gotcha! Chidi realizes she is right, and clutches his stomach... CHIDI It’s getting worse.   The stomach ache is getting worse.   I feel like my sou",
      "dialogue_count": 3,
      "word_count": 1612
    },
    {
      "scene_number": 2,
      "slugline": "INT. TEHANI/JIANYU’S HOUSE - LATER They talk with SACHVEER, a SIKH -- SACHVEER -- and he said “You’ll die without both your kidneys,” and I said, “But you will live, and that means climate change can be reversed.”   It was a simple decision, really. ELEANOR Wowwwwww that is so amazing! (calling off) Hey Janet? Janet APPEARS behind her. JANET Hi there!   How can I help? ELEANOR I’ve had eight glasses of wine and I feel nothing.   Can you not get drunk here? It’s suddenly very important that I get drunk. JANET Our default setting is that alcohol has no effect.   If you want it to affect you, just think to yourself that you’d like -- ELEANOR Got it.   On it.   Thanks. She grabs TWO GLASSES OF WINE from a passing tray, closes her eyes like she’s making a birthday wish, and DOWNS THEM both. INT. TEHANI/JIANYU’S HOUSE - LATER Michael CLINKS his glass and everyone quiets down.   Eleanor is now pretty drunk. MICHAEL I won’t take up too much time, here.   As Shakespeare once said, “Brevity is the soul of wit.”   Although he’s -- (points down) -- so maybe we should ignore that advice. CHIDI Really?   Shakespeare?!  The Good Place   “PILOT”   [0101x]   23. Writer's 1st Draft   xx/xx/15 (CONTINUED)",
      "characters": [],
      "action_text": "MICHAEL There’s been a lot of bad high school productions of “Midsummer.”   Caused a lot of agony.   Anyway: you all know that I’m the architect of this Neighborhood.   What you don’t know is: this is the very first Neighborhood I’ve ever designed!   I’ve been an apprentice for a while now -- about 300 years -- and my bosses finally gave me my first solo project. He gestures around him.   Everyone APPLAUDS. MICHAEL (CONT'D) For that reason, it’s very special to me, and I want it to be perfect.   You deserve a perfect world.   Because you are all -- every one of you -- good people!   So if you have any problems at all -- which you won’t! -- Everyone LAUGHS. MICHAEL (CONT’D) -- come see me, personally.   My door is always open.   Back to the party! Everyone CLAPS. TEHANI Bravo, Michael!   Bravo! Eleanor turns to Chidi. ELEANOR Ugh, Tehani -- what a condescending birch.   Why does she still have a British accent?   No one else has an accent -- she is choosing to have that accent! (bad British) “Hell-oooo everyone!   I’m utterly perfect and I look like a cartoon princess!” CHIDI Okay, maybe it’s time to head home. She SLURPS DOWN the rest of her drink as he ushers her away. ELEANOR (yelling to no one) Waiter!   Mas tequila, por favor! CHIDI Who are you even talking to?  The Good Place   “PILOT”   [0101x]   24. Writer's 1st Draft   xx/xx/15 CONTINUED: (CONTINUED) ELEANOR Unclear! INT. ELEANOR’S HOUSE - NIGHT He gets her into bed. ELEANOR That Tehani is such a butthead. (happily) Hey!   At least I can still say “butthead.”   She’s a butthead.   Her butt is a head, and her head is a-- (she belches for a long time) --butt.   Sorry I burped.   That’s embarrassing. She lies down.   He starts to leave. ELEANOR (CONT’D) Chidi, Chidi -- wait.   I’m sorry. (off his look) I’m sorry for dragging you into this. It’s not fair that your first day in paradise is babysitting a drunk moron. CHIDI It’s okay. ELEANOR It’s not, though. (sigh) Do you think anyone cared that I died? Maybe som",
      "dialogue_count": 0,
      "word_count": 1817
    }
  ]
}