{
  "slug": "the-man-in-the-high-castle-101-the-new-world-2015",
  "title": "the man in the high castle 101 the new world",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 4,
  "characters": [
    "JULIANA",
    "FRANK",
    "GUARD",
    "MAN"
  ],
  "total_words": 11468,
  "total_dialogue": 5,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. STREET -   DAY 1 5   5   *  Juliana, bag over her shoulder, walks out of the dojo. Passes  RICKSHAWS, JAPANESE SOLDIERS, SIGNS IN KANJI, and A BANNER   *  being hoisted,   Welcome H.I.H. the Crown Prince and Princess.   *  As Juliana walks, CAMERA RISES UP, revealing -- the San   *  Francisco SKYLINE, the Golden Gate Bridge spanning the bay. A  LEGEND reads:   Japanese-Occupied San Francisco.  EXT. BROOKLYN STREET -   NIGHT 1 6   6   *  A seedy neighborhood in East New York. An ELEVATED MONORAIL   *  glides past, the skyscrapers of Manhattan beyond. Joe exits   *  the station, glances at the slip of paper.  A SIGN confirms this is Montauk Avenue. He looks down the  block, sees “Lariat Shipping & Moving.” He heads toward it,   *  passing --  GESTAPO OFFICERS questioning a MAN, examining his identity  papers under a street light. One officer -- BALD, prominent  HOOKED NOSE -- eyes Joe. Joe averts his gaze, keeps going.  As he pulls open the door to Lariat Shipping --   *  INT. LARIAT SHIPPING -   NIGHT 1 7   7   *  Whirr of power tools, hiss of a blow torch. It’s busy even at  this hour, MECHANICS working on long-haul trucks.  A man points Joe to an office on the second floor. Joe passes  another MECHANIC, 30s, muscled with PRISON TATS. He glances  at him, then goes back to work --  INT. LARIAT SHIPPING - OFFICE -   NIGHT 1 8   8   *  Joe knocks on the half-open door, then steps inside. Sees a  MAN facing the window.  JOE  Are you the manager? Mr. Warren?  DON WARREN, 50s, unshaven, doesn’t turn. He’s facing a bank   *  of black & white SURVEILLANCE MONITORS. One of them, he sees   *  the Gestapo Officers questioning the Man on the street.   *  WARREN  Yeah.  5.  (CONTINUED)",
      "characters": [
        "JULIANA"
      ],
      "action_text": "JOE  I’m Joe Blake.  WARREN  So?  JOE  I was told you have a job.  WARREN  And who told you that, Joe Blake?  Joe smiles, polite, nervous.  JOE  I didn’t get his name. Just this.  Joe sets down the paper. Warren turns, sees it on his desk.  Studies the American eagle symbol. Then looks at Joe.  WARREN  So this is what they send me now.  How old are you, 28?  JOE  27.  WARREN  27. What the hell you doing here,  Joe Blake?  JOE  I... I want my country back.  WARREN  You want it back? You never had it.  JOE  Sir?  WARREN  You were still sucking your thumb  when they dropped the bomb. This  shit hole’s the only country you’ve  ever known.  JOE  My father told me what it was like.  Before the war, I mean.  Joe takes out a Zippo lighter, ignites the paper.  6.  CONTINUED: 8   8  (CONTINUED) WARREN  Your father, huh.  JOE  He said every man was free.  The paper consumed by flames. Warren drops it in an ashtray.  WARREN  How do I know you’re not a spy?  JOE  A spy...?  Warren taps a German cigarette out of a pack.  WARREN  The Resistance -- what’s left of it  -- is shot through with them. Half  my friends are dead. Guess that’s  why they’re down to kids like you.  JOE  I’m not a spy.  Joe lights the cigarette. Breathes out a stream of smoke.  WARREN  You know what those brownshirts out  there would do if they caught you?  JOE  I’m not afraid to die.  WARREN  Me, either. Might be kind of a  relief actually. But how you feel  about pain?  JOE  Pain...  WARREN  Yeah, when they’re plucking your   *  fingernails out one by one. Or   *  cracking your balls open like   *  walnuts. That’s when maybe you stop  caring what your old man said and   *  tell Johnny Jackboot out there my  name, just about anything else he  wants.  7.  CONTINUED: (2) 8   8  (CONTINUED) JOE  You’re so afraid, why are you here?  WARREN  I fought in the war, kid. I saw my  buddies’ brains get blown out on  Virginia Beach. You... you’re just  a punk who could get me caught.  Joe thinks. After a beat --  JOE  I",
      "dialogue_count": 2,
      "word_count": 3263
    },
    {
      "scene_number": 2,
      "slugline": "EXT. STREET - SAN FRANCISCO -   NIGHT 1 20   20   *  Juliana bites her lip, lost in her own troubled thoughts.  Approaching the steps to her apartment, when --  TRUDY (O.S.)  Juliana --  She turns, sees Trudy running toward her. She’s breathless,  eyes frightened.  JULIANA  Trudy? I thought you were leaving --   *  She presses the BLACK SATCHEL into her hands.  TRUDY  Take this.  JULIANA  What is it?  Trudy looks over her shoulder.  TRUDY  Get inside. Quick --  JULIANA  Trudy? What is this?   *  Trudy meets her eyes --  TRUDY  A way out.  Then runs off. Juliana now sees the Japanese Men and Soldiers  down the street, chasing Trudy. Juliana ducks back into her  alcove, out of their line of vision.  JAPANESE MAN  Yamete!   Stop!  Trudy keeps sprinting as fast as she can, rounds the corner.  As the Japanese Men and the Soldiers charge past Juliana --  ANGLE - TRUDY  Turns, but this is a DEAD END. No place for her to run or  hide. She turns as one the Soldiers stops, RAISES HIS RIFLE.  Terror in her eyes --  CLOSE - JULIANA  21.  (CONTINUED)",
      "characters": [
        "FRANK"
      ],
      "action_text": "Steps out of the alcove, moving to follow. When --   BLAM!   She  hears a GUNSHOT. Her heart rises in her throat, chest  thumping hard. She runs round the corner, then stops, covers  her mouth, stifling a cry. Eyes wide with horror, as --  THE JAPANESE MEN  Approach Trudy’s body, lying in the middle of the street. A  gaping bloody hole in the center of her back.  The Wire-Frame Man rolls her over with his shoe. Trudy’s eyes   *  stare up at him, LIFELESS.  The Wire-Frame Man scans the area, looking for something.  Tersely giving orders to the Soldiers.  ANGLE - JULIANA  Looks from the Wire-Frame Man to the black satchel in her  hands. Knows THIS IS WHAT HE’S LOOKING FOR. As she turns,  hurries back to her apartment. Shakily keys her door.  INT. FRANK & JULIANA’S APARTMENT -   NIGHT 1 21   21   *  Juliana bolts the door. Reeling from shock. Then, with  trembling hands, she unsnaps the satchel. An object wrapped  in torn sheets of   Manga   comics. She rips them open, finds --  A REEL OF 16MM FILM  At the center of the spool, someone has hand-written the  words,   The Grasshopper Lies Heavy .  Juliana stares, confused at what this means -- what her  sister was doing with it -- and why it’s worth dying for.  CUT TO:  EXT. AUTOBAHN -   LATE NIGHT 1 22   22   *  A ribbon of high-speed traffic, headlights spoking into the  rural night. As Joe’s SEMI grows close, PASSING CAMERA --  INT. SEMI TRUCK -   LATE NIGHT 1 23   23   *  Joe behind the wheel, turning from one news station to  another on the radio. Listening for a report on him. When --  A POLICE SIREN  22.  CONTINUED: 20   20  (CONTINUED) Sounds. Joe looks in his rear-view mirror. Sees RED LIGHTS  FLASHING. A police car gaining on him.  CLOSE - JOE  Swallows, his heart rising in his throat. He takes his foot  off the gas pedal, but doesn’t brake. Not certain yet whether  the siren is for him. When --  THE POLICE CAR PASSES. In pursuit of another vehicle. Joe  lets out a ragged sigh. Then clicks off the radio.  CUT TO",
      "dialogue_count": 1,
      "word_count": 2216
    },
    {
      "scene_number": 3,
      "slugline": "EXT. NAZI EMBASSY - SAN FRANCISCO -   DAY 2 36   36   *  The Federal Reserve building, festooned with Nazi banners. A  plaque identifies the “Embassy of the Greater Nazi Reich.”  INT. NAZI EMBASSY -   DAY 2 37   37   *  A high-ceilinged room. A heroic-style portrait of Hitler.  HUGO REISS, 40s, trim, is the Nazi Ambassador. He and his  aide, SS Officer KURT SCAUSCH, 30s, in conference with --  TAGOMI, 50s, head of the Japanese Trade Mission, and his   *  associate, KOTOMICHI, 30s, thin. Both Tagomi and Kotomichi  immaculately dressed in tailored suits.  They stand over blueprints, tiny PLASTIC FIGURES representing  Nazi Officers, members of the Japanese delegation.  REISS  -- and then I will escort the Crown  Prince and Princess into this room,  where we will take tea.  Tagomi frowns, looks to Kotomichi. Reiss shares a look with  Scausch.  SCAUSCH  Is there a problem, Mr. Tagomi?  TAGOMI  We’re very sorry, but the furniture  in this room. It is not appropriate  for the Crown Prince and Princess.  REISS  Trade Minister, I assure you these   *  are very fine pieces -- the same as  the Führer has in Berlin.  Tagomi bites his lip. Deeply embarrassed. Reiss privately  gives Scausch another ‘ what the fuck?’   look.  SCAUSCH  We’re happy to replace it, of  course. If you’ll send us  information on the proper pieces.  Tagomi is relieved.  TAGOMI  Yes. Thank you.   *  (then, to Reiss)   *  32.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "Thank you, Ambassador. These are   *  excellent plans.  REISS  We’re deeply honored to receive  the Crown Prince and Princess as  guests here at the Embassy.  KOTOMICHI  It is an harmonious expression of  the friendship between the German  and Japanese peoples.  REISS  Indeed.  An awkward moment. Tagomi and Kotomichi bow. The two Nazis  reply with salutes. After the Japanese have gone --  REISS (CONT’D)  What the hell was that about?  SCAUSCH  The furniture doesn’t have   chi.  REISS  Chi?  SCAUSCH  One of the five great elements. It   *  comes from the Chinese. They   *  believe there’s a spirit in things,  bringing good or bad luck.  REISS  Superstitious slant-eyed crap. I  don’t understand why the Führer  allowed these people to rule half  the continent.  SCAUSCH  “Allowed.” But for how much longer?  Reiss smiles.  EXT. NAZI EMBASSY -   DAY 2 38   38   *  Tagomi and Kotomichi walk down steps to a waiting Mercedes  LIMOUSINE.  KOTOMICHI  The Nazi ambassador has disdain.   *  33.  CONTINUED: 37   37  TAGOMI (CONT'D)  (CONTINUED) TAGOMI  He only understands a world he can   *  see.  KOTOMICHI  You seem troubled, Trade Minister.   *  TAGOMI  It is a time of great uncertainty,  Mr. Kotomichi. The Führer is said  to be very ill.  KOTOMICHI  Surely his successor will continue  a policy of peaceful cohabitation.  TAGOMI  I consulted the oracle. The reply  was the twelfth pentagram.  KOTOMICHI  “Danger, pay attention.”  Tagomi nods, climbs in the limousine. As Kotomichi follows,  troubled now as well --  CUT TO:  INT. FRANK & JULIANA’S APARTMENT - BEDROOM -   DAY 2 39   39   *  Frank knots his necktie, then stops. Staring at a DRAFTING  TABLE in the corner, scattered with painted canvases, pastel   *  sketches and various art supplies. Frank goes to the table,   *  fishes out some hand-drawn JEWELRY DESIGNS.   *  He thinks for a beat. Then picks up the designs, stuffs them  in a GREEN PORTFOLIO.  CUT TO:  INT. FRANK & JULIANA’S APARTMENT - KITCHEN -   DAY 2 40   40   *  J",
      "dialogue_count": 0,
      "word_count": 2829
    },
    {
      "scene_number": 4,
      "slugline": "EXT. STREET -   DAY 2 A58   A58   *  As the limousine drives past, heading toward the city --   *  CUT TO:  INT. FACTORY -   DAY 2 B58   B58   *  A giant ASSEMBLY LINE, much like the one we saw in the Nazi   *  newsreel. Machines stamp out METAL PARTS, hand-assembled by   *  aproned WORKERS. Among them, we find --   *  FRANK, assembling replicas of old Colt. 45 revolvers, across   *  from Ed. He does his job efficiently, but keeps looking up at   *  the office overlooking the floor. Something on his mind.   *  ED   *  What happened last night?   *  FRANK   *  (distracted)   *  Huh?   *  ED   *  The phone call at the bar. What was   *  that about?   *  FRANK   *  Um, nothing. Cover for me, will   *  you?   *  ED   *  OK. Sure.   *  CUT TO:   *  INT. FACTORY - OFFICE -   DAY 2 C58   C58   *  WYNDAM MADSEN, 50s, small, paunchy, but vigorous, works at   *  his desk. He hears a knock on his door, sees -- Frank.   *  FRANK   *  Mr. Madsen?   *  MADSEN   *  Yes, Frank.   *  FRANK   *  I’m just wondering... have you had   *  a chance to look at the designs?   *  47.  (CONTINUED)",
      "characters": [],
      "action_text": "MADSEN   *  You just gave them to me this   *  morning, Frank.   *  FRANK   *  Right. And?   *  MADSEN   *  And as it happens, I have looked at   *  them.   *  (holds up green portfolio)   *  They’re quite beautiful.   *  FRANK   *  Thank you.   *  MADSEN   *  But degenerate, Frank.   *  FRANK   *  You just said they’re beautiful.   *  How can jewelry be degenerate?   *  MADSEN   *  The Japs only want old-timey stuff,   *  like those Colt .45s down there.   *  Americana.   *  FRANK   *  No one’s actually tried selling   *  them jewelry --   *  MADSEN   *  And no one’s going to. Because no   *  one wants to land in jail. C’mon,   *  Frank, come back from fairy land.   *  (beat)   *  You’re a solid worker. You’ve got a   *  solid job. Count your blessings.   *  He holds up the portfolio. Frank takes it. Frustrated.   *  CUT TO:   *  OMITTED D58   D58   *  EXT. RURAL AUTOBAHN -   DAY 2 58   58   *  The Greyhound BUS wipes through frame, heading toward the  Rockies.  48.  CONTINUED: C58   C58",
      "dialogue_count": 0,
      "word_count": 378
    },
    {
      "scene_number": 5,
      "slugline": "INT. BUS - MOVING -   DAY 2 59   59   *  Juliana checks her watch, looks out the window.  WOMAN’S VOICE (O.S.)  May I?  She looks up, sees the Middle-Aged Woman from before.  JULIANA  Sure.  She sits in the seat next to Juliana.  MIDDLE-AGED WOMAN  Guy next to me was snoring. I can  never sleep on buses, can you?  Juliana looks over. Sees the large African-American asleep.  MIDDLE-AGED WOMAN (CONT’D)  What brings you to the neutral  zone?  JULIANA  (a quick lie)  Just visiting a friend.  MIDDLE-AGED WOMAN  You must have some interesting  friends.  JULIANA  I don’t know what you mean.  MIDDLE-AGED WOMAN  You see any other white girls on  this bus? Look at ‘em all, darlin’.  Wrong color, wrong religion, wrong  bedmate... If the Nazis catch ‘em,  poof! Up in smoke they go. But the  Japs are happy to let ‘em scramble  out of the Pacific States. Hole up  in the Rocky Mountains, or run down  to South America if they like.  JULIANA  What’s it like? The neutral zone?  MIDDLE-AGED WOMAN  Ever seen those old Westerns the  Führer watches? It’s like that.  49.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "Lawless. Except for the Marshal, of   *  course.  JULIANA  The Marshal?  MIDDLE-AGED WOMAN  This is your first time, isn’t it?  A Nazi agent. Hunts down enemies of  the Reich, strings ‘em up and burns  ‘em alive.   *  Juliana is horrified. But the Woman goes on, matter of fact.   *  MIDDLE-AGED WOMAN (CONT’D)  Just about everybody in the neutral  zone’s got a gun and a secret.  JULIANA  What’s yours?  MIDDLE-AGED WOMAN  Fear of flying. I’m in the import-  export business. Katie Owens.  It’s said as a prompt.  JULIANA  (reluctant, then)  Trudy Walker.  Juliana turns, uncomfortable. There’s a SIGN out the window.   *  It reads, in Japanese and English, “Now leaving the Japanese   *  Pacific States.”   *  CUT TO:  A SIGN, in German and English, “You are now leaving the   *  Greater Nazi State.” We are:  EXT. NAZI CHECKPOINT -   DAY 2 60   60   *  A line of cars and trucks approaching the gateway to the  neutral zone. CAMERA ADJUSTS to find Joe’s semi approaching --   *  INT. SEMI TRUCK -   DAY 2 A61   A61   *  Joe looks at the checkpoint with dread. As he swallows,   *  starts to pull over. PRELAP the ringing of a phone --   *  50.  CONTINUED: 59   59  MIDDLE-AGED WOMAN (CONT'D)",
      "dialogue_count": 0,
      "word_count": 389
    },
    {
      "scene_number": 6,
      "slugline": "INT. PHONE BOOTH -   DAY 2 B61   B61   *  Joe stands inside, truck parked beyond. He listens to the   *  phone, ringing and ringing. Finally, he hangs up, frustrated.   *  As he retrieves his coin, heads back to his truck --   *  CUT TO:  INT. RIKERS ISLAND - CELL -   DAY 2 61   61   *  Obergruppenführer Smith enters, finds Warren hanging from his  chains. Badly beaten, and unconscious. He turns to his Aide.  SMITH  Where is this man’s minder?  AIDE  I’ll find him, Obergruppenführer.  The Aide goes off. Leaving Smith alone with Warren. He  inspects his wounds, gently lifts his head, seeing the eyes  swollen shut, lips busted.  The Aide returns with the Guard, who gives a Nazi salute.  GUARD  Heil Hitler.  SMITH  Why was this man left unattended?  GUARD  The subject has lost consciousness,  Obergruppenführer.  SMITH  I can see that.  The Guard looks confused.  SMITH (CONT’D)  Your orders were to flog this  subject until he answered your  questions.  GUARD  Obergruppenführer, this subject  cannot wake up.  SMITH  Has he answered your questions?  51.  (CONTINUED)",
      "characters": [
        "GUARD"
      ],
      "action_text": "Now it’s Smith who smiles.  CUT TO:  OMITTED 63   63   *  INT. FRANK & JULIANA’S APARTMENT -   NIGHT 2 64   64   *  Frank enters, sets down the portfolio.  FRANK  Jules!  He goes to the kitchen, opens the fridge. Pulls the tab on a  can of beer. He takes a swallow, then --  FRANK (CONT’D)  Jules?!  Getting no answer, he walks across the living room to the  bedroom. Finding it EMPTY, too. But he now notices -- the   *  heart PENDANT on the dresser. Frank picks it up.   *  FRANK (CONT’D)   *  Oh Jesus...   *  Off Frank, his rising concern --   *  CUT TO:  OMITTED 65   65   *  INT. BUS -   NIGHT 2 66   66   *  Juliana slumped against the glass, asleep. When her eyes   *  flutter open, noticing --   *  The BUS HAS STOPPED. It’s been parked for awhile -- several   *  people move down the aisle, back toward their seats. Juliana   *  sees Katie is no longer beside her, then looks --   *  HER POV - THROUGH THE WINDOW   *  Katie walks toward an AFRICAN-AMERICAN MAN in a rusted-out   *  OLD CAR. On her arm -- JULIANA’S BLACK SATCHEL.   *  CLOSE - JULIANA   *  53.  CONTINUED: 62   62  (CONTINUED) Alarm rising in her throat. She taps on the glass, tries to   *  draw Katie’s attention, insistent but not loud -- she has to   *  be careful not to attract attention.   *  But Katie hears her tapping, looks at her. Her expression   *  IMPASSIVE. She had to play the role of Chatty Cathy before --   *  but she’s really a thief and no longer tries to hide it.   *  Juliana rises. Struggles past the people going the other way.   *  Making it to the front just as the Driver closes the door --   *  JULIANA   *  Wait!   *  BUS DRIVER   *  (firm, bored)   *  Bus is leaving.   *  JULIANA   *  I... I left something out there.   *  The Driver pulls open the accordion door.   *  BUS DRIVER   *  Go get it. Bus the bus is leaving.   *  Juliana looks from the Driver to outside the door. The car   *  with Katie and the African-American Man is driving off.   *  Juliana starts back toward her seat. The",
      "dialogue_count": 1,
      "word_count": 1466
    },
    {
      "scene_number": 7,
      "slugline": "INT. SUNRISE DINER -   DAY 3 78   78   *  Joe enters, walks past the counter, noticing a MAN WITH A   *  LINED FACE, 50s, poring over a book as he eats. Joe takes a   *  seat in a booth.   *  The Barman gives a prompting look to Juliana, still tying on   *  an apron. She grabs a coffee pot, hurries to Joe’s table --   *  JULIANA   *  Coffee?   *  Joe meets her eyes. Smiles.   *  JOE   *  Yes, please. How many eggs you got   *  back there?   *  JULIANA   *  (pouring coffee)   *  I don’t know. Plenty.   *  JOE   *  Good. Bring me a a whole plateful.   *  Over easy.   *  JULIANA   *  OK.   *  JOE   *  And a bunch of bacon.   *  JULIANA   *  Coming right up.   *  She starts off, stopped by --   *  JOE   *  Hey, you ever been to New York?   *  JULIANA   *  Never. Why?   *  JOE   *  You look familiar. I could swear   *  I’ve met you before.   *  JULIANA   *  I can swear you haven’t.   *  Joe watches Juliana’s figure as she walks off. Attracted to   *  her. Then looks to the Lined-Face Man. Wondering if he’s the   *  man he’s here to meet.   *  59.",
      "characters": [],
      "action_text": "OMITTED 79   79   *  OMITTED 80   80   *  EXT. SUNRISE DINER -   DAY 3 81   81   *  Juliana steps outside, surprised to find Joe waiting for her.   *  JOE   *  You off work?   *  JULIANA   *  For now.   *  JOE  Can I buy you a drink?  From behind his back, he holds up two LONG-NECK BEERS.   *  JOE (CONT’D)   *  (smiles)  Still think I know you from  somewhere...  Off Juliana, wondering if this could be Trudy’s contact --   *  CUT TO:  EXT. MAIN STREET - CAÑON CITY -   DAY 3 82   82   *  Juliana sits on a wall with Joe, beers in hand --   *  JOE  You’re not wearing a name tag.   *  JULIANA  I’m... Trudy.   *  JOE  Trudy. Pleased to meet you. Joe.   *  Joe offers his hand, playfully formal. As they shake --   *  INTERCUT:  60.",
      "dialogue_count": 0,
      "word_count": 342
    },
    {
      "scene_number": 8,
      "slugline": "EXT. LARIAT SHIPPING -   DAY 3 83   83   *  An unmarked van lurches to a stop, engine idling. Something  is thrown on the sidewalk. The van screeches off. DOC steps  out. Turns over -- DON WARREN’S DISFIGURED CORPSE.   *  JOE  How long you been in Cañon City,  Trudy?  JULIANA  Just got here, as a matter of fact.  How about you?  JOE  I’m just passing through. That  truck over there’s mine.  EXT. STREET - SAN FRANCISCO -   DAY 3 84   84   *  Randall hurries past bleachers and bunting, in place for the   *  visit of the Crown Prince and Princess. Sees Japanese POLICE  OFFICERS following him. Passes --  Rudolph Wegener who steps outside a hotel, lights up a  cigarette. Thinking.   *  JULIANA  You seem kind of young for a truck  driver.  JOE  My first run. I’ll head back to New  York after delivery.  Juliana stares at Joe. Trying to decide who he is --  INT. OFFICE - SAN FRANCISCO -   DAY 3 85   85   *  Tagomi at his desk, throwing yarrow stalks to consult the I  Ching. He looks at the divination, frowns, while --  EXT. STREET - SAN FRANCISCO -   DAY 3 A86   A86   *  Randall rounds a corner to escape the Officers. Runs right   *  into MORE OFFICERS. Blocking his way. Off Randall, CAUGHT --   *  61.  (CONTINUED)",
      "characters": [
        "MAN"
      ],
      "action_text": "JULIANA  You... you weren’t looking for  anyone named Trudy, were you?  JOE  No...  JULIANA  This is just... You really just  wanted a beer?   *  JOE  Yeah, why? Is that so weird?  Juliana shakes her head, disappointed.  JULIANA  No. Guess not.  INT. FRANK & JULIANA’S APARTMENT -   DAY 3 86   86   *  A knock on Frank's door. Frank opens -- is ROUGHLY GRABBED by  Soldiers. BEATEN and HANDCUFFED. Dragged outside.  Joe remembers something, looks at his watch.   *  JOE  Aw, crud.   *  JULIANA   *  What?   *  JOE   *  Be right back.   *  As he sets down his beer, Juliana watching him go --   *  EXT. FRANK & JULIANA’S APARTMENT -   DAY 3 87   87   *  Doni, the Teenage Boy from the dojo, stands beside Inspector  Kido. Face bruised, he looks at Frank with guilty eyes -- he  told Kido about the satchel Juliana was carrying. Frank is  dragged inside the back of a van, doors SLAMMED SHUT --  EXT. SUNRISE DINER -   DAY 3 A88   A88   *  Joe in a phone booth, listens to the PHONE ringing, then   *  connect.   *  62.  CONTINUED: A86   A86  (CONTINUED) END OF EPISODE   *  64.  CONTINUED: 88   88",
      "dialogue_count": 1,
      "word_count": 585
    }
  ]
}