{
  "slug": "the-handmaids-tale-201-june-2018",
  "title": "the handmaids tale 201 june",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 8233,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. RED CENTER - DORM - NIGHT -   FLASHBACK  Moonlight. Handmaids in white nightgowns kneel beside their beds. HANDMAIDS (in unison) God in heaven, blessed be Your name. Heads down, hands clasped. Like Christmas card angels. HANDMAIDS (CONT’D) (in unison) Thank you, oh God, for not creating me a man. AUNT LYDIA patrols. She passes MOIRA, ALMA and OFFRED. JANINE prays passionately, swept up in the ecstasy of abasement. A bandage covers her freshly-plucked eye. HANDMAIDS (CONT’D) (in unison) Dear God, make me empty. Obliterate me. Make me worthy to receive Your seed. Janine raises her hands, looks heavenward. JANINE (desperate ramble) Please make me worthy God I know I’m a slut I know I’m a piece of shit --  ZAP   -- Aunt Lydia shocks Janine with her cattle prod. Janine yelps, falls quiet. Offred and the others go silent. AUNT LYDIA No need to make a spectacle of yourself, Janine. Janine cowers, instantly contrite. JANINE I’m sorry, Aunt Lydia. Aunt Lydia offers a forgiving look -- the kind shepherd. (CONTINUED)  THT   Production Draft   Ep. 201 \"June\" 8/22/17   1.",
      "characters": [],
      "action_text": "AUNT LYDIA Yes. (an order) Girls. The Handmaids continue their prayers. ON OFFRED -- HANDMAIDS (in unison) I am your vessel, oh God. Mortify my flesh that I may be multiplied in Your grace... As the HANDMAIDS pray, we PRE-LAP OFFRED’S VOICEOVER. OFFRED (V.O.)  God in heaven, blessed be Your name. Whatever it is.  (and then)  I wish you’d tell me. The real one, I mean.  END FLASHBACK:  EXT. GILEAD - STREETS - DAY  Just after the end of SEASON 1.  A black EYE VAN moves through the beautiful streets of Gilead. OFFRED (V.O.)  I think we’re at that point in our relationship, right?  (and then)  Okay, then I wish at least I knew the plan.  INT. EYE VAN - NIGHT - CONTINUOUS Offred sits in the back of the van. Placid. Thin shafts of sunlight make moving patterns across her face. OFFRED (V.O.)  I know it isn’t Your plan. I don’t believe for a minute that what’s going on here is something You ever meant to happen.  (and then)  If I were You I’d be fucking furious.  Offred turns, sees the profile of the VAN DRIVER. CONTINUED: (CONTINUED)  THT   Production Draft   Ep. 201 \"June\" 8/22/17   2. OFFRED (V.O.)  Maybe You could just tell me who to trust.  (and then)  Anyone? Even Nick?  The Driver watches the road. His eyes hidden behind sunglasses. Friend or foe? Offred has no way to know. A CLICKING catches her attention. She looks across the van. Against the wall, two BRASS SHELL CASINGS tap together. Artifacts of violence. OFFRED (V.O.)  Maybe I don’t really want to know. Maybe I couldn’t bear to know.  (and then)  If it’s that bad, then forget about my daily bread. And forgiving my trespasses.  (and then)  Just deliver us from evil. That’s all.  From outside, Offred hears BARKING DOGS, MALE VOICES, and SQUAWKING RADIOS. It sounds like a GUARDIAN CHECKPOINT. The van JERKS, then reverses with a piercing   beep, beep --  Offred fights rising panic. OFFRED (V.O.)  But God, if we have to die, let it be fast. You might even provide a Heaven for us.  (and then)  Hell, we can make for o",
      "dialogue_count": 0,
      "word_count": 4310
    },
    {
      "scene_number": 2,
      "slugline": "INT. PUBLISHING OFFICE - CONFERENCE ROOM - DAY -   FLASHBACK  From the Red Center horror, we flashback to something beautiful, serene. JUNE -- sunlight on her face. A moment captured -- a young woman, a young mother, living her normal life. Thinking about the future. She is alone in the conference room. A BOOK MANUSCRIPT and other work papers clutter the table. But June ignores her work. She looks out the window, over the city. A perfect autumn day in Boston. The door opens. A young colleague QUINN steps in. He holds June’s purse. JUNE Hey. QUINN You’ve been buzzing. He means her cell phone. Quinn crosses, sets June’s bag on the table. JUNE Sorry. Thanks. June starts digging in her purse for her cell phone. JUNE (CONT’D) Did you set the thing with Paspalis? QUINN Waiting for a call back. (re: the manuscript) How’s the draft? JUNE Good, the changes are helping. Quinn peeks at the title. QUINN  Agricultural Economics in Early Modern Spain and Portugal.   Sexy. June finds her phone. Looks at the screen. (CONTINUED)  THT   Production Draft   Ep. 201 \"June\" 8/22/17   24.",
      "characters": [],
      "action_text": "JUNE Shit. June starts dialing her cell. QUINN What? JUNE My daughter’s school. Quinn makes a   yikes, I hope this is nothing bad   face. RECORDED VOICE (O.S.) (on phone)  Hello, you’ve reached Madison Brand Elementary School. If you know the extension...  June hits a few numbers. SCHOOL WORKER (O.S.) (on phone)  Good morning, school office.  JUNE (into phone) Hi, this is June Osborn. You called me, my daughter is Hannah Bankole. SCHOOL WORKER (O.S.)  Oh, okay, Mrs. Bankole. I’m afraid Hannah isn’t feeling very well this morning.  We follow June -- INT. PUBLISHING OFFICE - DAY - CONTINUOUS -   FLASHBACK  June walks through the busy office to her desk. JUNE Is she okay? Can I talk to Mrs. Dhanji? SCHOOL WORKER (O.S.)  She was running a temperature, ummmm --  (checking)  One-oh-one point one.  CONTINUED: (CONTINUED)  THT   Production Draft   Ep. 201 \"June\" 8/22/17   25. JUNE Crap. Okay. She was a little warm when she woke up, but I gave her some Tylenol to knock it down. SCHOOL WORKER (O.S.)  A child is required to be fever- free for 48 hours before he can return to school.  June grabs her coat from her desk. JUNE I’m sorry. I’m leaving now. Can you tell Mrs. Dhanji to tell her I’ll be there in like fifteen minutes? SCHOOL WORKER (O.S.)  Mrs. Bankole, Hannah isn’t here. When we couldn’t reach you we called an ambulance.  June reacts --   an ambulance?  JUNE She has a   fever . SCHOOL WORKER (O.S.)  The state has policies. We can’t take any chances.  June holds back her anger. JUNE Which hospital? SCHOOL WORKER (O.S.)  University Children’s.  JUNE Thank you. June turns off her phone, walks fast for the elevators. JUNE (CONT’D) Fuck, fuck, fuck. INT. HOSPITAL - ER TREATMENT ROOM - DAY -   FLASHBACK CONTINUES  LOOKING OUT into the busy ER. We see JUNE enter, stop at the Admitting Station. A CLERK points. June hurries across the ER, enters the TREATMENT ROOM. CONTINUED: (CONTINUED)  THT   Production Draft   Ep. 201 \"June\" 8/22/17   26. HANNAH lays in bed. Worn out, sleepy",
      "dialogue_count": 0,
      "word_count": 3923
    }
  ]
}