{
  "slug": "the-boys-101-the-name-of-the-game-2019",
  "title": "the boys 101 the name of the game",
  "genre": "drama",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 10947,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SUBURBAN HOUSE - DAY  OPEN ON A BOOKCASE.   Loaded with TROPHIES.   RIBBONS.   “LITTLE MISS SUPERSTAR - 1st PLACE.”   “SWEET CORN FESTIVAL & 5K RUN - BEST OVERALL POWERS.”   Etc.   Along with a crowd of photos -- of a heavily made-up, Jon Benet-style Starlight, ages 4 thru 10, always jauntily posing, hands-on-hips, wearing a kid- sized, homemade version of her outfit. A shrine to a Mother’s pride in her daughter. In the adjacent kitchen -- Starlight herself, in her grown-up Superhero outfit, pours some Kraft Shells and Cheese into a pot.   Keeps one ear on a POLICE SCANNER, which babbles on about some local loitering and a nasty rash of graffiti. Her Mother enters -- listens briefly to the scanner -- STARLIGHT’S MOTHER Any maniacs out there? STARLIGHT Quiet night.   Like every night. STARLIGHT’S MOTHER Too bad.   We could use the press right now. (sees the pot, clucks) Oh, Annie, could you pack any more carbs into that? Apparently, Annie is her ‘secret identity’ name. STARLIGHT I’m hungry, Mother.   And would you relax?   I didn’t get the job. STARLIGHT’S MOTHER You don’t know that, you’re better than all of them. When -- RING.   RING.   The phone.   Mom goes to answer. STARLIGHT They’re auditioning nation-wide. Besides, Countess probably got it, she’s really good in a room. STARLIGHT’S MOTHER If you’re negative, negative things happen to you. (picks up phone) Hello?   Um, I’m her Mother.   Yes, yes, one moment. Mom holds out the phone, on pins and needles.   Mouths “it’s them!”   Starlight can’t help but feel a stab of butterflies. Moves for the phone.  (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   12. UTA",
      "characters": [],
      "action_text": "STARLIGHT Hello?   Yes, this is she. (then) I -- got it?   I GOT IT?! STARLIGHT’S MOTHER YOU GOT IT!!   YOU GOT IT!! Off this rambunctious, unbridled maternal ECSTASY --  INT. ROBIN’S PARENTS’ APARTMENT - NIGHT  OPEN ON A FRAMED PHOTO in a much less happy home.   ROBIN beaming beside her loving PARENTS. WIDER.   Hughie sits at their kitchen table.   Awkwardly shuffles notes and papers. In front of Robin’s Mom and Dad.   Mom, red-rimmed eyes, only stares down at her folded hands.   Dad also averts eye contact, impatiently taps his wedding ring onto his beer bottle throughout.   Clink.   Clink. HUGHIE ...so we can’t file criminal charges against A-Train.   Heroes are like cops, they can’t be charged for collateral damage while in pursuit. Robin’s Mom wipes away a tear.   This is all a painful subject.   Hughie continues -- HUGHIE But -- but -- we can still file a civil suit.   I found a lawyer -- he’ll work on percentage, won’t even charge us unless we win -- ROBIN’S DAD Hughie -- HUGHIE I just need you to jump in -- I’m not family, I can’t really sue by myself.   But -- ROBIN’S DAD Hughie.   Stop.   We’re not suing anybody. HUGHIE What?   Why not? ROBIN’S DAD There’s no case.   She was in the street.   It’s the same as if she jay- walked and a bus hit her.  CONTINUED: (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   13. UTA HUGHIE She was a half-step off the curb! Then Hughie spots it.   On the table, right in front of the parents: another SILVER ‘VOUGHT’ PEN.   The truth falls on Hughie like a ton of bricks. HUGHIE Wait, were they -- did you sign? (silence speaks volumes) You took their money?   Gene? Dad stops clinking the beer bottle.   Searches Hughie’s face. ROBIN’S DAD How long have I known you, Hughie? HUGHIE Since -- Robin and me were in high school. ROBIN’S DAD Prom night, actually.   We met you, in that tux two sizes too big -- and there are some kids who just have that go-getter spark in their eye. (then) You were not one of tho",
      "dialogue_count": 0,
      "word_count": 777
    },
    {
      "scene_number": 2,
      "slugline": "EXT. NEW YORK STREET - NIGHT  Hughie.   Walking down the street.   Despondent.   Listening to a MESSAGE on his CELL -- DOUG FRIEDMAN (ON PHONE) Hugh, this is Doug Friedman from Vought, just checking in.   Look, I know the money can never make up for losing Robin.   But we can make things a little easier for your family, if you’d -- Hughie CLICKS it off.   Then strangely, we CUT TO -- A STILL CAMERA POV.   From inside a car.   SNAPPING PICS of Hughie.   Clickclickclickclick.   As he enters a bodega. Who’s taking pictures?   Off this mystery --  INT. NEW YORK BODEGA - NIGHT  A SIXER of BUD LIGHT.   Pulled from the fridge case by Hughie. He’s on edge. An edge he goes plummeting right over when -- He pivots in the cramped aisle.   Coming face to face with A- Train!   Even worse, a DOZEN A-TRAINS!   Side by side! It’s a magazine rack.   A-Train on the cover of US WEEKLY.   He smiles, hugging a chirpy BALD CANCER KID beneath the headline “MAKING WISHES COME TRUE.” Hughie, breathing shallow, backs away.   Bumping against an entire row of CEREAL.   Box drops, Hughie looks. Delicious FROSTED A-TRAINS.   A whole fucking ROW of them. WIDE ANGLE.   Hughie.   Spinning.   Drowning.   Now sees -- A- Train on CANS of MONSTER ENERGY DRINK. On a CARDBOARD CUT-OUT at the aisle’s end, cerveza in hand -- ‘A-TRAIN CELEBRA CINCO DE MAYO.’ A-Train, A-Train, A-Train, A-Train. The guy murdered the love of Hughie’s life.   And everyone idolizes the asshole. Hughie’s chest is heaving now.   He slides to the floor, back against the wall.   We leave him there -- in the throes of a full blown PTSD PANIC ATTACK.  EXT. THE SEVEN TOWER - NEW YORK CITY - MORNING  PAN DOWN off the gleaming, sky-scraping, futuristic SEVEN TOWER.   To find --  (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   15. UTA",
      "characters": [],
      "action_text": "A LIMO PULLS UP.   A ‘Vought’ PAGE opens the door for -- Starlight.   Followed by her Mother.   They gape up at the Tower.   At the CROWD of SCREAMING FANS behind the ropes.   A GROUP OF MEN and WOMEN APPROACH -- Starlight’s ENTOURAGE -- ASHLEY Hi.   I’m Ashley, I’m your publicist. STARLIGHT’S MOTHER (holy shit!) A publicist. STARLIGHT Hi.   Hello. ASHLEY This is Rachel, hair and make-up. Luis is your stylist.   Dan and Rich, they’re from your marketing and social media teams.   Amy’s your PA, you need anything, you ask her.   You two thirsty?   Amy! STARLIGHT (to the group) I’m -- hi.   No, we’re good. ASHLEY Well, Amy’s gonna get your Mom to her seat, but you, you’re with me, we’re gonna be late! Starlight is dizzy already.   A heady whirlwind of glamor. Waves happily at her Mother as she’s whisked away.  INT. THE SEVEN TOWER - AUDITORIUM - DAY  Starlight’s Mother, awed, takes her VIP front row seat among a packed HOUSE of INVESTORS. A SPOTLIGHT illuminates Vice-President of Hero Management Julia Stillwell.   Confident.   Gregarious. She pitches the crowd before a stage-wide video screen -- ‘VOUGHT INTERNATIONAL: 2017 ANNUAL MEETING OF SHAREHOLDERS.’ Along with alternating images of their various projects. Movie Posters.   Theme Parks.   Toys.   Cartoons.   Vought makes Marvel look like a corn-studded piece of shit. JULIA STILLWELL ...net income is up 14 percent, our latest film “G-Men: World War” grossed just shy of 1.7 billion world-wide.   This fall we break ground on our newest theme park outside of Paris.   Our branding opportunities are limitless.  CONTINUED: (MORE) (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   16. UTA It’s a good time to be in the Superhero Business. The crowd applauds -- Julia holds up her hand, goes sincere -- JULIA STILLWELL But as we all know, none of that matters.   Because job one?   Is managing, supporting, and advising the brave heroes who put themselves in harm’s way each and every day. For us.   Take",
      "dialogue_count": 0,
      "word_count": 3093
    },
    {
      "scene_number": 3,
      "slugline": "INT. OLD MONEY BUILDING - PRIVATE CLUB - NIGHT  DING!   CLOSE ON HUGHIE as the ELEVATOR DOOR OPENS.   His jaw hits the floor.   As he takes in -- A PRIVATE CLUB.   Dark.   Thumping music.   Lots of SIDE ROOMS and various nooks and crannies. AND SUPERHEROES.   Male and female.   All shapes and sizes and colors.   PARTYING THEIR COSTUMED ASSES OFF.   The female heroes are having as much rambunctious fun as the men.   It’s like Studio 54 -- multiplied by 54. One FEMALE HERO with a tiara tightens her FLUORESCENT ROPE, S&M style, around a HOG-TIED NAKED MAN.   He happily begs to be spanked, she happily obliges. Two HEROES TELEKINETICALLY HURL a CHAIR over a ducking WAITER, SMASHING it through the window, as if they were Whitesnake on the Sunset Strip. Hughie and Butcher step over a burly STEEL-SKINNED SUPERHERO, passed out on the floor in a pool of his own sick.   WAITERS try to drag him away, but he’s far too heavy. Hughie is absolutely gobsmacked.   Then spots -- HUGHIE Hey, that’s Captain Fantastic.   The ‘Capes for Christ’ guy.   Holds those anti-gay rallies. POV.   The stretchy Superhero we saw on TV in the opener is in ecstasy, wrapped around THREE MEN in G-STRINGS. BUTCHER And now he’s the meat in the Manwich.   Fuckin’ hypocrite.   Like Bill Cosby in spandex. They pass a HERO, his hair a SHIMMERING WAVE of FIRE, quietly and desperately crying to himself.   Who knows why. HUGHIE Okay.   So this is more than I ever, ever wanted to see.   I’m leaving now before one of them tries to have sex with me.   Or kill me.   Or both. BUTCHER Not yet. Off Hughie -- he follows Butcher into a back room --  INT. SECURITY ROOM - NIGHT  The anxious Security Guard checks the coast is clear.   Then lets Butcher and Hughie into the SECURITY ROOM.   A wall full of monitors recording every room.  (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   27. UTA",
      "characters": [],
      "action_text": "SECURITY GUARD Hurry up. BUTCHER Where’s the vid you rang me about? The Security Guard reluctantly hands Butcher a MEMORY STICK. Butcher plugs it into a COMPUTER. BUTCHER Oi.   Hughie.   Monitor 2. Butcher fiddles a knob.   Turning up the AUDIO. THE MONITOR.   Time-stamped security cam footage of a BACK ROOM.   A-TRAIN.   Throws back shots like it’s his job. HUGHIE A-Train’s -- here? BUTCHER Was.   This is from last night. THE MONITOR.   Suddenly, A-Train looks O.S., as -- BIG GAME (O.S.) A-Train.   Your girlfriend’s here. She’s pissed. A HERO -- BIG GAME -- enters.   He carries two MANNEQUIN ARMS. BIG GAME She wants to know why you ran through her the other night.   I mean, she just went to pieces. HUGHIE.   His jaw clenches.   Butcher looks at him, sympathetic.   Knows how hard this is for him. A-TRAIN Hey, I’m not the one that threw a Volvo at that carjacker, without realizing there was a fucking kid strapped inside. BIG GAME Screw you, man, that sucked. (sucks back a shot) I had to go fucking cry on Diane Sawyer. Pointed, because A-Train just did the same -- A-TRAIN Boy, can’t imagine what that’s like, asshole. Big Game sticks the mannequin arms into A-Train’s crotch.  CONTINUED: (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   28. UTA BIG GAME Aw, look, she wants to make up. A-TRAIN Sorry, baby, but when I get inside a girl, I get inside a girl. CLOSE ON HUGHIE.   Quietly enraged -- HUGHIE ...they’re laughing.   Like she’s a joke.   They’re fucking laughing. BUTCHER Question is, what are you gonna do about it?  INT. THE SEVEN TOWER - OUTSIDE BOARDROOM - NIGHT  Vought Vice-President Julia Stillwell skims down the Tower’s hallway with the Vought Lawyer -- same guy from before -- he hurries to keep up.   He’s nervous -- she is miles above his paygrade.   But she never loses her corporate geniality. JULIA STILLWELL I’m sorry.   It’s Doug? DOUG FRIEDMAN Yes.   Doug.   Friedman.   Ma’am. JULIA STILLWELL Doug, I appreciate you trying to low",
      "dialogue_count": 0,
      "word_count": 2282
    },
    {
      "scene_number": 4,
      "slugline": "INT. THE SEVEN TOWER - BOARDROOM - NIGHT - INTERCUT  Stillwell’s smile is tight.   She doesn’t like to acquiesce. JULIA STILLWELL Alright, Steve.   This fucking chafes, but we can go down to 230 million for Nubian Prince. MAYOR I think that’s very reasonable, Julia.   Thank you. JULIA STILLWELL Well, like you said, friendship cuts both ways. MAYOR Yes, it does.   You have my word. There are secrets and scandals between these lines.   But we don’t know what they are.   Yet. Off the Mayor, seemingly winning the negotiation --  INT. HUGHIE’S FAMILY APARTMENT - QUEENS - NEXT DAY  ON THE TV.   ELLEN.   Eternally upbeat.   She sits with a VISIBLE (and clothed) TRANSLUCENT -- He rolls up his sleeve, lifts his bare arm.   Which SHIMMERS then seemingly DISAPPEARS. TRANSLUCENT ...no, I don’t actually vanish, my skin turns into this -- carbon meta- material -- that bends light.   Like an invisibility cloak. ELLEN But just to be clear -- you have to be completely naked, right? The audience OOHS and AAHS -- Hughie.   Sits on the couch.   Numb, listless, defeated.   Next to his wheezing Father.   His Mom sets a plate of pizza rolls on the coffee table. HUGHIE’S MOM Here you go, honey.   Pizza rolls with ketchup. Hughie picks one up.   Hesitates.   Somehow, eating one means acquiescing to his sad suburban life.   When --  (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   36. UTA",
      "characters": [],
      "action_text": "HUGHIE’S DAD (finally speaks) 30 years at that One Hour Martinizing.   Cost me a lung, and what’d I get for it?   And you wanna take on Vought?   It’s like trynna take on a mountain.   Take the money, Hughie.   We’re lucky to get it. PUSH IN ON HUGHIE.   Holding that pizza roll.   Looking at his Dad.   Is he really gonna give up?   Give in?  EXT. CENTRAL PARK - DAY  Starlight -- dressed for the first time in CIVILIAN CLOTHES. As her secret identity: mild-mannered Annie.   She strolls through the park, phone to her ear.   INTERCUT WITH:  INT. SUBURBAN HOUSE - DAY  Starlight’s Mother makes a bedazzled PRESS SCRAPBOOK of all her daughter’s recent newspaper clippings. STARLIGHT’S MOTHER ...so.   How amazing is it?   What’s the Homelander like? ANNIE/STARLIGHT I... he’s busy, I haven’t really met him yet.   Look, Mom, I gotta tell you what happened... STARLIGHT’S MOTHER Oh, I almost forgot.   I was playing Mahjong with Judy and Elaine, and they were going on and on about how wonderful Starlight is.   Starlight this and Starlight that.   I know, I know, I gotta protect your secret identity, but I would love to see the looks on their faces if I told them it was you. (beat) Anyway, what were you gonna say? ANNIE (long beat) Just that everything’s great.   Just how I dreamed.   Mom, I gotta go. WITH ANNIE.   She hangs up.   Sits on a park bench.   Stares up at -- the radiant SEVEN TOWER.   This isn’t at all what she thought it would be.   Her dreams are dying on the vine. HUGHIE (O.S.) I’m sorry, but... are you okay? HUGHIE.   On a bench beside her.  CONTINUED: (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   37. UTA Both of them, watching the Tower.   For very different reasons.   She wipes a tear, embarrassed. ANNIE Yeah.   I’m fine. Hughie pulls a CLOTH HANDKERCHIEF out of his pocket. Crosses to Annie.   Holds it out. She gives him an odd look.   After what she’s been through, she’s not ready to accept a kindness from a stranger. ANNIE No thank",
      "dialogue_count": 0,
      "word_count": 1411
    },
    {
      "scene_number": 5,
      "slugline": "INT. THE SEVEN TOWER - BOARDROOM - DAY  A-Train.   With Julia Stillwell.   Having a quiet side-bar in the corner as the other members of the Seven enter the BOARDROOM for their official meeting. A-TRAIN No.   No way. JULIA STILLWELL We gotta put this behind us, it’s five minutes out of your day. A-TRAIN So some dude can blubber all over me?   I’m -- not good in situations like that.   No. Julia steps forward.   Her genial smile never leaves her face. JULIA STILLWELL You know.   The Blue Bolt shaved another point off his mile.   He’s almost as fast as you.   Impressive, especially someone that young. A-TRAIN The hell is that supposed to mean? JULIA STILLWELL Look, I’m just trying to help.   You know I love you, but I’m only one person in this company.   You don’t want the guys upstairs to start bitching that you’re difficult. Like they did with the Lamplighter. Off A-Train...  INT. DIVE BAR - DAY  Butcher.   Hughie.   At the bar.   Waiting.   When -- RING! Hughie’s cell.   He answers. HUGHIE Hello?   Yes, Mr. Friedman...? He gives Butcher a look.   They’re in.   Butcher knew it.  INT. THE SEVEN TOWER - BATHROOM - DAY  Starlight.   Back in uniform.   Alone at the sink. She stares at herself in the mirror.   Suppressing her fear and anger.   Fuck ‘em.   She won’t give ‘em the satisfaction. THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   42. UTA",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 237
    },
    {
      "scene_number": 6,
      "slugline": "INT. THE SEVEN TOWER - BOARDROOM - DAY  Starlight enters.   The Seven have gathered, a modern-day Knights of the Oblong Conference Table.   Homelander at the head.   Julia Stillwell observes in the corner. HOMELANDER (pure Costner) Starlight.   Don’t wanna be late for your first official meeting.   I had a whole welcome speech planned. STARLIGHT Sorry, Sir. HOMELANDER Homelander is fine. DEEP We were beginning to wonder if you’d even show up. She glares at the Deep, defiant.   She’s literally got a look to kill and wants to use it.   But she restrains herself. STARLIGHT (dry) Oh, no, I’m excited to be here.   I’m on pins and needles. The Deep.   Glares at her, surprised.   Didn’t expect this much grit from Starlight. As a floating pair of reading glasses in the next chair peruses some paperwork -- TRANSLUCENT ...can we get back to this please, this is a serious crime. (then) Copyright infringement of our brands, individually and collectively, is costing Vought 1.2 billion per year.   That’s money out of our pockets.   We’ve all got, what, four points each? As they ramble on... Starlight.   She acts calm, strong.   But she’s wearing a mask. A-TRAIN Fuck.   You’ve got four points? QUEEN MAEVE And clearly, better lawyers. HOMELANDER Hey.   C’mon.   Stop.  (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   43. UTA",
      "characters": [],
      "action_text": "Everyone shuts up.   Turns to the Homelander.   He commands unwavering respect -- HOMELANDER (pure Clooney) What’s Starlight gonna think, listening to us haggle over nickels? We’re the Seven for God’s sake.   Now what I want to hear -- is who you saved this week.   Black Noir, let’s start with you -- The guy really is an omnipotent Boy Scout.   Off this --  EXT. THE SEVEN TOWER/INT. BUTCHER’S CAR - NIGHT  PAN DOWN off the SEVEN TOWER to reveal -- Butcher’s car.   The behemoth of a Caddy. INSIDE THE CAR.   Hughie, anxious as hell.   Looks in the back seat -- notices some STRAY DOG TOYS.   Bright, cutesy, squeaky rubber animals.   Seems out of character for Butcher. HUGHIE You have a dog? BUTCHER No. Butcher doesn’t elaborate further.   On Hughie -- umkay. BUTCHER Give us your phone. Hughie complies.   Butcher pops it out of its case.   Then pulls out a BUG.   As wide and thin as a silver dollar. BUTCHER Security won’t find it, or the X- ray. Butcher hides the bug in Hughie’s phone case, clicks the phone back in place OVER it -- BUTCHER Now, what they’ll probably do is take you to the boardroom.   Give it a minute, say you need a crap.   Take out the bug when you’re in the bog. Glue’s there on one side, see?   Go back, stick it under the boardroom table, that’s that. Hughie’s heart is racing.   Commencing another panic attack? He starts spluttering -- HUGHIE That’s that?   Kinda seems like -- a lot, actually.   What if --  CONTINUED: (CONTINUED)  THE BOYS #101 \"Name of the Game\" - 10/15/17 (NETWORK DRAFT 6)   44. UTA BUTCHER Hughie.   Two choices.   One: go an’ whine to a shrink for the rest of your life, pop some Klonopin, maybe punch an A-Train doll.   Two: stop bein’ such a cunt.   What do you say? Off Hughie.   He swallows nervously -- a major effort -- and climbs out of the car.  INT. THE SEVEN TOWER - LOBBY - NIGHT  Hughie.   GRIPPING his phone.   We hear his THUMPING HEART.   As he enters the hypermodern lobby.   Approaches Ashley the publicist, surgically atta",
      "dialogue_count": 0,
      "word_count": 3147
    }
  ]
}