{
  "slug": "the-greatest-showman-2017",
  "title": "the greatest showman",
  "genre": "drama",
  "format": "film",
  "scenes_count": 22,
  "characters_count": 6,
  "characters": [
    "YOUNG BARNUM",
    "BARNUM",
    "HERALD",
    "JENNY",
    "ODDITIES",
    "CHARITY"
  ],
  "total_words": 26027,
  "total_dialogue": 9,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. WATERFRONT ESTATE - DAY 5   5  SILENCE.   A close-up of YOUNG BARNUM (10) silhouetted against   *  the sun.   Someone else is with him, but hard to see.   We don’t know where we are.   Young Barnum speaks gently. YOUNG BARNUM All you have to do is jump. YOUNG CHARITY (O.C.) I’m scared. YOUNG BARNUM That’s what makes it fun!   *  WIDER -- Young Barnum and Young Charity (also 10), stand on the limb of a giant old tree that reaches out over the water. She wears a white party dress. He is in scuffed work clothes. It’s a 20 foot drop to the water -- no small feat. YOUNG CHARITY   *  I shouldn’t be doing this.   *  YOUNG BARNUM   *  That also makes it fun!   *  YOUNG CHARITY   *  You always make me do crazy things!   *  YOUNG BARNUM   *  It’s like you’re flying!   For one second,   *  you feel free!   *  She looks down a moment, then pulls back.   *  YOUNG CHARITY I can’t do it. YOUNG BARNUM Of course you can!   You just have to take that first step... She half-smiles, still scared.   Nods bravely -- let’s do it! YOUNG BARNUM (CONT’D) Ready?   One, two, three...! They jump.   And fall, side-by-side...   SPLASH!   They surface. She is laughing, delighted.   She just became a braver person. YOUNG CHARITY Let’s do that again!   And again, and again, and again!  The   Greatest   Showman   On   Earth   4/20/15   Draft   4.  (CONTINUED)",
      "characters": [],
      "action_text": "He grins -- dazzled by her delight.   They swim to the shore and climb steps up onto a lawn -- laughing, high-spirited. YOUNG BARNUM I saw a sea nymph underwater!   *  YOUNG CHARITY You did not! YOUNG BARNUM She was wearing a white dress! She laughs.   He drinks in her laughter.   Behind them, we SEE grounds of a massive, old-money Connecticut estate. MR. HALLETT (O.C.) Charity! They turn.   MR. HALLETT, patrician and stern, steps forward, glaring balefully.   Behind him, a grounds-keeper with a rake, PHILO BARNUM (40s), in work clothes, looks on worriedly. Charity quickly bows her head -- becoming docile, obedient. MR. HALLETT (CONT’D) Is this how we have taught you to behave? Like a person of no breeding?   Come here!   *  Look at your dress!   How many times have   *  I told you not to trouble the help!   *  She walks to her father, not looking at Young Barnum. PHILO It’s the boy’s fault, sir.   I’m sorry.   *  He’s a bit touched in the head, you know.   *  Come on, son.   There’s work to do. MR. HALLETT You’ve done quite enough today, Mr. Barnum.   There’s that for your troubles. He hands over a nickel.   Philo bows obsequiously. PHILO Thank you, sir.   Apologies again.   *  Mr. Hallet turns, walks back to his estate. Charity follows dutifully.   Barnum watches.   Then she turns, and, behind her father’s back, smiles at him.   Young Barnum is thunderstruck. This smile, a beacon of joy, will become his North Star. Philo -- seeing his son’s love-struck gaze -- swats his head.   *  PHILO (CONT’D) Are you crazy?   Let’s get home.   *  The   Greatest   Showman   On   Earth   4/20/15   Draft   5.  CONTINUED: 5   5",
      "dialogue_count": 0,
      "word_count": 515
    },
    {
      "scene_number": 2,
      "slugline": "INT. BARNUM HOUSE - KITCHEN - BETHEL - DAY 6   6  Nothing quaint here, the austere room reflects a hardscrabble Yankee life.   The family sits at the table as Barnum’s four younger SIBLINGS (ages 3 to 7) are served thin soup by their mother IRENE.   Barnum is telling them stories, and they are giggling and enthralled.   Philo listens in impatient silence. YOUNG BARNUM ...And when I get to India, I shall ride an elephant!   And capture a tiger! IRENE And what will you do with a tiger? YOUNG BARNUM I’ll give my tiger as a gift to the Raj.   *  And everyone will want to come see it!   *  And the Raj will become my best friend, and he will offer me half his kingdom... PHILO BARNUM Phineas. YOUNG BARNUM ...And I shall say, “No, thank you, sir!” Philo SLAMS his hand on the table.   Everyone jumps.   Silence. PHILO BARNUM As of Monday, you’ll join me on the farm. IRENE What about his schooling? PHILO BARNUM A waste of time.   His place is in the fields. YOUNG BARNUM But father...! Philo silences him with a sharp look.   It hurts to say: PHILO BARNUM You can dream all you want, son.   It won’t put food on the table. Barnum stares.   He gets up, leaves the table, and exits. OMITTED 7   7  The   Greatest   Showman   On   Earth   4/20/15   Draft   6.",
      "characters": [
        "YOUNG BARNUM",
        "BARNUM"
      ],
      "action_text": "EXT. BEACH - SUNSET 8   8  Young Barnum sits on a beach -- his father’s words echoing in his head.   He looks up to see young Charity approaching. YOUNG BARNUM How did you get out? YOUNG CHARITY I climbed out the window once father got into his Port. She sits down next to him.   She is downcast as well.   *  YOUNG BARNUM Were you scolded? YOUNG CHARITY Were you? They share a look -- they both were. They turn to the sunset, sad and pensive.   Then Barnum picks up a piece of driftwood. YOUNG BARNUM Do you know what this is? She can’t help but smile, knowing that a story is coming. YOUNG BARNUM (CONT’D) Look carefully.   You see?   *  (he turns it in his hand) It’s the fossil of a Mermaid from   *  Atlantis. She looks. Amazingly, the driftwood has a mermaid-like shape. YOUNG BARNUM (CONT’D) It’s a priceless treasure.   *  He gives it to her.   She smiles, but is suddenly teary-eyed. YOUNG CHARITY I’m going to miss you. He turns to her -- what does that mean?   She turns to him. YOUNG CHARITY (CONT’D) Father is sending me to finishing school.   *  YOUNG BARNUM When will I see you again? She shakes her head -- never.   He is caught off guard.  The   Greatest   Showman   On   Earth   4/20/15   Draft   7.  (CONTINUED) YOUNG CHARITY I don’t know what my future will be.   *  Father says I am to be a lady, but...   *  It’s all so dull when you’re not there. He looks at her.   He has one chance to not lose her forever. YOUNG BARNUM I can see my future.   And yours too.   *  YOUNG CHARITY No, you can’t. YOUNG BARNUM I can.   I’ll show you... MUSIC starts under, a simple piano theme, both sweet and sad. EXT. MANSION - NIGHT 9   9  Barnum leads Charity up the front walk of a huge neoclassical   *  mansion that has fallen into disrepair. YOUNG BARNUM It’s okay.   No one lives here anymore. INT. MANSION - NIGHT 10   10  It’s dark, lit only by the moon.   Barnum leads Charity through the rooms.   As he sings about a world he envisions, we see trophy animals, oriental antiques, and c",
      "dialogue_count": 2,
      "word_count": 2899
    },
    {
      "scene_number": 3,
      "slugline": "INT. BANK - MANHATTAN - DAY 27   27  Barnum sits opposite a BANK MANAGER. BANKER Mr. Barnum, this venture you propose is risky, if not downright bizarre.   The bank is going to need substantial collateral -- Barnum puts a full set of legal documents on the desk. BARNUM I own the deed and title to every   *  trading vessel in this flotilla.   *  The Banker looks at the documents, then at Barnum, impressed. BANKER I see.   And where are these ships now?   *  BARNUM (all-too-literally true:) In the South China Seas. BANKER (nods, approving) Ah.   Well, then!   What do you plan to call this...   scheme of yours? EXT. LOWER EAST SIDE STREET - MANHATTAN - DAY (WEEKS LATER) 28   28  Barnum shows his family his new building, spruced up with flags and colorful posters.   A sign introduces ’BARNUM’S AMERICAN MUSEUM OF CURIOSITIES.’   Caroline reads it, puzzled. CAROLINE Barnum’s American Museum of Curiosities. HELEN What kind of museum is it, Daddy? BARNUM It’s a place to be transported!   To let your imagination soar!   To see things you never in your life thought you’d see! CAROLINE What sort of things? INT. BARNUM’S MUSEUM - DAY 29   29  THWACK!   A GUILLOTINE BLADE comes down, cutting off Marie Antoinette’s head.   Helen covers her mouth in shock.  The   Greatest   Showman   On   Earth   4/20/15   Draft   17.  (CONTINUED)",
      "characters": [],
      "action_text": "HELEN What is it? Barnum energetically leads them through a room filled with famous figures. Many have been slightly damaged in transit. BARNUM A wax figure!   They’re all the rage in Europe now!   Look -- there’s Napoleon! (waves in his face) Hello!   And Marie Antoinette, with the sore throat!   You can meet them all! The most famous people who every lived!   *  Everyone knows they’re not real, but it   *  doesn’t matter!   People want to believe,   *  so they do!   *  CHARITY   *  Speaking of which...   I brought this.   *  Charity holds out something wrapped in a blanket.   Barnum   *  unwraps it.   It is the driftwood mermaid from the beach.   *  Barnum is touched.   He looks up at Charity.   She smiles.   *  CAROLINE What’s that?   *  Barnum gently sets piece of wood into a display case.   *  BARNUM It’s a mermaid.   Straight from Fiji!   *  HELEN It looks like driftwood. BARNUM Only to the most literal-minded! He looks to Charity for support.   Charity, however, looks around skeptically -- the room filled with a rather sorry   *  collection: a pygmy skeleton, half-melted wax figures, etc.   *  CHARITY I’m not sure people are going to pay to see a handful of wax dummies -- BARNUM Exactly!   Which is why I also hired... Acrobats!   *  He whistles and a FAMILY of elderly Romanians stumble on to do a routine.   Barnum beams as the girls look on in wonder.   *  Charity leaves, needing a moment.   Barnum watches her go.  The   Greatest   Showman   On   Earth   4/20/15   Draft   18.  CONTINUED: 29   29 INT. BARNUM’S MUSEUM - A FEW MINUTES LATER 30   30  Barnum comes into the lobby to find Charity, fretting. BARNUM I know how it looks. CHARITY Good.   If you didn’t, I’d be worried. BARNUM This is just the beginning... CHARITY How much did we put into this again? BARNUM It’s complicated. CHARITY -- how much? BARNUM (hesitates) Everything. Charity takes a moment to absorb that. CHARITY You’re either a genius or a madman. BARNUM Or both. Off Barnum’s grin, we DISSOLVE T",
      "dialogue_count": 0,
      "word_count": 2127
    },
    {
      "scene_number": 4,
      "slugline": "INT. BARNUM’S TENEMENT APARTMENT - BEDROOM - NIGHT 42   42  Barnum tucks Caroline in next to Helen, who’s already asleep. CAROLINE Will there be dancing girls? BARNUM Every show has dancing girls. CAROLINE What about acrobats? BARNUM Every show has acrobats.   Or trained animals.   Or daredevils... CAROLINE Why don’t you have them all?   A show with everything? BARNUM That’s not a bad idea.   A show with everything!   But still...   It’s just more of the same, isn’t it? CAROLINE But... What else is there? BARNUM I don’t know!   I want performers you can’t see anywhere else.   Someone who couldn’t possibly exist but there they are, right in front of you!   A man with   *  two heads!   Or a giant, ten feet tall!   *  Like you’re walking into a dream!   And   *  when you walk out, you’re glad you were   *  alive to see it!   *  CAROLINE What about Tom Thumb? BARNUM Tom Thumb? CAROLINE He’s a boy we read about in school.   They say he’s the size of your thumb. BARNUM (holds up his thumb) Tom Thumb.   I like that.   You should be doing my job.  The   Greatest   Showman   On   Earth   4/20/15   Draft   26.  (CONTINUED)",
      "characters": [],
      "action_text": "He leans down and kisses Caroline.   She smiles. EXT. SMALL WOODEN CABIN - PORCH - DAY 43   43  Barnum knocks on the door.   A CRONE-LIKE WOMAN opens it and peers out, not saying a word. BARNUM Good day, Madam.   I am looking for a Mr. Charles Sherwood Stratton. WOMAN Never heard of him. She starts to close the door.   He stops her. BARNUM That’s a funny thing to say about your own son. Her look confirms he’s right. BARNUM (CONT’D) Please, ma’am.   You have no idea what I’ve gone through to find him.   I have a proposal that could change his life. The woman, MRS. STRATTON, hesitates, not sure she understands what he said.   Finally, she pulls the door open. INT. SMALL WOODEN CABIN - DAY 44   44  Barnum sits in the main room, waiting.   After a moment, CHARLES STRATTON enters the room.   25 inches, 20 pounds.   He is a boy, but the same chromosomal glitch that affects his growth also makes him look like a much older man.   His mother turns away, clearly ashamed.   But Barnum is delighted. BARNUM Hello.   My name is Mr. P.T. Barnum. Barnum stands, realizes he’s way too tall, sits back down. Stratton stares at the floor, guarded, defensive, tense. STRATTON What you want with me? BARNUM I’m putting together a show.   And I want you to star in it. A snort from Mrs. Stratton.   Stratton looks up accusingly. A lifetime of alienation and ridicule has made him scrappy.  The   Greatest   Showman   On   Earth   4/20/15   Draft   27.  CONTINUED: 42   42  (CONTINUED) STRATTON Why?   So people can laugh at me? BARNUM They’re laughing anyway, kid.   You might as well get paid. They are shocked.   No one’s ever spoken so bluntly to them. MRS. STRATTON Really, Mr. Barnum.   You should be ashamed. BARNUM I was, Mrs. Stratton.   For a long time. I was poor, and I was laughed at.   I’ve been called a fool many times... STRATTON Oh, please, you’re breaking my heart! Barnum turns, facing down the tiny but glowering Stratton. BARNUM ...But I don’t care about that anymore. STRATTON Good!  ",
      "dialogue_count": 0,
      "word_count": 1494
    },
    {
      "scene_number": 5,
      "slugline": "INT. BARNUM ARMS - NIGHT 50   50   *  An after-show party.   Tom Thumb entertains the others by drinking from a bottle while balancing on W.D.’s out-   *  stretched hand.   Barnum plucks the bottle from his hand,   *  replaces it with a glass of milk, to much LAUGHTER.   *  Barnum, in high spirits, downs a drink at the bar with Anne,   *  then turns to see SAM ROTH, a grumpy newspaperman who watches the antics with opprobrium.   Roth lifts his glass to Barnum. ROTH Impressive, Mr. Barnum. BARNUM Thank you, sir.   And you are? ROTH Sam Roth. BARNUM From the Tribune!   You got my letter!   *  (claps his shoulder) It’s an honor, sir!   How much do I have   *  to pay you to write a good review for us? ROTH I don’t know if you have that much money. BARNUM You might be surprised, Mr. Roth. ROTH Yes, well...   No one ever went broke underestimating the intelligence of the American public.   Your show is proof of   *  that.   Though even the public has it’s   *  limits, I hope...   *  Barnum is thrown by this. BARNUM   *  I think perhaps you missed the point -- ROTH -- Really?   Was there a subtext to the prancing dwarf that went over my head? BARNUM You’re over-thinking it.   We aim to show people the wonders of the world...  The   Greatest   Showman   On   Earth   4/20/15   Draft   32.  (CONTINUED)",
      "characters": [],
      "action_text": "ROTH Wonders?   Is that what you call freaks being paraded for entertainment? BARNUM Sir, the man you are calling a freak is   *  my colleague, and my friend...   *  ROTH Oh, is that how you treat your friends? Putting them on display for everyone to gawk at?   I hate to waste ink on this atrocity, but I have a duty to warn the public.   And when I’m finished, I hope   *  you will be finished as well.   *  Roth finishes his drink and departs, leaving Barnum worried. INT. BARNUM’S MUSEUM - DAY 51   51  Morning.   Barnum, Charity, W.D., Anne, and Tom sit at a table   *  by the stage, as Charity finishes reading Roth’s review.   *  CHARITY ”...insulting, degrading, and perhaps just shy of criminal, P.T. Barnum’s show is the singularly most unpleasant evening I have spent in years, calling to mind the most primitive aspects of the Roman Circuses of yore.” She stops -- it’s too painful to go on.   Uneasy silence. Barnum takes the review and scans it, thinking fiercely. CHARITY (CONT’D) Phin...   I’m so sorry. Barnum looks up -- eyes shining, seemingly elated. BARNUM It’s fantastic. He leaps up, rips out the review and hands it to W.D. BARNUM (CONT’D) Go to the Tribune and buy a half-page ad. Tell them to reprint the entire review, word for word. Everyone is stunned.   This is borderline insanity. CHARITY He called you The Prince Of Humbug.  The   Greatest   Showman   On   Earth   4/20/15   Draft   33.  CONTINUED: 50   50  (CONTINUED) BARNUM Humbug is merely the time-honored use of hyperbole to create excitement and joy. CHARITY Humbug is a lie, dear. BARNUM What’s important is: we made page one. (to W.D.) And tell them I’ll give half-price tickets to anyone who brings in a review. (off their looks) When other papers see people rushing to buy the Tribune, they’ll review us too. W.D. starts for the door, then turns back to Barnum. W.D. You sure, Mr. B.?   The whole city will read this by dinner time. Barnum, hesitates, doubting his bravado for a second.   *  Charity, clock",
      "dialogue_count": 0,
      "word_count": 1038
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BARNUM’S MUSEUM - DAY 54   54  The line is now around the block. W.D. supervises more TICKET   *  TAKERS.   A sign: “BY POPULAR DEMAND, SECOND SHOW TONIGHT.”   *  As CUSTOMERS move quietly through the doors, there’s more a   *  sense of drudgery than excitement -- people with hard lives.   *  Barnum walks down the line, eyeing the Customers in line.   *  BARNUM I STUMBLED THROUGH MY DAYS HAD MY HEAD HUNG LOW MY SKY A SHADE OF GRAY WAS TOLD TO HIDE AWAY INT. BARNUM’S MUSEUM - EVENING 55   55  Barnum walks “backstage,” singing as he passes all of the performers preparing to go on; Chang and Eng dressing together, Anne stretching, Lettie combing her beard.   He   *  stops by each one -- helping them get ready for the show,   *  trading grins and supportive smiles, keeping everyone happy.   *  BARNUM STAYIN' LOCKED INSIDE AND MADE TO FEEL ASHAMED SOMEONE WHO HAD BEEN FORGOTTEN TOLD IT WAS MY ONLY OPTION BUT THEN I FLICKED A SWITCH AND BRIGHTENED UP THAT DARKEST DAY SUN IS UP, NOW THE COLOR'S BLINDIN' TAKE A WORLD AND REDEFINE IT ANYTHING YOU WANT TO BE, IT'S TIME TO LET 'EM SEE INT. BARNUM’S MUSEUM - NIGHT 56   56  The cavernous first floor has been transformed, dominated by a circle of tiered BLEACHERS surrounding a massive STAGE. Barnum stands alone, singing to the crowd, illuminated by a   *  carbon lamp and candle footlights. BARNUM COME ALIVE COME ALIVE GO AND LIGHT YOUR LIGHT LET IT BURN SO BRIGHT REACHIN' UP TO THE SKY AND IT'S OPEN WIDE YOU'RE ELECTRIFIED AND THE WORLD BECOMES A FANTASY   *  The   Greatest   Showman   On   Earth   4/20/15   Draft   36.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "AND YOU'RE MORE THAN YOU COULD EVER BE 'CAUSE YOU'RE DREAMIN' WITH YOUR EYES WIDE OPEN AND WE KNOW WE CAN'T GO BACK AGAIN TO THE WORLD THAT WE WERE LIVIN' IN 'CAUSE WE'RE DREAMIN' WITH OUR EYES WIDE OPEN SO COME ALIVE! In the wings, Lettie stands in a sequined gown, suddenly unsure of herself.   She makes eye contact with Barnum, who offers a warm, reassuring smile. She will be safe here.   He gestures to the stage.   She smiles, and steps into the light. Then Barnum encourages a PARADE of ODDITIES to take the stage.   Those who were once hidden in the shadows now step   *  into the spotlight, and feel accepted for the first time. O'CLANCY YOU STEP OUTTA THE DARK LETTIE CAN'T BELIEVE YOUR EYES YOU DON'T KNOW WHAT IS REAL TOM THUMB NOW THEY'RE SEEIN' WHO YOU ARE CHANG AND ENG AND ALL YOU FEARED JUST FADES AWAY YOU GOT A WHOLE NEW THING TO FEEL LORD OF LEEDS NEVER BEEN APPRECIATED WONDERED WHY YOU'D BEEN CREATED BUT NOW THEY'RE FLIPPIN', FALLIN', HEAR 'EM CALLIN' OUT YOUR NAME LETTIE/W.D. A LITTLE BIT OF LIGHTNIN' STRIKIN' BOTTLED UP TO KEEP ON SHININ' BARNUM YOU CAN TRY, YOU CAN'T DENY YOU'LL NEVER BE THE SAME ALL COME ALIVE COME ALIVE GO AND LIGHT YOUR LIGHT LET IT BURN SO BRIGHT REACHIN' UP TO THE SKY AND IT'S OPEN WIDE YOU'RE ELECTRIFIED  The   Greatest   Showman   On   Earth   4/20/15   Draft   37.  CONTINUED: 56   56  BARNUM (CONT'D)  (CONTINUED) People gasp as they suddenly see Anne circling in a wide arc above their heads.   Children point and laugh as circus performers tumble into each other on the stage.   Then a massive LION enters, led by a colorfully dressed LION TAMER. It is a show of astonishments, almost too much to take in. In the wings, Barnum helps Tom Thumb onto his pony, readying   *  him for his big entrance.   Then Barnum turns.   Eunice the   *  elephant is there, towering over them.   Barnum turns back,   *  looks at Tom thumb.   They make eye contact.   Uh oh.   *  JUMP TO: Eunice the elephant enters the ring, with Tom Thumb   *  riding on to",
      "dialogue_count": 0,
      "word_count": 857
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BARNUM’S MUSEUM - NIGHT 59   59   *  People spill out in the street after a show -- elated, abuzz   *  with delight, and transformed by the experience.   They are   *  literally grabbing their friends and pulling them toward the box office -- you gotta see this!   Hawkers sell merchandise --   *  children buy Tom Thumb DOLLS, Eunice the Elephant LOLLIPOPS.   *  Barnum surveys the people as they exit.   He sees Sam Roth skulking in the alley and flashes a triumphant smile at him. ROTH Tell me, Barnum.   Does it bother you that what you’re selling is fake? Barnum steps onto the sidewalk.   Roth steps out as well now, so the two men are facing off just a few feet apart. BARNUM Do those smiles seem fake?   Or the applause?   It doesn’t matter where it comes from.   The   joy   is real. ROTH So now you’re a philanthropist? BARNUM I’m an entertainer. ROTH The prince of Humbug. BARNUM Hyperbole isn’t the worst crime, Mr. Roth.   Men suffer more from imagining too little than too much. ROTH Ah -- the creed of a true fraud. BARNUM There’s nothing sadder than a cynic, except perhaps a cynic with a pen. ROTH A philosopher too!   Please, sir, don’t add pretension to your list of sins. BARNUM Mr. Roth -- when is the last time you smiled?   Or had a good laugh? A real one? The simplicity of the question silences Roth.   Barnum smiles.  The   Greatest   Showman   On   Earth   4/20/15   Draft   39.  (CONTINUED)",
      "characters": [
        "BARNUM"
      ],
      "action_text": "END SONG. Over the sounds of enthusiastic APPLAUSE we CUT TO: EXT. STREET - BETHEL, CT. - DAY 62   62  A beautiful tree-lined street.   Barnum steps out of a ZEBRA- DRAWN CARRIAGE, then helps a blindfolded Charity out.   Helen and Caroline jump out after them. Time has passed -- they are all better-dressed and more polished than they used to be. BARNUM Right this way, m’lady. CHARITY I’m going to break my neck. Barnum removes the scarf.   Charity is stunned to see the same MANSION that she and Barnum broke into as children. CHARITY (CONT’D) This is the same--...?! BARNUM It is. In the gated backyard, there is an actual GIRAFFE grazing! CHARITY Oh, Phin.   Can we afford this? BARNUM Of course.   And even if we couldn’t, it’s an investment.   Land is the one thing they’re not making any more of. (to Helen) I think there’s something on the porch for you. Helen looks and sees a GIANT WOODEN DOLLHOUSE on the porch. She shrieks happily and runs up to claim it.   They come up the stairs behind her. Barnum opens the door.   He grabs a small WHITE BOX from the foyer, turns to Caroline. BARNUM (CONT’D) Something for you too. She opens the box and pulls out a PAIR OF BALLET SLIPPERS. She looks up at him -- it’s what she’s always wanted. BARNUM (CONT’D) And, funny enough, there’s a ballet school just down the street.  The   Greatest   Showman   On   Earth   4/20/15   Draft   41.  CONTINUED: 60   60  (CONTINUED) Caroline jumps for joy and kisses him, then runs to catch up to Helen, who’s already inside the house and headed upstairs. BARNUM (CONT’D) Your parents still live nearby, don’t they? CHARITY Phin. If I didn’t know you better, I might wonder if you bought this house to rub my parents’ noses in your success. BARNUM OUR success.   And of course not.   It’s true that I’ve accomplished everything your father said I never would -- CHARITY Yes... But you know, to them, house or no house, you’ll always be a bum from the south side. BARNUM Yes, but now I’m a bum with a huge house",
      "dialogue_count": 1,
      "word_count": 1012
    },
    {
      "scene_number": 8,
      "slugline": "INT. BARNUM MANSION - FORYER - ANOTHER DAY 64   64  Caroline sits at the foot of the stairs, putting on her ballet shoes.   She practices a few motions - she has clearly already begun her classes.  MUSIC: Orchestral version of “A Million Dreams.”  Caroline dances around the foyer, confidence growing.   She disappears around the staircase and when she emerges she is TWO YEARS OLDER, dressed in a tutu. The lights go down - she is lit by a single spotlight as she 65   65  dances with skill and maturity.   We are no longer in Barnum’s mansion, but on a dark stage.   As Caroline finishes her dance, she is joined by six other ballerinas.   They bow to a round of applause.   We DISSOLVE TO: INT. METROPOLITAN MUSEUM OF ART - LOBBY - NIGHT (LATER) 66   66  A reception for students and parents, where the upper crust gather to turn their daughters into swans. Barnum and Charity stroll among the other guests.   He is upbeat, ebullient. BARNUM Remember when we couldn’t afford ballet slippers?   And now -- look at this. Barnum tips his hat to another couple, MR. and MRS. WINTHROP. BARNUM (CONT’D) Good evening, Mr. and Mrs. Winthrop! Lovely recital, don’t you think? They barely nod to him as they pass. Charity shakes her head. CHARITY Why do you still bother? BARNUM I know I shouldn’t.   I just love the look on their faces when I do. He watches the Winthrops go join a small crowd encircling a handsome, jaded young man, PHILLIP CARLYLE.   Barnum frowns. BARNUM (CONT’D) Who is that man? CHARITY Phillip Carlyle?   His new play is a hit on Broadway.  The   Greatest   Showman   On   Earth   4/20/15   Draft   43.  (CONTINUED)",
      "characters": [],
      "action_text": "BARNUM Play, huh?   Pfff!   You pay good money to watch people stand around and   talk   for two hours!   They call   me   a con man! But as he watches others flock around Phillip, he can see the social power of artistic success.   Barnum suddenly makes a beeline, joining the small crowd.   Charity follows.   As he arrives, the Winthrops are begging Phillip for a favor. MRS. WINTHROP ...We know it’s sold out, but if you could find us two tickets for Sunday... PHILLIP Yes, of course.   I’ll see what I can do. Excuse me. He slips off -- louche, bored by the attention. The Winthrops know they’ve been dissed.   They look disappointed.   Barnum, witnessing this, can’t help himself.   He steps up, genuine. BARNUM You know, if you ever want to take in the circus, we’d love to have you.   As my guest, of course.   Bring the family -- MRS. WINTHROP Thank you just the same, Mr. Barnum. They turn on their heels and walk off, with another COUPLE. Barely out of hearing, the Winthrops lean into each other: MR. WINTHROP My God, what was that smell? MRS. WINTHROP Peanuts. They and the other Couple laugh. A nearby group of Ballerinas SNICKER, and turn, parting to reveal... Caroline, among them,   *  with the Winthrop’s daughter MARY.   Caroline’s eyes well up,   *  but she forces a smile.   The Winthrops stop short, covering.   *  MRS. WINTHROP (CONT’D) Oh hello, girls!   Caroline, dear, I believe your parents are looking for you. RACK FOCUS ACROSS the room to see Barnum staring darkly.   He has witnessed the entire exchange.  The   Greatest   Showman   On   Earth   4/20/15   Draft   44.  CONTINUED: 66   66",
      "dialogue_count": 0,
      "word_count": 554
    },
    {
      "scene_number": 9,
      "slugline": "EXT. STREET - BRIDGEPORT, CT. - NIGHT (LATER) 67   67  Charity and Helen walk ahead while Barnum strolls with Caroline, who is withdrawn and a bit down. BARNUM I was so proud of you tonight, Caroline. You were amazing up there. CAROLINE I really wasn’t. (then) I’ve actually decided to quit the ballet. BARNUM Quit?!   Why? CAROLINE I started too late.   I’ll never catch up. I’m just not good enough. BARNUM Not good enough?!   You were the best dancer on that stage! Caroline looks away, too old to buy into his hype. CAROLINE What would you know about it? BARNUM You think I can’t spot talent? CAROLINE How many ballets have you seen in your life? BARNUM Well... CAROLINE Not everything’s like the circus, you know.   Ballet takes years of hard work. (pointed, sharp) You can’t just fake it. She runs off, bounding up the steps ahead of Charity and Helen.   We hold on Barnum, who looks stricken. INT. BARNUM MANSION - BEDROOM - NIGHT 68   68  Charity moves in and out of the room, preparing for bed. Barnum is slumped in a chair, sad and worried.  The   Greatest   Showman   On   Earth   4/20/15   Draft   45.  (CONTINUED)",
      "characters": [],
      "action_text": "BARNUM It’d be a shame if she quit.   She just feels out of place with the other girls. CHARITY I should hope so.   I’ve never seen so many entitled little prima donnas. BARNUM Those prima donnas are the most important thing in the world to her right now.   She just wants to fit in. Charity gives him a look.   This is about more than Caroline. CHARITY People like the Winthrops will never accept us, Phin.   If they did, they’d have to stop judging.   And then they might actually have to do something with their lives. BARNUM I don’t want it for me. CHARITY Caroline will be fine.   Eventually. BARNUM She’s embarrassed by me. CHARITY She’s a teenager. Charity puts her arms around him, smiles.   But he won’t be assuaged.   He shakes his head -- this cuts too deep. BARNUM No.   I want her to be proud of who she is.   Her family.   Proud of me. CHARITY She   is   proud of you.   In her way. He looks at her -- that seals it.   She gazes at him, worried. CHARITY (CONT’D) Phineas...?   *  PRELAP: Sound of polite applause.  The   Greatest   Showman   On   Earth   4/20/15   Draft   46.  CONTINUED: 68   68",
      "dialogue_count": 0,
      "word_count": 394
    },
    {
      "scene_number": 10,
      "slugline": "EXT. WINTER GARDEN THEATRE - NIGHT 69   69  Barnum exits, pulling on his coat, and spots Phillip Carlyle standing under the marquis, beside a poster advertising the play that just ended: “THE DRUNKARD or THE FALLEN SAVED,” a temperance movement drama that was the snob hit of 1857. BARNUM Excuse me, Mr. Carlyle? I believe you produced this play -- PHILLIP Yes, and I apologize.   Refunds are available at the box office. BARNUM (offers his hand) P.T. Barnum. PHILLIP (shakes it vigorously) From the circus?   I’m a great admirer of what you do, Mr. Barnum. BARNUM Oh come now -- PHILLIP I’m serious.   People leave your shows transformed, or at least a good deal happier than when they came in.   Which is   *  more than I can say for my play.   Can the evils of alcohol be the theme, plot, and moral all at the same time? He glances around at the sober-faced survivors of his play.   *  BARNUM Yet you have no trouble selling tickets. PHILLIP My audience believes it makes them sophisticated. I exploit that pretension, and everyone wins.   Except art, of course.   Art takes a bit of a beating. BARNUM I don’t suppose I could buy you a drink. That is, unless you don’t -- He gestures to a PHOTOGRAPH of the abstemious Mr. Cribbs from the play.   Phillip takes a flask from his vest pocket.  The   Greatest   Showman   On   Earth   4/20/15   Draft   47.  (CONTINUED)",
      "characters": [],
      "action_text": "PHILLIP How do you think I get through this play every night? INT. PRIVATE CLUB - BAR - NIGHT 70   70  A fancy room, almost empty at this late hour.   A lone piano player plays.   They are a few rounds in.   Barnum is low-key, but he’s in full sell-mode -- passionate, a true believer. BARNUM If we present legitimate entertainments, we can expand our appeal.   Bring in the carriage trade.   Go after the high-brows. PHILLIP Funny, you want to attract the snobs and I’ve spent my entire life wishing to get   *  away from them.   They are suffocating. He downs his drink, feeling vaguely sorry for himself. Barnum smiles, leans back. BARNUM So, come join the circus!   You clearly have a flair for show business. PHILLIP “Show business”?!   I’ve never heard that term before! BARNUM Because I just invented it. (smiles)   *  And you were there!   *  PHILLIP I like it.   But I’m still not clear on what you think I can do for you. The last few drinkers make their exit, leaving Barnum and Phillip alone with the piano player. BARNUM Teach me how to appeal to the snobs, as   *  you call them.   Make it fashionable.   *  Sophisticated.   Ennobling.   Shakespeare, and all that.   Exploit their pretensions. PHILLIP You’ve created this wonderful show and now you want to pervert it with culture?  The   Greatest   Showman   On   Earth   4/20/15   Draft   48.  CONTINUED: 69   69  (CONTINUED) BARNUM Anything to fill seats, Mr. Carlyle!   *  And I’ll teach you everything I know about the circus. Phillip grins at Barnum -- he really likes him.   However. PHILLIP I appreciate the offer, Mr. Barnum.   But such an association could, at the very least, cost me my inheritance. Barnum waves dismissively -- cheerful and high-spirited. BARNUM Oh, it’d cost you a lot more than that! Your inheritance, your reputation!   Your place in society!   Why, people would look at you the same way they look at me! PHILLIP (sheepish) No offense. BARNUM None taken! The pianist hits a chord, and Barnum starts to si",
      "dialogue_count": 0,
      "word_count": 1239
    },
    {
      "scene_number": 11,
      "slugline": "INT. BARNUM’S MUSEUM - NIGHT They step off a ladder, onto a catwalk above the last row of bleachers.   From here, you can see everything.   *  The vast space is dark, though you can HEAR a packed house. SPOTLIGHTS sweep the room, tracking an acrobatic act. Phillip leans forward to see what’s going on, when... ...The CROWD beneath them parts, and Anne comes swinging up from below, arms free.   Her arc ends almost face to face with Phillip.   Then gravity whips her back in the other direction. Phillip turns to Barnum.   Barnum grins. PHILLIP Who was that? LATER -- As another act, a daredevil HORSE RIDER, takes over, circling the ring, Anne disengages from her ribbons with W.D.’s help.   Barnum steps up with Phillip. BARNUM Miss Anne Wheeler?   I’d like to introduce my newest hire, Mr. Phillip Carlyle. Anne takes in Phillip with her eyes, then shakes his hand. ANNE And what’s your act, Mr. Carlyle? PHILLIP I don’t have an act -- ANNE   *  Everyone’s got an act. Instant chemistry.   Anne, freed from her ribbons, smiles,   *  flirty, and walks off.   Phillip, smitten, turns to check out   *  Anne.   When he turns back, he finds W.D. glaring at him. INT. THE “BARNUM ARMS” - DAY 72   72  A pub across from the museum.   Barnum sits at the bar with Tom Thumb, Lettie, and O’Clancy, a stack of newspapers in front of them.   He reads from Roth’s review in the   Tribune : BARNUM “... Barnum’s reputation as the national clearinghouse for the grotesque remains firmly intact.   How much longer will the public indulge this man’s reckless forays into the unseemly depths of bad taste?”  The   Greatest   Showman   On   Earth   4/20/15   Draft   52.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "(incredulous) Can you believe he’s reviewing us again?! LETTIE What do you care about Roth for?   He’s a prig and a snob. BARNUM Yes, and all the snobs in New York read him.   He does their thinking for them. Barnum throws the paper down, frustrated.   Phillip bursts into the pub.   Clearly excited. BARNUM (CONT’D) Have you seen this? PHILLIP I have. BARNUM I thought I was paying you to class up the joint. PHILLIP I’ve been working on it.   Everyone...? He turns to the others, holds up a folded piece of paper. PHILLIP (CONT’D) If you want society to accept you, do you start at the bottom?   Or in the middle? No -- you start at the very top. BARNUM And what’s the top? He hands the paper to Barnum.   It’s a telegram.   He reads: BARNUM (CONT’D) “You are hereby invited to an audience with Her Royal Majesty, Victoria...”   *  (looks up, stunned) Is this real? PHILLIP It took some doing, but I got us invited to England!   To meet with the Queen! GASPS and CHEERS from the assembled Performers. LETTIE The Queen, huh?   How much is she payin’?  The   Greatest   Showman   On   Earth   4/20/15   Draft   53.  CONTINUED: 72   72  BARNUM (CONT'D)  (CONTINUED) Barnum stares at the telegram, a smile forming. EXT. BARNUM MANSION - FRONT PORCH - A FEW NIGHTS LATER 73   73  Charity sits on the porch swing as Barnum alights from a carriage and rushes up the front walk to join her. BARNUM Sorry I’m late.   Are the kids in bed? CHARITY They tried to stay awake for you... Barnum sits next to her on the swing, upset to miss them. BARNUM There’s just a hundred things to do --   *  sending the whole troupe to London... CHARITY I know, Phin.   It’s okay. She rubs his back, and gazes at him, already sad. CHARITY (CONT’D) You know what I realized?   We haven’t spent a night apart since we got married. BARNUM I have to go.   If the Queen of England likes us, everyone there will. CHARITY And everyone here too. Barnum smiles, she can always see through him. BARNUM I don’t mind if people call me c",
      "dialogue_count": 0,
      "word_count": 711
    },
    {
      "scene_number": 12,
      "slugline": "INT. BARNUM MANSION - VARIOUS ROOMS - NIGHT (LATER) 74   74  Barnum sings a farewell LULLABY (that will become a duet with Charity), to Helen and Caroline, both of whom are asleep.  BARNUM CLOSE YOUR EYES REST YOUR HEAD WHILE THE STARS ARE SHINING BRIGHTLY YOU’LL STAY IN THESE ARMS THEY WERE MADE TO HOLD YOU TIGHTLY HERE WITH ME YOU’LL ALWAYS BE WITHOUT A WORRY IN THE WORLD Next he sings to Charity, as she sleeps: BARNUM (CONT’D) IF YOU’RE SCARED IN THE DARK CALL MY NAME AND I WILL GUIDE YOU FOR I WILL BE THERE LOOK AROUND I’M RIGHT BESIDE YOU I AM HERE DREAM SWEET DREAMS, MY DEAR WITHOUT A WORRY IN THE INT. BARNUM MANSION - FOYER - DAWN 75   75  Music continues to play under as Charity watches from atop the stairs as Barnum prepares to leave.   From downstairs, Barnum catches her eye, and smiles lovingly at her.   She smiles back and comes downstairs. BARNUM DREAM SWEET DREAMS MY DEAR BARNUM/CHARITY WITHOUT A WORRY IN THE WORLD WITHOUT A WORRY IN THE WORLD. Barnum kisses her and steps out the front door. SONG ENDS as we linger on Charity at the front door, watching   *  him go -- a look of concern on her face.   *  EXT. BUCKINGHAM PALACE - DAY 76   76  The circus performers disembark from their carriages.   They have all tried to dress up, with varying success.   Anne wears a dazzling gown.   Phillip helps her down from her carriage.  The   Greatest   Showman   On   Earth   4/20/15   Draft   55.  (CONTINUED)",
      "characters": [
        "HERALD",
        "JENNY"
      ],
      "action_text": "PHILLIP Miss Wheeler.   You look like royalty. ANNE I’m just an acrobat. PHILLIP No.   In the aristocracy of talent, I would say you are a Queen. His meaning is clear.   She meets his eyes, then moves on. INT. BUCKINGHAM PALACE - CORRIDOR - DAY 77   77  The group is led down an endless hall by a prim and proper LORD-IN-WAITING.   Even dressed up, they look wildly out of place.   The enormous Lord of Leeds is wheezing and falling behind.   Tom Thumb tugs on the bottom of his coat. TOM THUMB Only a mile to go, tubs. Don’t die on me. LORD OF LEEDS I won’t die on you.   I may sit on you... LORD-IN-WAITING Don’t speak to the Queen unless spoken to.   Don’t offer your hand unless she offers hers first.   And never turn your back on Her Royal Highness.   You must enter and exit the room facing forward. LETTIE Well, at least she can’t talk about us behind our backs! LAUGHS and HOOTS.   Phillip shoots Barnum a glance, sotto:  PHILLIP I’m starting to think this was a bad idea. BARNUM This was   your   idea! PHILLIP You shouldn’t have listened to me!   I’m an apprentice, for God’s sake! INT. BUCKINGHAM PALACE - QUEEN’S DRAWING ROOM - DAY 78   78  The double doors open to the Queen’s drawing room.   Members   *  of the royal entourage, luminaries, and visitors are present.   *  The   Greatest   Showman   On   Earth   4/20/15   Draft   56.  CONTINUED: 76   76  (CONTINUED) There is a small stir near the doors, as the crowd is hushed. HERALD Ladies and gentlemen, Miss Jenny Lind. GUESTS applaud as JENNY LIND enters.   In her early 30’s, she is a stunning Scandinavian beauty.   Barnum turns to Phillip. BARNUM Who is that? PHILLIP Only the most famous singer in Europe. BARNUM Another singer, huh? He rolls his eyes.   But as he watches everyone scurry to form   *  a crowd around Miss Lind, Barnum’s expression changes. As he watches, the Queen herself (regal but plain) chats and smiles with Jenny, clearly taken by her beauty and presence. On Barnum, watching as the old-fashioned royal",
      "dialogue_count": 2,
      "word_count": 2396
    },
    {
      "scene_number": 13,
      "slugline": "INT. BARNUM’S MUSEUM - NIGHT 86   86  Tom Thumb sits, playing the Ukulele to the sold out crowd. Lettie sings “Oddities”, a celebration of the self-acceptance   *  that Barnum has given them, but somehow can’t give himself.   *  LETTIE WHY DID GOD CREATE ME INTO SUCH AN ODDITY IS IT SO WRONG I WANT TO BELONG THERE’S GOT TO BE A PURPOSE FOR ME. The other Oddities appear on stage to harmonize. LETTIE (CONT’D) UNUSUAL IS SO BEAUTIFUL THAT IS IN-DISPUTABLE IT AIN’T SO WRONG YOU WANT TO BELONG CHANG AND ENG (Harmonizing) YOU’LL FIND IN ME THAT WE’RE ALL   *  ODDITIES   *  ODDITIES   *  ODDITIES   *  ON BARNUM in the wings, watching the show with one eye, and   *  his pocket watch with the other.   Finally, he grabs his coat.   *  ODDITIES (CONT’D) WE’RE THE MONSTERS   *  WE’RE THE FREAKS WE’RE THE MISFITS WE’RE THE FREAKS EXT. BARNUM’S MUSEUM - SAME 87   87  Barnum exits.   On the sidewalk is a small CROWD of PROTESTERS   *  holding signs: “Close the Circus!” and “No More Freak Show!”. ODDITIES (V.O.)   *  IT AIN’T SO WRONG   *  WE ALL BELONG   *  TO ONE FAMILY...   *  Barnum slows for a second -- he’s never seen these people.   *  Then he climbs into a waiting carriage.   It drives off.   *  The   Greatest   Showman   On   Earth   4/20/15   Draft   65.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 224
    },
    {
      "scene_number": 14,
      "slugline": "INT. CASTLE GARDEN THEATER - BACKSTAGE HALLWAY - NIGHT (SAME) 88   88  Barnum finds Jenny signing autographs and greeting high- society type in a backstage hallway.   He attempts to mingle, but no one has any interest in him. He greets a Couple who don’t respond in kind.   He himself is an oddity there. ODDITIES (V.O.) AND WE’RE ALL ODDITIES   *  ODDITIES... ODDITIES....   *  EXT. NEW YORK STREET - DAY   *  Anne, in her Sunday finest, window shops outside a clothing   *  store.   She goes to enter, only to have the door shut in her   *  face.   A sign is flipped from “Open” to “Closed for Lunch”.   *  She absorbs this indignity, stoic, and moves on.   Across the   *  street, Phillip has seen this.   His heart breaks for her.   *  ODDITIES (V.O.)   *  IT AIN’T SO WRONG   *  WE ALL BELONG   *  TO ONE FAMILY...   *  INT. CASTLE GARDEN THEATER - BACKSTAGE - NIGHT   *  Barnum smiles and nods to a well-heeled couple, who completely ignore him as they walk past.   We INTERCUT:   *  THE ODDITIES 89   89   *  Singing raucously, then, back to...   *  BARNUM, IN THE HALLWAY 90   90   *  Trying to engage.   People squeeze past, jostling as they try   *  to get to Jenny Lind.   Finally, he gives up.   He turns and watches as the cream of New York society crowds around Jenny, showering her with the respect they will never give to him.   *  TRACK IN on Barnum, alone, as he stares at Jenny.   She is the personification of everything he’s ever wanted for himself. Then, in the midst of the crowd, she glances up and sees him watching her.   She smiles at him with warmth and gratitude -- he’s made all this come true.   A connection across the room. Something stirs in Barnum -- a consuming, almost pathological need for acceptance and adulation.   He sees now he will never get there on his own.   He needs Jenny Lind.  The   Greatest   Showman   On   Earth   4/20/15   Draft   66.  (CONTINUED)",
      "characters": [
        "ODDITIES"
      ],
      "action_text": "Barnum follows her gaze to the older couple that has just entered, looking somewhat uncomfortable. BARNUM Is that...? CHARITY My parents. Charity makes eye contact with Mr. and Mrs. Hallet from across the room.   Her mother offers an uncertain smile. PRE-LAP: Jenny’s singing. INT. WINTHROP MANSION - NIGHT - A FEW MINUTES LATER 94   94  Jenny sings to the assembled guests, accompanied by a lone pianist.   Caroline sits between Barnum and Charity. JENNY [SINGS EPIC LOVE SONG] As Jenny sings, her eyes find Barnum’s in the audience and rest there, like she’s singing to him.   Charity clocks the   *  look between them warily. Barnum turns, surveys the audience,   *  listening raptly. He finally has an act they can’t say no to. The SONG ends in applause.   Caroline, looking around at the   *  reactions of her friends and parents, smiles and claps.   *  As Jenny bows, Barnum joins her in the center of the room. He takes her hands and kisses her ceremonially on each cheek. BARNUM Thank you all very much.   And thank you, Miss Lind, for sharing your gift with us. You know, ladies and gentlemen, these days, I am largely associated with elephants and acrobats and oddities. Here he smiles and gets a bit of a chuckle from the crowd. BARNUM (CONT’D) But to me, the noblest art is that of making others happy.   And that applies to a circus for the masses, or a virtuoso vocalist for you good people here. Barnum pauses.   ON Charity and Caroline, watching nervously. CHARITY (to herself) No, don’t...   Don’t, don’t, please don’t!  The   Greatest   Showman   On   Earth   4/20/15   Draft   68.  CONTINUED: 93   93  (CONTINUED) BARNUM I grew up not far from here.   As a matter of fact, my father tended the lawns of some of your homes. So I never imagined I’d actually be an honored guest in one of them.   Or that I’d own the largest house in the neighborhood. Charity closes her eyes in dismay. BARNUM (CONT’D) Actually, I did imagine it.   When you’re born into poverty -- and treated with s",
      "dialogue_count": 1,
      "word_count": 1126
    },
    {
      "scene_number": 15,
      "slugline": "INT. BARNUM’S MUSEUM - BARNUM’S OFFICE - DAY 95   95  CLOSE ON a poster for the Jenny Lind tour.   It is wildly extravagant -- the 19th Century version of Las Vegas.   Barnum loves it.   Phillip is desperately trying to reason with him. PHILLIP ...A ninety piece orchestra?!   Custom sets!   Indoor fireworks!   No one’s ever done anything like this! BARNUM Exactly!   We’re giving the world something they’ve never seen before! PHILLIP With good reason!   You’ve had to pay the theaters in advance!   You’ve paid Jenny in advance!   You won’t see a penny of profit til the fortieth show, at least! You’re risking everything you’ve built! BARNUM And how do you think I built it?   By risking everything! Phillip flops down in a chair, anxious and overwhelmed. BARNUM (CONT’D) Calm down, man.   What’s eating you? Phillip holds up a telegram. PHILLIP Miss Lind’s contract. BARNUM Isn’t it done?   *  PHILLIP She won’t sign.   You’re asking her to do two shows a night.   She insists on one. You’ve got to hold the line on this, P.T. You’re risking too much already. BARNUM I’ll handle Miss Lind. Barnum plucks the contract from Phillip’s fingers, grabs his   *  hat, heads for the exit.   Phillip turns. PHILLIP Or will she handle you?  The   Greatest   Showman   On   Earth   4/20/15   Draft   70.  (CONTINUED)",
      "characters": [
        "CHARITY"
      ],
      "action_text": "But Barnum is already gone. INT. HOTEL DINING ROOM - DAY 96   96  Barnum walks in to find Jenny finishing a lunch.   He has the papers in his hand, looking serious.   She sees him, smiles. JENNY Mr. Barnum!   To what do I owe the pleasure?! BARNUM I received a draft of your contract. JENNY Oh, dear.   Is something wrong? BARNUM Not at all.   It’s just that I have booked each hall for two shows a night... JENNY ...And I can only perform once. Barnum is baffled by this.   He strains to be polite. BARNUM Is there something   else   you will be doing for twenty three hours? JENNY Mr. Barnum, I am not a cuckoo clock.   To be perfect, my voice requires rest. BARNUM If it is just less than perfect, I assure you, no one will know the difference. JENNY  I   will know the difference. BARNUM But you are not buying tickets. JENNY You told me you wanted the best for this tour, Mr. Barnum. Or was that humbug too? Her challenge throws Barnum. He struggles to control himself. BARNUM I am paying you top dollar.  The   Greatest   Showman   On   Earth   4/20/15   Draft   71.  CONTINUED: 95   95  (CONTINUED) JENNY This isn’t about money... BARNUM What else could it be about? She looks at him with affection.   She’s tacitly pleading with him to change himself and become “respectable”. JENNY The question is simple, Mr. Barnum -- do you want to give your audience something real?   Or just hoodwink them again? Barnum half-smiles.   He sits next to her, shakes his head. BARNUM It’s certainly easier to hoodwink them. Not to mention more fun and profitable. She looks at him: what kind of man is he?   He nods -- this is the price of respectability.   Holds up the papers. BARNUM (CONT’D) I’ll have it changed before you leave. JENNY You mean before we leave? He stops short.   They look at each other, both surprised. BARNUM You don’t think I’m going with you?   *  JENNY Why would you not? BARNUM I have a business to run! JENNY I don’t know anyone in this country! BARNUM (exasperated) You’ll meet ",
      "dialogue_count": 1,
      "word_count": 2763
    },
    {
      "scene_number": 16,
      "slugline": "INT. HOUSE - MORNING Charity, Caroline, and Helen eat breakfast.   Charity opens the newspaper and stops.   There is a picture of Barnum and Jenny together on stage -- bowing, holding hands.   *  EXT. TRAIN - NIGHT 106   106  The train whips through the countryside. INT. TRAIN - NIGHT Barnum sits next to Jenny, who looks out the window.   Then she turns and catches his eye, offering a vulnerable smile. He smiles back, reassuring.   Jenny closes her eyes, leans her head against his shoulder.   Barnum lets her. CHARITY AND IT'S ALL AN ADVENTURE THAT COMES WITH A BREATHTAKING VIEW WALKIN' A TIGHTROPE WITH YOU-OO-OO-OO-OO WITH YOU-OO-OO-OO-OO WITH YOU WITH YOU-OO-OO-OO-OO WITH YOU WITH YOU   *  INT. CINCINNATI HOTEL - SUITE - DAY 115   115  Jenny opens a door and lets Barnum into her hotel suite.   He sweeps in as if walking on air -- high-spirited, elated. BARNUM Good afternoon, Miss Lind. JENNY Mr. Barnum.   Don’t be shy.   Come in. BARNUM I don’t know if you’d had a chance to see the review in today’s paper. He holds up a folded newspaper.   She plucks it from him with a self-mocking smile, turns and leads him to the living room. JENNY Oh, I   never   read reviews. BARNUM Neither do I.   And yet here we are. JENNY Here we are.   Did they have anything kind to say?  The   Greatest   Showman   On   Earth   4/20/15   Draft   81.  (CONTINUED)",
      "characters": [],
      "action_text": "He plucks the paper back out of her hand, and reads from it as Jenny sits on the couch and pours two glasses of wine. BARNUM “Miss Lind is a virtuoso...   The diva of her generation...   Her beauty surpassed only by her talent...” He smiles, offers her the paper.   She takes it and scans it quickly.   Finding something, she smiles, reading aloud. JENNY “In bringing Miss Lind to our shores, we owe Mr. Barnum our most humble gratitude. The erstwhile showman and one-time Prince of Humbug has transformed himself into a patron of the arts and a connoisseur of the highest order.” She looks up -- happy for him.   He’s a bit embarrassed by how much this anonymous praise means to him.   He shrugs. BARNUM You dream and dream...   And one day it comes true. It’s touching.   He’s almost like a little boy.   She stands and hands him a glass of wine. JENNY It’s what you do.   Make dreams come true. She clinks his glass, takes a sip.   Suddenly, he sees where this is going.   He wavers -- torn between staying with her and leaving.   Then he takes a quick sip, checks his watch. BARNUM Well, two hours to curtain.   I’m due at the box office to go through receipts. JENNY Stay for a moment?   Please?   I’ve been alone all day. She sits on the sofa primly.   He relents and sits beside her. BARNUM Of course. She looks down, staring at her drink, and laughs to herself. BARNUM (CONT’D) What are you laughing at?  The   Greatest   Showman   On   Earth   4/20/15   Draft   82.  CONTINUED: 115   115  (CONTINUED) She shakes her head, keeps her eyes on the wine glass. JENNY When I first met you?   I didn’t know what to think.   You were so...   Unrefined. Unembarrassed.   So vital and unafraid. BARNUM And what do you think of me now? She gazes down, unable to meet his eyes. JENNY You have surprised the world, Mr. Barnum. And you have surprised me. She takes his hand.   He lets her.   Quietly, she confesses. JENNY (CONT’D) You have taken me in, stolen my heart. You have become everything to me. S",
      "dialogue_count": 0,
      "word_count": 2264
    },
    {
      "scene_number": 17,
      "slugline": "EXT. BARNUM’S MUSEUM - CONTINUOUS 128   128  Charity, Caroline, Helen, Anne, W.D., and all of the Oddities watch the building in silence, as the flames devour it. Then, through the smoke, a figure... Barnum emerges carrying Phillip, unconscious, in his arms. As soon as they are clear, Barnum collapses to his knees, lays Phillip on the ground.   Anne runs to Phillip. Charity, Caroline, and Helen descend on Barnum, hugging him. BARNUM I’m okay...   I’m okay... He stands up, turns.   His family gathers around him, sombre.   *  The Performers -- Oddities; Acrobats; Trainers -- Barnum’s   *  whole work family, gather around him as well.   Together, they   *  stand and watch as the building, his life’s work, burns up.   *  Barnum turns to Charity.   *  BARNUM (CONT’D) Take the girls home.   It’s going to be a long night. Charity nods.   Barnum turns to see a team of FIREFIGHTERS lift Phillip’s limp body, carry him toward a fire truck... INT. HOSPITAL - NIGHT (LATER) 129   129  Phillip is laid into a hospital bed by two DOCTORS.   He is unconscious, dressed in bandages.   The room is large, with rows of beds.   As the Doctors turn to leave, Anne steps forward, at his side, looks down, eyes full of tears. A NURSE (white) takes her arm, trying to usher her away. NURSE Miss?   You don’t belong in here. Anne turns on her, knocking her hand away. The Nurse recoils. She sees the hurt and anger in Anne’s eyes.   Prim and disapproving, she turns -- Hhhhh! -- and bustles away. Anne turns back, sits down next to Phillip.   His hand lies   *  open, as if reaching out.   She looks around, self-conscious, then reaches forward and takes his hand. OMITTED 130   130   *  The   Greatest   Showman   On   Earth   4/20/15   Draft   90.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 295
    },
    {
      "scene_number": 18,
      "slugline": "EXT. BARNUM’S MUSEUM - DAWN 131   131   *  Burnt debris blankets the property.   Barnum surveys the smoking shell of his building.   Barnum falls into a sitting   *  position, spent, gazes at the damage around him, devastated.   *  Behind him, a lone figure approaches down the empty street --   *  Roth.   Roth arrives to find Barnum, dirty with soot, gazing   *  at the ruins of his museum.   Barnum glances up, darkly.   *  BARNUM If you’re here to gloat, I’d reconsider. Roth takes out a handkerchief and wipes down a charred wooden chair before sitting down beside Barnum. ROTH Police caught the folks who started the   *  fire.   Just thought you’d like to know. Roth pulls out a flask, offers it. Barnum looks at him, wary. ROTH (CONT’D) Come on. You look like you could use it. Barnum relents, takes a swig.   Hands it back.   Roth smiles, takes another quick nip before he pockets the flask. ROTH (CONT’D) You’ll rebuild, I hope. Barnum looks at him, surprised. BARNUM You hate the circus. ROTH I did, at first.   It’s everything a critic is supposed to hate -- big, obvious, enjoyable, fun...   But when they started protesting?   I had to reconsider.   *  (points to ruins)   *  What was going on inside those four   *  walls...?   Was democracy at its finest.   *  A celebration of humanity in every form --   *  big, small, bearded, whatever.   And that   *  scares people.   That’s why they burned   *  you down.   It may not be art, and it’s   *  definitely lowbrow.   But it ain’t humbug.   *  Barnum smiles, this is something he never expected to hear.   *  The   Greatest   Showman   On   Earth   4/20/15   Draft   91.  (CONTINUED)",
      "characters": [
        "CHARITY"
      ],
      "action_text": "BARNUM Thank God for Jenny’s tour.   I can borrow off those profits and rebuild -- ROTH The tour?   My God, you don’t know...?   *  Roth reaches into his bag and hands Barnum a morning paper. ROTH (CONT’D) I’m sorry.   I thought you knew...! On the front page, a PHOTO of the kiss is framed by a heart, as lurid as any modern tabloid.   The headline reads, “BARNUM SCANDAL! Jenny Lind Quits U.S. Tour! Sails Today for Sweden!” Barnum’s face falls -- it’s his worst nightmare. EXT. NEW YORK HARBOR - DOCK - DAY 132   132  A CROWD of FANS and PRESS have gathered to see Jenny Lind   *  depart.   A line of PORTERS ascend the gangplank onto an OCEAN   *  LINER.   Jenny signs a last autograph, smiles for pictures.   *  Then she steps onto the gangplank, follows the Porters up.   A   *  NOISE.   She turns.   It is Barnum, running up the dock.   *  BARNUM Stop!   Stop!   Stop right there! He runs up the gangplank to her.   He is breathing hard, red-   *  faced, furious.   She is cool as ice. BARNUM (CONT’D) You cannot leave.   There are forty cities left in your tour.   If you break our contract, I will sue you.   I will sue you   *  for everything you are worth!   *  JENNY You’ve seen the papers this morning? BARNUM That has nothing to do with our contract! JENNY Indeed, it does, Mr. Barnum. Our contract has a morals clause, which you have broken with your reckless display.   My reputation has suffered irreparable harm. You should be glad I am not suing you. On Barnum, as he absorbs the full extent of her calculations. The wind goes out of him.   He looks up at her, going quiet.  The   Greatest   Showman   On   Earth   4/20/15   Draft   92.  CONTINUED: 131   131  (CONTINUED) BARNUM Jenny, please.   You can’t leave.   I risked everything on this tour. JENNY As did I, Phineas. It seems we both lost. There is terrible sadness in her eyes.   She turns to go. BARNUM Jenny.   Don’t.   I’ll lose the circus.   *  I’ll lose my home.   You will ruin me.   *  JENNY   *  Maybe that’s what I",
      "dialogue_count": 1,
      "word_count": 1822
    },
    {
      "scene_number": 19,
      "slugline": "EXT. HALLET’S HOUSE - BETHEL, CT - DAY 139   139  Barnum stands at a distance from the house, watching as Charity and their daughters head into her childhood home. BARNUM BUT WHEN I STOP AND SEE YOU HERE I REMEMBER WHO ALL OF THIS WAS FOR AND FROM NOW ON THESE EYES WILL NOT BE BLINDED BY THE LIGHTS FROM NOW ON WHAT'S WAITED 'TIL TOMORROW STARTS TONIGHT AND LET THIS PROMISE IN ME START LIKE AN ANTHEM IN MY HEART FROM NOW ON FROM NOW ON   *  The MUSIC quiets but continues UNDER... INT. HOSPITAL ROOM - DAY The dim, quiet hospital room.   Curtains drawn.   Phillip lies in bed, still unconscious.   Anne sits next to him, bent over with exhaustion, head bowed.   But still holding his hand.   In the background, Doctors and Nurses quietly do their rounds. CLOSE ON -- His hand.   Gently, it twitches, grasping hers. She raises her head, disbelieving.   She clutches his hand, squeezing...   He stirs.   Then his eyes open.   He sees her. PHILLIP You’re here. A tear falls down her cheek. ANNE “Here” is where I belong. They share a tearful smile.   A passing NURSE notices he is awake and waves to others.   A handful of Doctors and Nurses gather at the foot of the bed. She leans in and kisses him on the lips, unafraid and   *  unashamed.   He wraps his arms around her, kissing her back.   *  INT. CHARITY’S HOUSE - BETHEL, CT. - DAY 140   140  The MUSIC rises briefly, but continues UNDER as... Barnum strides up the front walk, in a mirror of the elopement scene.   As he steps onto the porch, Mr. Hallett opens the front door, looks at Barnum with withering disdain.  The   Greatest   Showman   On   Earth   4/20/15   Draft   98.  (CONTINUED)",
      "characters": [
        "BARNUM"
      ],
      "action_text": "BARNUM Mr. Hallet, it seems I am the penniless bum you always said I was.   But I am in love with your daughter, and if you don’t mind, I like to see my wife. MR. HALLETT She’s not here. Mr. Hallet moves to close the door, but Barnum stops him.   *  BARNUM Where is she? MR. HALLETT She doesn’t want to see you! BARNUM Where is she?! Hallett moves again to shut the door.   Barnum blocks him. CAROLINE (O.C.) She’s at the beach! They turn. Caroline and Helen are at the top of the stairs.   *  He smiles. They smile back. He nods -- thank you! -- turns... EXT. BEACH - SUNSET - DUSK 141   141  Silence.   Charity gazes out at the wintry surf.   She looks sad, lost, lonely.   The beach is familiar, it’s where they played as kids.   Then something catches her eye.   She turns. In the distance, Barnum walks towards her. His stride is purposeful, but he is a man stripped bare.   No cockiness or pride.   No dazzle or glitz.   He is a man at the end of a very long journey, whose prize is finally in sight. She’s taken aback -- she’s never seen him like this.   As he draws closer, she can see the pain and sorrow in his eyes.   *  As they meet, he stops short -- not wanting to say the wrong thing. But his eyes betray how desperately he wants her back. BARNUM Caroline was kind enough to tell me where you were. She nods but says nothing, watching him warily.   Barnum looks away, vulnerable.   He falters, searching for the right words.  The   Greatest   Showman   On   Earth   4/20/15   Draft   99.  CONTINUED: 140   140  (CONTINUED) CHARITY Stop selling already and kiss me. They kiss. EXT. BANK - MANHATTAN - DAY 142   142  Barnum steps out of the bank, loosening his tie. PHILLIP (O.C.) Did they say no? Barnum looks up to see Phillip, now fully recovered, joining him.   Barnum offers a small smile, glad to see him. BARNUM Emphatically.   Repeatedly. (shakes his head) I used to thrive on rejection -- educated men sitting behind desks telling me what I can’t do.   But after twenty or thirt",
      "dialogue_count": 1,
      "word_count": 1322
    },
    {
      "scene_number": 20,
      "slugline": "EXT. BROOKLYN RIVERBANK - DAY 143   143  A SLEDGEHAMMER hits a metal stake, driving it deep into the ground.   We WIDEN to find DOZENS OF WORKERS across the field. Barnum pitches in, sleeves rolled, honest sweat on his brow. Phillip picks up a sledgehammer and joins the others. ODDITIES & WORKERS FROM NOW ON BARNUM THESE EYES WILL NOT BE BLINDED BY THE LIGHTS ODDITIES & WORKERS FROM NOW ON BARNUM WHAT'S WAITED 'TIL TOMORROW STARTS TONIGHT BARNUM (CONT’D) AND LET THE PROMISE IN ME START LIKE AN ANTHEM IN MY HEART FREAKS AH   *  AH ODDITIES & BARNUM FROM NOW ON, FROM NOW ON BARNUM FROM NOW ON   *  FROM NOW ON FROM NOW ON FREAKS AND WE WILL COME BACK HOME   *  AGAIN AND WE WILL COME BACK HOME AGAIN AND WE WILL COME BACK HOME AGAIN BARNUM AND WE WILL COME BACK HOME AGAIN MUSIC ends. EXT. BROOKLYN RIVERBANK - DAY 144   144  Phillip and Anne are married on a Sunday morning.   Except for   *  W.D., both families have boycotted the ceremony.   *  But the bride and groom are surrounded by their adopted family of circus performers, with Caroline and Helen as flower girls, and Barnum and Charity bearing witness.  The   Greatest   Showman   On   Earth   4/20/15   Draft   103.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 212
    },
    {
      "scene_number": 21,
      "slugline": "EXT. BROOKLYN RIVERBANK - DUSK 145   145  The glorious tent, the first, is pitched and ready to go. The attractions are all here, as well as dozens of animals and TRAINERS, and other CREW.   The anticipation is palpable. The sun sets and dozens of CARBON ARC LAMPS blast on, bathing the circus in a warm glow.   We CUT TO: EXT. BROOKLYN RIVERBANK - DUSK (LATER) 146   146  Barnum stands watching as, in the distance, CROWDS stream into the tent.   Phillip walks up, joins him.   Barnum turns. BARNUM I have a job for you. PHILLIP I thought I had a job. BARNUM The circus has three rings now.   There’s a lot happening.   We need a master of ceremonies to guide the audience. He takes off his Top Hat, hands it over. A DRUM begins UNDER.   *  BARNUM (CONT’D) Congratulations.   You’re the Ringmaster. PHILLIP But I’m not a performer. BARNUM Everyone’s got an act, Mr. Carlyle. Phillip smiles, recalling the first words Anne said to him. BARNUM (CONT’D) I’d do it myself, but I plan to be busy. PHILLIP Doing what? BARNUM Watching my girls grow up. INT. CIRCUS TENT - DUSK 147   147  We return to Barnum’s reverie from the opening of the movie: Barnum gazes at the crowd, taking in the joy and excitement   *  all around him.   SOUND FADES.   In a wistful moment, he sings   *  to himself about the long road it took to get here.   *  The   Greatest   Showman   On   Earth   4/20/15   Draft   104.  (CONTINUED)",
      "characters": [],
      "action_text": "BARNUM IF IT WEREN'T FOR THE DARKNESS THAT FALLS EVERY NIGHT HOW WOULD WE KNOW THAT THE SUN GIVES US LIGHT Barnum watches proudly as Phillip puts on his top hat, then steps into the rings -- the new Ringmaster.   SOUND returns.   *  Barnum checks his pocket watch, then turns.   Eunice, the elephant, is held by a Trainer at the edge of the tent. EXT. FIFTH AVENUE - DUSK Barnum rides Eunice down Fifth Avenue, drawing stares and Gawkers.   KIDS run along side, thrilled to see an elephant. EXT. METROPOLITAN MUSEUM OF ART - DUSK Charity, Caroline, and Helen wait on the steps of the Met. Caroline wears a tutu under her coat.   Around them, Parents   *  and young Ballerinas climb the stairs and stream into the museum entrance.   A small banner reads, “Metropolitan Annual Ballet Recital”.   Charity checks a distant tower clock.   *  Helen sees something, points.   They all react with disbelief.   *  ANGLE -- Barnum rides Eunice up towards the Met steps. BARNUM WE'D NEVER LOSE OUR WAY IF WE DIDN'T DARE TO ROAM TO WANDER FROM THE PATH IS HOW YOU KNOW YOU’RE HOME   *  Helen giggles.   Charity smiles, shakes her head.   Caroline hides her face in her hands, but she is laughing -- she has accepted Barnum for who he is, grand gestures and all. INT. CIRCUS TENT - DUSK   *  Phillip stands in the center ring and gazes in wonder as the   *  circus goes full throttle all around him.   He turns to Anne   *  and sings.   She smiles affectionately at her new husband.   *  PHILLIP   *  YOU MAKE ME REAL   *  MAKE ME FEEL I’M ALIVE   *  ANNE   *  LOVE CAN REVEAL   *  EVERY REASON TO SURVIVE   *  He puts an arm around her.   She wraps her arms around him.   *  The   Greatest   Showman   On   Earth   4/20/15   Draft   105.  CONTINUED: 147   147",
      "dialogue_count": 0,
      "word_count": 557
    },
    {
      "scene_number": 22,
      "slugline": "EXT. METROPOLITAN MUSEUM OF ART - DUSK   *  Barnum slides down Eunice’s trunk, hands a leash to a startled young VALET.   He strides up to his family.   *  BARNUM   *  WITHOUT YOU ALL THE RICHES   *  IN THE WORLD ADD UP TO NONE   *  WITHOUT YOU ALL THE THINGS   *  WE LOVE TO DO   *  AREN'T HALF AS FUN   *  They hug him, then turn and sing together. ALL ALL THE WONDERS IN THE WORLD AND THE ONES WE'VE YET TO VIEW WOULDN'T BE SO WONDERFUL IF IT WEREN'T FOR YOU Barnum, his arms around his wife and daughters, turn and walk up the Museum steps together. EXT. CIRCUS TENT - NIGHT (2015) 148   148  The Big Top, lit within, stands on the Brooklyn shore.   MUSIC plays UNDER as we hear the CROWD APPLAUD inside the tent. We CRANE UP, rising high, as FIREWORKS explode across sky, we CIRCLE AROUND to SEE the across the river is the contemporary skyline of Manhattan.   Barnum’s legacy still stands -- more than a century later -- as The Greatest Show On Earth. FADE TO BLACK TITLE CARD: “The noblest art is that of making others happy” -- P. T. Barnum  The   Greatest   Showman   On   Earth   4/20/15   Draft   106.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 206
    }
  ]
}