{
  "slug": "the-secret-life-of-pets-2016",
  "title": "the secret life of pets",
  "genre": "horror",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 1,
  "characters": [
    "SNOWBALL"
  ],
  "total_words": 16772,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. NEW YORK CITY - MORNING 1   1  The skyline glimmers in the morning sun as we move across the Hudson toward the city.   “Welcome to New York” by Taylor  Swift plays.  As we pass the STATUE OF LIBERTY, we see a flock of BIRDS flutter into the morning sky.  We move into the city, over the Brooklyn Bridge and past the Empire State Building.  We see Central Park, lined with bright yellow and orange trees of autumn. MAX (V.O.) I’ve lived in this city all my life. Riding through Central Park on her bicycle is KATIE.   Her dog MAX, sits in the bicycle basket. MAX (V.O.) I’m Max, and I’m the luckiest dog in New York...because of her. That’s Katie. Katie and Max continue to bike down the street. Max barks  happily.  MAX (V.O.) Katie and I...well, we have the perfect relationship. FLASHBACK: NEW YORK CITY - DAY 2   2  Max, as a puppy, sits inside a box that says “FREE PUPPIES.” Katie approaches him, picks him up and he licks her face. MAX (V.O.) We met a few years ago and, boy, let me   tell you, we got along right away. You know, it was..it was one of those relationships where - where you just know. FLASHBACK: KATIE’S APARTMENT - CONTINOUS 3   3  Puppy Max runs around Katie’s apartment and sits on the couch  with his green ball. He looks at Katie with adorable puppy  eyes.",
      "characters": [],
      "action_text": "MAX (V.O.) A-And get this - she was looking for a   roommate...and so was I! So I just moved in that same day. It was perfect. EXT. NEW YORK CITY - PRESENT DAY 4   4  Katie parks her bike near flock of PIGEONS.   Max barks aggressively at them. They FLY AWAY, except for one. MAX (V.O.) We’ve been together ever since. Katie would do anything for me. And I’m her loyal protector Max approaches the remaining pigeon. BARKS at it. The pigeon FLAPS ITS WINGS and CAWS at Max. He backtracks into Katie’s arms.   She LAUGHS and pets him reassuringly. INT. KATIE’S APARTMENT - DAY 5   5  Katie notices that her SHOES are torn up.   She opens the closet to see Max sitting inside, CHEWING on all her shoes. MAX (V.O.) Our love is...our love is, how do I put this...our love is stronger than words.   Or shoes. INT. KATIE’S APARTMENT - LIVING ROOM - DAY 6   6  Max is on the couch.   Katie is on the phone, pacing back and forth.   Every time Katie passes, Max’s tail wags. MAX (V.O.) It’s me and Katie.   Katie and me. EXT. FRONT STOOP - DAY 7   7  It’s pouring rain.   Katie is in a slicker.   Max is in a matching slicker.   They are waiting for it to stop raining. THUNDER and LIGHTNING!   Max BARKS.   Katie holds him close. MAX (V.O.) Us against the world.  The Secret Life of Pets   2.",
      "dialogue_count": 0,
      "word_count": 477
    },
    {
      "scene_number": 2,
      "slugline": "INT. KITCHEN - DAY 8   8  As she puts the dishes into the dishwasher, she lets Max LICK each one. MAX (V.O.) I wouldn’t go so far as to call us soul mates... INT. BEDROOM - NIGHT 9   9  Katie and Max sleep in Katie’s bed. Max’s leg KICKS as he sleeps. Katie PATS his head and his leg stops kicking. MAX (V.O.) ...even though any sane person who saw us would... EXT. APARTMENT BUILDING - FIRE ESCAPE - LATER 10   10  Katie and Max sit on the fire escape eating their dinner. She HUGS Max as she looks out into the city. INT. KATIE’S APARTMENT - MORNING 11   11  MAX (V.O.) There’s just one little problem... (panic growing) ...pretty much every day... KATIE C’mon Max! MAX ...she leaves. Katie prepares to leave.   She wraps a SCARF around her neck. Max GRABS onto it and she pulls him along. She scoops him up. KATIE I’ll see you tonight. She KISSES his face and sets him down. MAX (V.O.) Sometimes I try stuff to get her to stay...  The Secret Life of Pets   3.",
      "characters": [],
      "action_text": "KATIE Okay, sit. Max sits. KATIE (CONT’D) Spin! Max spins around in a circle. KATIE (CONT’D) Speak! Max barks.   Katie LAUGHS. KATIE (CONT’D) Okay, that’s a good boy. MAX (V.O.) ...but it never works. She leaves. MAX (V.O.) Where is she going? What could she possibly be doing? His face falls and he sighs. MAX Awww, I miss her so much. Suddenly, the sound of KEYS RATTLING comes from the other side of the door.   Max springs to his feet.   His tail wags like crazy. MAX (CONT’D) Whoa--oh my--oh, she’s back! Katie rushes back in. KATIE Forgot my phone. MAX What took so long?   Why did you-- She grabs it and exits. MAX (CONT’D) Oh, come on!   Ughh...I miss her so much. He sits by the door to wait for her return.  The Secret Life of Pets   4. INT: APARTMENT - CONTINUOUS 12   12  An owner says goodbye to her tiny Pomeranian, GIDGET, and leaves. GIDGET’S OWNER Bye, Gidget! Be a good doggie! Gidget climbs a couch and gazes through a window at Max, who is across the alley. GIDGET Hey Max! MAX (eyes on his door) Hey Gidget. GIDGET Any plans today? MAX Yes.   Big, big stuff today, Gidget. I got big plans.   I’m gonna sit here and I’m gonna wait for Katie to come back. GIDGET Oh, that sounds exciting!   Well, I won’t interrupt.   I’ve got a very busy day, too. Gidget SIGHS and settles in for a day of staring at Max. MONTAGE: In many other apartments, we see owners LEAVE for the day and say goodbye to their pets. INT. CHLOE’S APARTMENT - SAME 13   13  An owner bends down to give CHLOE, her fat cat, some food. CHLOE’S OWNER Here ya go.   See ya later, Chloe! When the owner leaves, Chloe KNOCKS THE BOWL AWAY. INT. PEPE’S APARTMENT - SAME 14   14  PEPE, a Chihuahua, BARKS EXCITEDLY as his owner leaves.  The Secret Life of Pets   5. PEPE’S OWNER  Bye, Pepe!  Once the owner is out the door, Pepe stops barking and walks  offscreen, nonplussed. He pulls a WINDOWSHADE to propel him onto a TABLE, and then HOPS up into a hanging FLOWER PLANTER. He then lifts his leg and PEES in it. He sigh",
      "dialogue_count": 0,
      "word_count": 717
    },
    {
      "scene_number": 3,
      "slugline": "INT. CHLOE’S APARTMENT - SAME 19   19  She makes her way over to the fridge and sees a ROASTED CHICKEN inside.   She opens and closes the door to the fridge, agonizing over if she should give in and eat. INT: MEL THE PUG’S APARTMENT - SAME 20   20  MEL sets up a CHAIR and an end table with TREATS in front of a window.   He opens the curtain and sits in the chair, BARKING at each squirrel he sees in the tree outside. INT: BUDDY’S APARTMENT - SAME 21   21  Buddy, a Daschund, makes his way over to the kitchen counter. He KNOCKS   a mixing bowl to the floor and stands beneath the mixer, letting the blades massage his body until he HOWLS, ROLLS OVER, and FALLS to the floor. INT: CHLOE’S APARTMENT - SAME 22   22  Chloe has DEVOURED the chicken.   Fat and lethargic, she ROLLS over out of the fridge and lands on the FLOOR.   But when she gets up, she notices a CAKE on the shelf below.   She salivates. INT: APARTMENT - SAME 23   23  LEONARD, A DAINTY POODLE sits in a posh apartment.   His owner leaves for the day. POODLE’S OWNER You be a good boy, Leonard. ...Leonard DAINTILY taps a CD player.   PUNK MUSIC BLARES, and he can FINALLY cut loose, head-banging and dancing.   We see that there are other pets there, hiding.   They pop up from behind the couch and headbang with the music. INT: KATIE’S APARTMENT - CONTINUOUS 24   24  Max is still waiting by the door. Chloe FALLS from her floor and lands in front of Max’s window. CHLOE Hey, Max.  The Secret Life of Pets   7.",
      "characters": [],
      "action_text": "MAX Hey, Chloe.   Do you ever wonder where they go during the day? Chloe squeezes through the window... CHLOE Do you know what?   I just...I don’t really caaare-- She stops.   Chloe is stuck in the window. MAX Maybe that’s what it’s like for YOU.   But Katie and I have a different relationship.   You know, you’re a...you’re a cat.   So maybe  that’s why.   Cuz nobody could ever love a cat the way they love a dog. I’m just saying.   Maybe that’s why. She SQUEEZES through the window inelegantly and FALLS.   She then walks into the apartment as though nothing happened. CHLOE Whatever you need to tell yourself. ALL THE PETS emerge from the fire escape, including MEL (dim- witted lovable pug), and SWEETPEA, the adorable, wide-eyed budgie. MEL Hey, mornin’, Max! MAX Hey guys.   ‘Sup, Sweetpea. Sweetpea WHISTLES a greeting. MAX (CONT’D) Hey Mel, where you been, man? MEL OH!   GET THIS, last Sunday, my owner feeds me a small white pill, right. I start to feel a little groggy. The next thing I know, I wake up, I’m in the sky. MAX Wait a minute, the-the sky?  The Secret Life of Pets   8. MEL Yeah, there are suitcases everywhere.   I’m locked up in a crate. CHLOE Come on. MAX There are suitcases in the sky? MEL So I pass out from fear. And when I wake up, I’m in Florida. MAX Umm, this did not happen. MEL I will NEVER eat a pill like that again.   Unless it’s covered in peanut butter, because I mean, COME ON, RIGHT?!   It’s peanut butter! NORMAN, a guinea pig, appears through a VENT. NORMAN Hey guys! MAX (calling out) Oh Hey Norman.   You still looking for your apartment? NORMAN Yeah.   Going on three weeks now. Is this the 2nd or the 3rd floor? MAX I don’t know any numbers, but uh,  you don’t live here. NORMAN Aw pellets. Well, see you guys later. CHLOE You know what?   You can do it! (beat, to Max) He can’t do it. Buddy the Dachshund opens the door, hanging from the knob.  The Secret Life of Pets   9. MAX Buddy!   There you are!   Did you find it? BUDDY Haha, you KNOW I did. ",
      "dialogue_count": 0,
      "word_count": 5434
    },
    {
      "scene_number": 4,
      "slugline": "EXT. KATIE’S APARTMENT BUILDING - DAY 40   40  Gidget, sweating and out of breath, climbs up the fire escape. Each step is a monumental task for a dog her size. GIDGET Uppp...I can do it... EXT. ROOF OF MAX’S APARTMENT BUILDING - CONTINUOUS 41   41  Gidget pulls herself up onto the roof. GIDGET Max! MAX!!!   Max!   Max!   Max!   Max! Max! Exhausted, she pushes an upside down clay pot towards the edge of the roof and hops up. She flops on the ground, out of breath and exhausted.   She looks out on the New York Skyline.   It’s BIG.   IMMENSE actually. GIDGET (CONT’D) Where are you, Max? (sighs) TIBERIUS (O.S.) Looks like you could use a little help. GIDGET Who said that? TIBERIUS (O.S.) Over here. In this dark and foreboding shed. Gidget turns and sees a FOREBODING, WOODEN SHED. She  approaches.  GIDGET Uh...Hello? Through a SMALL WINDOW, we see the dark shape of TIBERIUS, A RED TAILED HAWK. His SHARP CLAWS glint in the sunlight. TIBERIUS I can see for miles. If you let me out, I’ll find your friend.  The Secret Life of Pets   36.",
      "characters": [
        "SNOWBALL"
      ],
      "action_text": "GIDGET Wow, really?   Awww, you are SO sweet. TIBERIUS You’re sweet, too. (sniffs) GIDGET Oh, thanks, stranger! TIBERIUS But not too sweet. There’s also a salty, gamey thing going on. GIDGET Yeah, that’s me! Come on, let’s get you out of that shed. Gidget opens the door. As she walks toward Tiberius, we hear a horrible CRUNCHING sound. Light hits Tiberius and we see that he’s wearing a HOOD. TIBERIUS Yeah.   That’s it. Just step over the pile of bones. GIDGET Pile of bones, okay, will do! I sure hope Max is safe! TIBERIUS You’re a very thoughtful food. Food?   I didn’t say that, I said friend.   I meant food.   Fr--friend. You know what I meant. GIDGET I’m sure lucky I found you, uh... TIBERIUS ...Tiberius.   And yes, this is a very good thing for you, this whole meeting me thing. Take off my hood. She takes it off. Tiberius spreads his WINGS and LUNGES at Gidget. Gidget SQUEALS and LEAPS out of the shed; Tiberius FLIES out of the shed and after Gidget as she races across the roof. GIDGET Ahhh, no! Aaah!  The Secret Life of Pets   37. He’s about to catch up with her, when his CHAIN runs out of slack. He collapses on the ground, CHOKING. TIBERIUS Ah!   The chain!   Ah! GIDGET Oh! You tried to eat me! TIBERIUS (ashamed) I’m sorry. GIDGET You should be sorry!   You   deserve  to be locked up! You’re a bad, bad bird! Tiberius looks guilty. TIBERIUS I can’t help it. I was born with killer instincts. GIDGET That is just no excuse! TIBERIUS You’re right. Even for a predator, I’m selfish. I’m a selfish predator. It’s no wonder I have no friends, nobody...this is hopeless... He starts to cry. GIDGET (sympathetic) Oh, don’t...there’s no need to cry. I’m sorry that I yelled at you before. TIBERIUS Please take off the chain.   This time I’ll help you.   I promise. GIDGET Tiberius, this is going to sound completely horrible, but um, I don’t fully trust you. Tiberius averts his eyes, deeply hurt and crying.  The Secret Life of Pets   38. GIDGET (CONT’D) Oh no no but...I guess eve",
      "dialogue_count": 1,
      "word_count": 3076
    },
    {
      "scene_number": 5,
      "slugline": "INT. UNDERGROUND RIVER 46   46  Max and Duke swim with frantic desperation, as they are swept downstream towards a swirling WHIRLPOOL. Duke SINKS into the whirlpool. A moment later, so does Max. INT. UNDERWATER - CONTINUOUS 47   47  The swirling water pulls Max and Duke through a PIPE. INT. PIPE - CONTINUOUS 48   48  Max and Duke, looking panicked, rocket through the long, curving twists and turns of the pipe. EXT. HUDSON RIVER 49   49  Max and Duke and gallons of sewage run-off SHOOT out of a pipe... MAX/DUKE (screaming) Aaaaaaaiiiigggh! They SPLASH into the water. They swim to the surface, panting and terrified. DUKE Come on. We gotta get to shore! MAX I only know the doggy paddle! (struggling) And I don’t know it well! DUKE Swim, tiny dog, swim! Max keeps slipping under the water, too tired to stay afloat. Duke spots a PASSING FERRY. Max and Duke swim with all their might. Duke GRABS the steps on the back of the ferry. MAX Duke!   HELP! He pulls himself up and tosses a LIFE RING to Max. DUKE Max, grab the ring! Max bobbles the ring.  The Secret Life of Pets   53.",
      "characters": [],
      "action_text": "MAX I--I can’t!  DUKE Keep it up, Max!   You’re doing-- well, you know, you’re not doing great, but you’re not drowning, and that’s something! Max STRAINS---Duke begins to pull Max in. DUKE (CONT’D) You’re almost there! Duke almost loses the rope.   He GASPS. He GRABS it just in time. Duke pulls him in. Heaving chest, panting, Max is wide-eyed scared. They shake the water off their fur. MAX Thanks, Duke.  DUKE No problem. MAX (out of breath) Finally...I’m going home. They look up and see the glittering skyline of Manhattan. It RECEDES into the distance. They’re going to Brooklyn. DUKE Uh, isn’t home that way? Max droops with disappointment. Just when things couldn’t get any worse... MAX Agh.   Seriously?  The ferry’s horn HONKS, startling them. ANGLE ON the water pipe. Snowball, Ripper and Tattoo try to get out of the water pipe but the grating prevents them.   Snowball PULLS ON IT. SNOWBALL Graaaaaaah! He sees Max and Duke motoring away on the ferry.  The Secret Life of Pets   54. SNOWBALL (CONT’D) They’re going to Brooklyn. TATTOO They say everyone’s going to Brooklyn these days.   Making a real comeback. SNOWBALL I’m not talking about hipster real estate trends.   I’m talking about vengeance, Tattoo!   Death is coming to Brooklyn and it’s got buck teeth and a cotton tail. EXT: ALLEY 50   50  Buddy jumps on top of a dumpster, then an air conditioning unit, and then onto a fire escape. BUDDY Let’s go! A ladder slams down in front of the pets.  INT: POPS’ APARTMENT - DAY 51   51  The pets CRAWL through an open window. They walk into an apartment, which is teeming with dogs and cats. “Good Day ft. Nappy Roots” by Greg Street plays.  CATS play a catapult game, adhering to curtains with their claws. A group of DOGS circles each other, sniffing each others’ butts. DOGS Hi how are you?...Hi, how are ya?...Enchante... A GROUP OF DOGS sit in a circle around a toilet, rooting for another dog drinking the toilet water. DOGS (CONT’D) Chug! Chug! Chug! Chug!...YAAAY!  LEONARD ",
      "dialogue_count": 0,
      "word_count": 4275
    },
    {
      "scene_number": 6,
      "slugline": "EXT. STREET - CONTINUOUS 72   72  A WOMAN approaches a baby carriage and peers inside. WOMAN Awww...coochie, coochie coo! It is revealed that SNOWBALL is the “baby” in the carriage. He glares at her. She SCREAMS. She then looks at the “woman,” who is actually Tattoo and SCREAMS again. Then the Bearded Dragon BURSTS out from the “woman’s” chest, and she SCREAMS again. She runs away from the scene. The Flushed Pets laugh. Then, Max RUNS BY! SNOWBALL TINY DOG!! The Flushed Pets pursue Max. SNOWBALL (CONT’D) Yaah!! Max is closing in on the van!   But then...Max turns, sees Snowball and company closing in! MAX Ugh, are you kidding me? SNOWBALL You thought that was over Tiny Dog? Yaah, yaah, yaah! He jumps on the back of the truck. Snowball and Tattoo are running straight for the truck---- ---which stops at a red light. SNOWBALL (CONT’D) STOOOOOOPPPP! Tattoo keeps running...THUMP!   He smacks into the back of the Animal Control Van. INT: ANIMAL CONTROL VAN - CONTINUOUS 73   73  The Animal Control Worker driving the Van looks in his rearview mirror... ...and sees Tattoo.  The Secret Life of Pets   76.",
      "characters": [],
      "action_text": "ANIMAL CONTROL WORKER 1 Huh? EXT: STREETS - CONTINUOUS 74   74  Snowball spits out his pacifier and LEAPS ON TOP OF MAX!  They tumble beneath the adjacent cars. SNOWBALL Aiee! Jab jab jab, body blow! Body blow! Karate chop to your neck! He bites Max’s leg.  MAX (annoyed) Would you get off me?! They see the feet of the ANIMAL CONTROL WORKERS approach Tattoo and Dragon... ...and GRAB THEM!   Tattoo SQUEALS! SNOWBALL Tattoo! END POV as Max and Snowball watch helplessly as the DOORS CLOSE--- ---they run out.   The Van DRIVES AWAY! SNOWBALL (CONT’D) No no no no no no...Oh, TD, this KILLS me to say, but we gotta join forces, man. (claps)  EXT: BROOKLYN BRIDGE - A FEW MINUTES LATER 75   75  A BUS flies through the air.   Beastie Boys’ “No Sleep Till  Brooklyn” plays.  WHAM!   A car gets clipped by a bus.  WHAM!   A car gets clipped by another bus. WHAM WHAM!   The bus hits more CARS.  The Secret Life of Pets   77. INT: BUS - CONTINUOUS 76   76  A crazy-eyed Snowball is driving the bus.   Max is working the peddles. SNOWBALL Wooo-hooo!   Ha! We make a great team, Tiny Dog!   Well, mainly I’m doing   all the hard work, but you’re helping! MAX Yes, yes, fine, just keep your eyes on the road, you’re driving like an animal! SNOWBALL Woohoo! They HIT SOMETHING. Max topples over.  MAX What was that? SNOWBALL Oh, that was a pothole. MAX You’re hitting things on purpose! SNOWBALL Heh, you know, you know me too well, TD! Always keeping me in check. EXT: BROOKLYN BRIDGE - CONTINUOUS 77   77  The bus hurdles spins around on the Brooklyn Bridge, weaving  through traffic. INT: BUS - CONTINUOUS 78   78  MAX (sigh, annoyed) Do you see the van? Snowball looks... SNOWBALL Yeah, I see it. We’re about to hit it.  The Secret Life of Pets   78. Snowball sits in a seat and buckles his SEATBELT. EXT: BROOKLYN BRIDGE - CONTINUOUS 79   79  WHAM!   The bus hits the van, keeps driving. Duke is tossed about in his cage! Tattoo, Ripper and Dragon  laugh maniacally.   Their cage door JUMPS a BIT, the me",
      "dialogue_count": 0,
      "word_count": 2375
    },
    {
      "scene_number": 7,
      "slugline": "INT. KATIE’S APARTMENT - NIGHT 97   97  Max and Duke settle in front of the door. MAX Duke, this is the BEST part of the day--- DUKE Ooh! Is that her...? Max cocks his head, leans in and listens. MAX Nah, no, thats - wait - Suddenly, they hear Katie’s key enter the keyhole. MAX (CONT’D) Yeah, she - that’s her! That’s her! MAX & DUKE KATIE! They start pacing back and forth, barking, SO EXCITED!   She  ENTERS THE ROOM. KATIE There they are!   Max and Duke, Duke and Max! Oh, my boys! So, how’d it go?   Great, right?   (sees broken lamp) I...Oh... Max and Duke look up at her.  KATIE (CONT’D) So maybe a few bumps. But I knew  this was gonna work out. So, who’s hungry? On Max and Duke, as she hugs them.   They smile, nuzzle into her. EXT: FIRE ESCAPE - NIGHT 98   98  Katie, Max and Duke sit together on the fire escape. They  rest their heads on Katie’s lap.  MAX Welcome home, Duke. DUKE Thanks, Max.  The Secret Life of Pets   88.",
      "characters": [],
      "action_text": "We PULL AWAY from the city, seeing all the pets in the windows with their owners. FADE TO BLACK. CREDITS ROLL. EPILOGUE: INT. LEONARD’S HALLWAY - LATER 99   99  BUDDY and MEL, dressed as a Teddy Bear and Minion, hop up the stairs of Leonard’s apartment building. BUDDY C’mon, man. Hurry it up. Mel is out of breath. MEL Okay! I’m comin’ I’m comin’. Sheesh.  They approach the apartment and scratch at the door. SNOWBALL opens the door, the PUNK MUSIC blasting from inside the apartment. SNOWBALL Welcome my dogs! Oh you guys look weird. Hurry up, come on in. INT. LEONARD’S APARTMENT - LATER 100   100  The same PUNK MUSIC plays. Both the PETS and the FLUSHED PETS all rock out with LEONARD. They jump around, head-banging to the music. Buddy turns to Mel. BUDDY You said it was a costume party. MEL Why do you listen to me? Leonard hears his owner coming back. The music STOPS, as Leonard assumes his posh seated position. LEONARD’S OWNER (O.C.) I’m home, Leonard! The animals scatter. Leonard turns the CLASSICAL MUSIC back on. Leonard’s owner enters, and pats him on the head.  The Secret Life of Pets   89. LEONARD’S OWNER (CONT’D) Were you a good boy, Leonard? Suddenly the chandelier CRASHES down from the ceiling in front of Leonard’s owner with TATTOO on top of it. He smiles at Leonard’s owner innocently. CREDITS ROLL.  The Secret Life of Pets   90.",
      "dialogue_count": 0,
      "word_count": 418
    }
  ]
}