{
  "slug": "the-farewell-2019",
  "title": "the farewell",
  "genre": "drama",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 17359,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. THE PEOPLE’S HOSPITAL, WAITING ROOM - DAY A PAINTING displays an idyllic landscape, bathed in institutional fluorescent lighting. Off-screen, we hear sounds of a Chinese announcement amidst other bustling hospital sounds. A phone buzzes, answered by an authoritative female voice. NAI NAI (O.S.) [Hello?] [*Note: All Chinese Mandarin dialogue in brackets. Other languages will not be subtitled.] NAI NAI (80) walks into frame holding a cell phone. A head of neatly-permed white hair, this woman is the consummate matriarch. BILLI (O.S.) [Nai Nai. Hi!] Hearing her granddaughter’s cheerful voice, Nai Nai breaks into a warm smile. NAI NAI [Billi! It’s the middle of the night there, why aren’t you sleeping?] BILLI (O.S.) [Middle of the night? It’s seven...] NAI NAI [Seven at night?] EXT. NYC - EVENING Horns BLARE as BILLI WANG (30) walks quickly through the kinetic streets of New York City. She’s in her element here. Her movement is effortless, even as she switches between speaking Mandarin and English. WE INTERCUT BETWEEN THEIR PHONE CONVERSATION. BILLI [Yea, it's always twelve hours time difference! Isn’t it seven in the morning in China?] NAI NAI [It’s almost seven thirty!] (beat) (MORE)",
      "characters": [],
      "action_text": "[Is it cold there? Are you wearing enough? Cold travels through the head! Are you wearing a hat?] BILLI [I am.] (she’s definitely not) [Stop worrying about me!] NAI NAI [You have to be careful. I read that in New York there are men who steal your earrings. They rip them out! And then you have to go to the hospital to get your ears stitched up!] BILLI [I’m not wearing earrings, Nai Nai!] NAI NAI [Ah. So you heard too.] A loud Chinese ANNOUNCEMENT blares through the phone. BILLI [Hey, what’s that sound? Nai Nai, where are you?] The announcement continues. NAI NAI [Me? I’m... I'm at your great aunt’s house.] Clearly in a hospital, Nai Nai tells this lie with total ease. NAI NAI (CONT’D) [What are you doing?] BILLI [I’m heading to Mom and Dad’s for dinner...] Before Billi can finish, a STREET CANVASSER interrupts with performative cheerfulness. STREET CANVASSER Hi! Do you have a minute to save the polar bears? Billi stares blankly, annoyed by the interruption. NAI NAI (CONT'D) 2. BILLI I really wanna say something snarky, but I used to have your job. STREET CANVASSER (still smiling) So you know how important it is to support us! BILLI I know your job sucks. Suddenly sympathetic, Billi stops. BILLI (CONT’D) (on phone) [Hold on, Nai Nai...] She pulls out her wallet. All she has is a dollar. She hands it to the stranger, who eyes it cynically. STREET CANVASSER Lemme guess, you got fired? BILLI (feigns being offended) I quit! (beat, with a laugh) Cuz I was about to get fired! Billi and the canvasser share a laugh before Billi returns her attention to Nai Nai. BILLI (CONT’D) [Sorry, Nai Nai.] NAI NAI [What was that?] BILLI [Nothing. Just um... a friend...] Another announcement blares through the hospital speakers. BILLI (CONT’D) [Hey, Nai Nai, what is that? What’s going on?] NAI NAI [It’s nothing. I’ll call you back later, OK?] Nai Nai’s abruptness catches Billi slightly off-guard. 3. BILLI Uh, OK... NAI NAI [I’ll call you back granddaughter! I promise I’ll call you back!] B",
      "dialogue_count": 0,
      "word_count": 1790
    },
    {
      "scene_number": 2,
      "slugline": "EXT. NEIGHBORHOOD LAUNDROMAT - DAY Billi steps outside, realizes she’s still holding her laundry. INT. WANG FAMILY HOME - DAY Billi bursts through the door carrying the laundry. BILLI Ma! Ba! Hello? JIAN Shhh! What are you doing here? BILLI I’ve been calling, why didn’t you guys pick up? JIAN We busy. Have you eaten? I’ll make you some wontons. As Jian heads to the kitchen, Billi heads into the laundry room and puts clothes into the washer. JIAN (CONT’D) So what, you broke? That’s why you come. I know you... You need money, right? Billi tries to deflect with humor. BILLI No, I just love an excuse to come see you. JIAN What’s going to happen to you? Are you always going to live like this? BILLI Poor but sexy? I hope so. JIAN Why you not save? You should change your expensive lifestyle! BILLI Seriously, Mom. If you’re gonna give me shit every time I come home, I won’t come back anymore! 10.",
      "characters": [],
      "action_text": "JIAN Lower your voice. Dad’s sleeping! BILLI It's six o’clock. What’s wrong with him? JIAN Nothing. He’s just resting. BILLI Is he OK? Jian turns away from Billi and grabs frozen wontons from the freezer. Her body language is evasive. JIAN He’s fine. We just very busy. BILLI Doing what? What’s going on? JIAN (lets out a sigh) Hao Hao’s getting married, so we have to go to China. BILLI What? Since when? Didn’t he just start dating this girl a few months ago? Jian doesn’t respond, intently focused on chopping scallions. BILLI (CONT’D) I can’t go to China right now, Mom. JIAN You don’t have to go. BILLI He’s my only cousin, shouldn’t I be there? JIAN No one expects you to go. Billi considers this suspiciously. BILLI You think he knocked her up? Jian silently continues cooking. 11. JIAN How many wontons you want? BILLI Um... Five. JIAN Only five? That's not enough. BILLI Then make a dozen. JIAN I think ten's good. Billi looks around - the house is eerily quiet. Something's not right. INT. WANG FAMILY HOME, HALLWAY - NIGHT Billi stares at the closed door. The light is on inside. She knocks gently and opens the door. INT. WANG FAMILY HOME, MASTER BEDROOM - NIGHT Haiyan sits on the edge of the bed, facing away from Billi. BILLI Dad? His stillness, his silence - it’s eerie. BILLI (CONT’D) What's wrong, Dad? HAIYAN Nothing. BILLI Did you and Mom get in a fight? Haiyan fights back tears. BILLI (CONT’D) Have you been drinking? More silence. Terror. BILLI (CONT’D) Can you please talk to me? You're scaring me. Billi looks up to see Jian at the door. 12. BILLI (CONT’D) What's going on? More silence. Billi’s insides are shrieking. BILLI (CONT’D) (raises her voice) Something's going on! Just tell me what's going on! JIAN (dry, to-the-point) Nai Nai's dying. She has lung cancer. It's stage four. Billi’s heart drops. She collapses onto the bed, sitting beside her father. BILLI What? I just spoke to her, she didn’t say anything... JIAN She doesn’t know yet. Billi’s mind races. BILLI H",
      "dialogue_count": 0,
      "word_count": 901
    },
    {
      "scene_number": 3,
      "slugline": "INT. NYC SUBWAY PLATFORM - NIGHT An ELDERLY CHINESE WOMAN waits for her train across the tracks on the opposite platform. As Billi watches her, she fights back emotions. As the train arrives, we see Billi’s grief transform into determination.   She knows she must go. As the train whisks the elderly woman away... INT. CHANGCHUN AIRPORT, CHINA - DAY A sea of Chinese faces. The ceiling is low, the floors are a glossy white marble. It takes a few moments before we spot Billi in the crowd. CHINESE VOICES echo around her. Billi gets shoved into a stranger. As a reflex, Billi says ‘I’m sorry’ in English. The stranger responds with a flurry of Chinese. Billi reacts, trying to orient herself. EXT. CHANGCHUN AIRPORT, CHINA - DAY A group of TAXI HUSTLERS target Billi, invading her personal space. They inundate her with questions: “Do you need a taxi?” “Where are you going?” INT. TAXI - DAY Billi stares out the window. Construction cranes dot the skyline, wide streets interrupted by the skeletal frames of unfinished buildings. INT. TAXI, ALLEY - DAY The DRIVER honks repeatedly as he pulls down a narrow alley. Pedestrians and rickshaw peddlers make way for the car to pass. EXT. NAI NAI’S APARTMENT - DAY The taxi pulls up to a complex of PEACH BUILDINGS. Billi gets out. She stares up at the looming building, not sure she’s prepared for the challenge she’s about to face. INT. NAI NAI'S APARTMENT, STAIRWELL - DAY Billi climbs the stairs. The narrow staircase is dimly lit by a single bulb. She KNOCKS. We immediately hear barking. As Billi waits, the automatic light goes off, leaving her in the dark for a few brief moments. 16.",
      "characters": [],
      "action_text": "Mr. Li opens the door, letting out a shaft of cold fluorescent light from inside the apartment. MR. LI [Who’s that?] BILLI [Mr. Li? It’s me, Billi.] MR. LI [Who?] Mr. Li shouts his words, as one does when they’re losing their hearing, and perhaps even their mind. BILLI Billi! MR. LI [Billi? What are you doing here? Come in, come in!] BILLI (peering inside) [Nai Nai?] INT. NAI NAI’S APARTMENT, LIVING ROOM - CONTINUOUS As Billi moves into the living room, everyone reacts. Nai Nai, Haiyan, Jian. There’s also UNCLE HAIBIN (early 60's), distinguished grey with black-rimmed glasses. AUNTIE LING (60), quiet but shrewd. The pimple-faced and sheepish cousin is HAO HAO (early 20’s); ‘on the brink of tears’ is his eternal state of being. AIKO is his sweet but confused Japanese bride. NAI NAI [Billi? Oh my god, Billi’s here!] HAIYAN Why'd you come? LITTLE NAI NAI [What are you doing here? We all thought you weren’t coming!] JIAN How’d you get here? They talk AT her, all at once. Nai Nai is the only one who seems pleased by this surprise. In fact, she’s overjoyed. 17. NAI NAI [Billi! Billi! What are you doing here you stupid child?] Nai Nai approaches Billi, analyzing her. NAI NAI (CONT’D) [Let me look at you. Oh you’re not that skinny! Your Mom said you got skinny, but you’re not that skinny!] Nai Nai embraces Billi. Billi’s throat swells shut. Her mouth quivers as tears flood to her eyes. NAI NAI (CONT’D) [Oh my granddaughter! Why didn’t you tell me you were coming? I’ve been trying to call you all week!] A deer in headlights, Billi doesn’t speak, as if the secret would spill out if she opened her mouth. Family members observe her carefully, exchanging looks of concern. Nai Nai kisses her all over her face. Billi fights for control of her emotions. NAI NAI (CONT’D) [Your mother said you were too busy to come!] Billi opens her mouth and still, nothing comes out. Anticipation lingers in the air. NAI NAI (CONT’D) [What’s wrong with you? Why aren’t you talking?] Billi looks at her",
      "dialogue_count": 0,
      "word_count": 8392
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOTEL BEST, HALLWAY - NIGHT The men stagger back to their rooms with the help of their wives. JIAN [I told you not to drink, you had to drink! Your mother’s always telling me to take care of you, but if she’s giving you booze she doesn’t worry about your health? Every time you drink you get drunk!] BILLI Mom, leave him alone. HAIYAN [Who drank too much? I’m not drunk! My mom gave it to me. I drink with my Ma... I drink for my Ma...] INT. HOTEL BEST, JIAN & HAIYAN’S ROOM - NIGHT Billi watches as Jian removes Haiyan’s jacket in bed. JIAN Grab me the water. Over there. Billi grabs the bottle. Jian brings the bottle to Haiyan’s mouth, forcing him to drink. JIAN (CONT’D) Come. Help me remove his shoes. Billi and Jian undress Haiyan as he groans. BILLI Nai Nai shouldn’t be organizing this wedding. JIAN She enjoy it, so just let her do it! BILLI She’s sick. She should be resting or in the hospital, not stressing about a fake wedding! JIAN You don’t know your grandma as well as you think you do. (MORE) 60.",
      "characters": [],
      "action_text": "Don’t you know, she loves to boss everyone around! Make her feel important and in control. BILLI Mom... JIAN It’s true! That’s why she hated staying at our house in America. Because she couldn’t tell anyone what to do. She see me and nothing I do is good enough for her but in America she couldn’t say anything there because it was MY house. Jian becomes increasingly aggressive with undressing Haiyan, stripping him down to his underwear. BILLI Stop it, Mom. JIAN (suddenly defensive) What? [What did I do?] BILLI I know you’ve always had issues with her, but you need to drop it! JIAN I don’t have issues with her. She has issues with me! BILLI She’s dying! Can’t you be a little more sensitive? Haiyan groans as their voices raise to a shout. JIAN What do you want from me? To scream and cry like you? You know, when my father died, I also sad... But I not act like you! When I went back to China for the funeral, everyone was watching me, all expecting me to fall apart! They think if I don’t cry, I don’t love my father. BILLI No one’s asking you to cry. JIAN (CONT'D) 61. JIAN Death is very personal. I don’t have to cry in front of everyone to prove anything! I don’t like to put you know... all my emotions on display, like I’m in a zoo! Here they think that’s the only way to grieve. By performing for everybody. Otherwise they think you’re not respectful. You know, in China... they even hire professional crier just WAAAAAH screaming crying to show oh how sad they are. It’s ridiculous! I hate that! Billi can’t look at her mother. She is at a complete loss. Prelap the sound of WAILING. EXT. NATIONAL PEACE CEMETERY - DAY A funeral procession is led by a melodramatic CRIER. Nothing specifically indicates whether she’s professional or amateur. Nearby, the Wang family (including Gu Gu and Bao) gather around YE YE’S GRAVE. The tomb bears a PHOTO OF YE YE. They quickly set out fruit, eggs, bao zi (dumplings), bamboo- wrapped sticky rice, and other offerings. Everyone talks over each ot",
      "dialogue_count": 0,
      "word_count": 2501
    },
    {
      "scene_number": 5,
      "slugline": "INT. HOTEL BEST, BILLI’S BEDROOM - NIGHT YE YE (60) smokes a cigarette by the window. It’s the middle of the night and Billi opens her eyes, as if stirred by his presence. Her POV of the window: Ye Ye isn’t there, but his smoke lingers like a ghost. EXT. CELEBRITY HOTEL - DAY A row of identically-clad waiters shout a long-winded Chinese welcome in unison, with wide smiles. INT. CELEBRITY HOTEL, LOBBY - LATER A lion dancer leads the bridal party in. Nai Nai is at the head of the family, greeting guests. Billi watches as Nai Nai works the room. Nai Nai gives Billi a stern glare to remind her of her duty. Putting on her best smile, Billi calls out to relatives with forced enthusiasm. BILLI [Hello uncle! Hello auntie!] Nearby, Nai Nai catches up to Little Nai Nai. NAI NAI [Have you picked up the test results from the hospital? Weren’t they supposed to be ready yesterday?] LITTLE NAI NAI [Not yet, I’ll go tomorrow.] NAI NAI [Tomorrow’s Saturday! Now we won’t be able to get it until Monday!] LITTLE NAI NAI [So I’ll get it Monday! Stop worrying! You’re fine!] INT. CELEBRITY HOTEL, BANQUET HALL - DAY Plates of CRABS exit the kitchen. Waiters set the crabs on tables. Kids run amuck as Nai Nai goes from table to table greeting guests. Hao Hao and Ami also greet guests. On stage, SUN AO (early 40’s) and his wife NICO give a toast. Both are tipsy and exuberant. 72.",
      "characters": [],
      "action_text": "SUN AO [We are very happy to have you all back in Changchun! Doesn’t matter if you are in America or Japan or anywhere else... We are all one and the same! Citizens of the planet earth, of the Milky Way galaxy, of the universe! The only thing you should all know is that no matter how far you go, even if it’s to the moon! You will always have a home here in Changchun. We will always, always welcome you.] NICO [Please, let’s all have a toast so you know when you come home to Changchun, you know that you’ll always eat well, drink well and be merry! That way, you’ll come back often!] As her family eats, Billi stares at the mountain of food in front of her with no appetite. Mic feedback alerts the room that someone has taken the stage, though they’re reluctant to stop eating. INT. BANQUET HALL, STAGE - CONTINUOUS Uncle Haibin clears his throat. UNCLE HAIBIN [Keep eating, keep eating, I don't mean to interrupt your meal. As the eldest son, let me say a few words on behalf of myself and my brother.] Their attention is dispersed as Uncle Haibin launches into his speech. UNCLE HAIBIN (CONT’D) [It's been over 25 years since my brother and I have both been in China at the same time with our families. I'm very happy to welcome Aiko to our family. Perhaps next time, when we return again, we'll bring a new baby.] Uncle Haibin’s voice drifts as he struggles to stay focused. 73. UNCLE HAIBIN (CONT’D) [My little brother and I haven't been around, and all these years, we've had to rely on all of you to take care of our ma. Chen Ping... you’ve been here all these years, by our mother’s side, treating her like your own. I’m very grateful to you. To all of you... I want to thank you, from the bottom of my heart.  (long beat) But the person I want to thank the most...] His face quivers. Billi leans in, holding her breath. The entire room suddenly gets quiet. The awkward silence is underscored by the sporadic SOUND OF CHAIRS AND UTENSILS. UNCLE HAIBIN (CONT’D) [The person I want to thank ",
      "dialogue_count": 0,
      "word_count": 2226
    },
    {
      "scene_number": 6,
      "slugline": "INT. THE PEOPLE’S HOSPITAL, SECOND FLOOR - DAY Billi bolts up the stairs and frantically searches for Mrs. Gao. She spots her and runs up to her. MRS. GAO [Oh, what are you doing here?] BILLI (out of breath) [Did you get it?] MRS. GAO [The test results? Yea.] BILLI [Where?] Mrs. Gao digs into her purse and pulls out a document. She hands it to Billi, scanning the panic on her face. MRS. GAO [What’s the matter? What’s it say?] Billi looks up at Mrs. Gao, confused. BILLI [I don’t know. I can’t read Chinese. Didn’t you read it?] MRS. GAO (blushes) [I... I can’t read. (beat) I never went to school.] Despite her relief, Billi softens with sympathy. BILLI [Come on, let’s go.] INT. COPY CENTER - DAY The test result document is scanned into a computer. Billi, Little Nai Nai and Mrs. Gao huddle over the COPY CENTER OWNER as he tries to doctor the results in his computer. COPY CENTER OWNER [What should I write?] LITTLE NAI NAI [Just write benign shadows.] 82.",
      "characters": [],
      "action_text": "COPY CENTER OWNER [Benign shadows? What’s that?] LITTLE NAI NAI [It means... it’s not fatal.] INT. NAI NAI’S APARTMENT - NIGHT The entire family gathers around Nai Nai as she examines the document. Time slows. Nai Nai nods, as if she knew all along. NAI NAI [See. I told you I was fine!] EXT. NAI NAI’S APARTMENT - DUSK The family walks in epic slow-motion as a single unit. Little Nai Nai, Aiko and Hao Hao. Uncle and Auntie. Haiyan and Jian. Billi is framed in the center. They’re all in this together. There’s no turning back. EXT. CHANGCHUN - DUSK It’s dark and the city is still asleep. A light comes on in one window. INT. NAI NAI'S APARTMENT, BEDROOM - DUSK Nai Nai opens the closet door and grabs a RED ENVELOPE. She hands it to Billi. BILLI [Don’t give me money, Nai Nai...] NAI NAI [Take it, child! Take it! I gave one to Hao Hao so I want to give you one too.] BILLI [But... I didn’t get married.] NAI NAI [Even more reason! You’re all on your own, with no one to support you. And I can’t be of much help to you. I’m sorry. I wish there was more I could do to help you.] Nai Nai’s eyes well with tears as she grapples with her helplessness. She pushes the envelope into Billi’s hand. 83. NAI NAI (CONT’D) [Take it, my child.] Billi nods, emotional. NAI NAI (CONT’D) [And don’t spend it on anything practical like rent! Buy yourself something nice...] Billi smiles. BILLI [I don’t want to leave, Nai Nai.] NAI NAI [You’ll be back.] Billi fights back tears. NAI NAI (CONT’D) [I know you’re always thinking of me. But you don’t need to worry. I’m fine. I’ve been taking the new medicine and I feel much better.] BILLI [Really?] NAI NAI [You have work to do. You have so much ahead of you. I’m proud of you.] Billi diverts her eyes, something clearly on her mind. After a beat, she decides to be honest. BILLI [I didn’t get the grant.] NAI NAI [Really? You just heard?] BILLI [Last week. I didn’t tell you because... (beat) I didn’t want you to worry.] Nai Nai considers this and nods. 84. NAI",
      "dialogue_count": 0,
      "word_count": 1370
    },
    {
      "scene_number": 7,
      "slugline": "INT. BILLI’S APARTMENT - NIGHT Billi walks into the dark apartment with her suitcase. Despite being a small studio apartment, her place now feels enormous. Empty. Silent. Nothing but her own shadows. EXT. STREET, NYC - NIGHT Billi strolls down the sidewalk, the weight of the world on her shoulders. Overwhelmed by emotion, she appears to be on the verge of breaking down. She stops in the middle of the street. Strangers walk around her, absorbed in their own lives. As Billi stands there amidst the chaos of the city, a different energy suddenly overtakes her. Instead of crumbling, she lifts her chin and inhales deeply. Then, with all the life force in her, with the spirit of Nai Nai, she shouts - BILLI HA! EXT. NAI NAI’S NEIGHBORHOOD, CHANGCHUN CHINA - DAY Our familiar peach-colored buildings surround a LARGE TREE. Billi’s voice echoes loudly into this shot - echoing across the globe. BIRDS scatter from the tree, flying off into the distance as a unit, the pattern of their formation silhouetted against the sky. THE END 89.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 179
    }
  ]
}