{
  "slug": "the-tomorrow-war-2021",
  "title": "the tomorrow war",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 19,
  "characters_count": 0,
  "characters": [],
  "total_words": 25150,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. THE FORESTER HOUSE - BACK YARD - DAY 28d   28d Young Muri digs in the backyard. Dan walks up. DAN What are you doing? Young Muri looks at rough gouges in the ground. YOUNG MURI I’m looking for vaccines. Digging’s hard. Dan takes the shovel, twirls it, puts blade tip to ground. DAN The key is weight and leverage. He puts foot to blade, shoves, levers a chunk of dirt free. He stares into the hole.   Damn.   Young Muri looks from hole to dad. YOUNG MURI You did that one. DAN Mom’s gonna need to call the cable company. He stabs the shovel into the ground. DAN (CONT’D) I gotta go on a trip, Chickpea. YOUNG MURI Where to? DAN Outta town. Week, maybe more. YOUNG MURI You got drafted. DAN No. I... yeah.... Muri gives a sad little smile. DAN (CONT’D) But when I come home... we’ll find a vaccine together. Even if we have to dig up this whole yard. THE TOMORROW WAR   31.",
      "characters": [],
      "action_text": "YOUNG MURI (nods; sad) Okay. DAN Gimme a hug... Young Muri wraps her arms around Dan’s neck, her small voice GROWLING LIKE A LION as she hugs tightly. DAN (CONT’D) Squeeze me as hard as you can. Is that all you got? You think you’re a lion? C’mon. Tighter. Tight as you can. Even the oldest, sickest antelopes are laughing at you right now. She squeezes with all she’s got. Finally, he tries to pull away, but she holds onto him. YOUNG MURI (it’s not a game anymore) You can’t leave! Don’t leave me... Dan’s eyes well as Muri squeezes him tighter. DODD (PRE-LAP V.O.) You people. You all have something in common. Dan finally breaks away from Muri. As he walks away from his heartbroken daughter... DODD (PRE-LAP V.O.) (CONT’D) Whatever sins, whatever shortcomings, whatever mistakes you’ve made in the past--  INT. DAN’S CLOSET - MOMENTS LATER 28dA   28dA Dan moves aside boxes to reveal -- DODD (PRE-LAP V.O.) That’s all over. You are now heroes. A GUN SAFE. He opens it. Inside: His Army revolver. Off Dan... OMITTED 28e   28e THE TOMORROW WAR   32.",
      "dialogue_count": 0,
      "word_count": 354
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ATLANTA MOTOR SPEEDWAY - SUNRISE 29   29 The last two buses bounce out of a huge lot, join ten others in a twelve bus caravan. DODD (PRE-LAP V.O.) You are answering a call.   A cry for help... across time.  INT. COACH BUS (MOVING) - DAY 30   30 Full. CLIPBOARD SOLDIER, clipboard in hand, moves down the aisle, past anxious faces -- all older, out of shape, MISFITS -- checking off names, handing out labeled zip-loc bags. Dan sits mid-bus, looks around. A DAY TRADER LOUIE consoles TEARFUL JOE. A LAWYER PACIFIST JULIE prays. CHRISTIAN stares out a window. COWAN, 30s listens to Drowning Pool “Bodies”. Dan hears his name, his hand goes up. He’s given a zip-loc bag. The label: Forester, James Daniel. He drops his phone in. Zip. DODD (PRE-LAP V.O.) It is the voice of your children and your grandchildren. And they need you... OMITTED 31   31  INT. ARMY BASE - HANGAR - CHECK-IN - DAY 32   32 A dozen buses disgorge confused luggage-toting Draftees. Two dozen SOLDIERS hand & herd with stockyard efficiency. Dan drops his zip-loc bag in the plastic bin labeled F-J. EMT SOLDIER jabs a SYRINGE into his shoulder, vaccinating. ANOTHER SOLDIER hands him a thin stack of clothes; on the stack, EARBUDS, PLIERS. DODD (PRE-LAP V.O.) The sacrifice you make now is for them. You are their only hope. And history will remember you as such. A THOUSAND DRAFTEES stand in rough formation. Suitcases, backpacks, duffel bags at their feet. Men, women, every ethnicity and body type. Most in their 40s, 50s, Jumpbands locked to arms. An ARMY OF THE ORDINARY. Dodd finishes -- THE TOMORROW WAR   33.",
      "characters": [],
      "action_text": "DODD (CONT’D) On behalf of the Department of Defense and a grateful nation, we thank you for your service. Dodd ‘thank you’s’ people on his way out. LT. KRISTEN HART (25) walks up. A SONIC BOOM goes off. The ground shakes. LT. HART You all know that sound. That’s a team jumping into a combat zone thirty years in the future. In 7 days you will replace them. Your tour of duty will be: 7 days. That’s 168 hours. At the end of your tour, if the Jump-band attached to your arm determines that you are still clinically alive, you will automatically be jumped back and your tour of service will be complete. I want as many of you as possible to make that jump home.  INT. ARMY BASE - HANGAR - PROCESSING CENTER - DAY 33   33 Majority of Draftees in some stage of undress. Embarrassed faces, averted eyes. Fat rolls, slack skin, knobby knees. LT. HART What you think you know about basic training does not apply. You will not march, climb or crawl. There will be no pushups, no pull-ups, no obstacle courses. COWAN Thank you Jesus. Feet jam into boots, pants pulled up, shirts over heads. SOLDIERS push large rolling bins heavy with clothes, shoes. LT. HART (points each out) Overly ventilated jeans... yoga pant fails... cargo shorts; all will be replaced. CHARLIE That’s effed up. Dan looks right. CHARLIE PURPURA, 37, smiles. He’s got kind eyes, a belly-stretched t-shirt: I SURVIVED JELLYFISH SEASON. THE TOMORROW WAR   34. CHARLIE (CONT’D) Force me to battle aliens in the future, that’s one thing. But hands off my cargo shorts. Charlie turns to BUS DRIVER ROSE draftee (50s) who agrees then dons SAFETY GOGGLES.  INT. ARMY BASE - FIRING RANGE - DAY 34   34 Lt. Hart addresses the THOUSAND DRAFTEES now in a mix of civilian and Army clothing. Earbuds in. LT. HART Most of you will deploy wit h D- Forc e. The rest will jump with   R- Force . The screen on your Jump-band indicates deployment. Draftees check their Jump-bands. Dan looks at his: R-FORCE. CHARLIE (O.S.) We’re together, I think. Charli",
      "dialogue_count": 0,
      "word_count": 4358
    },
    {
      "scene_number": 3,
      "slugline": "I/E. HIGH RISE HOTEL - MOMENTS LATER 52   52 Everyone’s crouched against the wall leading outside. Dan turns back to everyone. DAN We need someone on point. (to Norah and Cowan) You two -- He waves them up the street. DAN (CONT’D) (into mic) You see anything? NORAH’S POV: A boat lays on it’s side in the street. NORAH Uh, a boat. In the middle of the street. ROMIO COMMAND (O.S.) The street ahead is clear. I see   * it. Keep moving.   * DAN (O.S.)   * Command, is there anyone left here?   * ROMIO COMMAND   * All the personnel was ordered to   * evacuate. There’s nothing there   * besides the research team.   *  EXT. MIAMI BEACH - STREET - DAY 52a   52a Dan SIGNALS for GROUPS of FOUR. He sends them off, ducking as they go. DAN (O.S.)   * Command, we’re at the Research   * Facility. Southeast side. No   * activity.   * ROMIO COMMAND   * Actual, proceed to the lab on 7.   * Charlie is walking with Norah and Cowan. COWAN I’m just gonna throw it out there; we find a house, hotel, air b&b-- scavenge some food, water... (MORE) THE TOMORROW WAR   Buff Revisions 1/10/20   53.",
      "characters": [],
      "action_text": "and just wait it out. Seven days. No problem. CHARLIE You mean hide? And do nothing? COWAN No. Doing something by doing nothing. NORAH Like meditation. No offense yoga lady. CHARLIE And   say   what when we get back home? COWAN I dunno. How about: “Hi. I’m home!” SOMETHING runs between the buildings behind them. COWAN (CONT’D) What was that? DAN Guys... get out of the street. Dan, Charlie, Norah and the others flatten against the building, try to be invisible. Heads on swivel. Dorian is near Dan, picking up ammo from dead bodies. DORIAN You’re wasting your time teaching them to be soldiers. DAN I’m not. I’m trying to keep em alive. Dorian scoffs. Dan watches Dorian picking up ammo. DAN (CONT’D) (to Dorian) Look, you and your friends are the only ones who know what you’re doing. Help us. DORIAN Look man, we’re here to kill aliens. Period. I don’t give a shit about any of those people. COWAN (CONT'D) THE TOMORROW WAR   Green Revisions 11/15/19   54. Dorian nods over to the army of the ordinary. Dan looks at them. They do look slightly helpless. DORIAN (CONT’D) The only thing they are is bait. That’s it. Dan looks back at Dorian. Clocks Tank and Diablo who are not just picking up ammo, but are picking wallets from dead bodies. DAN Hey. I see you. I get it. You’re helping your friends. Just like me. Dorian laughs. DORIAN That’s gonna get you: eaten. (motions towards Tank and Diablo) We’re gonna be team Not Eaten. Got it? Tank, Diablo and Dorian walk off. Dan watches them go. Cowan looks over from nearby. COWAN So they DO eat us??? // Did he say they eat us?  EXT. R-FORCE FACILITY - MOMENTS LATER 53   53 The PERIMETER GATE is overrun. The former Mt. Sinai Medical Center beyond. It’s clear there’s been a vicious attack -- DAN (INTO MIC) Command, we’re at the Research Facility. Southeast side. No activity. CHARLIE Power’s on. ROMIO COMMAND (O.S.) Actual, proceed to the lab on 7. DAN Copy. (to Norah and Cowan) You two stay out here. Keep watch. THE TOMORROW WAR   Green Revi",
      "dialogue_count": 0,
      "word_count": 1607
    },
    {
      "scene_number": 4,
      "slugline": "INT. R-FORCE FACILITY - TEST LAB - SAME TIME 57e   57e Dan finds the centrifuge. Inside is a series of BLUE AMPOULES that contain a thick, creepy BLUE FLUID that looks alive -- DAN Uck. Weird. (he takes them all; into mic) Command we’ve got everything - ready to exfil. Cowan and Norah race into the lab -- COWAN We do NOT want to go out THE FRONT DOOR-- ROMIO COMMAND (O.S.) Actual, head to the loading dock in back - take the rear stairwell. DAN Team. We are on the move.  INT. RESEARCH FACILITY - STAIRWELL - MOMENTS LATER 58   58 Dorian eases to the railing, peers over the side. Floors and floors of darkness. Small fires, sparks falling. No movement. He gives the all clear. Our crew files in, descending down the stairwell when they HEAR: c...l...i...c...k...i...n...g.... Dan braces, holds up a fist. Everyone freezes. A beat - then again ...c...l...i...c...k...i...n...g.... Norah anxiously looks to Dan who slowly inches toward the railing - points his weapon down the center of the stairwell... Dark abyss. Still nothing. DAN Alright, let’s keep moving. The team continue downward - but not Cowan - he stops, peers slowly up behind him: Nothing except flickering lights and fires illuminating the floors above them. Wait! A head appears from the darkness.   What is that?   Cowan stares. Is it? - a pair of Whitespike tentacles come out. Then more heads... THE TOMORROW WAR   Green Revisions 11/15/19   62.",
      "characters": [],
      "action_text": "COWAN Uhm... guys? No one is listening. Behind the shape. More heads appear. COWAN (CONT’D) (shouts) GUYS!!! Dan looks up. So does Dorian -- DORIAN That’s them. CHARLIE What’ll we do? Dan and Charlie look at each other. DAN SPRAY AND PRAY! The Whitespike shoots SPIKES out of its tentacles. One spike hits COWAN, throwing him into the wall. Dorian unloads his weapon. Dan follows suit. The rest join, FIRING INTO THE BELFRY WHITESPIKE. The Whitespikes FIRE - spikes raining down -- one piercing Jumplink Greg knocking him down. Dead. Charlie fumbles with his gun as Norah unleashes a barrage of bullets. CHARLIE (x1000) Shit. Shit! SHIT! SHIT!! A Whitespike is hit - blood everywhere as it tumbles into the stairwell and crashes past our heroes. DAN Fall back! Keep moving! Go, go, go! Our crew runs downstairs firing their weapons. The Whitespike creeps down the stairs, tentacles up, as bullets fly. CHARLIE (x2000) Shit. Shit! SHIT! SHIT!! It turns the corner. Going straight for Rose. Dan FIRES at it next to Rose. BULLETS FLY EVERYWHERE. THE TOMORROW WAR   Green Revisions 11/15/19   63. Draftee #2 Kelly KILLED. April KILLED.(location of death TBD)  BUS DRIVER ROSE (firing) EAT MEEEEEEEEEEEEEE!!!!! The Whitespike, completely unfazed, shoots TWO SPIKES right at Dan! One hits Bus Driver Rose in the chest, sending her flying into Dan, knocking Dan down and dislodging his gun from his grip. Dan reaches for his gun -- the Whitespike fires two MORE spikes at him! Dan recoils, the spikes barely missing him. With quick hands, Dan reaches for his gun just as the Whitespike SCREECHES and stands: 8 foot tall. Dan fires at the Whitespike. It quickly crawls back upstairs, away from the spray of bullets. DAN Come on! Let’s go!! Our crew runs for the door. Dorian, at the front of the pack KICKS it OPEN-- everyone files through. Christian SLAMS the door shut just as a Whitespike barnstorms into it-- BAMMM!!! The door FLIES clear off it’s hinges --  INT. RESEARCH FACILITY - 1ST FLOOR CORRIDOR -",
      "dialogue_count": 0,
      "word_count": 1084
    },
    {
      "scene_number": 5,
      "slugline": "EXT. STREET - CONTINUOUS 61b   61b Dan, exits, looks up and FIRES on Whitespikes crawling down the parking garage! DAN Move. Move. Move. The team runs out door onto the street. Our team doesn’t look back - Louie’s KILLED.  INT. COMMAND CENTER - DAY 61c   61c ROMIO COMMAND The Humvees are inbound... get to the street and push south toward Dade Boulevard.  EXT. STREET - CONTINUOUS 61d   61d Dan and the team are firing away--  INT. COMMAND CENTER - DAY 61e   61e ROMIO COMMAND Head towards 2nd street. OMITTED 62   62  EXT. STREET (MOVING FAST) - DAY 63   63 Charlie and Diablo on a dead run, firing at Whitespikes. Charlie TRIPS and falls-- a huge weapon falls out of his bag--  What is that?  DIABLO You have a Rocket Launcher? CHARLIE I do? Charlie, on the ground, keeps firing! THE TOMORROW WAR   Green Revisions 11/15/19   67.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 147
    },
    {
      "scene_number": 6,
      "slugline": "EXT. STREET - MOVING 63a   63a Dan and team are on the move. Whitespikes gallop down the street towards us. DAN Can we outrun them? DORIAN No. But I don’t have to outrun them. I just have to outrun you. Dorian runs ahead. Spikes and bullets FLY. OMITTED 63b   63b OMITTED 63c   63c  EXT. STREET - DAY 63d   63d It looks like all hope is lost! They’re sprinting down the street when suddenly, THE SMOKE UP AHEAD PARTS to reveal CHARLIE WITH THE ROCKET LAUNCHER! He lifts the rocket launcher to his shoulder-- looking for the perfect shot. CHARLIE Good? DIABLO Backstage clear! On Dan: DAN Rocket out! Team takes cover. CHARLIE FIRES! The rocket flies past Dan into the swarm of Whitespikes and KA-BOOM! A massive ball of fire. Dan reaches Charlie, they look back at the aftermath. CHARLIE Yes! Yes! A moment of relief. And then -- WHITESPIKES EMERGE OUT OF THE FLAMES ON FIRE! One, two, five, twenty! CLICKING. HISSING.   HOLY SHIT!  THE TOMORROW WAR   Green Revisions 11/15/19   68.",
      "characters": [],
      "action_text": "DAN Run!! The team sprints! Barb KILLED. Draftee #1 (Royce) KILLED. OMITTED 63e   63e  EXT./INT. COMMAND CENTER/MARTA STREETS (INTERCUT) - MOVING 63f   63f The team run down a street. Whitespikes not far behind-- ROMIO COMMAND (O.C.) Actual you need to head left at the next intersection you’ve got Whitespikes closing in on you from the north and the south. DAN And West! (then) Command, we’re going right. Truck Driver Palmer KILLED. ROMIO COMMAND Okay, but you need to stay away from areas with red smoke. They find themselves engulfed in red smoke. MAJOR GREENWOOD Coordinates are being released. Our team doesn’t look back - running at top speed. A palm tree ABLAZE, a HELO fires a rocket at a building - KABOOM. DAN Command, we need an extract. Romio Command looking at the monitor: ROMIO COMMAND Keep heading for the bridge the Humvees will intercept. At the other end, THREE HUMVEES swerve around a corner. The cavalry is here! NORAH Thank God. THE TOMORROW WAR   Green Revisions 11/15/19   69. Our team walks forward, suddenly hopeful! A GUNNER emerges at the top of the lead Humvee, ready to blast Whitespikes-- CHARLIE WOO-HOO! We are SAVE-- Out of nowhere - WHITESPIKES careen into the Humvees tossing the three end over end - exploding them in a mass of debris and fire. When -- Spikes rain down- They look up and see WHITESPIKES ABOVE THEM! DAN Contact left. All move forward, take cover behind cars. Everyone fires wildly at Whitespikes. They’re everywhere! At the Monitor: Major Greenwood and Romio Command watch the monitors. MAJOR GREENWOOD There’s too many of them. ROMIO COMMAND Actual, you’re going to have to fight your way out of this one. Dan firing away in both directions -- takes cover behind next car. Reloads-- Then gets up and FIRES AWAY! Others move forward behind more cars. Behind a car- Dorian shoots with a SHOTGUN! Taking as many out as he can when - A Whitespike leaps at him on top of a car --   he runs out of ammo. Then Dorian picks up the automatic weapon and",
      "dialogue_count": 0,
      "word_count": 766
    },
    {
      "scene_number": 7,
      "slugline": "INT. TUNNEL 63n   63n -- crashing to the ground SNAPPING his leg. He YELLS as he collapses.  EXT. SLATTED TUNNEL - CONTINUOUS 63na   63na Norah looks down at Cowan -- NORAH Cowan! DORIAN Leave him! Norah jumps down into the tunnel. Dan follows. Dorian turns to keep moving, but looks back-- Whitespikes are behind them! Dorian, Tank, and Diablo jump down into the tunnel.  INT. TUNNEL - SAME TIME 63nb   63nb Dan and Norah run to Cowan - he’s in immense pain - the others jump down. DAN Come on. Can you stand? ROMIO COMMAND (O.S.) Whitespikes are closing in on your location, you need to keep moving! THE HORIZON - a herd of Whitespikes charging into the tunnel - Dan and Norah try to help Cowan. COWAN I’m not gonna make it --  INT. COMMAND CENTER 63o   63o Romio Command leans into the mike - staring at the aerial view of their position. Can’t see them anywhere. ROMIO COMMAND Actual - get the hell out of there!  INT. TUNNEL 63p   63p Cowan won’t take their help. THE TOMORROW WAR   72.",
      "characters": [],
      "action_text": "DAN Charlie! Help me. Charlie runs over. He and Dan struggle to help Cowan up. They hoist Cowan up, he screams in agony, falls back down. COWAN I can’t do it, man! NORAH You have to! We’re not leaving y-- She gets SPIKED IN THE BACK RIGHT HIP. She looks down at the spike in shock, drops to her knees. Dan looks at her. DAN Where are you hit? Looks at Cowan. He can’t save both. Norah sees it on his face. ROMIO COMMAND (O.S.) Actual, where are you?! I’ve lost visual. Birds are inbound and you are in the line of fire, you need to get out of there! Dan sees Whitespikes getting closer. Spikes fly past him. Tank and Diablo are SPIKED. CHARLIE What do we do?! DORIAN Get the fuck out of here. ROMIO COMMAND (O.S.) Dan! Get the hell out of there! NORAH Go. We’ll do what we can to hold them off. COWAN Let us get you out. ROMIO COMMAND (O.S.) Dan, I need you to make it out of there, you have to keep moving! NORAH We got this. Go!! THE TOMORROW WAR   73. Dan runs. Norah and Cowan, with all their strength, spray gunfire at the charging Whitespikes.  EXT. AERIAL TUNNEL - DAY 63q   63q Whitespikes charging ever closer.  INT. TUNNEL 63r   63r The team full out crazy sprints to the mouth of the tunnel. Norah and Cowan, still shooting as the Whitespikes are closing in on them -- KABOOM! The tunnel, Norah, Cowan, and the Whitespikes EXPLODE.  EXT. TUNNEL 63s   63s The EXPLOSION rockets out of the tunnel - Dan, Charlie, Dorian and the others enveloped in the concussion and flames as they are thrown violently in the air -- and we-- CUT TO BLACK. OMITTED 64-66   64-66  INT. FORWARD OPERATING BASE - MEDICAL TENT - DAY 66a   66a A BLURRY POV EMERGES OUT OF DARKNESS: Injured soldiers on cots in a makeshift medical tent. POV comes into focus AS - DAN blinks. Sits himself up. Everything hurts. His shoulder has been bandaged, along with part of his head. He sees Charlie a few cots away from him -- DAN Hey - You okay? CHARLIE Where the heck are we?  EXT. FORWARD OPERATING BASE - MEDICAL TENT - TH",
      "dialogue_count": 0,
      "word_count": 4455
    },
    {
      "scene_number": 8,
      "slugline": "EXT. VIPER 3 - NIGHT 89   89 The interior lit by the glow of Muri’s computer, the Black Hawk flies deep into the night sky.  INT. VIPER 3 - NIGHT 90   90 With the red hue of dawn on their faces, Muri nudges Dan awake. She hasn’t slept. We can hear the APPROACH OF A LOW RESONANT BUZZING SOUND. Dan’s eyes open -- MURI (on Comms) We’re here. That’s Deepswell. We see:  EXT. DEEPSWELL 9 RESEARCH STATION - NIGHT 91   91 A repurposed DEEP WATER OIL RIG, outfitted with ROCKET BATTERIES, PHALANX CANNONS... A SQUADRON of solar-electric AERIAL COMBAT DRONES patrol the sky above. A CARAVAN OF BOATS drive towards Deepswell. Civilians crowd the decks, looking up to the helicopters.  EXT. CRUISE SHIPS - SAME TIME 91A   91A Civilians crowd the decks to get a look at the three helicopters approaching, one of them with the CAGED FEMALE WHITESPIKE underneath.  INT. VIPER 3 - SAME TIME 91B   91B Muri leans out of the helicopter and raises a fist triumphantly. The crowds below CHEER!  EXT. DEEPSWELL 9 RESEARCH STATION - CONTINUOUS 91C   91C The Deepswell wall parts as the three helicopters fly in. We see the converted oil rig. As they fly past the drone container ship...  INT. VIPER 3 - SAME TIME 91D   91D DAN What is this place? THE TOMORROW WAR   94.",
      "characters": [],
      "action_text": "MURI Deepswell-9. DAN It’s one hell of a fortress. MURI It was originally built to protect our most valuable weapon: the Jumplink. We see the JUMPLINK on the tower. MURI (CONT’D) Now we use it to protect everyone else. OMITTED 92-94   92-94  INT. VIPER 3 - THAT MOMENT - NIGHT 95   95 From the helo we see an elaborate UNDERWATER WALL raises behind the cruise ship, creating a secure perimeter.  INT. DEEPSWELL 9 - LAB - DAY 96   96 The FEMALE WHITESPIKE, inside a 12-foot diameter BALLISTIC GLASS SPHERE. LIMBS and TENTACLES SHACKLED by TITANIUM CUFFS, A GIANT MUZZLE over her face. She’s IMMOBILE. However, her EYES can still SPY the pulse visible in Muri’s neck. Muri taps on her computer making final checks as Dan enters. Both still aware of the intensity of their last talk. MURI Glove up and get ready. She turns to him holding A TEN-INCH NEEDLE -- MURI (CONT’D) (to break the tension) You want to hold her down? DAN You sure it’s safe to be that close? TIGHT ON - THE NEEDLE. Going in the abdomen of the Spike. Muri’s working through GLOVES on the POD that let her access the inner chamber and the Whitespike. The needle’s effects are quick, TENSION leaves the Whitespike’s BODY -- THE TOMORROW WAR   95. MURI We gave her 180 milligrams of hydromorphone. Dan’s HANDS WORK a set of GLOVES on the other side of the pod preparing NEEDLES and SAMPLE TUBES that he pushes towards Muri through a SAFETY TRAY -- DAN That’s gonna be one high Whitespike. MURI It’s sedated. DAN Betcha it’d perk up for some Flaming Hot Cheetos. Muri takes up a needle and specimen tube, looks to Dan -- MURI Let’s do this quickly. She jabs the needle in the Whitespike’s leg, they wait as the tube fills, Dan carefully monitoring her vitals -- Muri pulls out ONE TUBE - filled with FLUID. Dan takes it from her, hands her another EMPTY. As he does -- MURI (CONT’D)   * Her genetics aren’t that different   * from the males. The poison hurts   * them, but their bodies are better   * at detoxifying.   * DAN   * So if y",
      "dialogue_count": 0,
      "word_count": 1694
    },
    {
      "scene_number": 9,
      "slugline": "INT. DEEPSWELL 9 - LAB - DAWN 101   101 Muri puts drops of a CLEAR SOLUTION into a test tube of WHITESPIKE BLOOD. She feels eyes on her. Turns to-- The FEMALE WHITESPIKE - staring at her with WHITE HOT HATE. Blood lust in its narrowed eyes. Its teeth gnash. It wants to tear her apart. Muri looks back at it, holds up the test tube. MURI (taunting) Tick, tock. She loads it into the LC-MS. Presses a button. It whirs to life. Dan enters. The LC-MS slows, then BUZZES. A digital FAIL/MATCH readout on Circle ONE: FAIL. Resumes spinning. DAN   * How’s it going?   * Muri rubs her eyes, exhausted.   * MURI   * (sarcastic)   * Great. I’ve discovered roughly ten   * thousand ways to not achieve   * sufficient potency.   * Dan sits next to her.   * DAN   * Why don’t you take a break? I can   * handle the rest.   * MURI   * I’m fine, really.   * She’s buried in her work, not looking at him. He recognizes   * himself in her, realizes what Emmy must have felt. He reaches   * out and takes her hand.   * DAN Muri. You don’t have to do this on   * your own. I know I’m here for a   * purpose. Tell me how I can help.   * Muri looks off, hesitates. The LC-MS slows -- FAIL -- two   * down.   * THE TOMORROW WAR   Buff Revisions 1/10/20   102.",
      "characters": [],
      "action_text": "MURI   * If this toxin works, I need you to   * take it back. We can’t make more   * here. But you have the resources   * and ability in your time to mass   * produce it and send it back.   * Dan studies her for a beat.   * DAN   * And you want it sent back in these.   * Dan holds up his jumband. Muri looks at him, shocked he   * figured it out.   * DAN (CONT’D)   * Human beings are their primary food   * source... which makes them the only   * reliable delivery method.   * The LC-MS slows -- FAIL -- three down. The female Whitespike   * STIRS in its restraints.   * MURI   * The jumpbands will only inject the   * toxin into the bloodstream when it   * registers a cardiac arrest.   * Muri sees the female’s vitals rising. FAIL. Four tubes down.   * DAN It’s smart Muri...   * MURI And...   * (this is the thing that’s killing her) ...it’s immoral.   * FAIL. Five. The FEMALE WHITESPIKE starts to CLICK.   * DAN But the soldiers would already be   * dead, right? Why wouldn’t they want   * their bodies used to kill these   * things?   * The FEMALE’S CLICKING grows ever LOUDER -- DAN (CONT’D) You’re asking that a few thousand   * soldiers die so that the human race   * can survive --   * THE TOMORROW WAR   Buff Revisions 1/10/20   103. FAIL. Six tubes down.   * MURI   * We’re going to send the soldiers into the Nests. Straight in. It’s a suicide mission. DAN We got out-- MURI Barely. And lost two SEAL teams in the process. I’d be dropping thousands of people into a NO-WIN situation - not hoping they’ll kill a few Whitespikes and survive - but HOPING THEY WILL GO IN THERE AND DIE. We wouldn’t be asking them to   * fight, we’d be asking them to die.   * DAN Muri if you brought me here to tell you to do it - I’m telling you - do it. End this. You can. MURI (conflicted, struggling)   * I don’t want to pray for the death of some people in order that others will live. Dan sees his fractured child and it breaks his heart. DING.   * “MATCH” glows GREEN. They look at the screen. Muri",
      "dialogue_count": 0,
      "word_count": 709
    },
    {
      "scene_number": 10,
      "slugline": "INT. DEEPSWELL 9 - LAB-INTERCUT DAN/MURI/FEMALE WHITESPIKE 103   103 Dan’s tension rises, watches the ALARM lights strobe when suddenly the building ROCKS violently-- DAN What was that? MURI My god... ON THE LAB MONITOR: WE SEE DEEPSWELL SURROUNDED BY A SEA OF WHITESPIKES. MURI (CONT’D) The minefield. OMITTED 104   104  EXT. DEEPSWELL - GREENWOOD AREA - DAY 104a   104a Greenwood stares aghast out to the perimeter. GREENWOOD They found us!!  EXT. DEEPSWELL - GREENWOOD POV 104b   104b EXPLOSIONS - in the water - moving closer and closer. GREENWOOD They’ve surrounded us!!  EXT. DEEPSWELL - GREENWOOD AREA - DAY 104c   104c GREENWOOD (he starts running) They are destroying the perimeter fence!!  EXT. AERIAL SHOT - DEEPSWELL-9 - DAY 105   105 Rapidly moving shadows of tens of thousands of Whitespikes swimming beneath the surface of the sea, boxing in Deepswell. ANNOUNCEMENT (O.S.) All military personnel to your battle stations. THE TOMORROW WAR   105.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 152
    },
    {
      "scene_number": 11,
      "slugline": "EXT. DEEPSWELL - DAY 105a   105a Rising shot - soldiers charging to their stations - we see the attack has started - GUNNERS start unloading their 50 calibers. ANNOUNCEMENT All civilians. Arm yourselves with whatever you can.  EXT. DEEPSWELL - DAY 105b   105b WHITESPIKES - swimming ferociously towards Deepswell. Rocket launchers fire missiles into the water - EXPLOSIONS - we see the creatures scale the Deepswell supports by the hundreds. ANNOUNCEMENT Fight for your lives and the lives of your family.  INT. DEEPSWELL - LAB - INTERCUT DAN/MURI/WHITESPIKE 105c   105c CLOSE - Female Whitespike screeches as it stares down Muri. DAN (realizing) They are coming for her... The centrifuge spins. ALARMS blaring. The female continuing to SCREAM. “MATCH” glows GREEN. MURI We did it. But there’s no smile. A burden shouldered. Dan clocks this. MURI (CONT’D) I need to get you... The centrifuge arm offers the TOXIN -- the liquid glows an IRRADIATED GREEN. Muri grabs THE VIAL. MURI (CONT’D) ...and this... to safety. (into comms) Greenwood!! Send the KILL TEAM to the lab. Their orders: execute the female. I’m taking Dan to the drone pad. I need you to protect the jumplink so he can jump back. THE TOMORROW WAR   106.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 203
    },
    {
      "scene_number": 12,
      "slugline": "EXT. JUMPLINK TOWER - DAY 105d   105d REVEAL: Greenwood at the highest position on Deepswell. Already protecting the Jumplink - armed to the teeth. GREENWOOD Way ahead of you. Be careful - the whole rig is crawling with Whitespikes.  INT. - DEEPSWELL - LAB - DAY 105e   105e Muri opens a weapons cabinet -- DAN We can kill her right now-- MURI That’s all the toxin we have. You need to take it back. Make more. (throws Dan an MKZ) You have to survive. They charge to the exit. The WHITESPIKE SCREAMS defiantly--  EXT. DEEPSWELL-9 - MOMENTS LATER 105f   105f Muri and Dan burst out of the lab. SIRENS ECHO. WORKERS and ARMED TACTICAL TEAMS rush across the open-air platforms. Running -- leaping - Muri and Dan make the run of their lives through the complex maze of Deepswell. We ARC up to see the platforms being overwhelmed. OMITTED 106-107   106-107  INT. DEEPSWELL-9 - MOMENTS LATER 108   108 MAYHEM is audible from every direction. Constant POP of automatic FIRE. ALARMS. CLICKING close by. Muri puts on her pair of SPECIAL GLASSES - calls out: MURI Drones -- to the east tower. Now!! THE TOMORROW WAR   107.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 197
    },
    {
      "scene_number": 13,
      "slugline": "EXT. DEEPSWELL - DRONES - DAY 108a   108a DRONES wake up and veer on Muri’s command. We FOLLOW them as they traverse and find a wide look at Muri and Dan running. DRONE POV - Dan/Muri and below them on the stairwell... DRONE 100 bogeys on the stairwell. Your order?  INT. DEEPSWELL - OPEN AREA - DAY 108b   108b Dan and Muri - full sprint. Muri gives commands. MURI Level one: EXECUTE!! We INTERCUT - between Muri’s commands and the Drones carrying out the action. WIDE - lower stairwell. DRONE Order confirmed. The Drones destroy all Whitespikes. MURI (O.S.) Level two: Execute. CLOSE - DRONE - opening fire on Level two. DRONE Order confirmed.  EXT. DEEPSWELL - TOP OF STAIRS - DAY 108c   108c Dan and Muri on a sprint - Whitespikes rise out of the stairwell ahead blocking their exit!! DAN Muurrii!! MURI (O.S.) Level three. EXECUTE! BLAM - the WHITESPIKE is SPLIT IN HALF - revealing the drone behind - Muri and Dan dive between the parting halves. DRONE Order confirmed. THE TOMORROW WAR   108.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 178
    },
    {
      "scene_number": 14,
      "slugline": "EXT. DEEPSWELL STAIRWELL - DAY 108d   108d Dan and Muri - skip-jump down the stairwell. KILL TEAM #1 (O.S.) Commander Forester. This is the kill team.  INT. DEEPSWELL LAB - DAY 108e   108e Foreground - the cage - destroyed. The Kill team stunned. KILL TEAM #1 The female has escaped!! Repeat - the female has escaped.  EXT. DEEPSWELL - CORRIDOR - DAY 108f   108f Muri wheels around a corner. MURI Dammit! Dan hot on her heels, bobbing and weaving past pipes and girders.  EXT. DEEPSWELL - SOMEWHERE ELSE - DAY 108g   108g Female Whitespike - running - focused - clearly on a mission. Two Whitespike Henchman at her side - a quick CLICK CLICK to both of them and they split off.  INT. DEEPSWELL-9 - ENGINE ROOM - MOMENTS LATER 109   109 Dan and Muri turn a corner past massive boilers -- A SOLDIER is attacked violently right in front of them - they retreat the way they came.  EXT. DEEPSWELL-9 - CORRIDOR - CONTINUOUS 109aaA   109aaA Dan and Muri run alongside the engine room. The FEMALE WHITESPIKE sees them from a parallel walkway and leaps over the railing, landing just behind them. Dan and Muri sprint, the female whitespike chasing after them! THE TOMORROW WAR   109.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 208
    },
    {
      "scene_number": 15,
      "slugline": "INT. DEEPSWELL-9 - ENGINE ROOM - CONTINUOUS 109aaB   109aaB Dan and Muri run into the engine room, just as a SOLDIER is ATTACKED - dragged away screaming by one of the female’s henchmen.  EXT. DEEPSWELL-9 - CORRIDOR - CONTINUOUS 109aaC   109aaC Hugging the wall now - they watch as they see the FEMALE walking away from them. As it heads off to their left - they silently escape to the right. As they exit our frame - a beat and the FEMALE comes CHARGING around the corner in hot pursuit. ANGLE ON - Dan and Muri exiting the Engine room - another soldier is ATTACKED - dragged screaming away by one of the Females henchman - forcing Dan and Muri to change paths. Putting them FACE TO FACE - WITH THE FEMALE. Muri unloads on one of the boilers - it explodes in A BURST OF SCALDING STEAM. But the FEMALE charges right through --  INT. DEEPSWELLL HALLWAY - DAY 109a   109a -- Then FREEZES - where are they? ANOTHER ANGLE - Dan and Muri - sweating, leaning against a wall - holding their breaths. A beat - they realize the female has left. They bolt to the open doorway.  EXT. DEEPSWELL GIRDERS - DAY 109b   109b Dan and Muri precariously balance their way across the steel girders of Deepswell. They can see the drone pad ahead. MURI We are almost there!! FFFFTT - SPIKES whiz through the air - hitting Muri in the stomach. She screams, topples off the girders. DAN Murrrri!! Dan jumps down to where she has fallen. THE TOMORROW WAR   110.",
      "characters": [],
      "action_text": "DAN (CONT’D) Muri! He looks up - sees the Female above them - staring down with pride. A tentacle comes up - poised - the other follows - ready for the kill shot - GUNFIRE! - whack - the Female takes it in the head - and topples from it’s perch - hitting the side of the platform as it plummets into the ocean. Dan looks up - Greenwood - from his perch. A nod of thanks. Dan picks up Muri - starts running. DAN (CONT’D) We have to get you to the drone.  EXT. DEEPSWELL-9 - STAIRS - DAY 110   110 Dan helps a pale, bleeding Muri up the stairs.  EXT. GANTRY PLATFORM - BRIDGE - DAY 111   111   * Dan and Muri race across the bridge. She’s still holding the   * TOXIN. The world around them is ON FIRE.   *  EXT. GANTRY PLATFORM - THAT MOMENT 111a   111a   * Muri falls to the ground - exhausted and in pain. Dan finally gets a real look at her wound; deep, arterial, fatal. He blinks. Eyes fill. DAN Lie down.   * MURI I don’t feel so good.   * Dan tries to apply pressure to her wound-- DAN   * You’re gonna be okay.   * MURI   * I’m not going to make it.   * DAN Don’t say that... Yes you are.   * THE TOMORROW WAR   Buff Revisions 1/10/20   111. He looks in her eyes.   * DAN (CONT’D)   * Everything’s going to be okay.   * He’s still the Dad she remembers.   * MURI Listen. He moves hair from her eyes.   * MURI (CONT’D)   * I’m sorry.   * DAN   * You don’t....   * MURI   * No. I shouldn’t have said all of   * those things to you.   * DAN   * It’s okay...   * MURI I wanted to see you like this - I   * wanted to see you like you were   * when I was a kid. This is who you   * are. This is what I remembered...   * Tears stream down her face. With the last of her strength,   * she EMBRACES HIM. Her head on his chest.   * MURI (CONT’D)   * I love you... Dad.   * Just then: The hair on Dan’s arms stands up, he looks down -   * 59 seconds. time slows... DAN NO. The platform rocks. Dan turns - revealing--   * The FEMALE WHITESPIKE!!  EXT. DRONE PAD - DAY 111b   111b Explosions, fire - Whitespi",
      "dialogue_count": 0,
      "word_count": 691
    },
    {
      "scene_number": 16,
      "slugline": "INT. DRONE CONTAINER - DAY 111c   111c Dan leaps - sliding down - reaching out - GRABBING HER HAND. Muri fights - holding onto THE TOXIN. Dan - trying to pull Muri back in - holding onto his child for dear life - he catches a glimpse of his jump band - 21,20,19 - Muri sees it as well. She’s panting. Each breath agony. Eyes going glassy. She realizes what she has to do-- -- she lets go -- and as she slips away - her eyes on her Dad - she tosses him THE TOXIN. Dan catches it - his jumpband down to the last seconds - he watches his daughter fall slowly into a sea of Whitespikes -  EXT. DRONE PAD - DAY 111d   111d CUT AROUND TO SEE: Passengers leap from overwhelmed Cruise Ships. A Black Hawk covered with Whitespikes takes off, banks sharply, arcs into the ocean. An EXPLOSION rocks the rig, a platform leg buckles, the structure collapsing. Underwater mines EXPLODE, rip a hole in the fleeing Cruise ship. A bloody Major Greenwood FIRES protecting the Jumplink until he’s out of ammo. He is OVERRUN. We circle around the Drone Container - Dan hanging out the open door - Muri being swallowed up. The end of humanity as we know it.  INT. DRONE CONTAINER - DAY 111e   111e DAN’S LIMBS WON’T MOVE. NO SOUND COMES FROM HIS THROAT AS THE LAST IMAGE HIS EYES SEE IS A MASS OF WHITESPIKES FALLING ON HIS CHILD. AND HIS JUMPBAND GOES TO ZERO-- HE VANISHES. CUT TO BLACK. Blackness. The rising SOUND of a BEATING HUMAN HEART. THE TOMORROW WAR   113.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 274
    },
    {
      "scene_number": 17,
      "slugline": "EXT. ARMY BASE - FIELD - DAY 112   112 Still for a moment, then: DAN APPEARS feet above the ground, body-slams into the field. Forty-seven other Draftees materialize. Thud into the grass. Dan fights to stay conscious. LT. HART Forester.   Forester . They pick him up. Drop him on a GURNEY. Dan’s eyes jerk open. MEDIC Some damage in the left-- LT. HART Can he hear me? Dan’s eyes go from vacant to focused. DAN (he croaks out) The Toxin. DAN The green vial. Do we have it? LT. HART It’s in your hand. Hart opens Dan’s closed hand. In it; VIAL OF GREEN TOXIN. DAN We need to make more of this, send it back-- it will kill them, even the femal-- LT. HART (panicked) The Jumplink just went offline. We can’t send anything back. Unless you’re going to tell me someone there has a plan.... There’s a silence as Dan’s eyes drift to meet hers. He shakes his head. Hart backs up, loss curdling inside her. It all hits her. She can’t face Dan or anyone. She exits. ANOTHER DRAFTEE is next to Dan. It’s Charlie. He turns to Dan. THE TOMORROW WAR   114.",
      "characters": [],
      "action_text": "CHARLIE (barely gets out the words) I hid. They are both vegetables.  INT. COACH BUS (MOVING) - DAY 112a   112a Dan sits mid-bus, window seat, outline of the Jump-band on his arm. Numb. Around him forty seven survivors; bandaged, scarred, traumatized. One Draftee mumbles to himself, rocks.  EXT. V.A. - THAT MOMENT 112b   112b The one-bus caravan pulls into a receiving lot. FAMILIES hold WELCOME signs, cry, shout, wave. Dan walks off the bus. Through the crowd he sees Emmy. She smiles, waves, in a pretty I-made-an-effort dress. Dan staggers towards her, hands start to tremble. Emmy recognizes what she’s seeing, her smile fading. Dan’s eyes reach hers, she forces a happy face.  EXT. THE FORESTER HOUSE - DAY 112c   112c The minivan pulls up. Emmy driving, Dan riding shotgun, looking dazed. They get out of the car. OMITTED 113   113  INT. THE FORESTER HOUSE - LIVING ROOM - THAT MOMENT 114   114 They enter. He’s not ready for this: Muri, holding a welcome home sign, comes running -- MURI Dad! Dan STARES at her as she runs to him. Little Muri. His HEART THUMPS. His breath goes shallow. His head starts to RING as she jumps into his arms. She squeezes him, makes PLAYFUL LION SOUNDS made nightmarish with his head’s awful RINGING. Emmy looks at him, mouths SILENT words, concern on her face. THE TOMORROW WAR   115. Dan closes his eyes. THE RINGING GROWS UNBEARABLE AS DAN HOLDS MURI’S BODY TIGHTER AND TIGHTER, AS IF PROTECTING HER FROM THE APPROACH OF SOMETHING HORRIBLE, AS IF TO NEVER LET HER GO. Suddenly, Muri’s small voice cuts through the ringing SOUND. MURI (O.S.) (CONT’D) Dad? You’re squeezing too tight. EMMY Dan! Stop! Dan’s eyes SUDDENLY JERK OPEN as Emmy stands over him, PULLING MURI FROM DAN’S ARMS. The RINGING in Dan’s ears suddenly STOPS. He releases his grip. Emmy scoops up Muri. MURI (soft) I’m okay. Emmy looks at Dan, motionless, her eyes brimming. OMITTED 115-117   115-117  INT. THE FORESTER HOUSE - MASTER BEDROOM - NIGHT 115a   115a Emmy stirs in bed. She reach",
      "dialogue_count": 0,
      "word_count": 1401
    },
    {
      "scene_number": 18,
      "slugline": "INT. UPSCALE HIPSTER BAR - DAY 122a   122a Dorian sits at a TRENDY UPSCALE BAR, drinking vodka. The bar is pretty empty, seems closed. Dan and Charlie walk in. Dorian is not happy to see them. DORIAN Did you miss me? Dorian finishes his drink, reaches over the bar to grab a bottle. Dan notices there’s no bartender. DAN Guess there’s no one to stop you. Dorian refills his glass. DORIAN  Stop   me? There’s no stopping anything. Dorian nods to a TV playing news footage of riots. DAN We could end all of this. But I need your claw. DORIAN It’s over. We broke the world. Dorian drops the bottle back behind the bar. Dan studies him for a beat. Watches Dorian drinking. DORIAN (CONT’D) The future’s here to make us pay for our sins. No sense fighting it. It comes for us all. Dorian spits on the floor in disgust. A beat as Charlie and Dan exchange a look - the reality slowly dawning on them. DAN You’re sick, aren’t you? CHARLIE Yeah and not just like, in the head. Like sick, sick. Dorian hesitates, then... DORIAN I don’t know about you guys but when they told me I was gonna die in six months... I had to know. (MORE) THE TOMORROW WAR   Green Revisions 11/15/19   121.",
      "characters": [],
      "action_text": "I couldn’t just sit there with it. It was eating me up. Army guy said they weren’t allowed to say cause, but break a few fingers in the parking lot and pancreatic cancer pops out. DAN I’m sorry. (beat) For the Army guy. Dorian can’t help but laugh a little. Eases the tension. DORIAN Here, I was a dead man with nothing. Here, I’m supposed to die. But in the future: I got nothing to lose. I live while everyone around me dies. I’m larger than life. I’m a T-Rex. A hero. A god. There’s gotta be a reason for that. DAN And what do you think that is? DORIAN (smiling) Maybe it’s because I’m pretty. Charlie laughs. Dorian shoots him a look and he turns it into a cough. CHARLIE Could really be a number of different reasons. (nervous) Lotta scenarios at play here. DAN I think it’s because you’re supposed to help us. You said you’d rather die in the war than live a slow death back home. Dorian throws back a shot - studying Dan. CHARLIE I can’t imagine the drinking is helping the cancer situation. Dorian shoots him a death stare. Charlie backs down. DORIAN (CONT'D) THE TOMORROW WAR   Green Revisions 11/15/19   122. DAN They said you only had six months. That was almost a year ago. You should know more than anyone the future isn’t written in stone. Dorian looks at Dan, starting to believe him. DAN (CONT’D) You’ve already changed yours. Help me change the rest of ours. DORIAN Saving people is your game, Forester - not mine. DAN I’m not trying to save everyone. I’m just trying to save my daughter. But if I’ve gotta save the whole world to save her - then I’m sure as hell going to do it. What if I told you this was the reason you keep surviving? That this was the moment you’ve been waiting for your whole goddamn life. What would you say to that? DORIAN I’d say you were full of crap and outta options. DAN (beat) And you’d be right. Dorian smiles. Then puts the claw down on the bar.  INT. CHARLIE’S LAB - TIGHT ON MICROSCOPE POV: MOMENTS LATER 123   123 A kaleidoscopic star burst of bla",
      "dialogue_count": 0,
      "word_count": 2197
    },
    {
      "scene_number": 19,
      "slugline": "EXT. C-130 (FLYING) - DAY 131   131 Flies over snow caps and glaciers, descending. Wheels down.  INT. C-130 (FLYING) - COCKPIT - SAME 131a   131a Lt. Hart flies the plane.   *  C-130 (FLYING) - CARGO HOLD - SAME   * CHARLIE, DORIAN, TRAN, IKEMBA and DIAZ. Everyone is looking a bit grim and nervous. Charlie pulls handguns from a bag, shoves them into holsters, pockets. Loading up. Dorian and Diaz watch him, a bit amused. DORIAN My man brought the whole arsenal. Charlie looks at him. CHARLIE Because this time I’m not gonna hide. (holds up a gun, badass) I’m gonna fight. LT. DIAZ That’s not even loaded. CHARLIE Of course it’s not loaded! We’re in a pressurized cabin. I’ll load ‘em when we get there. Lt. Diaz and Dorian laugh as Charlie keeps stockpiling guns.   *  EXT. NORTHERN RUSSIA - DAY 132   132 The C-130 in the bg, rear door down. A line of snowmobiles motors away, across the white landscape.  EXT. ACADEMY OF SCIENCES GLACIER (BEGINNING) - DAY 133   133 Dan & Co. slow their snowmobiles, stop. The A.S.G looms. CHARLIE We’re looking for a rift, a crack, some sort of fissure. Anything that might let in more heat. THE TOMORROW WAR   Buff Revisions 1/10/20   132.",
      "characters": [],
      "action_text": "Pull out wide. A MILLION fissures. They all groan. JAMES This is the plan? We might as well be looking for an ice cube. DAN Yeah, well just use your years of experience finding the ice cubes at the bottom of your whiskey glass. DORIAN (to James) I knew there was something I liked about you. DAN (to James) Try to fight your natural instinct to run away when things get tough. Dan turns to the others. DAN (CONT’D) We’ll know it when we see it. Let’s grid up and try to cover this part of the glacier by sundown.  EXT. ACADEMY OF SCIENCES GLACIER - DAY 134   134 On snowmobiles, Dan & Co. spread out. They lean into the wind, creating a grid. Hunting. Dan buries an ice axe in a fissure, levers. Nothing. Charlie shines a light into an opening, squints. Nothing. Back on snowmobiles. Needle hunting in a million haystacks. CHARLIE I never had any desire to go to Russia and I think I was right. // All it took was one day in Russia for me to realize I actually love the beach.  EXT. ACADEMY OF SCIENCES GLACIER - DAY (HOURS LATER) 135   135 The team motors into a heavy wind, ice forming around their goggles. Dan clocks his speedometer, sees the needle dip. He signals stop, they all brake. Dan climbs off, roams. THE TOMORROW WAR   Green Revisions 11/15/19   133. DAN You feel that? DORIAN (shivering) Cold? My fingers? I don’t feel shit. They dismount, feel... something. Dan flips his parka hood back, what is that? Charlie eyes him, then everyone else. Dan feels his HAIR RISE. Charlie extends a curious hand-- JAMES Static electricity. CHARLIE  Shocking . He smiles, so pleased with his corny joke. He looks to see if anyone’s laughing. No one’s even listening. He quickly stops smiling and pretends to be looking at something important. DAN (picks up on it) There’s gotta be a source nearby. LT. HART An electrical field?   Out here? DAN No... more like... He pulls out a COMPASS. Watches the needle TURN AWAY FROM NORTH. Dan looks at the direction it’s pointing. DAN (CONT’D) A magnetic field",
      "dialogue_count": 0,
      "word_count": 4475
    }
  ]
}