{
  "slug": "the-boxtrolls-2014",
  "title": "the boxtrolls",
  "genre": "horror",
  "format": "film",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 23104,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BOXTROLL CAVERN - PNEUMATIC TUBES - CONTINUOUS  ON A BOXTROLL’S REAR END. He scratches the backside of his  box and - WHOOSH! - is sucked up into the air, revealing  Fish.  Fish steps up to a huge PNEUMATIC TUBE driven by a dozen  antique vacuum cleaners and calls up to SWEETS, a toothless  boxtroll with a set of old human dentures in his mouth.  FISH  (gurgled)  “Eggs?!”  Sweets stops, thinks, gets an idea and starts to speak just  as SPECS, a myopic boxtroll with an elaborate head gear of  eye glasses, twists an ANCHOR switch, turning on the  pneumatic tubes. First his DENTURES, then Sweets, are sucked  up into the tube. Fish watches Sweets go and then sees Oil  Can standing on top of the tubes oiling stuff.  FISH (CONT’D)  “EGGS?”  Oil Can stops oiling the tubes.  OIL CAN  (gurgled)  “He’s up there!”  Oil Can points up at a small cave high on the cavern wall.  INT. BOXTROLL CAVERN - EGGS’ NOOK  Fish arrives at the opening of the small dark cave. In the  shadows of the nook is a shape. It appears to be a very small  boxtroll.  FISH  (gurgled)  Eggs?  EGGS  (low, feral growls)  Out of the shadows waddles the small boxtroll. The first  thing that comes into the light is his box with an EGGS LOGO  printed on the front, then appears the dirty face of a feral-  looking 2-YEAR-OLD HUMAN BOY, EGGS.  Fish flashes a wonky-toothed smile at Eggs.  14.",
      "characters": [],
      "action_text": "EGGS (CONT’D)  Fish!  Fish plays a game of hide and seek with the found teddy bear.  He makes the arm, then another arm, then the head appear from  the arm and head holes of his box. Baby Eggs is enthralled.  He excitedly launches himself at Fish. They play wrestle over  the toy until Eggs grabs it from Fish and scampers away.  Eggs hugs the bear. So cute. Then... RIPS ITS HEAD OFF!  He reaches into the teddy bear’s chest cavity and pulls out  the MUSIC BOX. He tosses the gutted bear body away and tries  to get it to work. When he can’t figure it out he holds it  up to Fish.  EGGS (CONT’D)  Fish?  Fish winds the music box, gurgling an explanation of how it  works. Music fills the dark nook.  Eggs giggles with delight as the gears work again.   They both  close their eyes and hum along to the music.  EGGS (CONT’D)  (hums tune)  Do do doo do doo...  EGGS (CONT’D)  (hums along with music)  They stop humming when the giant clock chimes signaling the  end of the boxtroll “day”.  CUT TO:  (0400 GRU) GROWING UP BOXTROLL  INT. BOXTROLL CAVERN - CLOCK  CLOSE ON: the clock as the large hands representing the moon  and the sun flip.  INT. BOXTROLL CAVERN - SLEEPING PILE  As the lights go out, Knickers and the other boxtrolls gather  at the center of the cavern to sleep in a big, communal stack  of boxes like one big family.  15. The sleeping pile is stacked tight and high. Fish and Eggs  climb to the top of the pile. Fish holds Eggs up so he can  pull a chain to turn out the last light in the cavern.  Baby Eggs lies looking straight up. The ceiling of the cavern  is dotted with lots of small lights and slowly turning  machines -- it looks like the flickering of stars. Baby Eggs  happily drifts off to sleep, snuggling the head he ripped  from the teddy bear.  EXT. CHEESEBRIDGE ALLEY - NIGHT  The boxtroll clock chimes, signaling it is night above ground  and time to wake up! Eggs swings from the light bulb and  YELLS!  EGGS  Wake up!  The box pile explodes and falls apart as all",
      "dialogue_count": 0,
      "word_count": 3275
    },
    {
      "scene_number": 2,
      "slugline": "INT. CHEESE GUILD - ENTRANCE HALL - NIGHT  -- and approaches the foot of the main stairs.  SNATCHER  (calling out)  Lord Portley-Rind!  CLOSE ON the TASTING ROOM DOORS.  SFX Muffled voices of White Hats enjoying themselves suddenly  stop.  LORD PORTLEY-RIND (O.S.)  (muffled)  Did you hear something?  Winnie winces. She turns to Snatcher who is admiring the  white hat again.  WINNIE  (desperate)  Can I have the hat back now?  Snatcher puts the hat behind his back, grins and pulls Winnie  up the stairs by her wrist, toward the Tasting Room.  WINNIE (CONT’D)  (pleading)  Please.  Portley-Rind bursts out to see Snatcher ascending the stairs.  LORD PORTLEY-RIND  What in Gouda’s name is going on?  Archibald Snatcher?  SNATCHER  Deepest apologies, your Lordship.  But I found something out in the  street that belongs to you.  Snatcher gestures behind him revealing a sheepish Winnie. As  he turns he also reveals the white hat. Portley-Rind rushes  down the stairs to meet Snatcher half way and GRABS THE HAT.  LORD PORTLEY-RIND  My White Hat!  Winnie looks stricken.  WINNIE  Huh?  28.",
      "characters": [],
      "action_text": "As Portley-Rind pulls on the hat, Snatcher refuses to let it  go, so they tug each other up and down the stairs.  LORD PORTLEY-RIND  I’ll take that... Now, now,  Snatcher one doesn’t acquire a  white hat by simply--  (straining)  --picking it up... off the street.  Portley-Rind finally wins the tussle and grabs the hat back.  He growls under his breath at the smudges left on the brim.  LORD PORTLEY-RIND (CONT’D)  (with emphasis)  A white hat indicates privilege,  prestige, position!  (THEN)  It must be   earned.  He removes a handkerchief from his breast pocket and dabs at  the hat’s brim.  From the top of the stairs the other Guild members chime in.  LANGSDALE  With Valor!  BOULANGER  Chivalry!  BRODERICK  Or being rich! That’s how I got it.  Snatcher looks up at them and bows, removing his red hat.  SNATCHER  Oh, don’t I know it, sirs.  Snatcher climbs the stairs and gets face to face with Portley-  Rind.  SNATCHER (CONT’D)  Fortunately, we still have our  little...   agreeeeement .  Portley-Rind grimaces, remembering.  LORD PORTLEY-RIND  Um.. ehhh...  Snatcher opens his arms, gesturing widely, as he recites the  particulars of the deal.  29. SNATCHER  When I destroy every last boxtroll  in this town, I shall earn my white  hat...   and   join you in the Tasting  Room.  Snatcher takes a step toward the Tasting Room door and looks  longingly into its warm, inviting interior. The White Hats  reach back and slam the doors shut. Snatcher’s face falls.  LORD PORTLEY-RIND  Good lord.  (twists his mustache)  Not sure who should be more  terrified - the boxtrolls or us.  The White Hats chuckle. Snatcher’s expression drops into a  scowl. Portley-Rind puts his hat back on.  LORD PORTLEY-RIND (CONT’D)  Now, how the devil did my hat get  outside in the first place?  Snatcher smirks and gestures toward Winnie.  SNATCHER  I was told the wind had something  to do with it.  LORD PORTLEY-RIND  The wind, eh?  Portley-Rind looks at Winnie and frowns.  WINNIE  Father, I’m sorry--  SN",
      "dialogue_count": 0,
      "word_count": 9946
    },
    {
      "scene_number": 3,
      "slugline": "INT. CHEESE GUILD - COAT ROOM - NIGHT  --The dark corner of a closet. Madame Frou Frou advances on  Eggs.  MADAME FROU FROU/SNATCHER  You really think Portley-Rind will  help a nobody like YOU? In this  town, you want help, you’ve got to  help yourself! That’s what a man  does!  Snatcher adjusts his dress.  EGGS  You’re a liar! When I tell Winnie’s  father the truth, he’ll-- OOF!  Eggs’ tries to run out of the closet. Snatcher shoves him to  the floor.  MADAME FROU FROU/SNATCHER  He’ll THANK ME! Because all your  little boxtroll friends are going  to die -   tonight .  EGGS  What?!  MADAME FROU FROU/SNATCHER  That will make me the most  respected man   in this town.  Snatcher talks to himself as he rifles through the coats  searching for something.  MADAME FROU FROU/SNATCHER (CONT’D)  (while searching)  They’ll have no choice but to give  me a white hat.  Snatcher finds what he’s looking for - a long SCARF.  MADAME FROU FROU/SNATCHER (CONT'D)  They’ll parade me into the tasting  room on their shoulders!  He winds the ends around each fist and snaps it tight as he  stalks toward Eggs.  MADAME FROU FROU/SNATCHER (CONT’D)  And I’m not going to let that be  ruined by some little boxtroll  sewer rat.  81.",
      "characters": [],
      "action_text": "Snatcher is about to strangle Eggs when the curtain is  suddenly pulled aside and light fills the closet.  SIR LANGSDALE  Yoo hoo, Madame Frou Frou... You  promised your snookums a dance!  MADAME FROU FROU/SNATCHER  (deep Snatcher voice)  I did?  (as Frou Frou)  I did! Ha! But of course!  (1750 DAN) DANCE  INT. CHEESE GUILD - ENTRANCE HALL - NIGHT  Sir Langsdale pulls Madame Frou Frou out of the closet and  walks her out on to the dance floor. He gooses her.  MADAME FROU FROU/SNATCHER  Oooh! Vatch your hands, monsieur!  SIR LANGSDALE  (laughs lasciviously)  ON EGGS, as he slowly exits the closet. He awkwardly adjusts  his collar as he takes in his surroundings. Couples are  joined together in a WALTZ, filling the entrance hall with  activity.  Eggs looks up at Portley-Rind at the top of the stairs, then  at the impenetrable wall of dancers. He tries to walk through  the crowd and is nearly trampled. There is no way to get to  Portley-Rind without causing a scene.  Winnie runs up, now in a new, clean YELLOW DRESS.  WINNIE  There you are.  EGGS  (urgent)  We have to get to your father!  WINNIE  You can’t just cut through.  Winnie sizes up the situation: Portley-Rind across the room,  the dance floor between them. Suddenly her face brightens.  WINNIE (CONT’D)  We’ll dance!  82. EGGS  We’ll WHAT?  Winnie grabs Eggs by the shoulders and pulls him onto the--  INT. CHEESE GUILD - ENTRANCE HALL - CONTINUOUS  -- Dance floor, joining the swirling lines of waltzing  couples.  WINNIE  Like this. One two three... one two  three.  Winnie continues counting the steps as she guides Eggs to the  center of the dance.  WINNIE (CONT’D)  Just make a box.  EGGS  You made me get out of my box!  WINNIE  With your feet, silly!  Eggs looks down, concentrating very hard.   He gradually  catches on.  WINNIE (CONT’D)  That’s it, Eggs. You’re dancing!  She laughs. Eggs lets down his guard and joins in laughing.  For a moment they forget why they are at the party. They spin  crazily around the ro",
      "dialogue_count": 0,
      "word_count": 9883
    }
  ]
}