{
  "slug": "the-killing-of-a-sacred-deer-2017",
  "title": "the killing of a sacred deer",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 19637,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOSPITAL - OPERATING THEATRE - MORNING 1 STEVEN, a cardiothoracic surgeon, around 45 years old, MATTHEW, an anaesthetist of around 55, and three SURGICAL NURSES are leaning over the chest of a patient. They are performing open heart surgery. We follow the surgical instruments as they explore the patient’s internal organs. The surgeon’s movements are precise, considered. The procedure unfolds in perfect synchronicity. No one misses a beat. The only sounds are the clink of metal instruments, the doctors’ breathing, and the electronic beep of the heart monitor. BLACK SCREEN - OPENING CREDITS 2 INT. HOSPITAL - SURGERY PREPARATION ROOM - MORNING 3 Steven and Matthew stand at a sink, washing their hands. Their scrubs are splattered with blood. The overhead lighting is harsh. The anaesthetist takes his watch out of his pocket and puts it on. The surgeon takes the anaesthetist’s hand and studies his watch. Steven Nice watch. Matthew Thanks. STEVEN What’s the water resistance? MATTHEW 200 metres. Steven It also has a date display. MATTHEW Yes, it does. STEVEN I might have gone for a metal strap instead of a leather strap. MATTHEW Oh, really? STEVEN Yes. I think I’d prefer a metal strap. I’ve had this one for years and it’s as good as new. He shows Matthew the watch he’s wearing, which has a metal strap. Matthew studies it carefully.",
      "characters": [],
      "action_text": "MATTHEW What’s the water resistance? STEVEN 100 metres. MATTHEW How long have you had it? STEVEN Nine years. I’m a bit bored of it, actually. I’ve been thinking about getting a new one for a while now. MATTHEW Think about it. We can go together to the place where I bought it. If I tell them you’re a colleague of mine, a friend, they’ll definitely give you a better price. Both the owner and his father have been patients of mine, so I know them quite well. Think about it. Steven looks at Matthew’s watch again. He smiles almost imperceptibly and with a nod assures Matthew that he will think about it. The anaesthetist leaves the room. INT. HOSPITAL - STEVEN’S OFFICE - AFTERNOON 4 Steven unlocks the door to his office. A small room with two chairs, a two-seater sofa, and a metal locker. He opens the locker, takes off his white coat and hangs it up. He puts on a blazer and picks up his leather briefcase. INT. BURGER KING - AFTERNOON 5 Steven sits in a Burger King, waiting for someone. He sips a soft drink. There are barely any customers, it’s a slow time of day. On the table in front of him is a small piece of apple pie. MARTIN, a teenage boy, rushes over to Steven’s table. His face is flushed and his T-shirt is patchy with sweat. Martin, around 15, is dressed like a typical teenager. He has a nondescript face, not particularly likeable but not unlikeable either. MARTIN Hi. STEVEN Hi. MARTIN Sorry to keep you waiting. Did you eat?  2. STEVEN I’ve just had some apple pie. MARTIN Do you mind if I grab something to eat before we go? I’m starving. STEVEN Sure. No problem. MARTIN Are you sure you don’t want anything? Chicken wings? STEVEN No, thank you. I’m fine. Do you have money? I can give you some. MARTIN No, I’ve got money, thanks. I’ll be right back. The boy leaves. Steven’s mobile phone rings. He switches the ringer to silent and ignores the call. He watches the boy as he waits for his order. Martin comes back. Steven watches Martin while he eats. The boy eats very meth",
      "dialogue_count": 0,
      "word_count": 4754
    },
    {
      "scene_number": 2,
      "slugline": "INT. HOSPITAL - SURGERY PREP ROOM - MORNING 23 Steven pulls off his bloodied surgical gloves. He washes his hands and then applies steriliser. Matthew, standing beside him, takes off his disposable hat, gloves, and surgical mask and throws them in the bin. MATTHEW A friend of mine brought me a huge steelhead the other day. I thought I’d barbecue it. Do you and Anna want to come over for lunch on Saturday? STEVEN I’d love to. I’ll talk to Anna tonight to check we can make it and let you know. MATTHEW Does Anna eat fish? STEVEN Yes, she does. MATTHEW I’m only asking because she seems like quite a picky eater. STEVEN No, she isn’t. She loves fish. MATTHEW Perfect. Then you must come. Tell her I’ll be offended if you don’t. INT. HOSPITAL CAR PARK - EVENING 24 Steven approaches his car. The car park is fairly dark. Steven gets into his car and switches on the engine. As he pulls away, he sees a figure moving behind some parked cars. It looks like Martin. He’s wearing the same jacket as Martin, but we can’t see his face. As Steven drives towards him, the figure runs towards the fire escape, opens the door, and disappears. INT. MARTIN’S HOUSE - NIGHT 25 Steven, Martin and MARTIN’S MOTHER have just finished dinner. Martin’s mother is around 45 years old, a little plump, and has a beautiful face. She is dressed rather formally and is heavily made up. The living room is spacious and decorated in a conventional style. Everything is just so. Martin drains a glass of lemonade. His mother clears away the dishes and takes them into the kitchen.  24.",
      "characters": [],
      "action_text": "STEVEN Did you come to the hospital today? MARTIN No. I was at school, then I went to the gym and my French class. Weren’t you at the hospital today? STEVEN I was, but I was really busy. I just wondered whether you came by and couldn’t find me. Martin’s mother returns. MARTIN I’d like us to watch a film together, if you don’t mind. MARTIN’S MOTHER I’d gladly watch a film. STEVEN I’m afraid I have to be getting home soon. I can’t be out too late. I didn’t tell my wife I’d be late tonight and she might get worried. MARTIN’S MOTHER You could call her. In any case, if you feel tired we can stop the film, you can go home and we can watch the rest next time you come. MARTIN Please. We’ve rented my favourite film. It was my father’s favourite film too. INT. MARTIN’S HOUSE - NIGHT 26 Steven, Martin, and Martin’s mother are sitting on the sofa watching the film. She looks rapt. Martin yawns. MARTIN I think I’ll go to bed. I’m tired. Besides, I’ve got to get up early tomorrow to finish my homework. I’m sorry I can’t watch the end of the film with you. He gives them both a kiss and hug. MARTIN (CONT’D) Good night.  25. MARTIN’S MOTHER Good night. STEVEN Good night. Sitting on the sofa side by side, Steven and Martin’s mother carry on watching the film for a while. MARTIN’S MOTHER He really loves you, you know. He talks about you a lot. STEVEN I love him too. MARTIN’S MOTHER Have you been married long? STEVEN 16 years. MARTIN’S MOTHER You have lovely hands. STEVEN Thank you. MARTIN’S MOTHER Most doctors have beautiful hands. So white and soft and clean. STEVEN Really? MARTIN’S MOTHER Yes. I remember your hands from back when I used to visit my husband at the hospital. In fact, I even told him about your hands and he agreed. “You’re right, he has beautiful hands,” he said. STEVEN Thank you very much. MARTIN’S MOTHER Do you remember me coming to the hospital? STEVEN Of course. MARTIN’S MOTHER I was a bit heavier then. And my hair was brown.  26. STEVEN Yes. MARTIN’S MOTHER I got ",
      "dialogue_count": 0,
      "word_count": 3203
    },
    {
      "scene_number": 3,
      "slugline": "INT. HOSPITAL ENTRANCE - MORNING 41 Anna and Bob are walking towards the exit. The moment they step outside, Bob collapses to the ground. His mother bends down and tries to lift him up. She calls for help and two NURSES rush over. They lift Bob into a wheelchair. INT. HOSPITAL - MRI SCANNER ROOM - MORNING 42 Bob is lying inside an MRI machine. Steven and Anna watch from behind a glass window. Dr. Nichols is taking notes. INT. HOSPITAL - PATIENT’S ROOM - NIGHT 43 Bob is sleeping. Anna sits beside him. Steven stands talking to Matthew. There is a second bed in the room, but it is empty. MATTHEW You don’t have to operate tomorrow. Cancel everything. STEVEN No. Why would I cancel? The schedule would go haywire. There’s no need. Anyway, it’s nothing. The door opens and Dr. Nichols walks in. ANNA Any news, Andrew? DR. NICHOLS MRI and MRA both fine. Blood work came back good. Cardiogram, chest X- ray and carotid ultrasound all clear. STEVEN I told you. I knew it. ANNA Thank goodness for that. DR. NICHOLS Has he been under any psychological stress lately? Exams at school maybe? STEVEN Yes. ANNA No, he wasn’t stressed, he was just fine. He’s always a bit anxious, but that’s just the way he is.  39.",
      "characters": [],
      "action_text": "DR. NICHOLS In my opinion, he should stay in tomorrow as well so that we can keep an eye on him. ANNA Maybe we should give him a PET scan? STEVEN I don’t think there’s any need for that, do you Andrew? Tomorrow he’ll be well enough to walk all the way home. DR. NICHOLS Yes, I don’t think that’s necessary at this point. Let’s see how things are tomorrow and take it from there. There’s nothing to worry about, in my opinion. You go home and we’ll speak tomorrow. I’ll be here all day. Anna, it was great seeing you, even under these circumstances. ANNA And you, Andrew. How’s your daughter? DR. NICHOLS She got married last year. I’m a grandfather now. ANNA Give her my love. DR. NICHOLS I will. Good night. STEVEN Goodbye, Andrew. Thanks for everything. MATTHEW Do you want me to let them know that you won’t be operating tomorrow? STEVEN I said no. Don’t go on about it. ANNA That won’t be necessary, Matthew. I’ll come in the morning. I won’t go in to the clinic. I’ll bring him those cinnamon doughnuts he loves so much.  40. STEVEN Yes, I’m sure he’ll be thrilled. EXT. ROAD - NIGHT 44 Martin is riding his friend’s motorbike. Kim sits behind him, holding on tight. Neither of them are wearing helmets. Martin focuses all his attention on the road. Tears are streaming down Kim’s face, but it’s impossible to tell whether it’s from the wind or if she’s crying for some other reason. EXT. STEVEN’S HOUSE - GARDEN - NIGHT 45 Anna is watering the plants. Kim comes out into the garden. ANNA Where were you? KIM At Claire’s. Is Dad asleep? ANNA Yes. KIM How’s Bob? ANNA Bob is absolutely fine. They’ve just kept him in as a precaution. Kim looks at her mother for a while without saying anything. KIM How are you? ANNA I’m fine. How do you mean? KIM I mean are you tired? ANNA I’m absolutely fine. A little tired, that’s all. KIM Okay. ANNA See you in the morning. Oh, and while Bob’s in the hospital, you’ll be responsible for watering the plants. Okay? Kim walks away without answering.  41.",
      "dialogue_count": 0,
      "word_count": 590
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOSPITAL - CORRIDOR - MORNING 46 Steven, dressed in his white doctor’s coat, and Anna, holding a box of doughnuts, are walking down the corridor. It is rush hour at the hospital. They both greet various people as they walk along. ANNA Did he go to the toilet? Did he get up? STEVEN He hadn’t when I passed by about an hour ago. He didn’t want to. ANNA He didn’t want to pee or he hadn’t got up? STEVEN He didn’t want to pee. ANNA Could he get up? STEVEN He was asleep. I didn’t want to drag him out of bed. They stop outside the door to Bob’s room. INT. HOSPITAL - PATIENT’S ROOM - MORNING 47 Steven and Anna enter Bob’s room. Martin is already there, sitting next to Bob’s bed. Martin stands up. MARTIN Good morning, Doctor. How are you Mrs. Murphy? I just came by to see Bob. Kim told me what happened. ANNA Hello, Martin. How nice of you. Hi darling, good morning. Did your friend Martin come to see you? Bob does not reply. MARTIN I’ll leave you alone now so that you can spend time with him too. I have to go anyway. I’ll come by and see him again some other time, for sure. I offered to help him go to the toilet but he didn’t want me to and he wet the bed. I brought some lemonade. Mum made it yesterday. (MORE)  42.",
      "characters": [],
      "action_text": "Try it and let me know what you think. STEVEN Thank you very much. Anna goes over to Bob. ANNA Darling, do you know what’s in this box? BOB What? ANNA Cinnamon doughnuts, that’s what. Martin goes over to Steven. Anna pulls off the sheets and folds them up. MARTIN I’ll be in the canteen. Come whenever you can. STEVEN I don’t think I’ll have time today, as you might imagine. We’ll talk some other time. MARTIN No. Today. Come to the canteen. Just for ten minutes. Don’t stand me up like last time. Goodbye Mrs. Murphy. Bye, Bob. Martin leaves. We hear Anna saying goodbye as we watch him go. INT. HOSPITAL CANTEEN - AFTERNOON 48 Martin is waiting in the hospital canteen. Steven appears. The canteen is packed with doctors, nurses and patients, seated at the tables. MARTIN Coffee? Apple pie? STEVEN I’ve only got ten minutes. I have to be back upstairs in ten minutes max. MARTIN Okay. I’ll get straight to the point. I’ve brought you a present. MARTIN (CONT'D) (MORE)  43. You’ve given me so many presents and I’ve never given you anything. I thought that was rude of me. So I decided to make amends. Close your eyes. Steven does not close his eyes. MARTIN (CONT’D) Please close your eyes. Steven, losing patience, closes his eyes. Martin places a small box in his hand. Steven opens his eyes and sees the box. MARTIN (CONT’D) It’s a Swiss army knife. The boy puts his hand over his mouth, mortified. MARTIN (CONT’D) I shouldn’t have told you that. I messed it up. I ruined the surprise. I’m sorry. STEVEN Thank you very much, Martin. MARTIN What an idiot. STEVEN It doesn’t matter. Thank you very much. A PARAMEDIC approaches the doctor. PARAMEDIC Good afternoon, Doctor. STEVEN Hello, Justin. PARAMEDIC I got the car. Second-hand, but still. Blue. I couldn’t find it in silver. STEVEN That’s great. You’ll have to take me for a ride in it soon. PARAMEDIC Yeah, sure. See you later. The paramedic walks away. MARTIN (CONT'D)  44. MARTIN That reminds me, did you do anything about that motorbike I",
      "dialogue_count": 0,
      "word_count": 2215
    },
    {
      "scene_number": 5,
      "slugline": "INT. HOSPITAL - ULTRASOUND ROOM - NIGHT 58 Tired but wired, Steven stands next to a doctor who is giving Bob an abdominal ultrasound. DOCTOR Take a deep breath and hold it for a few seconds. Good. INT. HOSPITAL - CORRIDOR - NIGHT 59 Steven pushes Bob back to his room in the wheelchair. Bob is shattered, so is Steven. Abruptly, Steven stops pushing the wheelchair, lifts Bob up with both hands, puts his arms around him and walks him down the corridor, with the drip trailing behind them. Steven lets go of Bob and he falls to the floor. Steven picks him up again. He kneels down in front of his son. STEVEN Bob, why don’t we play a game? BOB What game? STEVEN I’ll tell you a secret, something I’ve never told you before, and then you’ll tell me one. And whoever tells the best secret wins. Okay? When I was your age I’d just started masturbating and I’d only just started ejaculating. Only a little, barely a drop. I was worried that I had some kind of problem because at school I’d heard all sorts of stories. Then one day when my father had had a lot to drink and my brothers were out and he was sleeping in the bedroom, I crept inside, put my hand on his penis and started stroking it until he ejaculated. The sheets got covered in sperm. I got scared and ran out. I’ve never told anybody that before. Now it’s your turn to tell me a secret. Bob stares at his father, dumbstruck. An awkward silence. BOB I don’t know. I don’t have one. STEVEN That’s impossible, you must have one.  52.",
      "characters": [],
      "action_text": "BOB I don’t. STEVEN Bob, if all this is just an act, you should know that if you tell me now, I won’t punish you and neither will your mother. We won’t be angry with you either. BOB It’s not an act. STEVEN But if it is an act and you don’t stop this stupid joke right this minute, your punishment won’t just be no TV for a month. I will take my electric shaver and I will shave your head and I will make you eat your hair. I mean it, I will literally make you eat your hair. I’m not kidding. BOB It’s not an act. Steven puts Bob back into the wheelchair in silence. INT. STEVEN’S OFFICE - HOSPITAL - MORNING 60 Steven is asleep at his desk. His hair is tousled and his tie is undone. The door opens and Anna walks in. Steven wakes up. Anna hands him a takeaway coffee. They don’t say anything. Steven has nothing to report. ANNA I brought you a clean shirt. She takes a shirt out of her bag and hangs it up inside the locker where Steven keeps his lab coat. STEVEN Thank you. ANNA Anything to tell me? Steven shakes his head. ANNA (CONT’D) Hungry? Want me to bring you something to eat?  53. STEVEN No, thank you. Maybe you were right. Maybe it’s all psychological. ANNA Everything will be all right, you’ll see. Trust me. We’re in this together and everything will be all right. Let’s go and get you something to eat and some fresh air and then we’ll go up and see the little one. INT. SCHOOL - REHEARSAL ROOM - DAY 61 Kim is singing in the choir. A middle-aged man, the CHOIRMASTER, is conducting the orchestra. Suddenly, Kim falls down. At first, everybody around her carries on singing. As fear ripples through the choir, everyone gradually falls silent and the music stops. The choirmaster rushes over to see what has happened. INT. HOSPITAL - CORRIDOR - AFTERNOON 62 Anna is sitting outside Bob’s room, crying. Matthew hugs her. A nurse comes out of the room, pushing a food trolley. INT. HOSPITAL - PATIENT’S ROOM - AFTERNOON 63 Kim and Bob are lying in adjacent beds. Steven is feeding Kim pi",
      "dialogue_count": 0,
      "word_count": 990
    },
    {
      "scene_number": 6,
      "slugline": "EXT. HOSPITAL GROUNDS - NIGHT 66 Anna is sitting on the steps outside the hospital. Steven stands beside her. He appears rather sheepish and speaks in a low voice. He avoids looking Anna in the eye. ANNA How old was his father when he died? STEVEN 46. ANNA Had you been drinking that day? STEVEN He had an arrhythmia, a stroke, and that was it. ANNA I asked whether you’d been drinking, not how he died. How long has this been going on? How long have you been seeing this boy? STEVEN About six months. ANNA Where were you meeting? STEVEN What does it matter? ANNA Where were you meeting him? STEVEN At a Burger King, then we’d drive to the seaside. He’s got issues, serious psychological issues. He always did. I knew he acted weird sometimes, but now he’s lost it completely, he’s become dangerous. We have to take precautions. Go to the police and take some precautions. ANNA You’re not going to the police. You’re not going to tell anyone. There’s no point. We’ll wait and see. Had you been drinking when you operated on his father?  56.",
      "characters": [],
      "action_text": "STEVEN Only a little. That had nothing to do with the outcome. A surgeon never kills a patient. An anaesthetist can kill a patient, but a surgeon never can. For example, Matthew has made mistakes that led to the death of a patient, but I never have. Anna turns her head away. She doesn’t say anything. STEVEN (CONT’D) I think Bob is a little better today. He seemed in a better mood and he wasn’t so pale. Anna does not respond. ANNA Why didn’t you tell me you were seeing him? STEVEN At first I didn’t see him that often, it was only recently that we started meeting more regularly. I was going to tell you at some point. I felt sorry for him. I gave him some money. His mum is out of work. ANNA I’m going upstairs. Anna gets up and leaves. Steven stands there for a while, alone with his thoughts. Then he follows his wife into the hospital. INT. STEVEN’S HOUSE- BATHROOM - DAY 67 Steven takes a shower. INT. STEVEN’S HOUSE - BEDROOM - DAY 68 Steven sits on the edge of his bed, naked and numb. His gaze is vacant - he looks completely blank. The room is relatively dark. The curtains are drawn. Steven stands up and hurriedly gets dressed. EXT. STEVEN’S HOUSE - FRONT DOOR - DAY 69 Steven emerges from the front door of his house and finds an envelope on the doormat, with his name written on it. He opens the envelope.  57. Inside is the watch he had given Martin, with a note. One of the watch straps is missing. Snapped off. Steven looks inside the envelope for the missing piece of leather, but it is not there. The note, written in very neat handwriting, reads: “Time shows no mercy. By the way, you were right. Metal straps are better. Leather straps break.” INT. HOSPITAL - PATIENT’S ROOM - DAY 70 Anna is sitting next to Bob’s bed. Kim is lying on her back on the other bed. She is playing a game on her mobile phone. Her legs are covered from the knees up with a sheet. Her toes are pointed. Exhausted, Anna rests her head on the metal bed frame. She strokes Bob’s legs. BOB When are we g",
      "dialogue_count": 0,
      "word_count": 2119
    },
    {
      "scene_number": 7,
      "slugline": "EXT. HOSPITAL ENTRANCE - NIGHT 77 The Hospital Director is saying goodbye to the visiting consultants. Steven and Anna also say goodbye. The consultants get into a car and drive off. The Hospital Director gives Steven a hug and pats him on the back. HOSPITAL DIRECTOR So, I don’t see any reason for the children to stay in hospital. STEVEN You mean you think you’ve done everything you can? HOSPITAL DIRECTOR Yes, Steven, I believe we have done everything we can. STEVEN Sorry, but if I was running this hospital I would feel like a complete failure. A loser. I wouldn’t be able to sleep at night. The Hospital Director looks at Steven then walks away. HOSPITAL DIRECTOR Good night, Anna. ANNA Good night, Ed. Anna looks at her husband. ANNA (CONT’D) I suggest you sign the release forms tomorrow and then they can go home. INT. HOSPITAL - CORRIDOR - NIGHT 78 Anna marches angrily along the corridor. Steven follows, trying to catch up. Suddenly, Anna falls over. Steven panics. Anna gets back up. ANNA I tripped. It’s nothing. My shoelace was undone. I tripped. She gets up and carries on walking, leaving Steven standing there. She is almost running.  65.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 203
    },
    {
      "scene_number": 8,
      "slugline": "INT. CAFETERIA - MORNING 79 Anna is sitting at a table, waiting. The cafeteria is almost empty. It doesn’t seem like the kind of place where Anna would normally choose to go. She is well dressed, but looks drained. Matthew comes over to the table. He kisses Anna on the cheek and sits opposite her. She wavers for a moment before she starts speaking. MATTHEW Good evening, Anna. ANNA Good evening, Matthew. Sorry to bother you. MATTHEW It’s no bother, really. ANNA As I said on the phone, I’d rather Steven didn’t find out about us meeting like this. MATTHEW He won’t. I’m listening. ANNA Four years ago, you were operating as a team, weren’t you? I mean four years ago, you were the anaesthetist on some of Steven’s operations? MATTHEW Of course. ANNA Were you the anaesthetist for Jonathan Lang? Matthew leans back in his chair and pretends rather unconvincingly that he is trying to place the patient’s name. The waiter arrives with the coffee that Anna has ordered. Their conversation is interrupted. MATTHEW A gin and tonic, please. The waiter leaves. MATTHEW (CONT’D) Who’s Jonathan Lang? ANNA Male, 46 years old, one of Steven’s patients. He died on the operating table.  66.",
      "characters": [],
      "action_text": "MATTHEW Anna, there have been so many patients over the years, so many operations. I don’t remember him, I’m afraid. I’m sorry. ANNA Can you find his file in the records and bring it to me, please? I’ll give it straight back to you. I just want to have a look at his medical history. And the cause of death. MATTHEW I don’t think that will be possible. I’m sorry, Anna. I can’t just take a file from the hospital. Why do you need it? ANNA Please. MATTHEW Look, I can’t bring you the file but I can tell you a couple of things about the case. I remember him now, I put him under. But what do I get in return? ANNA What you didn’t get that day we came for lunch. MATTHEW When? ANNA Now. Had Steven been drinking? MATTHEW Yes. ANNA Can it be considered his mistake? MATTHEW Yes. It definitely wasn’t mine, that’s for sure. You know an anaesthetist is never to blame for the bad outcome of an operation. The surgeon is responsible. He’d had two drinks that morning before we went in to prepare. Luckily none of the others realised, I was the only one who knew. But that wasn’t exactly unusual back then. (MORE)  67. You know that. He was drunk during almost every operation. ANNA Do you remember Lang’s case history? Matthew leans forward in his chair again and rests his arms on the table. EXT. DESERTED ROAD - MORNING 80 Matthew’s car is parked on a deserted road on the edge of town. There are no pedestrians and very few cars. Anna stares straight ahead as she jerks off the anaesthetist. He pushes his seat back to the reclining position. As soon as he comes, he pulls the chair forward, starts the engine, and they drive off. EXT. STEVEN’S HOUSE - FRONT DOOR - AFTERNOON 81 The front door is open. The children are being carried into the house with the help of two paramedics. Steven seems fairly optimistic as he manically rushes about, supervising the procedure. INT. KIM’S BEDROOM - AFTERNOON 82 Kim’s bedroom has been rearranged to accommodate both the children’s beds. The room is bright, the ",
      "dialogue_count": 0,
      "word_count": 1426
    },
    {
      "scene_number": 9,
      "slugline": "INT. STEVEN’S HOUSE - BASEMENT - MORNING 87 Steven and Anna head down to the basement. Steven unlocks the door. They enter a fairly large room full of random garden furniture. It is dark and dirty. The light goes on - a small bulb that faintly illuminates the space - and we see Martin huddled in a corner. He is sitting in an old armchair. His feet are bound together with gaffer tape and he is chained to a pipe in the corner of the room. His hands are tied in front of him. Martin’s face is bloodied and swollen. There is a rifle on the table. Anna looks at Martin and then walks over to the table. She turns to face Steven. Anna does not move. She looks at Martin. Martin looks up and holds her gaze. It’s hard to tell whether he is angry or afraid. He raises his hand and wipes some blood off the side of his mouth. STEVEN You remember Martin, don’t you? He came over for a play date, but I told him the kids are feeling a little unwell, so he’ll just have to wait here until they get better. Anna, go upstairs and make me some of that lemonade he likes so much, would you? I’ll stay here and keep him company. Off you go. Anna hesitates and then leaves. She closes the basement door behind her. We hear her footsteps on the stairs. MARTIN Let me go. My mother will be worried sick. STEVEN Do you think your mother is proud of you, Martin? Do you think she is happy that her beloved son is a murderer? MARTIN Murderer. There’s no need for such a dramatic, sensational, old- fashioned word. But if you insist, the murderer, both in my father’s case and our current situation, is not me. STEVEN Stop talking.  72.",
      "characters": [],
      "action_text": "MARTIN Don’t you understand that you’re wasting time? You don’t have much time left. STEVEN I said stop talking. MARTIN Steven, you’ll feel better once it’s done. You can start over, a clean slate, don’t you get it? Sometimes I think you might just be a fool who can’t understand the significance of the gift I am offering. Sometimes I think you’re naive. But you can’t be. You’re a good scientist, you can’t be an idiot. If I’d only just met you I’d seriously question the depth of your judgement. Steven strikes the boy across the face. Martin grabs his hand and holds it tight. MARTIN (CONT’D) Don’t move. I just want to give you an example, that’s all. I’ll give you one little example so that you understand what I mean. Martin bites Steven’s arm. Blood trickles down his hand. Steven screams. MARTIN (CONT’D) Should I apologise? No. Should I stroke your wound? No way. That would probably hurt even more, touching an open wound. No. There’s only one way to make you and me both feel better. Martin bites his own arm and spits out a small piece of flesh. His face is contorted with pain but he doesn’t scream. He tries to remain composed. MARTIN (CONT’D) Do you understand? It’s metaphorical, my example. A metaphor. I mean, it’s symbolic. EXT. STEVEN’S HOUSE - GARDEN - MORNING 88 Anna is scrubbing the blood from the back seat of Steven’s car. The dog watches her but she doesn’t pay him any attention. We hear a muffled gunshot. The dog starts to bark.  73.",
      "dialogue_count": 0,
      "word_count": 576
    },
    {
      "scene_number": 10,
      "slugline": "INT. STEVEN’S HOUSE - BASEMENT - MORNING 89 Anna opens the door. Steven has shot Martin in the leg. He is still holding the gun and pointing it at Martin. The boy writhes in agony. STEVEN Shut the door, Anna. Now Martin, you’ll see what it’s like to die. What it’s like when your head cracks open and your brains are blown out. ANNA Steven, don’t shoot him. MARTIN And then? STEVEN Shut up. MARTIN Shoot me. Then what? Answer me. STEVEN I’ll bury you in the garden and you’ll decompose. That’s what. MARTIN You won’t be able to explain it. You won’t understand how it could have happened. You’ll say - “But I only killed one person, how come four people are dead? I only shot one.” You’ll get confused and you’ll start counting again: one, two, three. But the numbers still won’t add up. If you dig a hole in the garden, better make it a big one. Steven walks over to Martin and puts the gun to his head. Anna walks up behind Steven and tries to take the gun out of his hands. At first Steven doesn’t let go, but Anna whispers something in his ear and he releases the gun. Anna calmly takes the gun and walks out of the room. INT. STEVEN’S HOUSE - KIM’S BEDROOM - MORNING 90 Bob is lying in bed. Kim is sitting in a wheelchair, looking out the window. She lights a cigarette and smokes it. She coughs a little. Bob winces in pain.  74.",
      "characters": [],
      "action_text": "KIM Does it hurt? BOB No. Just a little. KIM Just be patient. Dad’s bringing us some painkillers. BOB I know. KIM He didn’t kill him. BOB How do you know? KIM I just do. Anyway, he did the right thing. Otherwise it would have been like killing four people with a single shot. Wouldn’t that be tragic? I’m going to live with Martin. A beat. KIM (CONT’D) I want you to know that I’m really sorry, Bob. I really love you. We all do. Dad does too. But he’s in a really difficult position and he doesn’t have much of a choice. It’s not because he doesn’t love you. BOB They’ve bought me a piano. Mum told me it’ll be here next month. They didn’t tell you so you wouldn’t get scared. KIM Bob, something terrible happened yesterday. I lost the MP3 player that Martin gave me. I don’t know what’s gotten into me, I’ve lost two MP3 players in ten days. So I’d like to ask you a favour. Can I have your MP3 player when you’re dead? Please. Please. Please. INT. STEVEN’S HOUSE - KIM’S BEDROOM - MORNING 91 Bob drags himself over to the desk. He struggles to open the drawer and takes out a pair of scissors.  75.",
      "dialogue_count": 0,
      "word_count": 470
    },
    {
      "scene_number": 11,
      "slugline": "INT. STEVEN’S HOUSE - KITCHEN - MORNING 92 Steven gives the dog some food and water and watches him eat. He notices some blood on his hands and goes over to the sink to rinse them. Bob enters the room. He drags himself along the floor. He has cut his own hair. His face and hands are covered in hair. A Levin tube is inserted into his nose and he is holding a bag of feeding solution. The dog starts to bark as soon as he sees Bob. Bob Look, dad. I cut my hair like you wanted me to. STEVEN Good boy, well done. BOB I’m sorry I didn’t listen to you and get a haircut right away. I don’t know what I was thinking all this time. I would get so hot and I had to comb it all the time. It was a total hassle. I should’ve listened to you and cut it off sooner. Bob drags himself over to the French windows and tries to open the door. BOB (CONT’D) Do you want me to water the plants? Steven goes to him and hugs him. STEVEN No, darling. I watered them this morning. Tomorrow. BOB Dad, I’ve been thinking about it and I’ve decided I want to be a cardiologist, not an ophthalmologist. I lied to mum because I didn’t want her to get upset. I think I prefer what you do, it’s far more interesting and challenging. STEVEN That’s true, Bob. But some people find ophthalmology more interesting. BOB No. Not to me it isn’t.  76.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 262
    },
    {
      "scene_number": 12,
      "slugline": "INT. - STEVEN’S HOUSE - KIM’S BEDROOM - EVENING 93 Steven lays his son in his bed. He tucks him in and strokes his hair. EXT. STEVEN’S HOUSE - GARDEN - NIGHT 94 Steven is huddled behind some flowers. He is sobbing. Eventually, he pulls himself together, wipes his eyes, and walks towards the house. He closes the French windows and switches off the living room light. INT. SCHOOL - CORRIDOR - MORNING 95 Steven is waiting outside the Headmaster’s office. The HEADMASTER’S SECRETARY ushers him inside. Steven gets up and enters the office. INT. SCHOOL - HEADMASTER’S OFFICE - MORNING 96 Steven is sitting in a chair, signing some papers. He gives them to the HEADMASTER. HEADMASTER Sorry for the trouble, dragging you down here. It’s all just a formality, but it has to be done. STEVEN That’s quite all right. I understand. HEADMASTER All the staff and I personally hope that all this is only temporary and that the children will soon be back at school in good health. STEVEN Thank you very much. They’re already much better now that they’re back home. They are having daily physio, we go for walks together every day, they walk slowly of course but they are walking, and they’ve already started eating properly. However, I must inform you that they will need to be off school for a little while longer. HEADMASTER Whatever you think is best. If you feel they are not in a position to attend class yet, very well. (MORE)  77.",
      "characters": [],
      "action_text": "However, do bear in mind that in cases like this it’s generally best for children not to disrupt their daily routine for too long. Attending even some of their classes might do them good. Of course, it’s ultimately your decision. All I can do is share my thoughts with you. STEVEN Thank you very much. But as you know both my wife and I are doctors, and we are quite able to judge when our children are ready to return to school. HEADMASTER Of course. I hope everything works out well. STEVEN I’m very optimistic. Everything will be fine. HEADMASTER That’s the spirit. Steven gets up to go. STEVEN Generally speaking, if you had to compare the two children for some reason, which of the two would you consider the better student? HEADMASTER Well. The boy is very good at maths and physics. Kim on the other hand, apart from her natural aptitude for music, is pretty good at literature and history, areas in which Bob lags behind. She wrote a brilliant essay on the tragedy of Iphigenia which she read out in class. A+. STEVEN What about their behaviour in class? HEADMASTER They’re both a little restless, equally so. I mean I’ve had the occasional complaint from their teachers about some minor misdemeanors, but they’ve never been rude to any of the staff. HEADMASTER (CONT'D) (MORE)  78. In any case, if they had ever acted in an inappropriate way we would have informed you about it. STEVEN Do you especially like one of them more than the other? If you had to choose between them, which would you say is the best? HEADMASTER That’s a difficult question. I’m not sure I can give you an answer. The Headmaster considers his response for a long time. He doesn’t know what to say. Steven has put him in an extremely uncomfortable position. Steven stares at the Headmaster intently, as if his response has enormous significance. HEADMASTER (CONT’D) I don’t know. He thinks about it some more. HEADMASTER (CONT’D) I don’t know what to tell you. STEVEN Never mind. Have a good day. HEADMASTER Goodbye. ",
      "dialogue_count": 0,
      "word_count": 1251
    },
    {
      "scene_number": 13,
      "slugline": "INT. STEVEN’S HOUSE - BASEMENT - NIGHT 103 Steven notices the basement door is open. He goes into the basement and looks around. He goes over to Martin and hits him. STEVEN Where is she? MARTIN She’s gone. STEVEN Where is she? What did you do to her? MARTIN I didn’t touch her. I don’t know where she is. Steven runs out of the room. EXT. ROAD - NIGHT 104 Anna is driving very slowly along the road. Steven walks in front of the car. The high beam headlights illuminate the road. They scan the street for any sign of Kim. Steven is anxious, out of breath. He glistens with sweat. They find Kim dragging herself along the pavement. She tries to cross the road. Her hands and knees are covered with blood. INT. STEVEN’S HOUSE - LIVING ROOM - NIGHT 105 Steven is treating his daughter’s wounds. He puts disinfectant on her cuts. He sews up a gash on her knee. Anna, standing beside him, passes Steven the medical instruments. KIM I’m sorry for what I did tonight. I don’t know what came over me, I don’t know what I was thinking. I was only thinking about myself, noone else. That was wrong of me. I was frightened. Terrified. I shouldn’t have been. Let me be the one who atones for your sins, Dad. Kill me right here, in front of your eyes so you can be sure that I die, in case some fate spares me at the last moment. Kill me right here in front of you and give me the ultimate joy of saving my own mother and my beloved brother from certain death. (MORE)  82.",
      "characters": [],
      "action_text": "A joy that may take the form of death but has none of death’s bitterness, of its chill or darkness. Please Dad, take these scissors and do me the honour. Mum, tell him. Dad, please. I would do anything for you, I would even die for you. And I’m ready to prove it. You gave me life and you, only you have the right to take my life away. That makes perfect sense. You are my lords, my masters and I am just someone who lives to obey your wishes. I love you so much, don’t forget that. Remember that when I’m in my grave, unable to tell you that I love you. I love you more than anything in the world, you and my brother. Steven finishes dressing his daughter’s wounds. He kisses her almost on the mouth and caresses her. Anna leaves the room, taking the bloodied gauzes and cotton wool with her. INT. STEVEN’S HOUSE - KITCHEN - MORNING 106 Anna is sitting in a chair. In front of her is a glass of water. She takes a sip and then puts the glass back on the table. Classical music plays from a radio on the kitchen counter. Steven walks into the room. ANNA Where have you been? STEVEN I went to the hospital. I got the feeding formula. Have you checked on him? Did you give him the sedatives? ANNA I let him go. STEVEN What are you talking about? ANNA He’s not downstairs. I let him go. STEVEN Why would you do that? He hits Anna around the head. STEVEN (CONT’D) Why did you let him go? Tell me. Are you a complete idiot? KIM (CONT'D)  83. Anna walks away. The dog follows her. She stops and turns to face Steven. ANNA It wouldn’t have made any difference, Steven. It wasn’t going to solve anything. We both know that. INT. STEVEN’S HOUSE - CHILDREN’S BEDROOM - NIGHT 107 Anna sits on the edge of Bob’s bed. She has a washbowl next to her and cleans Bob’s limbs with a cloth. She has her back to Kim, who is sitting on her wheelchair beside the bed. Kim is holding her drip. She starts reciting the phrases that her mother has taught her to say when she answers the phone at the clinic. KIM Please descr",
      "dialogue_count": 0,
      "word_count": 1578
    }
  ]
}