{
  "slug": "the-witch-2016",
  "title": "the witch",
  "genre": "drama",
  "format": "film",
  "scenes_count": 5,
  "characters_count": 1,
  "characters": [
    "THOMASIN"
  ],
  "total_words": 16148,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. THE SAME CLEARING - DAWN – NOVEMBER It is now late autumn.   Anorexic CORNSTALKS are scattered across a muddy field. A FLEDGLING FARM sits on top of a hill at the foot of THE WOOD. MONSTROUS TREES loom over THE RAMSHACKLE COTTAGE.   Its crooked clapboards to are beginning to grey and the gabled thatch to brown. Behind the house are a few shoddy structures and scrap-wood fences for keeping in the small amount of livestock.   The frame of the INCOMPLETE BARN looks as if it will collapse at any moment.   Tools and raw lumber littler the yard. INT. FARMHOUSE – MORNING CLOSE ON: THOMASIN.   Her large blue eyes gaze earnestly toward heaven.   Her chin rests on little dirty fingers. She says her words with surprising acceptance: THOMASIN O most merciful father: I here confess I have lived in sin. I have been idle of my work, disobedient of mine parents, neglectful of my prayer. I have, in secret, played upon thy sabbath and broken every one of thy commandments in thought... followed the desires of my own will, and not the holy Spirit.   I know I deserve all shame and misery in this life, and everlasting hell-fire. But I beg thee, for the sake of thy Son. Forgive me.   Show me mercy.   Show me thy light. I thank thee that thou hast defended me this night, and brought me safe unto this day. These and all other graces, I beg at thy hands in that prayer which Christ himself hath taught me: INT. FARMHOUSE – MORNING MED CLOSE: KATHERINE BREAST FEEDS SAMUEL, THE BABY, now 6 months old.  5.",
      "characters": [
        "THOMASIN"
      ],
      "action_text": "(Pause). Peeeeeeep... CUT TO: EXT. THE EDGE OF THE WOOD – DUSK THOMASIN (O.S.) Boo! CLOSE ON: SAMUEL, THE BABY, is lying in the grass. He is stunned, smiling with huge baby eyes and a little wet mouth. HE SQUEALS WITH LAUGHTER! Too adorable! THOMASIN (O.S.) (CONT’D) There you are! There you are! SAMUEL laughs more and more. He is clearly being tickled! CUT TO: BLACK. SAMUEL’S laughter subsides. He breathes heavily, almost panting. He lets out a quiet half-laugh. He sounds worried. THOMASIN (O.S.) (CONT’D) Peeeeeep... CUT TO: THOMASIN (O.S.) (CONT’D) Boo! CLOSE ON: SAMUEL. He shrieks with laughter again! He raises his arms up and down in delight and kicks his legs. CUT TO: BLACK. THOMASIN (O.S.) (CONT’D) (whispered) Where is Sam? Where’s Sam? Where is that little man? (pause).  7.  THOMASIN (O.S.) (CONT'D)  (MORE) Peeeeeeep... CUT TO: LOW CLOSE ON: THOMASIN, kneeling on the ground. She uncovers her big sparkling eyes in the “peek-a-boo” fashion and shouts: THOMASIN (CONT’D) Boo! Her rosy-cheeked face is frozen in joy. Suddenly, her eyes register what is in front of her... Her compelling smile disappears... Her face loses all color... THOMASIN (CONT’D) Sam? CUT TO: CLOSE ON: Nothing. The dead grass where SAMUEL had been lying. All is silent except for THOMASIN’S panicking breath. Where is he? The wind blows. THE CAMERA slowly tilts up through the tall grass and weeds, toward... ... THE WOOD. The wild grass that leads to the edge of THE WOOD is MOVING SLIGHTLY, as if something had just run through it. THOMASIN screams: THOMASIN (O.S.) (CONT’D) Sam! Samuel!! THOMASIN runs into frame and stops, STARING INTO THE OPENING OF THE PRIMEVAL FOREST. IT SEEMS TO BECKON HER. THOMASIN (CONT’D) SAM!!! EXT. THE WOOD – NIGHTFALL The autumn mist is thick. Boney-fingered branches crack in  8.  THOMASIN (O.S.) (CONT’D) the wind. A SMALL HUNCHED FIGURE in a tattered RED CLOAK hobbles quickly through the enormous mossy trees. A distorted old breath comes from under THE RED HOOD, wheezing,",
      "dialogue_count": 1,
      "word_count": 1802
    },
    {
      "scene_number": 2,
      "slugline": "EXT. THE FARM – CONTINUOUS CALEB walks out the door... past a TALL PILE OF STACKED FIREWOOD... past the chopping block and AXE... EXT. THE FARM/CORNFIELD – CONTINUOUS ... He continues toward THE SILHOUETTED FIGURE at the bottom of the hill in the CORNFIELD. It’s WILLIAM. CALEB approaches tentatively. He gently touches WILLIAM’S shoulder... He is startled and turns: He sees his son out of the corner of his eye, peeking through his long thinning hair. HE TURNS AWAY. His smoky voice rumbles: WILLIAM Caleb. CALEB tries to initiate contact. CALEB God give you good morrow. (Pause.) WILLIAM frowns, biting on a his mustache and beard. His coarse hand holds an EAR OF INDIAN CORN. His wide-brimmed hat is in the other. THE CORN IS SHRIVELED, HALF GROWN AND ROTTING. A DISGUSTING MALIGNANT FUNGUS is bursting between its kernels. CHICKENS cluck several yards away. CALEB (CONT’D) All are still a-bed. (Pause.) Save Mother. WILLIAM No ease to rise on a grey day. The Devil holds fast your eyelids. CALEB I’ll wake ‘em.  13.",
      "characters": [],
      "action_text": "WILLIAM Let ‘em be. CALEB looks surprised. WILLIAM (CONT’D) Thy mother’s not slept a night since. WILLIAM looks at the ground. WILLIAM (CONT’D) We can search no longer, Caleb. We cannot. If not a wolf, hunger’d have taken him yet. Pause. WILLIAM looks at the devastated cornfield. Disfigured corpses of infected corn-ears lay upon the grey soil. WILLIAM THROWS THE EAR OF CORN HE HAS BEEN HOLDING WITH ALL HIS MIGHT. It disappears into the hazy dawn. WILLIAM (CONT’D) Let’s to The Wood. CALEB looks very surprised. WILLIAM (CONT’D) I’ve been a-laying traps for some while – before even this new misery. CALEB Within The Wood? WILLIAM Will you not help thy father? CALEB You and mother have always forbad us to set foot there. WILLIAM This is our home now. Fear it not. Eh? Did not we build our house of timbers? (Pause.) We must conquer this wood. It will not consume us. Pause.  14. CALEB Perchance you snared that wolf. WILLIAM Aye. Fetch thy hat, tis bitter cold. WILLIAM smiles hopefully at CALEB again and touches his bare head. CALEB smiles back and runs toward the house. WILLIAM (CONT’D) And the gun. EXT. THE EDGE OF THE WOOD – EARLY MORNING WILLIAM is only a small speck beneath the THREATENING TREES. The thick trunks moan and creak, swaying ever so slightly in the wind. He walks quietly into the darkness of THE WOOD. CALEB stands still, several paces back with FOWLER THE DOG. HE HOLDS HIS FATHER’S MUSKET. CALEB looks up at the high treetops, afraid to enter. FOWLER whimpers a little. WILLIAM calls from within: WILLIAM (O.S.) Caleb! Caleb catches up and crosses THE FORBIDDEN THRESHOLD. EXT. THE WOOD – EARLY MORNING Father and son walk in the early morning mist, FOWLER by their side. Their wooden powder flasks clink and clatter against their bony chests. Grey leaves crunch beneath their feet. A dense pine canopy bristles above them, shadowing the forest floor. CALEB’S LESSON echoes through the trees:  15. WILLIAM Art thou then born holy and righteous? CALEB No, nay! My first ",
      "dialogue_count": 0,
      "word_count": 5446
    },
    {
      "scene_number": 3,
      "slugline": "EXT. THE WOOD – EARLY MORNING The Wood is still dark. THOMASIN rides BURT. CALEB is on foot, holding the reins and leading the way with his flickering lantern. FOWLER trots along beside them. CALEB has the musket. The match-cord is lit. EXT. ANOTHER PART OF THE WOOD – MORNING CALEB finds one of THE TRAPS by THE LARGE OVERTURNED TREE. He bends down. THOMASIN Well? CALEB turns to her with a smile! They’ve made a catch! EXT. ANOTHER PART OF THE WOOD – DAY CALEB and THOMASIN move now with a swifter, more assured pace. A muskrat and other small game hang from the horse’s tack. Their spirits are light: THOMASIN Aye but we did! CALEB Nay. THOMASIN We did. CALEB No! THOMASIN We had glass windows in England. We have not been hither so long that you can forget that? CALEB As you like, Thomasin. THOMASIN You’ve gone mad!  49.",
      "characters": [],
      "action_text": "CALEB - THOMASIN We did. CALEB - THOMASIN Dost not remember Fowler laying on the floor i’the sun? You must! And the curious-curled shadows upon his back...? CALEB Nay. THOMASIN You do! And where the sun would shine, would he warm himself.(to Fowler) Wouldn’t you, thou idler? Remember once he lay upon the table, and Father saw him and he saith “we will have him for meat! Kate, Kate! We will roast this beast”(she laughs).   You must remember that! CALEB I remember that day, but no glass. Pause. THOMASIN Well... THOMASIN is very frustrated that Caleb cannot remember... and finds herself surprisingly emotional about this window. THOMASIN (CONT’D) ...it was pretty. Suddenly, FOWLER starts tracking something. CALEB What is’t boy? FOWLER POINTS: CALEB and THOMASIN look ahead.  50. Standing about fifty yards before them is same giant HARE from yesterday! BURT IS SPOOKED. He neighs and clomps around, kicking up dirt and tossing his head up oddly. THOMASIN holds tight to the work saddle. CALEB tries to keep his footing. CALEB (CONT’D) Burt, calm thee. THOMASIN pats BURT to calm him and CALEB gives her the reins. THE HARE stays motionless, looking straight at CALEB. CALEB carefully prepares the musket. He takes aim... He shouts: CALEB (CONT’D) Fowler, thence! FOWLER RUNS toward THE HARE, barking loudly! BURT neighs again, going rampant, nearly knocking THOMASIN off. THOMASIN Burt! THE HARE RUNS DEEP INTO THE WOOD! FOWLER FOLLOWS HIM AND DISAPPEARS! CALEB Fowler Nay! Fowler! CALEB RUNS AFTER FOWLER! HE SHOUTS BACK TO THOMASIN AS HE RUNS: CALEB (CONT’D) Stand here with Burt! BURT IS STILL ACTING FRANTIC! THOMASIN Caleb, he’s gone mad! CALEB (overlapping) I’ll straight back! BUT IT IS TOO LATE...  51. THE HORSE REARS AND BUCKS AGAIN, KNOCKING THOMASIN TO THE GROUND AND GALLOPS OFF IN THE OPPOSITE DIRECTION OF FOWLER! THUD! THOMASIN IS LEFT UNCONSCIOUS ON THE FOREST FLOOR. EXT. ANOTHER PART OF THE WOOD – LATER CALEB travels deeper into The Wood, running. THE TREES have become more",
      "dialogue_count": 0,
      "word_count": 812
    },
    {
      "scene_number": 4,
      "slugline": "EXT. ANOTHER PART OF THE WOOD – DUSK THOMASIN clumsily weaves through crackling branches. Daylight is waning. She breaths heavily, trying to run, but she is exhausted. All of a sudden, she hears something faint... voices! They are almost inaudible: WILLIAM (O.S) Caleb! Thomasin! KATHERINE (O.S.) Caleb! She picks up her pace! EXT. A WINDING PATH – DUSK CALEB trudges through a strange winding path of dense, twisting, vines and thorns. He tries to run, but the rain, fog, and spiky terrain slow him down. His stockings get caught on some thorns. He recoils in pain and drops THE MUSKET. He tries to disentangle himself, further cutting his fingers and legs. He tries to pick up the musket but it is caught in THE THORNS. He pulls and pulls and it only makes things worse. His hands bleed more. He is crying. IN THE DISTANCE IS A SWEET MELODY. A WOMAN HUMMING. He turns his head to find where the music is coming from. A few yards in front of him is THE HARE! THE HARE JUMPS AWAY. CALEB FOLLOWS, LEAVING THE MUSKET IN THE RAIN. EXT. THE EDGE OF THE WOOD – THE NEXT MOMENT THOMASIN comes to the edge of the tree line and sees her  54.",
      "characters": [],
      "action_text": "father in the last light of dusk. THOMASIN Father! Father! He hears her and runs toward her! WILLIAM Thomasin! They meet, WILLIAM picks her up in his arms. WILLIAM (CONT’D) Thomasin! My girl. He hugs her tight in the rain.   He rubs his cheek on hers. WILLIAM looks into her glassy eyes: WILLIAM (CONT’D) Where is thy brother? EXT. WITCH’S HOVEL – DUSK CALEB emerges from the barbed path to see a faint warm light. The humming is more distinct. Through the mist and rain THE WITCH’S HOVEL becomes visible: The pointed structure sits up high on four knotted tree trunks. Matted branches overhang its sagging moss-grown thatch-roof, upon which there is no chimney, just a hole puffing smoke. The whole thing looks held together by ill- omened weeds, plants, and sinister roots that grow all over and through the muddy walls like a plague. A rotting foot-ladder leads up to the slightly open front door. Firelight glows from within. CALEB continues to walk toward the humming. THE HARE is nowhere to be seen. He stumbles through a large FIRE PIT with BONES strewn about the ground. Rain plinks on a huge IRON CAULDRON in the center of the pit. Just then, THE DOOR opens wider... CALEB stops short. Out steps a BEAUTIFUL WOMAN (20s) IN A RED CLOAK. She smokes a small CLAY PIPE.  55. CALEB steps back. He is soaking wet. He tries his best to stop crying, to no avail. THE WOMAN comes forward and her very dirty, but dainty, bare foot takes one step down the foot ladder. She leans forward. She reaches her arms out sympathetically toward CALEB. Her face is greasy, but stunning. Her filthy bodice is cut quite low. There are a few small moles on her ample breast. CALEB sees this all. He stays still. The rain falls. THE WOMAN beckons him. CALEB walks toward her, he is drawn to her.   He can’t help it. She crouches on the foot ladder. CALEB is now face to face with her. She smiles at CALEB. Some of her teeth are crooked and browned near the gums, it is startling, but she is beautiful all the same. S",
      "dialogue_count": 0,
      "word_count": 5694
    },
    {
      "scene_number": 5,
      "slugline": "EXT. FARMHOUSE – NIGHT THE FARM waits quietly in the moonlight. No one is outside. No candle light creeps through the cracks in the door. The wind blows. Brittle branches rattle and snap. The tall trees creek and moan. Far away is the faintest sound of: “clickety-clackety- clickety-clackety-clickety-clackety-clickety-clackety.” It echoes through the forest and the farm. INT. GOAT SHED – NIGHT JONAS AND MERCY lie awake in the hay and straw with the sleeping goats. THOMASIN is asleep on the other side of the shed. “Clickety-clackety, clickety-clakety” THE TWINS HEAR IT... IS IT GETTING LOUDER? THEY CLUTCH EACH OTHER TIGHT. INT. FARMHOUSE, CANOPY BED – NIGHT KATHERINE lies on her pillow half asleep. SHE FAINTLY HEARS A GIGGLING BABY. She opens her eyes. It is utterly black. She gets out of bed, fumbling to light a taper. She puts it to a dying ember and the taper illuminates her face. In front of her is THE SILVER CUP! How can this be? She leans toward it... THE BABY GIGGLES again. SHE GASPS AND TURNS behind her: CALEB sits on a stool holding SAMUEL on his lap. They are clean and healthy, and illuminated by a dim ethereal light.  92.",
      "characters": [],
      "action_text": "SAMUEL wears a christening gown. KATHERINE gets up and goes to them. CAMERA STAYS ON KATHERINE: KATHERINE My lambs. My angels! Her face glows with joy! Her happy tears wash the grief from her face. She is beautiful. CALEB (O.S.) (whispering) Mother. We have longed to see you so. THEY EMBRACE. KATHERINE goes to her knees and looks up at CALEB. She takes SAM from his arms. SHE laughs! KATHERINE As I to thee! Her eyes light up. KATHERINE (CONT’D) I must wake thy father! He will be so glad- CALEB (O.S.) (whispering) ) No, let him sleep. CALEB strokes her hair. INT/EXT. GOAT HOUSE – NIGHT JONAS and MERCY clutch each other. The wind blows. The clickety-clackety through the trees has grown louder. Closer. Pause. The clickety-clackety comes again, this time they can hear the branches breaking off and falling upon the roof of the goat shed and on to the ground right next to them. Then they hear a light THUMP on the grass.  93. Now footsteps in the grass. They see SHADOWS moving through the wooden slats of the goat shed. They hear a SCRATCHING on the wall of the shed. Someone is trying to open the door. A figure scuttles around the shed. They hear the sound of something burrowing or digging. INT. FARMHOUSE – NIGHT CALEB (O.S.) (whispering) We would see you oft mother. Would that please you? KATHERINE Aye. CALEB (O.S.) (whispering) I have brought a book for you, Mother. Will you look at it with me? KATHERINE Aye. KATHERINE (CONT’D) One moment yet, Samuel is hungry. Come come, my little Sam. KATHERINE PUTS SAM TO FEED AT HER BREAST. She smiles and closes her eyes. She holds up the back of his head. She feels at home again. EXT. GOAT SHED – NIGHT MERCY and JONAS see something in the shed crawling around with them. They are squeezing each other’s arms in fear. Jonas lets out a whimper: JONAS Flora? Flora? Pause.  94. There is something near the nanny goats. JONAS (CONT’D) Girl? THEY MOVE EVER SO SLIGHTLY CLOSER. THEY GO CLOSER. THERE IS SOMETHING UNDER FLORA MOVING AROUND RHYTHMI",
      "dialogue_count": 0,
      "word_count": 2394
    }
  ]
}