{
  "slug": "the-fault-in-our-stars-2014",
  "title": "the fault in our stars",
  "genre": "drama",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 6,
  "characters": [
    "DR. MARIA",
    "HAZEL",
    "GUS",
    "MICHAEL",
    "MAN IN PAJAMAS",
    "VAN HOUTEN"
  ],
  "total_words": 26684,
  "total_dialogue": 21,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HAZEL’S HOUSE - BACKYARD - NIGHT 1   1  HAZEL GRACE LANCASTER (16) lies in the grass, staring up at  the stars. We’re CLOSE ON her FACE and we hear:  HAZEL (V.O.)  You have a choice in this world, I  believe, about how to tell sad stories.  CUT TO a SERIES OF QUICK IMAGES:  EXT. RESTAURANT - NIGHT 2   2  Hazel and the BOY we will come to know as AUGUSTUS “GUS”  WATERS (17) at an outdoor restaurant in some magical place.  [ Though we DO NOT SEE HIS FACE, the impression we get is that  the two of them look very much the perfect Hollywood couple.]  HAZEL (V.O.)  On the one hand, you can sugar coat - the  way they do in movies and romance novels.  EXT. RIVERBANK - NIGHT 3   3  “Perfect” Hazel and “Perfect” Gus in a GONDOLA in some  foreign country. She rests her head on his shoulder. Again,  we cannot get a good look at him.  HAZEL (V.O.)  Where villains are vanquished and...  heroes are born and...  INT. ANNE FRANK HOUSE - DAY 4   4  “Perfect” Hazel and “Perfect” Gus kiss in an unmarked room.  The CAMERA favors Hazel. Gus remains unseen.  HAZEL (V.O.)  ... beautiful people learn beautiful  lessons...  INT. HOTEL ROOM - NIGHT 5   5  “Perfect” Hazel and “Perfect” Gus fall onto a bed together.  Though we still don’t see Gus, the love in her eyes for him  is unmistakable.  HAZEL (V.O.)  ... and nothing is too messed up that  can’t be fixed with an apology and a  Peter Gabriel song.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 259
    },
    {
      "scene_number": 2,
      "slugline": "EXT. HAZEL’S HOUSE - BACKYARD - NIGHT 6   6  BACK TO Hazel on the grass, still watching the stars. Were  those dreams or were they memories? Still unclear.  HAZEL (V.O.)  I like that way as much as the next girl,  believe me. It’s just not the truth.  Hazel closes her eyes.  HAZEL (V.O.)  This is the truth.  And EVERYTHING GOES BLACK. We HEAR:  HAZEL (V.O.)  Sorry .  FADE IN ON:  INT. DOCTOR’S OFFICE - DAY 7   7  The real Hazel is no less beautiful than the one we just saw.  HAZEL (V.O.)  Late in the Winter of my 17th year...  There are, however, some key and obvious differences.  First , you’ll notice the OXYGEN TUBE in her nostrils which  help her to breathe.  Second , you’ll notice her hair - which we couldn’t see in the  grass. It’s much shorter than the “Perfect” version, the  result of someone whose head was completely shaved a few  years before.  HAZEL (V.O.)  ... my mother decided I was depressed.  HAZEL  I’m not depressed.  Hazel’s legs dangle over the side of an exam table. Her  mother FRANNIE (early 40s, younger than she feels) explains  to the oncologist, DR. MARIA:  FRANNIE  ... she eats like a bird. She barely  leaves the house,  The Fault In Our Stars   Pink Draft   8/21/13   2.  (CONTINUED)",
      "characters": [],
      "action_text": "HAZEL  I’m not depressed.  FRANNIE  ... she reads the same book over and  over...  DR. MARIA  She’s depressed.  HAZEL  I’m not depressed!  Off her look, CUT TO:  QUICK SEQUENCE, which play over:  HAZEL (V.O.)  The booklets and web sites always list  depression as a side effect of cancer...  INT. SHOPPING MALL - DAY 8   8  Filled with TEENAGE GIRLS - gossiping, laughing - being  teenage girls, basically. And here’s Hazel. With her Mom. And  her oxygen tank. Just another day.  HAZEL (V.O.)  Depression’s not a side effect of  cancer...  INT. HAZEL’S LIVING ROOM - DAY 9   9  She sits watching game shows in the middle of the afternoon.  Her Mom brings her a sandwich. A glass of water. And a whole  host of prescriptions. Hazel eyes them with indifference.  HAZEL (V.O.)  ... it’s a side effect of   dying .  INT. COFFEE SHOP - DAY 10   10  Hazel sits alone reading a dog-eared, heavily underlined copy  of a novel (“An Imperial Affliction” by Peter Van Houten).  She only looks up when distracted by a squeal of delight. A  YOUNG GUY has lifted a YOUNG GIRL over his shoulder  playfully. He spins her around. Hazel watches a beat - goes  back to the book.  HAZEL (V.O.)  Which is what was happening to me.  And we CUT BACK TO:  The Fault In Our Stars   Pink Draft   8/21/13   3.  CONTINUED: 7   7",
      "dialogue_count": 0,
      "word_count": 446
    },
    {
      "scene_number": 3,
      "slugline": "INT. DR. MARIA’S OFFICE - DAY 11   11  Frannie continues to talk to the doctor. Hazel continues to  dangle her feet.  FRANNIE  ... some days she won’t even get out of  bed.  Dr. Maria scratches her face, thinking.  DR. MARIA  I may switch you to Zoloft. Or Lexapro.  And twice a day instead of once.  HAZEL  Why stop there?  DR. MARIA  Hmm?  HAZEL  Keep ‘em coming. I can take it. I’m like  the Keith Richards of cancer kids.  (ALT)  I’m like the Charlie Sheen of cancer  kids.  Dr. Maria looks at Frannie who just shakes her head.  DR. MARIA  Have you been going to that Support Group  I suggested?  Instead of answering, Hazel looks at her Mom.  FRANNIE  She’s gone a few times.  HAZEL  I’m not sure it’s for me.  DR. MARIA  If you’re depressed --  HAZEL  (exasperated)  I’m not de--  DR. MARIA  (ignoring her)  -- support Groups are a great way to  connect with people who are...  The Fault In Our Stars   Green Revisions   8/27/13   4.  (CONTINUED)",
      "characters": [
        "DR. MARIA",
        "HAZEL",
        "GUS"
      ],
      "action_text": "HAZEL  What?  The Fault In Our Stars   Green Revisions   8/27/13   4A.  CONTINUED: 11   11  (CONTINUED) SPEAKER #4  Tamra. Neuroblastoma.  PATRICK  Patrick. Testicular. It began a few years  ago when I was a perfectly healthy,  strapping young man of 31. I’d just  gotten married...  As Hazel watches, bored, and Patrick continues, we hear:  HAZEL (V.O.)  I’ll spare you the gory details of  Patrick’s ball cancer. Basically...  INT. PATRICK’S BATHROOM - DAY 13   13  Patrick is urinating. We stay on his FACE as he finds  something off. It’s alarming to him.  HAZEL (V.O.)  ...they found it in his nuts...  OMITTED 14   14  INT. OPERATING ROOM - DAY 15   15  Patrick, terrified, is wheeled into an OR.  HAZEL (V.O.)  ...cut most of it out, he almost died,  but he didn’t die. And now here he is --  INT. PATRICK’S LIVING ROOM - DAY 16   16  Patrick plays GUITAR HERO on XBOX. He’s really into it.  HAZEL (V.O.)  ...divorced, friendless, addicted to  video games...  INT. PATRICK’S LIVING ROOM - DAY 17   17  Patrick sits on the couch watching an inspirational program  on TV while knitting what looks like a RUG of some kind.  INT. CHURCH BASEMENT - DAY A18   A18  Patrick has laid the elaborate (and badly sewn) rug of Jesus  Christ on the ground in the middle of the basement and is  placing chairs on it for the group to sit.  The Fault In Our Stars   Green Revisions   8/27/13   6.  CONTINUED: 12   12  (CONTINUED) Isaac tries not to laugh at this. Hazel sits back down.  ALL IN UNISON  “We’re here for you Hazel.”  Hazel exhales. This is not at all helpful. A few more beats.  PATRICK  Maybe now I’ll play a song...  EXT. CHURCH - AFTERNOON 19   19  Frannie sits in the car in the parking lot, reading from a  book, waiting for Group to be over. She sees the church door  open and puts the book away. Hazel comes out, disappointed to  see her Mother waiting there.  HAZEL  You didn’t go to the movies, did you?  FRANNIE  (caught)  Maybe next time.  Hazel is a little bummed by this, the lack of",
      "dialogue_count": 4,
      "word_count": 3500
    },
    {
      "scene_number": 4,
      "slugline": "INT. ANOTHER HOSPITAL ROOM - FLASHBACK - NIGHT 36   36  14-Year Old Hazel lies in bed, struggling to breathe. Frannie  tries to comfort her. Dad calls for a Nurse.  HAZEL (V.O.)  And then my lungs started filling up with  water.  INT. ANOTHER HOSPITAL ROOM - FLASHBACK - NIGHT 37   37  In the ICU, her parents standing over her.  HAZEL (V.O.)  That should have been the end.  FRANNIE  (through the tears)  You can let go, sweetie. Don’t be afraid.  14-Year Old Hazel nods. Michael can’t keep it together any  longer. He completely breaks down.  HAZEL (V.O.)  But it wasn’t.  INT. ICU - THE NEXT MORNING - FLASHBACK - DAY 38   38  The sun shines in the room. 14-year old Hazel eats ice chips,  the color has returned to her cheeks.  HAZEL (V.O.)  The antibiotics kicked in. They drained  the fluid from my lungs. And in time I  got better. Stronger.  INT. YET ANOTHER HOSPITAL ROOM - FLASHBACK - DAY 39   39  Slightly older Hazel is getting more intravenous medication.  It’s never ending.  HAZEL (V.O.)  I even found myself in an experimental  trial. You know the ones that are famous  in the Republic of Cancervania for not  working.  INT. RADIOLOGIST’S OFFICE - FLASHBACK - DAY 40   40  A SECOND RADIOLOGIST examines a second X-ray.  The Fault In Our Stars   Green Revisions   8/27/13   21.  (CONTINUED)",
      "characters": [],
      "action_text": "HAZEL (V.O.)  It’s called Phalanxifor. Didn’t work in  over 70 percent of patients but, for some  reason...  The Radiologist looks surprised.  HAZEL (V.O.)  ...it worked in me. They called it “The  Miracle.”  And finally, BACK TO:  INT. GUS’S CAR - AFTERNOON 41   41  Gus has one eye on the road, the other on Hazel. He was  impressed with her before. He’s totally dazzled now.  HAZEL  Of course my lungs still suck at being  lungs but, theoretically, they could  continue to suck in just this way for, I  dunno, a while maybe.  GUS  So are you back in school or...?  HAZEL  Can’t.  GUS  Why not?  HAZEL  Already got my GED.  GUS  A   college   girl! Well that explains the  aura of sophistication...  He smiles at her. She smiles back. Shoves his upper arm  playfully. They’re easing into each other.  Eventually Gus’s car pulls into his driveway, knocking over a  GARBAGE CAN in the process.  GUS (CONT’D)  We’re here!  He’s as good at parking as he is at driving. CUT TO:  The Fault In Our Stars   Green Revisions   8/27/13   22.  CONTINUED: 40   40 EXT/INT. GUS’S HOUSE - LATE AFTERNOON 42   42  Hazel follows Gus inside. She quickly notices all sorts of  engraved plaques and framed signs with phrases like “Home is  Where the Heart Is” and “True Love is Born from Hard Times.”  Hazel looks at Gus quizzically.  GUS  My parents call them “encouragements.”  (rolling his eyes)  Don’t ask.  Gus’s MOM and DAD (40s) are in the kitchen making dinner.  GUS (CONT’D)  Hey guys.  GUS’S MOM  Augustus, hi. New friend?  Gus’s parents don’t seem surprised to see Gus with some  random girl in their house. Hazel takes note of that.  GUS  This is Hazel Grace.  HAZEL  It’s just... Hazel.  GUS’S DAD  How’s it going, Just Hazel?  GUS  (abruptly)  Downstairs if you need us!  Gus drags Hazel to the next room. As she’s pulled:  HAZEL  Nice to meet you!  INT. GUS’S BASEMENT - LATE AFTERNOON 43   43  They walk down the carpeted stairs - Gus having an easier  time with his one leg than Hazel is with her oxyg",
      "dialogue_count": 0,
      "word_count": 1319
    },
    {
      "scene_number": 5,
      "slugline": "INT. KITCHEN - DAY 48   48  Eating breakfast.   And checking her phone.  INT. HAZEL’S BEDROOM - DAY 49   49  Hazel looks out her window. Trying not to check her phone.  Willing herself to not check the goddamn phone.   And checking  the phone.  Where is he?! Did he forget about her?  INT. HAZEL’S DINING ROOM - NIGHT 50   50  Hazel at the dinner table with her parents. She’s a little  sullen, barely touching her food.  Hazel’s phone buzzes. She tries not to seem too eager to  check it, what with her parents watching and all. She subtly  looks down at her lap. And sure enough: a text from Gus! Her  eyes bug out. We see:  “ Tell me my copy is missing the last ten pages or something .”  Hazel smiles. Goes back to eating. Frannie and Michael share  a quick glance. A second later, there’s a follow-up text.  “ Tell me I have NOT reached the end of this book !”  Hazel smiles again.  And then a third text:  “A BOOK CAN”T END IN THE MIDDLE OF A SENTENCE?!   WHAT IN GOD’S  NAME IS THIS MADNESS!   AAAAHHHH !”  Hazel now laughs out loud. Michael clears his throat. Hazel  looks up.  MICHAEL  Would you like to be excused?  EXT. HAZEL’S HOUSE - BACKYARD - NIGHT 51   51  Hazel sits down on a patio chair and dials the phone. We see  Michael, through the window, watching TV in the living room.  Gus answers on the first ring.  GUS (O.S.)  Hazel Grace.  The Fault In Our Stars   Green Revisions   8/27/13   28.  (CONTINUED)",
      "characters": [
        "GUS"
      ],
      "action_text": "HAZEL  Welcome to the sweet torture of reading  “An Imperial --”  At which point she hears a loud WAIL coming from the other  end of the phone.  HAZEL (CONT’D)  What the -- are you ok?  GUS (O.S.)  Me? Yeah. I’m excellent.  INTERCUT between Hazel on the patio and:  INT. GUS’S BASEMENT BEDROOM - NIGHT 52   52  Isaac’s head is buried in Gus’s couch. He’s wailing like a  banshee, having some kind of nervous breakdown.  GUS  (into phone)  I am, however, with Isaac.  Hazel hears more wailing. Has no idea what to make of it.  GUS (O.S.) (CONT’D)  (to Isaac)  Dude! Hey! Does Support Group Hazel make  this better or worse?  Hazel genuinely has no idea what the hell is going on.  GUS (CONT’D)  Isaac! Focus. On. Me.  Hazel waits a few beats for Gus to come back on. Finally:  GUS (O.S.) (CONT’D)  (to Hazel)  How fast can you get here?  Hazel thinks about this. Before she can even respond:  GUS (O.S.) (CONT’D)  Great. Door’s open. Gotta run!  And then CLICK. Hazel looks at the phone. And on her face,  CUT TO:  INT. GUS’S BASEMENT - NIGHT 53   53  Hazel descends the steps, carefully. She calls to them.  The Fault In Our Stars   Pink Draft   8/21/13   29.  CONTINUED: 51   51  (CONTINUED) HAZEL  Hello?  She hears an ungodly moan before she sees anyone. What has  she gotten herself into? Eventually Gus appears at the base.  GUS  Hazel!  (calling to Isaac)  Isaac, Hazel from Support Group is coming  downstairs.  Gus waits for a response. None comes. He gestures for her to  follow him into the room. Before he does:  GUS (CONT’D)  A gentle reminder: Isaac is in the midst  of a psychotic episode.  (Hazel nods)  You look nice, by the way.  Hazel blushes, follows Gus into the room to find Isaac  sitting upside down in a gaming chair. Tears are flowing down  his reddened cheeks. Empty soda cans and bags of junk food  lie around him.  HAZEL  How ya doing Isaac?  Again, no response. Hazel looks to Gus for an explanation.  GUS  Seems Isaac and Monica are no longer a  going concern.  HAZEL  O",
      "dialogue_count": 2,
      "word_count": 1522
    },
    {
      "scene_number": 6,
      "slugline": "EXT. HAZEL’S BACKYARD - NIGHT 55   55  Hazel lays on the grass in her backyard staring up at the  stars. She rings him back and as she does SPLITSCREEN w/  Hazel in the grass   and:  INT. GUS’S BASEMENT BEDROOM - NIGHT 56   56  Gus (upside down) in bed , a laptop on his chest.  GUS  Hazel Grace.  HAZEL  Hello Augustus.  GUS  I can’t stop thinking about this goddamn  book.  HAZEL  (smiles)  You’re welcome.  GUS  On the other hand... we do need closure,  don’t we?  HAZEL  What we need is a sequel.  GUS  Yes. We need to know what happens to  Anna’s family after she dies.  HAZEL  That’s what I kept asking Van Houten for  in my letters.  GUS  But he never wrote back.  HAZEL  That’s correct.  GUS  Because he’s a recluse.  HAZEL  Yeee-up.  GUS  Utterly unreachable.  The Fault In Our Stars   Pink Draft   8/21/13   35.  (CONTINUED)",
      "characters": [
        "GUS",
        "MICHAEL"
      ],
      "action_text": "HAZEL  Unfortunately so.  Gus clears his throat, smiles. Hazel waits.  GUS  “Dear Mr. Waters...”  HAZEL  Huh?  GUS  “I am writing to thank you for your  electronic correspondence.”  Hazel sits up. Could it possibly...?  GUS (CONT’D)  “I am grateful to anyone who sets aside  the time to read my book...”  HAZEL  Augustus!?  GUS  What?  HAZEL  What are you doing?  GUS  Mmm.... I might have found his assistant.  Emailed her. She might have forwarded  that email onto Van Houten. Shall I  continue?  HAZEL  (stunned)  Oh my god!  GUS  Ahem.  (clears his throat)  “I am particularly indebted to you, sir,”  he called me sir...  HAZEL  Keep reading, keep reading!  The Fault In Our Stars   Pink Draft   8/21/13   36.  CONTINUED: 56   56  (CONTINUED) GUS  “Both for your kind words about ‘An  Imperial Affliction’ and for taking the  time to tell me that the book, and here I  quote you directly, ‘meant a great deal’  to you and your friend, Hazel.”  HAZEL  You did not.  GUS  Of course I did.  Hazel is stomping her feet in excitement.  GUS (CONT’D)  “To answer your question: No. I have not  written anything else, nor will I. I do  not feel that continuing to share my  thoughts with readers would benefit  either them or me. However thank you  again for your generous email. Yours most  sincerely, Peter Van Houten.”  Silence.  GUS (CONT’D)  So... yeah... That happened.  More silence. Hazel is entirely speechless.  GUS (CONT’D)  Hazel Grace?  HAZEL  If you’re making this up, I’m going to  hurt you. You know that, right?  GUS  Do you really believe, with my meager  intellectual capabilities, that I could  just make up a letter from the great  Peter Van Houten?  HAZEL  Oh my god!  GUS  I’ve been trying to tell you, I’m... kind  of awesome --  HAZEL  Can I... would you mind if I...  The Fault In Our Stars   Pink Draft   8/21/13   37.  CONTINUED: (2) 56   56  (CONTINUED) is the Dutch Tulip Man up to something -  or is he just misunderstood? What happens  to Anna’s friends?  INT. HAZEL’S LIV",
      "dialogue_count": 4,
      "word_count": 3573
    },
    {
      "scene_number": 7,
      "slugline": "INT. HOSPITAL ROOM - ICU - MORNING 80   80  The sound returns . And it’s the sound of a heart monitor.  BEEP. BEEP. BEEP. It’s also the sound of a working heart.  Hazel has made it through. Frannie and Michael by her side.  FRANNIE  They thought it was a brain tumor.  MICHAEL  It wasn’t - thank god --  HAZEL  So what happened?  FRANNIE  The usual. Fluid in the lungs, preventing  oxygenation. They put that in...  There’s a TUBE in Hazel’s side draining fluid into a plastic  bladder that hangs off her bed.  FRANNIE (CONT’D)  Drained a liter and a half last night.  (That’s a lot of fluid.)  MICHAEL  The good news is... no tumor growth. No  new tumors in your body.  Hazel nods. That is a relief.  MICHAEL (CONT’D)  We’re all so relieved.  Frannie embraces her daughter.  FRANNIE  This is just a thing Hazel. It’s a thing  we can live with.  Hazel nods again. Only in the universe of Hazel Grace  Lancaster is something like   this   just a thing. Meanwhile:  INT. HOSPITAL ICU - WAITING AREA - MORNING 81   81  Here’s Gus, his foot tapping nervously on the floor. It’s  unclear how long he’s been waiting there. He sees Michael  walk down the hall. Races after him.  GUS  Mr. Lancaster! How’s she doing?  The Fault In Our Stars   Pink Draft   8/21/13   54.  (CONTINUED)",
      "characters": [],
      "action_text": "MICHAEL  Better, thank you. Much better.  Gus nods, as relieved as the rest of them.  GUS  They won’t let me in. Family only.  MICHAEL  I’m sorry --  GUS  No I get it. Will you just... will you  tell her I was here?  MICHAEL  Of course I will.  Gus smiles. And sits back down. Though he won’t get to see  her, he still wants to stay.  MICHAEL (CONT’D)  Gus.  Michael really likes this kid.  MICHAEL (CONT’D)  Why don’t you go home, get some rest?  Gus looks up. That might be for the best. CUT TO:  INT. HOSPITAL - CONFERENCE ROOM - DAY 82   82  Hazel and her Parents sit at a very large conference table  along with Dr. Maria and THREE OTHER ONCOLOGISTS - her whole  “Cancer Team.” DR. SIMMONS (late 60s, white beard, old  school) speaks.  DR. SIMMONS  Normally the tumors start resisting the  treatment. And that hasn’t happened here -  yet.  Hazel hears the “yet” the loudest.  DR. SIMMONS (CONT’D)  On the other hand, the drug may be  worsening the edema.  DR. MARIA  The truth is... very few people have been  on Phalanxifor as long as Hazel has. We  don’t really know the long term effects.  The Fault In Our Stars   Pink Draft   8/21/13   55.  CONTINUED: 81   81  (CONTINUED) That comforts no one. Sensitive Michael starts to cry a  little bit. He grabs Frannie’s hand. Dr. Simmons continues...  DR. SIMMONS  What we’re trying to do is prevent  endothelial growth which, if  overexpressed, can contribute to disease,  decay, vascular inhibition, and the  spread of the cancer cells we’re working  so hard to eradicate. The survival rates  of patients with severe endothelial  growth decreases exponentially the  more...  And as he drones on with some cancer gobbledygook, Hazel’s  eyes remain firmly fixed on her parents. Holding hands, Dad  in tears, she hates what she’s doing to them. And seeing them  like this -   it jogs a memory . CUT TO:  INT. HOSPITAL ICU -   FLASHBACK   - NIGHT 83   83  We saw this once before. It looks like the end for 13-year  old Hazel. Her father is weeping of",
      "dialogue_count": 0,
      "word_count": 659
    },
    {
      "scene_number": 8,
      "slugline": "INT. HOSPITAL - CONFERENCE ROOM - DAY 84   84  Hazel comes out of the memory when her parents see her  staring at them. She tries to shake it off. Dr. Simmons is  still talking nonsense when:  HAZEL  I have a question.  DR. MARIA  Yes Hazel.  HAZEL  Can I still go to Amsterdam?  Dr. Simmons can’t help himself. He laughs. Everyone looks at  him. He clears his throat.  DR. SIMMONS  That would not be wise at this juncture.  HAZEL  Why not?  The doctors look at each other, trying to be delicate here.  FRANNIE  Is there   any   way...?  DR. SIMMONS  It would... increase some risks --  HAZEL  So does going to the mall --  DR. SIMMONS  Yes but an airplane?  HAZEL  They have oxygen on airplanes.  DR. MARIA  Hazel --  HAZEL  It’s my life, right?  DR. SIMMONS  You’re Stage IV --  The Fault In Our Stars   Pink Draft   8/21/13   57.  (CONTINUED)",
      "characters": [
        "MICHAEL",
        "HAZEL"
      ],
      "action_text": "HAZEL  I have this opportunity I may never have  again. If the medicine’s working, I don’t  see why --  DR. MARIA  (to Dr. Simmons)  Perhaps there’s a scenario --  DR. SIMMONS  No. Look...  (beat)  I don’t know any other way to say this,  Hazel.   You’re just too sick .  And this is like a punch in the gut.  DR. SIMMONS (CONT’D)  I’m sorry.  Everyone feels horrible now. Dr. Maria, Frannie and Michael,  and even Hazel. This meeting couldn’t have gone worse.  EXT. HAZEL’S HOUSE - DRIVEWAY - LATE AFTERNOON 85   85  Hazel’s parents bring her home from the hospital. She looks  miserable. It’s clear the last few days have been a big  emotional set back. CUT TO:  INT. HAZEL’S BEDROOM - NIGHT 86   86  Her parents tuck her in.  FRANNIE  We’ll be right outside.  Hazel nods. Her phone buzzes. She looks at it. A text from  Gus that reads: “ ok ?” Hazel looks at it.  And she doesn’t write back . CUT TO:  INT. HAZEL’S KITCHEN - MORNING 87   87  Hazel sits staring at nothing. Soon enough, the house phone  rings. Hazel ignores it. Michael comes in from another room  with the phone in hand.  MICHAEL  (whispers, to Hazel)  Gus again.  Hazel thinks about it - silently shakes her head, no. Michael  says into the phone.  The Fault In Our Stars   Pink Draft   8/21/13   58.  CONTINUED: 84   84  (CONTINUED) She sits down in the grass, on the verge of tears. Receives a  text message from “Augustus.” It just says “ hello ?” Again,  she ignores it.  In the backyard, there’s an OLD RUSTY SWING SET that’s been  there for years. Hazel looks at it.  And starts to cry. Just for a few brief moments, she lets  herself cry.  Soon she gets another text.   “This silence is deafening.”  Hazel’s heart breaks. She can’t take it anymore. She picks  the phone back up. And dials.  GUS (O.S.)  Hazel Grace!  HAZEL  Hi Augustus.  GUS (O.S.)  Are you crying, Hazel Grace?  HAZEL  Kind of.  GUS (O.S.)  What’s the matter?  HAZEL  I don’t know...  (beat)  I mean, I   do   know. It’s a lot of things.  It’s... I want ",
      "dialogue_count": 4,
      "word_count": 2717
    },
    {
      "scene_number": 9,
      "slugline": "INT. PLANE - NIGHT 99   99  LATER. Mid-flight, the plane is dark, Frannie’s asleep. Hazel  and Gus watch the same gory action movie. Actually, he  watches the movie. She just watches him watch it. He watches  it with gusto. CUT TO:  SFX: the PLANE touching down . - DAY   CUT TO: 100   100  EXT/INT. AMSTERDAM HIGHWAY - TAXI - DAY 101   101  Hazel, Gus, and Frannie ride in the back of a TAXI. Hazel  looks out the window, taking in the landscape. It’s as if  they’ve been transported - not only to another universe but  to another time as well.  MULTI-COLORED ROW HOUSES lined on both sides of a windy  CANAL. HOUSEBOATS float against the edges and everyone rides  BICYCLES down cobblestone streets. It’s astounding.  EXT. HOTEL - AMSTERDAM - ESTABLISHING - DAY 102   102  The taxi arrives. We hear:  FRANNIE (OVERLAP)  Let’s get you dressed!  INT. HOTEL - LATE AFTERNOON 103   103  Hazel’s suitcase is opened and she’s digging through it,  trying to pick out an outfit.  FRANNIE  Reservations for two at a place called  Oranjee. Mr. Van Houten set it up.  Hazel finds one dress. Discards it. Looks for another.  FRANNIE (CONT’D)  Very fancy according to the Guidebook.  And romantic.  Hazel is getting frustrated. She’s nothing to wear. At which  point, Frannie hands her a WRAPPED GIFT. Hazel looks at her -  what’s this? Frannie smiles. Hazel opens it to find:  The perfect Dress. Stylish, elegant, and perhaps a little  sexy. She hands it to her. Hazel smiles.  HAZEL  Mom...  The Fault In Our Stars   Pink Draft   8/21/13   70.  (CONTINUED)",
      "characters": [],
      "action_text": "FRANNIE  I’m just saying...  HAZEL  You’re saying a teenage girl running free  with an older boy on the streets of a  foreign city famous for its vice and  debauchery... is   totally   cool with you.  That’s   what you’re saying?  FRANNIE  (beat, excited)  That is   exactly   what I’m saying!  Hazel just shakes her head. CUT TO:  INT. HOTEL ROOM - LATE AFTERNOON 104   104  Frannie opens the door to find Gus in a perfectly tailored  BLACK SUIT, cigarette dangling from his mouth.  FRANNIE  (calling to the bathroom)  Hazel! Gus is here.  (to Gus)  Looking sharp.  GUS  Thank you ma’am.  A few beats later Hazel emerges from the bathroom. She wears  a knee-length, pale blue SUNDRESS. And she looks...  GUS (CONT’D)  Wow.  HAZEL  I...   (beat)  Am I under-dressed?  GUS  You look gorgeous.  Gus offers Hazel his arm. She takes it. They’re ready to go.  EXT. RIVERBANK - LATE AFTERNOON 105   105   *  Hazel and Gus in a GONDOLA, his arm around her. It really   *  couldn’t be more romantic. But she’s still fighting it.   *  Hazel leans into his body, but only a little. They stay like   *  that, expectation of the evening building. CUT TO:   *  The Fault In Our Stars   2nd Pink Revisions   9/30/13   71.  CONTINUED: 103   103",
      "dialogue_count": 0,
      "word_count": 470
    },
    {
      "scene_number": 10,
      "slugline": "EXT. ORANJEE RESTAURANT - NIGHT A106   A106   *  Establishing.   *  INT. ORANJEE RESTAURANT - NIGHT 106   106   *  Hazel and Gus are shown to a TABLE.   *  HOSTESS  Your table, Mr. And Mrs. Waters.  Gus pulls out Hazel’s chair for her. A WAITER brings them a  bottle of CHAMPAGNE as they sit.  HOSTESS (CONT’D)  The champagne is   our   gift.  Hazel and Gus look at each other. Is this a dream? The  champagne is poured and Gus raises his glass.  GUS  Ok.  Hazel raises hers.  HAZEL  Ok.  They clink glasses and sip.  HAZEL (CONT’D)  Wow that’s good.  WAITER  Do you know what Dom Perignon said after  he invented champagne?  (beat)  ‘Come quickly,’ he said. ‘I am tasting  the stars!’  Hazel and Gus smile.  WAITER (CONT’D)  Welcome to Oranjee. Would you like a menu  or will you have the chef’s choice?  Gus looks at Hazel. She shrugs.  The Fault In Our Stars   2nd Pink Revisions   9/30/13   72.  (CONTINUED)",
      "characters": [
        "GUS",
        "MAN IN PAJAMAS",
        "VAN HOUTEN",
        "HAZEL"
      ],
      "action_text": "GUS  The chef’s choice sounds lovely.  (the Waiter nods)  And can we get more of this?  WAITER  We have bottled   all   the stars for you  this evening, my young friends.  The Waiter leaves. Hazel and Gus look at each other.  GUS  Thank you for coming to Amsterdam.  HAZEL  Thank you for letting me hijack your  wish.  GUS  Thank you for wearing that dress which is  like whoa.  Hazel shakes her head, trying not to smile but it’s hard.  The Waiter brings two more glasses of champagne and a plate:  WAITER  Belgian white asparagus with a lavender  infusion.  Hazel takes a bite.  HAZEL  Oh my god.  GUS  Yeah?  Gus takes a bite.  HAZEL  I mean...  GUS  That is just...  HAZEL  There are no words.   *  The Fault In Our Stars   2nd Pink Revisions   9/30/13   73.  CONTINUED: 106   106  (CONTINUED) Hazel and Gus smile. This night could not be going any better   *  so far. CUT TO:  INT. RESTAURANT - NIGHT 107   107   *  LATER. We FOLLOW a tray of food from the KITCHEN, through the   *  restaurant, until it lands on Hazel and Gus’s table. Gus   *  takes a bite. If it wasn’t already clear on his face:   *  GUS  I want this dragon carrot risotto to  become a person so I can take it to Vegas  and marry it.  Hazel also marvels at the deliciousness. After a few bites,   *  she leans back in her chair.   *  HAZEL  I like your suit.  GUS  Thanks. First time wearing it.  HAZEL  That isn’t the suit you wear to funerals?  GUS  Oh no. That one’s not nearly this nice.  (off her look)  When I first found out I was sick - they  told me I had like an 85% chance to be  cancer-free. Great odds, sure. But that  meant a year of torture, the loss of my  leg, and   still   a 15% chance it might  fail.  A long beat.  GUS (CONT’D)  So anyway right before the surgery I  asked my parents if I could buy a suit,  like a really nice suit, just in case I  didn’t make it.  HAZEL  It’s your death suit.  The Fault In Our Stars   2nd Pink Revisions   9/30/13   74.  CONTINUED: (2) 106   106  (CONTINUED) GUS  That",
      "dialogue_count": 4,
      "word_count": 6373
    },
    {
      "scene_number": 11,
      "slugline": "INT. HOSPITAL - WAITING ROOM - MORNING 128   128  Hazel bounds in to find Mrs. Waters in the waiting room. She  stands to hug Hazel. They both sit down.  HAZEL  How’s he doing?  MRS. WATERS  He’s had a tough night, Hazel. His blood  pressure’s low. His heart --  Mrs. Waters fights back the tears.  HAZEL  What about the chemo?  MRS. WATERS  (shakes her head)  They’re gonna stop the chemo.  They both know what that means. Mrs. Waters gathers herself.  HAZEL  Can I see him?  Mrs. Waters doesn’t want to say no but in her brief  hesitation, Hazel understands completely. This is his mother.  She needs to be with him too. Hazel nods.  MRS. WATERS  We’ll tell him you were here.  HAZEL  I’m just gonna hang out for a while. If  you don’t mind...  Mrs. Waters smiles, hugs her again, walks out through the  heavy doors towards Gus’s room. Hazel sits in the chair. Same  chair Gus sat in while waiting for her. It’s as though  they’ve switched places.  EXT. INDIANAPOLIS MUSEUM OF ART - DAY 129   129  Hazel pushes Gus, now confined to a WHEELCHAIR, to their spot  on the hill overlooking “Funky Bones.” A second picnic, this  time with champagne. Hazel pours some for them both into  little plastic cups. She’s trying to be upbeat - but it’s  difficult. Gus watches the kids play on the bones.  HAZEL  What are you thinking about?  The Fault In Our Stars   Pink Draft   8/21/13   103.  (CONTINUED)",
      "characters": [
        "GUS",
        "HAZEL"
      ],
      "action_text": "GUS  Oblivion.  HAZEL  Augustus...  GUS  I know it’s kid’s stuff but... I always  thought I’d be a hero, you know, with a  grand story to tell. Something that would  run in all the papers. I thought I was  special --  HAZEL  You are.  GUS  Yeah but... you know what I mean.  Hazel, annoyed finishes her cup, tosses it to the side. Gus  can tell he’s said something wrong.  GUS (CONT’D)  What?  HAZEL  I   do   know what you mean, I just... I  don’t agree.  Hazel stands up, anger building.  HAZEL (CONT’D)  This obsession with being   remembered   --  GUS  Don’t get mad --  HAZEL  But I   am   mad!  (beat)  I   think you’re special, is that not  enough?  GUS  Hazel --  HAZEL  You think the only way to live a  meaningful life is for   everyone   to love  you, for   everyone   to remember you. Well  guess what, Gus, this is your life. This  is all you get. You get me, and your  family, and this world.  The Fault In Our Stars   Pink Draft   8/21/13   104.  CONTINUED: 129   129  (MORE)  (CONTINUED) And if that’s not enough, well I’m sorry,  but it’s not nothing. Cause   I’ll   remember  you,   I’ll   love you --  GUS  You’re right --  HAZEL  And I just wish... I just wish you’d be  happy with that.  GUS  You’re right. I’m sorry.  (pulling her back down)  I’m sorry.  Gus hands Hazel another cup. Raises his to hers in a toast.  GUS (CONT’D)  It’s a good life, Hazel Grace.  She softens. They toast.  HAZEL  It’s not over yet, you know.  Gus nods. Of course it isn’t. And yet they both know there  isn’t much time. CUT TO:  INT. HAZEL’S BEDROOM - NIGHT 130   130  Hazel is asleep. Suddenly, her phone buzzes. She looks at it -  “Gus” - then she looks at the clock - 2:35am. A pit grows in  her stomach. A quick panicked beat before she answers:  HAZEL  Hello?  GUS (O.S.)  (weakly)  Hazel Grace.  HAZEL  (relieved)  Oh, thank God. Hi. Hi, I love you!  GUS (O.S.)  I’m at the gas station --  HAZEL  What?  The Fault In Our Stars   Pink Draft   8/21/13   105.  CONTINUED: (2) 129   129  HAZEL ",
      "dialogue_count": 3,
      "word_count": 3466
    },
    {
      "scene_number": 12,
      "slugline": "INT. FRANNIE’S CAR - RAINY DAY 147   147  BACK TO: Hazel in the car.  HAZEL (V.O.)  “You know how I know,” she said.  (beat)  “You called a ten a nine.”  The loud music isn’t protecting her as well as she hoped.  INT. HAZEL’S BEDROOM - ANOTHER MORNING 148   148  Hazel puts on her funeral dress. She looks in the mirror.  HAZEL (V.O.)  But that wasn’t the truth. I didn’t call  it a nine cause I was brave. The reason I  called it a nine was... I was saving my  ten.  OMITTED 149   149  EXT. CEMETARY - DAY 150   150  Hazel sits with the gathered MOURNERS as Gus’s COFFIN is  about to be lowered into the ground. Michael and Frannie by  her side.  HAZEL (V.O.)  And this was it. The great and terrible  ten.  GUS’S PARENTS sit in the front row, crying. Frannie is  especially upset. Hazel sees this - her mother watching  another mother bury a child. Hazel reaches out and takes  Frannie’s hand. They hold on tight as a MINISTER stands to  address the mourners.  MINISTER  Augustus Waters fought hard for many  years. His battle was a courageous one  and his strength was a source of  inspiration for each and every one of  us...  Hazel frowns. This is all such bullshit. And she hears:  MALE VOICE  What a load of shit, eh kid?  Hazel recognizes that voice. But it doesn’t make sense. She  turns around and, sure enough, it’s   Peter Van Houten .  The Fault In Our Stars   Green Revisions   8/27/13   119.  (CONTINUED)",
      "characters": [],
      "action_text": "MINISTER  Let us pray.  The Fault In Our Stars   Green Revisions   8/27/13   119A.  CONTINUED: 150   150  (CONTINUED) Everyone clasps their hands, closes their eyes. Hazel keeps  staring at Van Houten, too shocked to do a thing.  VAN HOUTEN  We need to fake pray now.  Van Houten bows his head. Hazel, still stunned, is trying to  make sense of this unexpected appearance, when she hears:  MINISTER  And now we’ll hear from Gus’s...   special  friend   Hazel Lancaster.  Hazel stands, walks up towards the casket. When she gets  there, she removes a pack of Camel Lights, places it on the  coffin where other mourners have left dirt and rocks.  She turns to face everyone.  HAZEL  I was his   girlfriend .  Hazel clears her throat. Reaches into her pocket. Takes out  her notes.  CU - the eulogy she already read. We see, in her handwriting,  “Augustus Waters was the great star-crossed love of my life.”  BACK ON Hazel. She looks up. Sees Gus’s parents in the front.  She looks back at her notes, one last time. Folds it up.  And instead, she says:  HAZEL (CONT’D)  There’s a beautiful quote in Gus’s home  that reads “if you want the rainbow, you  gotta deal with the rain.”  Hazel continues to speak but we over it, WE HEAR instead:  HAZEL (V.O.)  I didn’t believe a word, of course. But  that was ok. I knew this was the right  thing to do.  Gus’s Parents, arm in arm, nod along with every word.  HAZEL (V.O.)  Funerals - I’d decided - they’re not for  the dead. They’re for the living.  Van Houten watches as well. It’s impossible to know what he’s  thinking at this moment. And we CUT TO:  The Fault In Our Stars   Pink Draft   8/21/13   120.  CONTINUED: (2) 150   150",
      "dialogue_count": 0,
      "word_count": 547
    },
    {
      "scene_number": 13,
      "slugline": "EXT. CEMETARY - LATER 151   151  The worst of it over. Hazel hugs her parents goodbye.  FRANNIE  Are you sure you don’t want some company?  HAZEL  I just want to drive for a while.  Frannie nods. Hazel turns and walks through the parking lot  towards the car. She gets in, turns the ignition.  Suddenly, a KNOCK on the window.  VAN HOUTEN  Can I hitch a ride with you?  INT. FRANNIE’S CAR 152   152  Hazel is about to say absolutely not. But before she gets a  word out, Van Houten is already in the car. He shuts the  door, whips out his flask, takes a swig. Hazel looks at him  in disgust. A few beats of awkward silence passes. Until...  VAN HOUTEN  Omnis Cellula e cellula.  Hazel ignores him.  VAN HOUTEN (CONT’D)  Your boy Waters and I corresponded quite  a bit in his last --  HAZEL  You read your fan mail now?  VAN HOUTEN  Oh I would hardly call him a fan. He  despised me. But he was quite insistent I  attend his funeral and tell you what  became of Anna and her mother. So here I  am and that’s your answer: omnis cellula  e cellula.  (beat)  “Life comes from life.”  HAZEL  I am so not in the mood.  VAN HOUTEN  You don’t want an explanation?  The Fault In Our Stars   Goldenrod Revisions   9/13/13   121.  (CONTINUED)",
      "characters": [],
      "action_text": "HAZEL  Nope. Thanks though. Have a great life.  VAN HOUTEN  You remind me of her.  HAZEL  I remind a lot of people of a lot of  people.  VAN HOUTEN  My daughter was eight. She suffered  beautifully. For so long.  Hazel wasn’t expecting this.  HAZEL  She had leukemia? Like Anna?  VAN HOUTEN  Just like her, yes.  And now Hazel is beginning to understand Van Houten.   Her  attitude softens.  HAZEL  Were you married then?  VAN HOUTEN  Not when she died, no. I was insufferable  long before Anna, my dear. Grief doesn’t  change you... it reveals you.  Hazel takes that in.  HAZEL  Well I’m sorry for your loss.  VAN HOUTEN  And I’m sorry for yours. And for ruining  your trip.  HAZEL  You didn’t ruin our trip. We had an  awesome trip.  VAN HOUTEN  Are you familiar with the Trolley  Problem?  The Fault In Our Stars   2nd Blue Revisions   9/23/13   122.  CONTINUED: 152   152  (CONTINUED) HAZEL  What?!  VAN HOUTEN  There’s a thought experiment in the field  of ethics known as the “Trolley Problem.”  HAZEL  You’ve gotta be kidding me --  VAN HOUTEN  Phillipa Foot was a philosopher--  HAZEL  I don’t give a shit, Van Houten!  VAN HOUTEN  Hazel, I’m trying to explain something to  you!   I am trying to give you what you  wanted--  HAZEL  What I   want   is for you to get out of my  car so I can go home, by myself, and  grieve for a while.   Can you do that for  me please?  Van Houten takes out a FOLDED PIECE OF PAPER.   He holds it  out to Hazel.  VAN HOUTEN  You’ll want to read this--  Hazel snatches the paper from his hand, crumples it up in a  ball and throws it at him.   It lands on the floor at his  feet.  HAZEL  Get out of the car!  He does as he’s told, stepping out onto the street.  Hazel is about to drive off. But before she does, she takes  one last look at the sad man by the side of the road.  Swallowing her anger, she rolls down her window.  HAZEL (CONT’D)  Hey Van Houten...  (beat)  The sunshine agrees with you.  (beat)  You should get out more.  The Fault In Our Stars ",
      "dialogue_count": 0,
      "word_count": 1369
    },
    {
      "scene_number": 14,
      "slugline": "INT. ICU - FLASHBACK - NIGHT 161   161  Gus stealthily sneaks into Hazel’s single room in the ICU.  She sleeps. He kneels by her side.  GUS’S VOICE  She was in ICU and I snuck in for ten  minutes and sat with her before I got  caught. Her eyes were closed, her lungs  were intubated...  Gus takes her hand and holds it.  GUS’S VOICE (CONT’D)  ... but her hands were still her hands,  still warm, and the nails painted this  dark blue black color and I just held her  hands and I willed myself to imagine a  world without us and what a worthless  world that would be.  INT. FRANNIE’S CAR - MAGIC HOUR 162   162  AND BACK TO HAZEL reading the letter. She never knew that  story, never knew he was there. CUT TO:  EXT. HAZEL’S HOUSE - BACKYARD - NIGHT 163   163  Hazel walks out to the grass behind her house, the oxygen  tank dragging behind her. She lays down on the grass and  looks up at the stars -   the same IMAGE that opened the movie .  GUS’S VOICE  She’s so beautiful. You don’t get tired  of looking at her. You never worry if  she’s smarter than you cause you know she  is. She’s funny without ever being mean.  She remembers:  EXT. RESTAURANT - (ORANJEE) - FLASHBACK - NIGHT 164   164  The magical dinner.  EXT. RIVERBANK - (AMSTERDAM) - FLASHBACK - NIGHT 165   165  The romantic GONDOLA in which they sat overlooking the water.  INT. ROOM - ANNE FRANK HOUSE - FLASHBACK - DAY 166   166  The passionate kiss which we now see is happening in Anne  Frank’s house.  The Fault In Our Stars   Pink Draft   8/21/13   127.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 281
    },
    {
      "scene_number": 15,
      "slugline": "INT. HOTEL ROOM - FLASHBACK - NIGHT 167   167  The two of them falling onto the bed together.  [All of these are images we saw at the beginning of the  movie, only now, we SEE the oxygen tank, we SEE Gus’s leg, we  SEE the fumbling and the difficulties etc. They don’t make  these images less beautiful. They make them twice as  beautiful - because they’re real.]  GUS’S VOICE  I love her, god I love her. I’m so lucky  to love her, Van Houten. You don’t get to  choose if you get hurt in this world but  you do have a say in who hurts you.  EXT. HAZEL’S HOUSE - BACKYARD - NIGHT 168   168  AND BACK ON Hazel in the grass. She holds the letter to her  chest. A single tear falls onto her cheeks.  GUS’S VOICE  I like my choices. I hope she likes hers.  Hazel CLOSES HER EYES.  GUS’S VOICE (CONT’D)  Ok, Hazel Grace?  A beat. Another.  Hazel OPENS HER EYES. And she says to the universe:  HAZEL  Ok.  BLACK.  The Fault In Our Stars   Pink Draft   8/21/13   128.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 183
    }
  ]
}