{
  "slug": "the-goldbergs-101-the-circle-of-driving-2013",
  "title": "the goldbergs 101 the circle of driving",
  "genre": "drama",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 4730,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. WAFFLE HUT - LATER  Adam and Pops sit in a booth, chowing down on Monte Cristos. A serious convo is going down.   Damn serious. ADULT ADAM (V.O.) Old people water dancing was just our cover.   The waffle hut was right next door -- and that’s where the schooling really began. POPS And you can’t go in and honk ‘em. It’s all about cuppage.   Be gentle. Those puppies are sensitive. ADAM (sincere) I just wanna... bury my face in ‘em. POPS I know.   We all do.   But you have to romance ‘em first.   Speaking of, where are we on Operation Waffle Girl? Adam glances over to ZOE the waitress (15, cute, bubbly).   In dramatic SLOW MO, she scrapes baked beans off a plate into a sludgy trough. ADULT ADAM (V.O.) Her name was Zoe Feldstein.   She was an older woman.   A freshman. ADAM Well, like you said, I’m laying the groundwork.   It’s the long con. POPS Damn right.   Last week, we told her your name.   Let’s see if it stuck. (calling to Zoe) Miss?   Can you top me off? ADAM No!   It’s too ballsy!   Pops, pull the rip cord! Zoe approaches and pours Pops a cup of coffee. POPS Thanks.   Really appreciate it. Pops nods to Adam.   He swallows his terror.  How the Hell Am I Normal?   \"Pilot\"   11.  2nd Rev. Network Draft 11.27.12 TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "ADAM Also... the check please? ZOE You got it, Alan. Zoe heads off.   Adam stares Pops down for a beat. ADAM That was... rad!   She said my name! POPS She called you Alan. ADAM Close enough!   You’re a genius, Pops. POPS Eh, so the long con will take a little longer than usual.  EXT. WAFFLE HUT - PARKING LOT - LATER  Pops and Adam head for the Firebird.   They spot Barry sitting outside Wawa eating out of a garbage bag, bike next to him. ADAM Barry?   What are you doing? BARRY What’s it look like?   Eating day- old donuts out of a garbage bag. My friend Terrance leaves ‘em out back for me. ADAM Why ? BARRY It’s called eating your feelings, ass-bag.   Mom’s gonna make me ride my banana seat Huffy for the rest of my miserable life. POPS Not if I can help it.   Put down the garbage cruller, ‘cause I’m gonna figure out a way to get you that license and my car. Pops offers Barry a hand up.   He takes it with a small smile.  How the Hell Am I Normal?   \"Pilot\"   12.  2nd Rev. Network Draft 11.27.12 TV Calling - For educational purposes only",
      "dialogue_count": 0,
      "word_count": 431
    },
    {
      "scene_number": 2,
      "slugline": "INT. FIREBIRD TRAMS AM - LATER  Pops speeds home in his Firebird.   Silent.   Deep in thought. Adam and Barry sit in back, eagerly awaiting his next thought. ADULT ADAM (V.O.) It looked like Pops was cooking up an epic plan.   That old man had schemes within schemes.   No one could compete with his big brain. BARRY Spill it, Pops.   So, what’s the master plan? ADAM (uneasy) Pops?   You okay? Pops blinks -- confused and disoriented.   He overshoots the left turn -- totally lost.   BOOM!   HE DRIVES HIS CAR THROUGH  THE LIVING ROOM OF A HOUSE ! A beat as the dust and debris clears, we REVEAL a horrified AFRICAN-AMERICAN FAMILY sitting in their destroyed living room.   Silence as they gawk at the car. ADULT ADAM (V.O.) Unfortunately, that big brain was being ravaged by dementia. Then -- CLICK!   POPS REACHES OVER AND LOCKS THE DOORS. Barry watches on in horror as Adam slinks low in his seat.  END OF ACT ONE  How the Hell Am I Normal?   \"Pilot\"   13.  2nd Rev. Network Draft 11.27.12 TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "ACT TWO INT. HOLDING CELL - DAY  Pops, Adam and Barry sit on a bench, heads hung low. ADULT ADAM (V.O.) Pops was booked with reckless endangerment and we were all thrown behind bars.   It was ugly alright... We PULL BACK through the bars to find Beverly chewing out OFFICER PUCHINSKI (30s), a massive hulk of a cop. ADULT ADAM (V.O.) ... Not for us.   For the poor officer who had to face my mom. BEVERLY Are you proud of yourself?   Locking up an old man and two little boys? You see the one with the girl pants?   He’s gonna be a big Hollywood director -- the next Steven Spielbaum and you treat him like a common criminal!   I mean, did you even offer them a sandwich? OFFICER PUCHINSKI It’s not really policy, but I guess I could whip up a -- BEVERLY No!   We don’t want your crappy sandwiches!   I want you to unlock that door and apologize! The officer unlocks the door and nods to Pops and the boys. OFFICER PUCHINSKI (sheepish) I’m, uh, sorry. ADULT ADAM (V.O.) As much as we complained, having an overbearing smother did have its benefits. Beverly wheels on Pops, Adam and Barry. BEVERLY Car.   NOW .  How the Hell Am I Normal?   \"Pilot\"   14.  2nd Rev. Network Draft 11.27.12 TV Calling - For educational purposes only ADULT ADAM (V.O.) But they were short-lived.  EXT. SILVER FRONT LAWN - LATER  The family is gathered, watching as a tow truck dumps the TOTALED FIREBIRD in front of the house. POPS Don’t worry, Beverly!   I’ll clear this whole mess up at my hearing next week. BEVERLY Forget your hearing.   It’s been heard.   You’re not driving. POPS Like hell I’m not.   I told you, the accident wasn’t my fault! BEVERLY So the house just darted out into the street without looking both ways? POPS The sun was in my eyes!   And the brakes failed!   And there was a... moose! BEVERLY A moose.   In the middle of town. It’s almost unbelievable . POPS Imagine my shock. BEVERLY That’s enough, Dad.   This is your second episode this month. POPS Please, I took a few grapes from the grocery",
      "dialogue_count": 0,
      "word_count": 3914
    },
    {
      "scene_number": 3,
      "slugline": "EXT. SILVER BACK YARD - DUSK  The sun sets as Beverly sits on the children’s rusty, unused swing set -- alone.   She holds a BABY BLANKET in her hand. After a moment, she gives it a deep sniff. MURRAY (O.S.) Whatcha doing? Beverly jumps, caught.   We REVEAL Murray behind her. BEVERLY Nothing. MURRAY Relax.   I know when you’re sad you come out here and sniff the kids’ old baby blankets. Murray sits on the swing next to her.   A beat. BEVERLY What happened, Murray?   Seriously, where did it go?   I blinked... and everything’s changed. MURRAY Honey, you’ve given everything to this family.   To the kids.   But if you can’t let them go... you’ll lose them for real. Beverly takes this in for a moment and nods. BEVERLY You were right.   My world is caving in.   Guess I really can’t stop it. MURRAY No.   But you still did the right thing.   After everything, you let that little bastard get his license. BEVERLY Baby steps. Murray pulls out a baby blanket.   He offers it to her. MURRAY Speaking of... can I take a hit?  How the Hell Am I Normal?   \"Pilot\"   32.  2nd Rev. Network Draft 11.27.12 TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "Beverly smiles as the Mister Mister SONG crescendos.   They sit there in silence, passing the blanket back and forth. It's crazy and creepy, but... oddly touching. BEVERLY Ooooooh, that’s the stuff. MURRAY Oh yeah.   Smells like when they couldn’t talk back. BAM!   Murray’s swing SNAPS under him.   He CRASHES to the ground. MURRAY (CONT’D) Goddammit! BEVERLY That’s it, I’m putting you on a diet! We PULL BACK TO REVEAL Adam video taping everything from his window.   He smiles victoriously. SMASH TO:  TAG  CHYRON OVER BLACK: DEDICATED TO MY FAMILY.   POPS.   MURRAY. BEVERLY.   BARRY.   ERIC(A). A short, 30 second montage of the real VHS footage of my family arguing -- featuring lines from this very script. MURRAY You’re aggravating me, you little bastard! BEVERLY What are you pulling his hair for? Look, he needs it.   It’s already thinning. BARRY I told you to stop filming!   ADAM Stop pulling on it! Then -- silence -- as the audience takes it all in.   What they saw was REAL.  END OF SHOW   *  How the Hell Am I Normal?   \"Pilot\"   33.  2nd Rev. Network Draft 11.27.12",
      "dialogue_count": 0,
      "word_count": 385
    }
  ]
}