{
  "slug": "the-comey-rule-101-night-one-2020",
  "title": "the comey rule 101 night one",
  "genre": "drama",
  "format": "series",
  "scenes_count": 13,
  "characters_count": 0,
  "characters": [],
  "total_words": 18438,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. COMEY HOME - MASTER BEDROOM - CLOSET - MINUTES LATER 8   8 Shaved and showered now, Comey eyes his options: 20 DARK BLUE SUITS hanging here, nearly identical. Which one to pick? Patrice appears behind him, fakes a sigh: PATRICE I know. Each makes such a different statement. Comey breathes out a smile, grabs a RED NECKTIE and a BLUE one. Can’t really go with either. We CUT TO: OMIT 9   9 INT. COMEY HOME - BREAKFAST ROOM - MORNING (2013) 10   10 Patrice makes breakfast for CLAIRE, 16, and ABBY, (13, long red hair.) The family dog BENJI eats happily. Taped to the fridge is a QUOTE: “ I don’t care about politics. I don’t care about expediency. I don’t care about friendship. I care about doing the right thing. ” The author? “James Comey,” (on the day he testified to become Deputy Attorney General.) He appears now: dark blue suit and a gold tie. PATRICE Ta Da.... CLAIRE He goes gold! Nice. ABBY Handsome. COMEY Have a great day. ABBY Say hi to Barack for me! OMIT 11-12   11-12 INT. WHITE HOUSE - WAITING ROOM - MOMENTS LATER 13   13 Comey sits. Phones ring. A huge staff works efficiently. Through an open door we hear a voice from the OVAL OFFICE: OBAMA (O.S.) Governor, I’m told you’ve got 24 dead and over 200 injured. Do we (MORE) The Green Room - Night One   PROD. BUFF (Oct 31, 2019)   3",
      "characters": [],
      "action_text": "have that right? Well I’ve ordered Janet Napolitano at DHS and Craig Fugate at FEMA to coordinate with your team to provide any assistance you need. And I’ll be out there myself on Sunday. You just hang in there. Help is coming. (a beat) You too. And thank you for managing this as well as you have. A beat. The phone hangs up. Comey’s adrenaline kicking in... as PRESIDENT BARACK OBAMA appears, in the flesh. Comey rises. OBAMA (CONT’D) C’mon in, Jim. COMEY Good to meet you, Mister President. Obama smiles warmly. They shake hands. Comey half-kids him: COMEY (CONT’D) I should confess, Sir. I supported John McCain. And Romney. OBAMA (mock seriousness) I know. Comey hesitates. Then that big Obama smile... And the tension is   gone . Just like that. We CUT TO: INT. WHITE HOUSE - OVAL OFFICE - MOMENTS LATER 14   14 Comey sits on a couch, Obama in an arm-chair beside him. The feeling is familiar, easy. Obama has that gift. But: OBAMA So why should I hire   you   to run the Bureau? Why shouldn’t I pick, say, someone who   supports   my criminal justice reform initiative? BANG. Test #1. Comey has to respond fast, and well: COMEY You could, Mister President - and that's an issue on which reasonable people can disagree. But I believe stiffer sentencing laws have on the whole made this country safer. A lot of Americans aren't dead today OBAMA (O.S.) (CONT'D) (MORE) The Green Room - Night One   PROD. WHITE (Oct 3, 2019)   4 because the guys who   might   have killed them were locked up. OBAMA Still, might be easier to have an FBI Director who agrees with me. COMEY That’s true. But you’ve always struck me as one of those leaders who gains just as much from thoughtful disagreement. Okay, Comey’s got some game. Obama regards him. OBAMA You garnered a lot of attention for taking on the Mob as a prosecutor, and for defending the DOJ in ‘04. COMEY I suppose that’s true. OBAMA Do you need a lot of attention? TEST #2. Obama x-raying the guy. Comey tightens. COMEY That’s not a huge driver ",
      "dialogue_count": 0,
      "word_count": 2030
    },
    {
      "scene_number": 2,
      "slugline": "INT. FBI DC - CAFETERIA - DAY 37   37 Comey enters. Instantly, 200 heads pop up, mid-bite. THE FUCKING DIRECTOR IS HERE. Now what? Comey heads for the PANINI LINE. It parts for him, but: COMEY Oh, no, no. That’s okay. I’ll wait. He waves them back in place, takes a spot at the end of the line. The WOMAN IN FRONT OF HIM (PAM, 40) eyes her shoe-tops. COMEY (CONT’D) Hi. Jim. And he waits for her to reply. Pam pauses:   I’m just supposed to chat with the Director?   (Yes, she is.) PAM Pam. COMEY What do you do here? PAM Counter-Terrorism Analyst. COMEY What did you do   before ? What drew you here? PAM Nine-Eleven. I was an analyst at Cantor Fitzgerald; missed work that day because of the flu. COMEY Thank you, Pam. (to MAN BEHIND HIM) What do   you   do here? MAN BEHIND HIM Computer-Tech, Counter-Intel. COMEY What were you   before ? What called you here? MAN BEHIND HIM I worked for Monsanto. Hated it. What do you do here? A beat. Everyone else in line goes SILENT. How to reply? The Green Room - Night One   PROD. BUFF (Oct 31, 2019)   12",
      "characters": [],
      "action_text": "COMEY I’m the Director. MAN BEHIND HIM Oh yeah? Director of what? COMEY Dude. The Bureau. (no reply) This morning? The big speech? MAN BEHIND HIM (paling a bit) Oh. Sir. I was in the bathroom. Comey is about to reply, when: PANINI COUNTER-GUY Next! OMIT 38-41   38-41 INT. DOJ - DAG'S OFFICE (ROSENSTEIN) - RESUMING (NOW) 42   42 Rosenstein continues: ROSENSTEIN In his first two years at the Bureau Jim did everything you’d expect a Boy Scout to do. He shook hands with the janitors and asked them for their life-story. He was adored,   beloved . INT. FBI DC - DIRECTOR'S OFFICE (COMEY) - DAY (2015) 43   43 Comey stares at a MAGNET BOARD. On it, pics of 330 FBI SENIOR EXECS - the “talent pool” - as: ROSENSTEIN (V.O.) Nothing slowed him. There were lone shooters, terror plots, kidnappings; his Chief of Staff left to run the DEA - but his sunniness was undimmed. Comey (somewhat sadly) takes the “Chuck Rosenberg” MAGNET off the board and moves a “JIM RYBICKI” MAGNET into its place. Then he swallows another ASPIRIN, as: The Board shows us that Rybicki is Chief of Staff. JIM BAKER is Chief Counsel, and MARK GIULIANO is Deputy Director... as: OMIT 44   44 The Green Room - Night One   PROD. DBL SALMON (Feb 13, 2020)   13",
      "dialogue_count": 0,
      "word_count": 418
    },
    {
      "scene_number": 3,
      "slugline": "INT. FBI DC - CONFERENCE ROOM - CONTINUING 45   45 Giuliano sits into frame. He looks a lot like a Country-Club Republican. But he’s an agent’s agent, all business. Facing him: Baker, PETER STRZOK, BILL PRIESTAP, JIM RYBICKI (35, Mormon, Comey’s new Chief of Staff). Plus: ANDY McCABE, TRISHA ANDERSON. LISA PAGE -- on each, more later. GIULIANO Morning. What’d the analysts pull together? What’s in the PDB? That fast, we’re off: MCCABE Got a potential issue in the UK. Getting chatter that AQAP is gonna hit another airliner bound for the US. JTF is reporting chatter in New York indicating the same thing. We don’t yet know where they’ll be flying from, or what techniques they’re planning to use. GIULIANO Do we have a time-frame on this? MCCABE Nothing specific. Just increased chatter. GIULIANO Is it something the Boss needs to brief the AG on? MCCABE Not yet. GIULIANO What else? MCCABE Got an operation in Detroit that’s ready to go down. Guy at a mosque there told an informant yesterday he was planning to target a Jewish Children’s Center. GIULIANO Do we have enough to charge? MCCABE Yes. The Green Room - Night One   PROD. DBL BLUE (Nov 19, 2019)   14",
      "characters": [],
      "action_text": "GIULIANO Do we have the right resources on the ground? A good takedown plan? MCCABE Will give them to you off-line. GIULIANO Okay. Let’s skinny down for the Director. Thank you. Most of these people rise to go. But-- JOHN GIACALONE (EAD of NatSec Branch) comes in - and: GIACALONE Mark, we got an I-G referral on Secretary Clinton and her emails. We’re gonna hafta open a case. And   everything STOPS . The room goes SILENT. GIULIANO Say more. OMIT 46-48   46-48 INT. FBI DC - CONFERENCE ROOM - RESUMING 49   49 Giuliano, fighting dread, eyes his team, rises... opens the door behind him, and we are now: INT. FBI DC - DIRECTOR'S OFFICE (COMEY) - CONTINUING 50   50 ...just as Comey is rising from his desk-- GIULIANO Boss. COMEY What’s up? Over Giuliano’s shoulder, we see the team... as: GIULIANO Got a referral from the Intel I.G. about Secretary Clinton’s emails. We’re gonna hafta open a case. Comey does not betray a reaction, just nods calmly. Then... COMEY Say more. The Green Room - Night One   PROD. WHITE (Oct 3, 2019)   15 GIULIANO “Did she mishandle classified information by using her personal email system while serving as Secretary of State?” (a beat) You know you’re screwed. Right? I do not see a positive outcome here, no matter what we find. COMEY Just do it right. OMIT 51, 52   51, 52 INT. FBI DC - MIDYEAR ROOM - MORNING (2015) 53   53 HEAVY RAIN pours down... as Giuliano faces the MIDYEAR EXAM TEAM: ANALYSTS, COMPUTER SPECIALISTS, McCabe, Pete Strzok, Jim Baker, Jim Rybicki, Trisha Anderson, Lisa Page. GIULIANO Welcome to your new home. (a beat... then:) I want to say something before we start. Whatever this investigation yields, History will look at what we do here through a microscope. So our work needs to be letter- perfect. No leaks, everything buttoned-down. We cannot cut corners, cannot screw this up in any way. Is that clear? (everyone nods) Now, this is NOT gonna become some kind of octopus. We’re not gonna chase down spills to the ends of the earth, which",
      "dialogue_count": 0,
      "word_count": 2092
    },
    {
      "scene_number": 4,
      "slugline": "INT. FBI DC - CORRIDOR - NIGHT (2015) 68   68 Jim Baker heads down a hallway, troubled. He reaches a door. But before he can open it, an AGENT passes by: PASSING AGENT Hey, are you in on Midyear? The Hillary case? BAKER Yeah? PASSING AGENT Godspeed, Brother. I hope you nail that bitch. With that, Passing Agent is gone. Baker “badges in”, to: INT. FBI DC - MIDYEAR ROOM - CONTINUING NIGHT (2015) 69   69 Strzok is at the head of the room again. The WHITE-BOARDS behind him are filled with names, dates... STRZOK Okay. Secretary Clinton was a part of 81 email chains containing 193 emails ranging from Confidential to Top Secret, all sent on unclassified systems. TRISHA ANDERSON That’s staff failure. STRZOK Tell me why. TRISHA ANDERSON On sensitive material, staff is supposed to include headers or footers with classification markings. That’s how these things get flagged. It’s standard. Her staff didn’t do it. MCCABE But she knew the material was sensitive and she knew the systems were unprotected. STRZOK Let’s chase that down later. Where are we on Huma Abedin’s emails? The Green Room - Night One   PROD. GOLDENROD (Oct 28, 2019)   24",
      "characters": [],
      "action_text": "MCCABE I asked. Justice doesn’t feel the need to get a warrant for them because “Abedin’s work for Clinton was administrative in nature and she was never an originator of classified materials.” LISA PAGE But she coulda been a FORWARDER of classified materials! Or taken stuff off of classified systems and dumped it down! They’re just too fucking scared to walk into Williams and Connolly and tell David Kendall to stop obstructing this investigation! TRISHA ANDERSON That’s a pretty big word. LISA PAGE They have obfuscated every step of this process. I don’t blame them - they should use every legal advantage at their disposal. I blame our fucking snowflake PROSECUTORS for letting them do it. STRZOK Where are they? Where’s Bob? BAKER Uh, Bob won’t be able to make it this morning. STRZOK Why’s that? BAKER He’s in his office, crying. (that lands...) I asked him to push Hillary’s team on the PRN Server - and apparently Kendall yelled at him. LISA PAGE Cool. One of our line-prosecutors is crying because a fancy lawyer yelled at him. THIS IS WHAT I’M TALKING ABOUT, PETE! The Green Room - Night One   PROD. YELLOW (Oct 16, 2019)   25",
      "dialogue_count": 0,
      "word_count": 395
    },
    {
      "scene_number": 5,
      "slugline": "EXT. DOJ - ESTABLISHING - DAY (2015) 70   70 Right across the street from the FBI... INT. DOJ - AG'S OFFICE (LYNCH) - SAME 71   71 A tense standoff (or sit-off), DOJ vs. FBI. Comey and Giuliano facing: Atty. Gen. LORETTA LYNCH, Dep. Atty. Gen. SALLY YATES, Yates’ Deputy MATT AXELROD, GEORGE TOSCAS, and a PROSECUTOR named BOB (the one who’d cried in his office.) Yates is a   force : clear-eyed, solid, effective, from Atlanta. Likes her Diet Coke. Lynch lets her officiate. YATES In a case this high-profile, there are bound to be tensions. COMEY Sally, my team feels their investigation is being impeded. TOSCAS And my team feels their work is being second-guessed. COMEY Our strong consensus is that Secretary Clinton’s attorneys have not been operating in good-faith with this investigation, and that they are being allowed to obfuscate by the Line-Prosecutors here at Justice. BOB You think I’m not doing my job, Jim? You think I’m getting played? COMEY I think you’re risk-averse, Bob. GIULIANO Crying in your office doesn’t help. That stung. Bob tries to recover... Then: BOB Every document or device that we have requested we are going to get. The Green Room - Night One   PROD. WHITE (Oct 3, 2019)   26",
      "characters": [],
      "action_text": "COMEY Her attorneys are only going to be as helpful as you push them to be. BOB We’re trying to be careful. COMEY Be careful faster. YATES Thank you, everyone. People pack up, but   they’re not gone yet , as: COMEY One other thing: The Bureau’s getting bombarded with questions about whether or not we’re investigating Secretary Clinton, and it’s starting to feel silly to keep issuing a “no-comment.” People are openly talking about it in the press, and even Secretary Clinton herself has referred to it. So I’d like your permission, if asked, to acknowledge it with “we don’t comment on investigations.” Suddenly, everyone’s lingering - to hear Lynch’s answer: LYNCH Fine... But I think it would be better to refer to it as a “matter.” COMEY Why would we do that? LYNCH Because we don’t comment on investigations. COMEY But if we’re trying to establish that we’re treating this like any other case, wouldn’t it be helpful to use the same   language   we’d use on any other case? LYNCH I’m trying to thread the needle here. I think matter does that. The Green Room - Night One   PROD. WHITE (Oct 3, 2019)   27 She’s his boss. And there’s no point in arguing, so-- COMEY Okay. We can make that work. LYNCH Good. Thank you. INT. DOJ - AG’S OUTER OFFICE - MOMENTS LATER (2015) 72   72 They emerge. Toscas teases Comey: TOSCAS Bye, Jim. And congratulations! COMEY For what? TOSCAS You’re now the Director of the “Federal Bureau of   Matters !” Comey takes that pretty well. He heads for the door-- Then he pauses - because   guess who’s sitting out here :  Rosenstein , awaiting a meeting. ROSENSTEIN Oh. Hi, Jim. COMEY Hi, Rod. ROSENSTEIN Budget meeting. How’ve you been? COMEY Fine, fine. Good to see you. Comey’s   about to go , when it just blurts out-- ROSENSTEIN Hey, would you ever wanna come talk to my team about leadership? (Comey turns) I bring guest-speakers in for them now and then. Various topics. Leadership’s a big focus for you, isn’t it? COMEY It is. The Green Room - Night One   PROD",
      "dialogue_count": 0,
      "word_count": 2690
    },
    {
      "scene_number": 6,
      "slugline": "INT. DOJ - DAG'S OFFICE (YATES) - DAY (2016) 89   89 Comey, Rybicki, Yates, (another Diet Coke) and Axelrod-- COMEY ... nothing . No crime that any reasonable Prosecutor would charge. We think she was guilty of great neglect and carelessness, but we don’t see anything indictable. The systems at State were so arcane if you wanted to charge her you’d have to charge 150 other people there too; the negligence was viral. YATES After poring through the relevant case law, we’ve reached the same conclusion. Neither the Espionage Act nor Volstead apply here.   And we think it’s time to start asking what the   end-game   on this might look like. COMEY In the middle of an election year, on something this visible, I don’t think DOJ can just put out a statement reading, “We looked at it. We’re NOT prosecuting Secretary Clinton. Case closed.” I think we’re going to need to explain our thinking on this to the American people, via the press. YATES We feel that way too. COMEY But there’s a very real downside to having the A-G make a statement on this. It cannot appear to be partisan in any way. YATES We thought the right approach might be for you and the A-G to make the statement   jointly.   We hold hands and jump off the bridge together. How would you feel about that? Comey has   many   feelings about that. We SLAM TO: The Green Room - Night One   PROD. GOLDENROD (Oct 28, 2019)   40",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 249
    },
    {
      "scene_number": 7,
      "slugline": "INT. FBI DC - CAFETERIA - EVENING (2016) 90   90 Sparsely populated. We find Jim Baker (eating fries) and Comey. BAKER As I see it, you’ve got three options, and all of them are terrible. Comey nods, in complete agreement. BAKER (CONT’D) You can make a joint statement with the A-G, as requested, which is terrible because there’s a widespread belief, rightly or wrongly, that Loretta is overly friendly with the Clinton Campaign. So standing beside her makes the Bureau seem complicit as well. (Comey agrees) Two. You can fall back on Department norms, just issue a brief statement declining the case, and move on. That’s terrible because the public needs to see that the Bureau really did try to make a case against Hillary - aggressively, thoroughly. COMEY Then there’s the idea of me making the statement on my own. BAKER ...which is the   worst   idea, by a mile. (Comey waits...) The Bureau doesn’t do that. EVER. It would violate a sacred norm in a culture built on norms. And, in my opinion, it would look horrible. COMEY But it’s the only one that allows us to tell the truth. Loretta would never just stand there and let me explain what Hillary did and why we think it was dangerous. Baker sags, knows what’s coming. Comey slides over a FILE. Baker doesn’t open it, doesn’t want to. Just eyes Comey... The Green Room - Night One   PROD. WHITE (Oct 3, 2019)   41",
      "characters": [],
      "action_text": "COMEY (CONT’D) This is a first attempt at a statement. I think it represents our outer boundaries in terms of transparency. BAKER I really wish you hadn’t done that. Anything committed to writing is discoverable. COMEY I’d ask you to assess three things: the accuracy of the facts laid out in the draft, any policy or other limitations around making such a statement, and the wisdom and mechanics of presenting it to the American people. Awright? Baker eyes him. We CUT TO: EXT. SMITHSONIAN - LATE AFTERNOON (2016) 91   91 Comey and Patrice leave the museum, hand in hand. PATRICE Anything on your mind? COMEY Why? PATRICE A little quiet. (he shrugs) Maybe a dead-end-politically- motivated investigation of a certain female Presidential candidate? He smiles, but doesn’t reply. Then, out of nowhere: COMEY Do you ever worry about my ego? PATRICE Why, has it not been feeling well? He sighs, guilty about something he hasn’t even done yet. PATRICE (CONT’D) Is there something you’d like to tell me? The Green Room - Night One   PROD. DBL GOLDENROD (Dec 19,2019) 42 COMEY Just that I love you. PATRICE That, I knew yesterday! What’s on your mind today? He smiles, kisses her. We CUT TO: INT. UNNAMED HOTEL ROOM - NIGHT (2016) 92   92 Two hands, intertwined, post-sex. Cuddling beneath a blanket on a sofa chair we find Pete Strzok and Lisa Page. LISA PAGE By the way, how’d the 302 on that programmer go? STRZOK Awesome. He lied his ass off. Guy went from “I was never inside the SCIF” to “I may have removed the trash from there twice” to “I trouble-shot the fax in there a couple times” to “Every time there was a secure fax sent, I sent it.” LISA PAGE It kills me when people lie even though they know we know they’re lying. Meanwhile there’s a Russian inside everyone’s computer and nobody’s talking about it. (Strzok nods) I love this room. STRZOK Heard a joke today: “How many people work at the DOJ?” LISA PAGE I don’t know. How many people work at the DOJ? STRZOK About half of ‘em. Lisa laugh",
      "dialogue_count": 0,
      "word_count": 633
    },
    {
      "scene_number": 8,
      "slugline": "EXT. 57TH ST. - MANHATTAN - DAY (2016) 93   93 TRUMP TOWER looms. SUPER: “ June 9, 2016 ” INT. TRUMP TOWER - 25TH FLOOR - CONFERENCE ROOM - SAME 94   94 FOUR RUSSIANS in a garish, crass room: NATALIA VESELNITSKAYA, ROB GOLDSTONE, IKE KAVELADZE, and RINAT AKHMETSHIN. And: PAUL MANAFORT, JARED KUSHNER, and a grinning DONALD TRUMP JR. (SUPERS under each person tell us who they are.) DON JR. It’s good to meet you all. Thank you for coming such a long way. VESELNITSKAYA We are happy to help. DON JR. Natalia, the floor is yours. VESELNITSKAYA I’m sorry? DON JR. Oh. I apologize. That’s an American expression. It means we’re ready to hear every single disgusting detail of the dirt you have on Hillary. VESELNITSKAYA Hillary? I thought we were here to discuss adoption! A beat. Awkward silence. Then the Russians start LAUGHING. Phew! And the Yanks start laughing too. What fun! Then-- VESELNITSKAYA (CONT’D) Let’s talk about the Magnitsky Act. INT. DAG’S OFFICE (ROSENSTEIN) - RESUMING 94A   94A Rosenstein sighs... ROSENSTEIN Some days, our job is chasing Russians. On others, we chase monsters. Jim had to do a lot of that. OMIT 95-97   95-97 The Green Room - Night One   PROD. BUFF (Oct 31, 2019)   44",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 210
    },
    {
      "scene_number": 9,
      "slugline": "INT. PULSE NIGHTCLUB - DANCE-FLOOR - DAY (2016) 98   98 A HAND clutches a ringing cell-phone. We PULL BACK to find--  The hand is extending out from under a SHEET : someone died holding that cell-phone. We PULL BACK FARTHER -- there are 49 BODIES in here, under sheets. Blood everywhere. More PHONES, several of them RINGING. Texts pinging - messages that will never be returned. PULL BACK FARTHER-- Here’s Comey, amid utter slaughter. All those hollow ring- tones. And he looks flattened, sickened. COPS and FBI and ATF CREWS working the scene. He takes it in. SUPER: “ Pulse Nightclub - Orlando - June 13, 2016 ” This is what he came to the Bureau to   stop . He turns to the COP to his right: COMEY Assemble the first-responders for me, would you? I want to thank them. Cop nods, goes. Comey eyes the scene. His head drops. The rings continue. Then he realizes, ONE of the rings is coming from   his   cell. He grabs it. COMEY (INTO CELL) (CONT’D) Not a great time, Andy. MCCABE (THRU CELL) Sorry, Boss. Just... It’s about the A.G. Huh? On Comey we CUT TO: OMITTED 98A   98A EXT. PHOENIX AIRPORT - TARMAC - DAY (2016) 99   99 A JUSTICE DEPARTMENT G-5 sits on a sun-baked tarmac. INT. JUSTICE DEPT. JET - CABIN - DAY 100   100 Loretta Lynch sits, reading. A timid STAFFER approaches: TIMID STAFFER Uh, General Lynch? Um... Former President Clinton is here as well, and he’d like to pay his respects. The Green Room - Night One   PROD. BUFF (Oct 31, 2019)   45",
      "characters": [],
      "action_text": "LYNCH Here where? TIMID STAFFER On the tarmac. That’s his plane. Lynch looks out the window, sees ANOTHER PLANE cozying up. She sighs deeply... then her “South” kicks in: LYNCH Well, it’d be rude to leave him standing out there. Show him in. Timid Staffer looks to ANOTHER STAFFER. Uh-oh. We CUT TO: OMIT 101   101 INSERT - SMASH TO: TELEVISION AND INTERNET COVERAGE -- 102   102 An ERUPTION: CNN, MSNBC, Fox :   Bill Clinton met privately on a jet with the Attorney General while Clinton’s WIFE is still being investigated by DOJ. The optics   horrible . Lynch is now under brutal fire from the press. We CUT TO: INT. FBI DC - CONFERENCE ROOM - DAY (2016) 103   103 The Midyear Exam Team faces Comey. Every face tight. COMEY The AG has just announced that she will not recuse herself from this investigation. But she will accept our findings, whatever they may be. Meaning this is now on us. LISA PAGE What a profile in courage. COMEY I no longer believe that I can credibly stand   beside her   to announce that Justice is closing the Clinton case. This Bureau - and the whole Department - will look utterly compromised and partisan. Does anyone see it differently? (no hands go up) But I think the public is now going to demand an explanation for our declining the case. That’s hard to disagree with. The Green Room - Night One   PROD. WHITE (Oct 3, 2019)   46 COMEY (CONT’D) So I’m going to go ahead and deliver the declination alone. SILENCE. Everyone thinking “That’s a HORRIBLE idea” - while waiting for someone of RANK to say it. Baker’s silent. So... MCCABE Um... That could go   really   wrong, Boss. For a million reasons. It’s just so not what we do. COMEY I get that, Andy. And conventional wisdom might mitigate against it. But this is not a conventional circumstance. This is a 500-year flood. If we let Justice issue a one-sentence declination now, it will place a corrosive doubt about our investigation - and more broadly the Rule of Law - into the public square. Even standing next",
      "dialogue_count": 0,
      "word_count": 1157
    },
    {
      "scene_number": 10,
      "slugline": "INT. PATRICE’S OFC. - NIGHT (2016) 106   106 The DOOR reads “Court-Appointed Special Advocate, Juvenile Division.” Comey, bearing a bag of TAKEOUT FOOD, pauses outside the door, Shaun discreetly in BG, as: PATRICE (INTO PHONE) Let me reframe this for you; maybe that would help: We just rescued a mom and four children from an abusive father, and you tell her, her kids can’t attend your school because of a   paperwork   error? Do you see the disconnect there? Comey smiles... A beat passes... PATRICE (INTO PHONE) (CONT’D) That would be great. Thank you. They’ll see you on Monday. She hangs up the phone. He enters her office. COMEY Maybe   you   should be running the Bureau. Patrice looks up from her cluttered desk, smiles. Comey sets the bag of takeout food down. She eyes it. PATRICE Just happened to be in the neighborhood? COMEY Couldn’t stand the idea of your eating alone. She knows him. Really well. So she’s ten steps ahead... PATRICE You’re gonna get clobbered, Jim. COMEY I’ve got a ten-year term, right? He sits. They eye one another. We CUT TO: INT. FBI DC - MIDYEAR ROOM - DAY (2016) 107   107 A punch-up session on Comey’s statement: Strzok, Lisa Page, Rybicki, Baker, Trisha Anderson, McCabe, Priestap. The Green Room - Night One   PROD. DBL YELLOW (Nov 26, 2019)   50",
      "characters": [],
      "action_text": "STRZOK I think we should add “Had these same emails been sent on a state.gov system, the FBI would never have investigated this matter.” PRIESTAP Let’s not say “matter,” hmm? Everyone chuckles. Priestap is thoughtful, nervous, careful. STRZOK Would also change “It’s reasonably likely that states hostile to the US gained access to her servers” to “It’s possible” that they did so. Forensics can’t take us any farther. PRIESTAP We shouldn’t say the President was one of the people she was emailing with. No reason to make the GRU’s job any easier. Replace that with “another senior government official.” LISA PAGE ...”who lives at 1600 Pennsylvania Avenue.” More chuckles. MCCABE It’s important to say why the FBI can, in good faith, recommend to DOJ that no charges should be brought here. NOT just because no reasonable prosecutor would bring such a case, but also because it’s the right thing to do. TRISHA ANDERSON But that’s not the tone of this statement at all. The tone is “I’m now going to prove that the Bureau did NOT take it easy on Hillary Clinton. And I’m going to do that by telling you what a horrible thing Hillary Clinton did... even as I’m recommending AGAINST prosecution in her case.” The Green Room - Night One   PROD. WHITE (Oct 3, 2019)   51 LISA PAGE Look. If she’d followed normal protocol in the first place, we wouldn’t have spent the last year fighting her fucking lawyers. Why does she get coddled for   breaking  protocol and possibly the LAW? TRISHA ANDERSON Because we’ve decided NOT to charge her. And I have real concerns about criticizing uncharged conduct. I also think this statement might violate the Department’s Election- Year-Sensitivities Policy. We’re not supposed to do anything within six months of an election that might affect the outcome. PRIESTAP That applies only to election-crime cases. TRISHA ANDERSON Then the policy isn’t   broad   enough. But it should still guide us. LISA PAGE Trisha, half the country thinks these emails are Nine-Eleven! We",
      "dialogue_count": 0,
      "word_count": 1118
    },
    {
      "scene_number": 11,
      "slugline": "INT. FBI DC - 7TH FLOOR - EXEC SUITE - DAY (2016) 114   114 Comey returns from the presser. No one congratulates or castigates him. We land on Trisha, watching him pass. INT. COMEY HOME - DEN - LATER NIGHT (2016) 115   115 Patrice and Abby are on the Couch, watching him get shredded on TV. Benji too. They all study Comey as he enters. COMEY At least I’m finished with her emails already. Abby eyes him. Today has not been fun for her... ABBY Daddy, I don’t think so. Shit. She’s probably right. Patrice studies Comey, pats the seat beside her. We CUT TO: INT. DOJ - DAG'S OFFICE (YATES) - SAME NIGHT (2016) 116   116 Yates sits alone. Just a lamp on. Lost in thought. JUSTIN (O.S.) Ma’am? It’s our own Justin in the doorway. He’s an   intern   at this point, still in Law School. Brand-new. Yates, unfailingly gracious, smiles at him. YATES Hello, Justin! How was your second day at the DOJ? JUSTIN Interesting. YATES Sorry about that. JUSTIN I thought you might want another soda. YATES Oh, no. Just one a day. But thank you. He smiles, about to back out, when-- The Green Room - Night One   PROD. BUFF (Oct 31, 2019)   55",
      "characters": [],
      "action_text": "JUSTIN Mind if I ask you, Ma’am -- what is that? In the frame behind you? She turns. So do we... to find an old PIECE OF CLOTH, with writing on it, in a glass frame. It makes her smile fondly. YATES That was from my first trial ever. Pro bono case when I was at King Spalding. A story, from the Boss! Justin is thrilled... YATES (CONT’D) An all-white jury that found for an African-American woman named Lovie Morrison against a white family trying to steal her land. In Barrow County, Georgia. That cloth was the deed. (a beat) I had never tried a case before. I didn’t even know where to stand. My star witness was a bootlegger’s wife. But that jury did right anyway. You remember that, next time someone tells you this country can’t be its best self. Or the Law doesn’t matter. Justin appreciates it. Nods... JUSTIN ‘Night, Ma’am. YATES ‘Night, Justin. I hope tomorrow’s a little more boring for you... He goes, leaving her alone again. She eyes the framed deed. We do too, and CUT TO: INT. FBI DC - CONFERENCE ROOM - DAY (2016) 117   117 McCabe, Strzok, Baker, Rybicki, Trisha, and Priestap wait. Comey enters, and finds a sea of grim faces. COMEY Okay. Russia. MCCABE Bill? The Green Room - Night One   PROD. PINK (Oct 10, 2019)   56 LIGHTS OUT, MOUNTED MONITOR ON, and under a HEADING that reads “CROSSFIRE HURRICANE,” we see a photo... of George Papadopoulos, with relevant facts. COMEY Who picks these file-names? MCCABE It was randomly generated in C.I. PRIESTAP His name is George Papadopoulos, adviser to the Trump Campaign. We’ve just learned that in March Papadopoulos told an Australian diplomat that the Russian government had dirt in the form of emails on Secretary Clinton and had offered it to the Trump Team. Whoa. A beat passes. Comey digesting what he just heard. COMEY Say more. PRIESTAP The diplomat didn’t think much of it until last week when he saw that the Russians had hacked the DNC. COMEY How high up is Papadopoulos? STRZOK He had a hand in writing Trump’s first foreign",
      "dialogue_count": 0,
      "word_count": 1571
    },
    {
      "scene_number": 12,
      "slugline": "INT. FBI DC - CONFERENCE ROOM - RESUMING (2016) 127   127 Priestap continues: PRIESTAP It was a years-long effort to recruit and maintain Trump as an asset of the FSB, with the long- term strategy of using him to sow discord and disunity within the US and amongst our allies. INT. MOSCOW THEATER - BACKSTAGE - RESUMING (2013) 128   128 Trump nears Sporyshev, Podobnyy, and Goldstone, as we hear: PRIESTAP (V.O.) The dossier further asserts that since last year the Trump campaign has “accepted a regular flow of intelligence from the Kremlin on his political rivals.” INT. FBI DC - CONFERENCE ROOM - RESUMING (2016) 129   129 Again, all eyes on Priestap: PRIESTAP Again, we have NOT corroborated any of this independently. And it should be noted that the original financier of this dossier was a Republican Never-Trumper. The funds to finish the dossier then came from the Democrats. COMEY Go on. INT. MOSCOW HOTEL - CORRIDOR - NIGHT (2013) 130   130 Two GORGEOUS RUSSIAN HOOKERS walk down an empty corridor... PRIESTAP (V.O.) The dossier holds that the FSB’s main leverage over Trump is likely blackmail, made possible because the Russians had videos of Trump engaging in “perverted sexual acts” when he stayed in the Presidential suite of Moscow’s Ritz-Carlton hotel, in 2013. The Hookers knock on the door of the Presidential Suite. The Green Room - Night One   PROD. WHITE (Oct 3, 2019)   62",
      "characters": [],
      "action_text": "PRIESTAP (V.O.) Specifically a “golden showers show.” COMEY (V.O.) I’m sorry. What does that mean? INT. FBI DC - CONFERENCE ROOM - RESUMING (2016) 131   131 Priestap reddens a bit. PRIESTAP It means they defiled a bed that Barack and Michelle Obama had slept in during a state visit - by urinating on it. COMEY I see. PRIESTAP Again, the Bureau has not yet been able to independently corroborate the claim - nor the dossier’s ultimate conclusions. But coupled with what we now know of Trump’s complicated financial ties to Russian banks, his loans from known Oligarchs, his ongoing attempt to build that tower in Moscow, the dossier does provide a plausible if alarming working theory: (reluctantly...) Russia has compromised Trump. Holy Shit. That hovers. Comey gathers himself, then-- COMEY That supposition does not leave this room. Let’s just find out if it’s true. MCCABE How aggressively? (a beat) The harder we pursue, the more likely we are to burn our source. STRZOK Can’t think that way on this one. Can’t do a traditional, years-long CI approach. The Green Room - Night One   PROD. GOLDENROD (Oct 28, 2019)   63 BAKER Why not? STRZOK Because what if   candidate   Trump becomes   President   Trump before we’ve determined whether or not any of this is true? If he takes office and we still think he may be a Russian asset, how would we share Intel with him? How do we vet his National Security nominees? It lands, as always, on Comey. He sighs, then-- COMEY Get me Jim Clapper. INT. WHITE HOUSE - OVAL OFFICE - DAY (2016) 131A   131A Comey, JAMES CLAPPER, JOHN BRENNAN, SUSAN RICE, and MIKE ROGERS report to Obama and his CoS, DENIS McDONOUGH. CLAPPER Mister President, as you know, for the past year we’ve been watching the Russians engage in a multi- faceted influence campaign concerning our election, directed by Putin himself. Cyber-espionage,  propaganda   across all social media platforms, hacking DNC emails and releasing them at the moment of maximum damage. (Obama nods calmly..",
      "dialogue_count": 0,
      "word_count": 4159
    },
    {
      "scene_number": 13,
      "slugline": "INT. BALTIMORE U.S. ATTY’S OFC. - BULLPEN - DAY 155   155 Rosenstein and Comey face 25 ATTORNEYS from Rosenstein’s Baltimore office, Elizabeth Swale and Rhyan among them. Comey may be twisting inside, but he   looks   unshaken, solid... ROSENSTEIN By now you all know Jim Comey’s resume. Former US Attorney in SDNY, former Deputy Attorney General, currently Director of the FBI. He is a man of utter integrity and patriotism. He’s also the reason I’m a US Attorney; Jim   selected   me for this post twelve years ago - which I guess means he owes you all an apology! (a few strained laughs) I wanted him to talk to you about an obsession of his: leadership, especially as seen through the lens of the firestorm he experienced this summer during the Bureau’s investigation of Secretary Clinton. Please welcome my friend and colleague, Jim Comey... The ATTORNEYS applaud. Rosenstein shakes Comey’s hand and takes a seat. Comey steels himself. Then he begins: COMEY Thank you, Rod. I’ll try to live up to that. (eyes the room...) It’s ironic that we’re here to talk about leadership today. In an hour or so, you’re going to see something on your newsfeeds that might make you question whether or not I am actually capable of it. The lawyers laugh. We SMASH TO: INSERT - TELEVISION AND INTERNET COVERAGE -- 156   156  Comey’s letter, having been delivered to Congress, is leaked by Congressman Jason Chaffetz via Twitter... ...and the world simply ERUPTS: TV. Internet. Print. A BLIZZARD of stories, as we RETURN TO:  INT. BALTIMORE U.S. ATTY’S OFC. - BULLPEN - RESUMING 157   157 Comey, mid-speech. The Green Room - Night One   PROD. BUFF (Oct 31, 2019)   82",
      "characters": [],
      "action_text": "COMEY First, I want to   thank   each of you. You came here to do good - and you’ve all made sacrifices to keep that promise. You stay up late working on your summation to explain why a drug dealer or child pornographer is guilty. You chase down materials to organize court exhibits that some yoyo from the Bureau has mislabeled. (they loved that) You shrug pleasantly when you hear people speak of the \"awesome resources of the federal government\" as you eye the fancy supplies at a law firm and think about swiping some stuff to take back to your office. (more laughs) Despite obstacles, you do the work. You protect people. That’s noble. Rosenstein watches, knowing that he could never do what Comey is doing so easily right now. We SMASH TO: INSERT - SMASH TO: MORE TELEVISION AND INTERNET COVERAGE 158   158  Lots of misstatements: “New evidence has come to light in the Hillary Clinton email case.” The story is EVERYWHERE.  INT. BALTIMORE U.S. ATTY’S OFC. - BULLPEN - RESUMING 159   159 Comey, continuing: COMEY What makes that work possible is a reservoir of trust and credibility, a reservoir built for us, and filled for us, by those who went  before   us in this work - most of whom we never knew. Our obligation is to protect that reservoir, to keep it full, or to make it fuller, for those who will follow us into public service. Comey has them. Rosenstein can see it... COMEY (CONT’D) The problem with reservoirs is that it’s hard to   fill   them, but one tiny hole can drain them. That’s what happens if our vigilance (MORE) The Green Room - Night One   PROD. BUFF (Oct 31, 2019)   83 fails, even for a second, if we ever put   anything   - politics, partisanship - above the primacy of truth and justice. INSERT - SMASH TO: MORE TELEVISION AND INTERNET COVERAGE 160   160 More of the blur. DEMOCRATS eviscerating Comey. Then BACK TO: INT. BALTIMORE U.S. ATTY’S OFC. - BULLPEN - RESUMING 161   161 Comey continues: COMEY I love the Bureau. I love its mission-- Hold it. His voice just",
      "dialogue_count": 0,
      "word_count": 1716
    }
  ]
}