{
  "slug": "the-whale-2022",
  "title": "the whale",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 1,
  "characters": [
    "DELIVERY BOY"
  ],
  "total_words": 18981,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. - LIVING ROOM - LATE THAT NIGHT CHARLIE, alone, in front of the television which plays a late- night program.   The chicken bucket is full of bones that have been licked clean, he is eating the last piece. He finishes the piece, throws the bone in the bucket with the others and puts the bucket on the ground.   The effort of bending over causes pain in his chest. CHARLIE (softly, to himself) In the first part of his book, the author, calling himself Ishmael, is in a small sea-side town and he is sharing a bed with a man named Queequeg. The pain subsides.   CHARLIE takes a couple of deep breaths. He lifts his shirt up, barely managing to pull it off of his body. CHARLIE (CONT’D) The author and Queequeg go to church and later set out on a ship captained by the pirate named Ahab who is missing a leg, and very much wants to kill the whale, which is named Moby Dick, and which is white. CHARLIE bends over, reaching under the coffee table.   He barely reaches a half-full bucket of water with a sponge floating in it.   He puts the bucket in his lap, squeezes the water out of the sponge, and starts to clean himself, taking special care to clean in between the flaps of flesh. CHARLIE (CONT’D) In the course of the book, the pirate Ahab encounters many hardships.   His entire life is set around trying to kill a certain whale.   I think this is sad because the whale doesn’t have any emotions, and doesn’t know how bad Ahab wants to kill him. CHARLIE wets the sponge, then sticks his hand into his pants, cleaning his crotch and in between his legs.  14.",
      "characters": [],
      "action_text": "CHARLIE (CONT’D) He’s just a poor big animal.   And I feel bad for Ahab as well, because he thinks that his life will be better if he can kill this whale, but in reality it won’t help him at all. CHARLIE reaches behind the couch, taking out a broom handle with a towel tied to the end of it.   He wets the towel in the bucket, leans forward on the couch, and then reaches the towel around to his back.   The effort of lifting his arms causes pain in his chest.   He squints. INT. - HALLWAY - SHORTLY LATER CHARLIE moves down the hallway on his walker, breathing heavily.   He goes to the end of the hallway, opens a door and barely manages to fit through the doorway. INT. - BEDROOM - CONTINUOUS A soiled, uncovered king-sized mattress lies in the middle of the floor, surrounded by empty food containers and empty and half-full two liter soda bottles.   Bracing himself on the walker, CHARLIE manages to slowly lower himself down onto the mattress.   His knees and chest ache as he descends.   He buries his head in his chest, struggling to breathe. Finally, he is able to lay flat on the mattress.   He stares up to the ceiling, wheezing, taking a few deep breaths. He reaches for a bottle of soda.   He opens it, takes a long drink, then continues to stare up at the ceiling. CHARLIE And I feel bad for Ahab as well, because he thinks that his life will be better if he can kill this whale, but in reality it won’t help him at all. CHARLIE puts the soda bottle on the floor, leaving the cap off.   He closes his eyes, listening to the sound of his heart beating, struggling to pump blood throughout his body. CHARLIE (CONT’D) This book made me think about my own life.   This book made me think about my own life.   This book made me--  15.",
      "dialogue_count": 0,
      "word_count": 615
    },
    {
      "scene_number": 2,
      "slugline": "EXT. - PALOUSE LANDSCAPE Shots of rolling hills of the Palouse, wind rushing over them.   As the images continue, the wind begins to vaguely sound like the sound of waves lapping against the shore. TITLE: TUESDAY INT. - HALLWAY - MORNING CHARLIE is making his way down the hallway toward the bathroom.   It takes a large amount of effort for him to move, he puts all of his weight onto his walker as he slowly moves forward. CHARLIE hears a soft cooing, he looks at an open window.   A bird is perched on the sill.   He looks at it for a moment, expressionless. CHARLIE looks away from the window, then goes toward the bathroom.   He finally makes his way to the bathroom door, opening it. INT. - BATHROOM - CONTINUOUS A series of shots of CHARLIE getting ready for the day. Using mouthwash, struggling to take his shirt off, wiping down his body with a wet cloth, brushing his teeth, applying deodorant all over his torso as best as he can, a meager attempt at smoothing over his hair. INT. - KITCHEN - MORNING CHARLIE opens up a kitchen drawer, there are several loaves of sliced bread inside.   He grabs one of them. As he removes the loaf of bread, he sees an old stash of candy bars hidden in the back of the drawer.   He takes a few of the candy bars, having forgotten he put them there.   He opens one, examining the label.   It’s obviously a few years old. He puts the candy bar back into the drawer. INT. - KITCHEN - MOMENTS LATER CHARLIE, breathing heavily, stands at the counter tearing off tiny pieces of bread and putting them on a small plate.  16.",
      "characters": [],
      "action_text": "As he puts the pieces of bread onto the plate, his eyes continually drift to the drawer with the candy bar stash. INT. - KITCHEN - MOMENTS LATER CHARLIE opens the drawer with the candy stash, grabbing a candy bar.   He opens the wrapping, eats half of it with two quick, large bites.   He then wraps up the remaining half, and begins to put it back in the drawer. He re-opens the drawer, is about to place the half-eaten candy bar inside, then stops.   He looks at the candy bar for a moment. INT. - KITCHEN - MOMENTS LATER CHARLIE stares at the kitchen counter where at least half a dozen candy bar wrappers sit in a pile.   He stares at them for a moment. Scooping up all the wrappers with his hand, he opens the cabinet under the sink and shoves them to the bottom of the trash can, hiding them.   He shuts the cabinet, then grabs the plate of bread crumbs. INT. - LIVING ROOM - MOMENTS LATER CHARLIE places the plates of bread crumbs on the window sill. INT. - LIVING ROOM - MOMENTS LATER CHARLIE, covered with sweat from the move to the living room, collapses on his couch with his walker.   He takes his computer, opens it. He types “congestive heart failure” into Google. He scans the Wikipedia article.   His heart rate begins to increase. He goes back, does another search: “congestive heart failure obesity”. He scans through a few results.   Sweat builds on his forehead, his pulse quickens. He goes back, does another search: “congestive heart failure obesity prognosis”.  17. As his heart rate spikes, he has a sudden pain in his chest. He grabs his chest, breathing heavily, wheezing.   He shuts the computer, slowly calming himself down. He thinks for a moment, then looks at his cell phone. The sound of flapping wings.   CHARLIE looks to the window, the bird is back, tentatively eating the bread off the plate. CHARLIE looks at it, smiling slightly. INT. - LIVING ROOM - THAT AFTERNOON ELLIE, 17, holding a backpack, stands in the open doorway looking at CHARLIE, who sits on the co",
      "dialogue_count": 0,
      "word_count": 5798
    },
    {
      "scene_number": 3,
      "slugline": "INT. - LIVING ROOM - LATER CHARLIE is on the couch, looking through some pamphlets absent-mindedly.   THOMAS holds a Bible. THOMAS I mean the Bible says that no one will know the precise day or hour, but the signs are there.   God’s sending us warning that it’s coming. CHARLIE looks turns a page in the pamphlet.   There is an illustration of hundreds of people floating up to heaven from out of a hellish city landscape. CHARLIE flips a page, the phrase “THE DAY IS COMING” appears in bold letters. THOMAS (CONT’D) What’s going on in Israel right now, I mean really what’s happening all over the Middle East, it’s all there in Revelation, you just have to-- CHARLIE You really think the world is gonna end soon? THOMAS I mean I think there’s really good reason to believe that we’re living in end times-- CHARLIE And that doesn’t...   Bother you? CHARLIE flips another page in the pamphlet.   There is an illustration of a thoroughly Caucasian Jesus, his arms open wide. THOMAS No, it--.   I think it’s a great gift.   I think it’s... CHARLIE turns to THOMAS.   THOMAS thinks, looking at his hands.  44.",
      "characters": [],
      "action_text": "THOMAS (CONT’D) The idea that there’s a better world coming to replace this one, that we can be released from this life, from our worldly desires and faults, and--.   It’s just... CHARLIE looks at him.   THOMAS continues to look at his hands. CHARLIE Oh. THOMAS quickly regains himself. THOMAS So the restoration of the state of Israel is probably the biggest sign of Christ’s coming, so we probably-- CHARLIE puts down the pamphlet. CHARLIE Look, I--.   I’m sorry, I don’t mean to be rude, but...   I know all this. THOMAS What do you mean? CHARLIE I’ve probably read just about everything written about New Life Church, probably every pamphlet they’ve ever published-- THOMAS Oh well--.   I mean that’s great, but if you actually read Revelation, you’ll see that-- CHARLIE I’ve read the Bible. Pause.   THOMAS looks at him, smiling. THOMAS Oh yeah? CHARLIE Sure.   Couple times. THOMAS Did you...   Like it?  45. Pause. CHARLIE I thought it was...   Devastating. God creates us, expels us from paradise, then we wander around for thousands of years killing each other before he comes back and sends most of us to hell. Pause.   THOMAS thumbs through his Bible a bit. THOMAS Yeah, I never really thought about it like that, but. Finally, THOMAS sighs, puts down the Bible.   He sits next to CHARLIE. THOMAS (CONT’D) You have to understand--when God comes again?   It’s going to be  amazing .   If you accept him, he’s going to release you from this, he’s going to take your soul out of this body and give you a new body, one made of pure light. CHARLIE sighs, looking away from him.   He glances out the window. CHARLIE Thomas, I’m not interested in converting.   I appreciate you helping me out yesterday, but you can go, this doesn’t-- THOMAS Did you used to go to New Life or something? Pause.   CHARLIE looks at him. THOMAS (CONT’D) Sorry it’s just--.   Your friend, Liz, she told me that New Life has-- caused you a lot of pain? Pause. CHARLIE No, I--.   I never went to New Life. But I...  46.",
      "dialogue_count": 0,
      "word_count": 1883
    },
    {
      "scene_number": 4,
      "slugline": "INT. - LIVING ROOM - THAT NIGHT CHARLIE is on his wheelchair in the kitchen, making several sandwiches.   The television is on in the background playing a late-night show. CHARLIE finishes the last sandwich, puts them on his lap, then starts to wheel himself back toward the couch and television, wheezing heavily. He has a pain in his chest and winces.   Most of the sandwiches fall off his lap and onto the floor. He stares at the sandwiches for a moment. In a moment of rage, CHARLIE grabs a nearby book and throws it across the room.   It hits a lamp in the corner of the room, shattering it. A dog from a nearby apartment is heard barking. CHARLIE stares at the broken lamp, immediately ashamed.   He takes a few deep breaths, calming down. INT. - LIVING ROOM - LATER THAT NIGHT CHARLIE is on his wheelchair, not far from where he was hours ago.   He is scanning through channels on the television absent-mindedly. A knock at the door. DELIVERY BOY (O.S.) Gambino’s. CHARLIE turns off the television. CHARLIE Hi, yeah.   You can-- DELIVERY BOY (O.S.) Money in the mailbox, leave it at the front door? Pause. CHARLIE Yeah, uh.   Thank you. CHARLIE pauses, waiting for the DELIVERY BOY to take the money and leave the pizza.   He doesn’t hear anything. Another moment passes.  54.",
      "characters": [
        "DELIVERY BOY"
      ],
      "action_text": "This notebook is retarded.   I hate everyone.” CHARLIE smiles wider.   He begins to laugh a little.   The laughter grows and soon it causes a sudden pain in his chest, the most severe he’s had so far.   He grabs his chest, speaking softly to himself. CHARLIE (CONT’D) I felt saddest of all when I read the boring chapters that were only descriptions of whales because I knew that the author was just trying to save us from his own sad story, just for a little while. This apartment smells. The pain in his chest starts to slowly subside.   He takes a few deep breaths, starts to smile again. CHARLIE (CONT’D) This apartment smells.   This notebook is retarded.   I hate everyone.   The author was just trying to save us from his own sad story.   I hate everyone.   The author was just trying to-- EXT. - PALOUSE LANDSCAPE More shots of rolling hills in the Palouse, wind rushing over them.   The images of the hills, as well as the sound of the wind, now distinctly resemble ocean waves.   This time, the waves are more aggressive, more distinct. TITLE: THURSDAY INT. - LIVING ROOM - THE NEXT DAY CHARLIE in his wheelchair, with his laptop on his lap, speaking into a microphone. CHARLIE I read a recent post on the discussion forum about strategies for coming up with a good thesis. CHARLIE pulls up the discussion forum in a window on his computer.  56.  CHARLIE (CONT'D) CHARLIE (CONT’D) It says that I want you to-- (reads) “Pick a sentence from the book and say it’s good or some shit.” Pause.   CHARLIE sighs, closes the window on the computer. CHARLIE (CONT’D) You don’t have any true reaction to these books, because I’ve taught you to edit your reactions, to reconfigure them so many times that you don’t--... CHARLIE stops, at a loss. He moves the microphone away from his mouth, is about to shut the computer. He has a thought, then stops.   He thinks for a moment, then picks the microphone back up. CHARLIE (CONT’D) How about this?   Don’t write about the book.   Forget the assignment, ",
      "dialogue_count": 1,
      "word_count": 2945
    },
    {
      "scene_number": 5,
      "slugline": "INT. - HALLWAY - CONTINUOUS ELLIE listens at the door.   She tries the knob one more time, it still won’t work.   She thinks for a moment, then pulls out her iPhone. ELLIE So why did you leave? THOMAS (O.S.) Because I think I was about to be excommunicated. ELLIE scrolls through her iPhone, opening up a voice memo app. ELLIE I don’t know what that means. THOMAS (O.S.) Like kicked out.   Of the church. ELLIE presses record, places her iPhone at the base of the door, pointing the microphone inside the bedroom. THOMAS (O.S.) (CONT’D) I got caught--smoking pot.   My best friend and I got caught smoking pot. ELLIE You’re getting kicked out of the church for   that?  THOMAS (O.S.) For smoking pot, and--doing other stuff. ELLIE thinks for a moment, realizing.   She smiles, nearly laughs out loud, stifles it. ELLIE So you and your   boyfriend -- THOMAS (O.S.)  He isn’t my--  ELLIE That’s why you left?  70.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 159
    },
    {
      "scene_number": 6,
      "slugline": "INT. - BEDROOM - CONTINUOUS THOMAS stands at the window, staring outside.   He starts to wander around the room aimlessly. THOMAS He told his parents I had pressured him into it.   That I got him high and pressured him into it.   It wasn’t even   my pot , it--... ELLIE laughs a little. THOMAS (CONT’D) Are you laughing at me? ELLIE (O.S.) Well, yeah. Pause. THOMAS I’m really fucked up. ELLIE (O.S.) Yes, you are. THOMAS I think my parents were about to kick me out of the house.   My dad can barely even look at me now. THOMAS looks down, sees the box that CHARLIE had before.   The lid is slightly ajar, THOMAS opens the box slightly further with his toe. ELLIE (O.S.) So why’d you come here? THOMAS sits down on the floor, looking in the box.   He takes out a framed photo, looks at it.   The photo is of CHARLIE’s partner, younger than the picture of him and CHARLIE on the coast.   The photo appears to be from a church confirmation ceremony. THOMAS I’ve always heard about New Life, the way they built up their congregation by door-to-door proselytizing, it just sounded so inspiring, it...   I just thought if I could see God working in people’s lives, then maybe it’d--help me?  71.",
      "characters": [],
      "action_text": "ELLIE (O.S.) Turn you straight? THOMAS puts the photo back in the box, takes out another photo.   It’s about ten years old, a photo of CHARLIE with his arms around his partner.   THOMAS looks at it for a moment. THOMAS Save my soul. ELLIE (O.S.) Same thing? Pause.   THOMAS puts the photo back in the box, picking up the essay on   The Sound and the Fury   that CHARLIE placed in there before.   He looks at the name at the top of the paper: “Alan Grant”. He thinks for a moment, then picks up the Bible.   He looks at it, opens it to the first page.   There is a large stamp reading “New Life Church”, and the name “Alan Grant” written on the top right hand corner of the page. THOMAS stares at it, realizing.   He flips through the Bible, which has obviously been meticulously studied--nearly every page has highlights, notes, or underlines. INT. - HALLWAY - CONTINUOUS ELLIE stands at the door, looking down at her iPhone, which is still recording. ELLIE So that’s why you wanna save my dad. The bedroom door unlocks, ELLIE quickly grabs her iPhone, shuts off the recording.   She puts it in her pocket. The door slowly opens, THOMAS stands looking at her. Silence. ELLIE takes her iPhone out and takes a picture of THOMAS. She smiles at him. Suddenly, the front door opens and LIZ enters, followed by MARY, a woman of about 40 but who looks considerably older. ELLIE sees MARY, goes to her. ELLIE (CONT’D) (to MARY) Mom--  72. MARY Shut up. LIZ looks at THOMAS and ELLIE. LIZ What the fuck is going on here? LIZ turns and sees CHARLIE, still asleep in his wheelchair. LIZ (CONT’D) Charlie. LIZ goes to CHARLIE.   MARY turns and finally gets a look at CHARLIE.   She freezes for a moment, shocked. LIZ (CONT’D) Charlie? LIZ shakes CHARLIE a bit, trying to wake him up.   She checks his breathing. MARY goes to CHARLIE as he wheezes loudly in his sleep.   She looks at him closely. MARY Charlie... MARY gets closer, examining his body in disbelief.   She looks him up and down as ELLIE moves into t",
      "dialogue_count": 0,
      "word_count": 3779
    },
    {
      "scene_number": 7,
      "slugline": "INT. - LIVING ROOM - MOMENTS LATER CHARLIE, near the couch, is ravenously eating the pizza. Sauce is getting everywhere, CHARLIE is struggling for breath but continues to eat. He eats furiously, angrily, chewing and swallowing dangerously fast.   Sweat pours down his face. INT. - LIVING ROOM - SHORTLY LATER Still eating the pizza, CHARLIE opens up his laptop.   He logs on to his teaching software, then begins to write a post to all of his students in all of his classes. We see only bits and pieces of what he’s writing: “just give me something fucking honest”, “fuck the readings”, and most notably, “THIS CLASS IS FUCKING BULLSHIT”. INT. - KITCHEN - SHORTLY LATER CHARLIE is at the fridge, sweating and breathing heavily.   He opens the door, searching around inside.   There is very little food.   He finds the jar of mayonnaise from before, eats from it with his bare hands. He searches around the kitchen, finds a few more bits of food: some cereal bars, potato chips, various junk food. A series of shots of CHARLIE eating, barely stopping to take a breath. Finally, unable to continue eating and breathing at the same time, he stops for a moment, taking a breath.   He looks up, breathing in and out. He has a pain in his chest, he doubles over in pain.   Just after the pain hits, he is overcome with a wave of nausea. He reaches under the sink, grabbing a trash can.   He holds the can up to his head, vomiting into it. Finally, he begins to calm down.   His breathing slowly returns to normal.   He puts the trash can down on the floor. He looks around the room, holding back tears. INT. - KITCHEN - LATER THAT NIGHT CHARLIE is asleep in his wheelchair, in the same position as before.   A loud knocking jolts him awake, producing pain in his chest.   Another knock.  90.",
      "characters": [],
      "action_text": "CHARLIE Liz?! THOMAS (O.S.) Can I come inside?! INT. - LIVING ROOM - CONTINUOUS CHARLIE barely manages to wheel himself out of the kitchen and into the living room, moving toward the door.   A dog in a nearby apartment starts barking. CHARLIE What’s wrong?! THOMAS (O.S.) I’m sorry, I just--.   I had to come over, right now. CHARLIE approaches the door, opens it.   THOMAS stands in the doorway, disheveled and bristling with energy.   A neighbor bangs on the wall. CHARLIE Just--.   Sh-- THOMAS (lowering his voice) I’m sorry.   Sorry. THOMAS makes his way inside, shutting the door behind him. CHARLIE pivots, facing THOMAS. CHARLIE What’s wrong? THOMAS My parents found out where I am. Pause. CHARLIE What? THOMAS Your daughter she took pictures of me smoking pot, and made a recording or something, and she sent it to my parents’ church and told them where I was. CHARLIE I don’t.   Really understand.  91. THOMAS sits down on the recliner. THOMAS My parents called me a few hours ago, and you know what they said? They said they were   glad   that they heard me say those things.   They said they finally   understood , and that they   loved   me and   cared   about me and wanted me to come home. CHARLIE looks at THOMAS, confused. CHARLIE I don’t-- THOMAS They’re coming to get me, tomorrow. And I sort of can’t figure out if your daughter was trying to help me or hurt me, I really don’t know what-- CHARLIE has a pain his in chest, he doubles over.   THOMAS goes to him. THOMAS (CONT’D) What’s wrong? CHARLIE Nothing, it just--.   It just hurts. THOMAS I want to help you.   I know I can help you. CHARLIE I’m not going to the hospital-- THOMAS I know.   I won’t make you go, but I can help you. THOMAS finds a chair, drags it next to CHARLIE, sitting down. THOMAS (CONT’D) Charlie, it’s not too late to know God’s love. CHARLIE sighs, looking away from THOMAS.  92. THOMAS (CONT’D) You don’t have to be in this kind of pain anymore, you don’t have to let your body hold your spirit down. C",
      "dialogue_count": 0,
      "word_count": 2208
    },
    {
      "scene_number": 8,
      "slugline": "INT. - LIVING ROOM - LATER LIZ stands in the open doorway, staring at the broken computer, holding a bag. CHARLIE is in the same position as before. CHARLIE I’m sorry. LIZ Don’t. LIZ makes her way inside, shutting the door. CHARLIE Liz-- LIZ I said don’t. LIZ takes the stethoscope off of CHARLIE, puts it back in her bag.   She moves away from CHARLIE. LIZ (CONT’D) I really hate you for putting me through this again, you know that? (pause) Those last few months before Alan...   I’d come over here, scream at him, shake him, just trying to get him to fucking   eat something . God, that was awful. CHARLIE It was awful for me, too. LIZ Well you weren’t the one who found him.   In your bed, underneath the covers, curled up like a fetus. LIZ stands for a moment, then goes to her bag.   She takes out a plastic bag filled with two sub sandwiches.   She drops the sandwiches onto the couch, looking at CHARLIE, defeated. LIZ (CONT’D) I don’t know what I’m doing. LIZ goes to CHARLIE, bending down to him, looking directly at him. CHARLIE I’m not.   Going to the hospital.  100.",
      "characters": [],
      "action_text": "LIZ looks at him. LIZ I’m not asking you to, Charlie. (pause) I can’t do this anymore. CHARLIE reaches up, brushing her face with his hand gently. He smiles at her. CHARLIE’s breathing is very shallow, sweat pours down his face.   He struggles for breath. CHARLIE looks out the window as LIZ begins to cry. Very softly, we begin to the hear the sound of waves as CHARLIE stares out the window.   CHARLIE smiles, joy radiating from underneath immense pain. CHARLIE She helped him. Pause. LIZ What? CHARLIE She wasn’t trying to hurt him.   She was trying to help him. LIZ finally looks at him. LIZ Who are you talking about? CHARLIE The kid from New Life.   He’s going home.   She did that.   She wasn’t trying to hurt him. LIZ goes to CHARLIE, putting her hands on his head. LIZ Charlie? CHARLIE She didn’t do it to hurt him, she did it to send him home. LIZ Do you feel light-headed?   Charlie, look at me.  101. CHARLIE She was trying to help him. LIZ Who? CHARLIE Ellie.   She was trying to help him, she just wanted him to go home. CHARLIE looks at LIZ lovingly.   He takes her hands, smiling at her. CHARLIE (CONT’D) Do you ever get the feeling.   That people.   Are incapable.   Of not caring?   People.   Are.   Amazing. Suddenly the door opens and ELLIE charges inside, holding the essay from before.   She advances on CHARLIE, but then stops when she sees the state he’s in. ELLIE What’s wrong with him? LIZ He’s dying. Pause. ELLIE So call someone. CHARLIE No. ELLIE Call a fucking ambulance! CHARLIE Liz. LIZ looks at CHARLIE, CHARLIE looks back at her. ELLIE I need to talk to him. LIZ I’m not leaving you alone with him. ELLIE  I need to talk to him alone .  102. CHARLIE Liz.   Please. CHARLIE and LIZ continue to look at one another, silently. Finally, LIZ smiles at him, nodding. Pause. LIZ Okay. (pause) Okay, I’ll--.   I’ll call someone, and I’ll wait downstairs. LIZ takes her cellphone out of her pocket, moving toward the door. Before she exits, LIZ stops, moves to CHARLIE, kissi",
      "dialogue_count": 0,
      "word_count": 1594
    }
  ]
}