{
  "slug": "the-marvelous-mrs-maisel-101-pilot-2017",
  "title": "the marvelous mrs maisel 101 pilot",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 5,
  "characters_count": 0,
  "characters": [],
  "total_words": 10006,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BEDROOM - SAME TIME Midge blinks her eyes awake.   She quickly peeks over her shoulder.   Joel is dead asleep.   Midge slips out of bed. INT. BATHROOM - MOMENTS LATER Midge takes the cold cream off her face. Midge applies powder, lashes, and lipstick. Midge unwraps the toilet paper from her head. Midge un-pins her pin curls. Midge brushes her hair and mists herself with perfume. INT. BEDROOM - MOMENTS LATER Midge carefully slips back into bed, gently puts her head back down on the pillow and closes her eyes.   Beat. The ALARM CLOCK GOES OFF.   Joel wakes up.   He stretches and then glances over at Midge “sleeping”.   He shakes her. JOEL Hey.   Morning. Midge “wakes up” slowly.   She turns to him. MIDGE (sleepily) Did the alarm go off? JOEL It sure did. He kisses her and smiles. MIDGE Wow.   I didn’t hear it at all. JOEL You never do. Joel gets out of bed.   Midge smiles.   It worked again. INT. LIVING ROOM - MORNING Midge emerges from the bedroom perfectly dressed in a perky sleeveless dress.   She heads to the kitchen. 22.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 184
    },
    {
      "scene_number": 2,
      "slugline": "INT. KITCHEN - MOMENTS LATER Midge finishes washing the Pyrex.   She dries it lovingly and puts it back on it’s proper shelf above the stove. INT. LIVING ROOM - MOMENTS LATER Midge sweeps through the room and exits. INT. HALLWAY - CONTINUOUS Midge goes over to the elevator and pushes the button.   Beat. The door opens.   The ancient Jerry is on his stool. MIDGE Morning Jerry. The doors close. INT. ELEVATOR - CONTINUOUS JERRY Yesterday?   That was a good cookie. MIDGE I’m so glad. Midge glances up at the elevator numbers. ANGLE ON THE NUMBERS 10 lights up.   11 lights up.   12 lights up.   Ding. MIDGE (CONT’D) See you later, Jerry. The doors open.   Midge walks out. INT. HALLWAY - CONTINUOUS Midge walks over to apartment 12C and walks on in. INT. WEISSMAN APARTMENT - CONTINUOUS Midge walks in. MIDGE (calling out) Hello!   It’s me. ZELDA, the Weissman’s crisply uniformed maid comes out. 23.",
      "characters": [],
      "action_text": "ZELDA Morning, Ms. Miriam.   Can I get you some coffee? MIDGE Oh, yes Zelda, please. Midge walks over to the den.   This is Abe’s domain.   Big leather chair and his baby grand piano.   The door is open. Abe sits reading the paper.   ETHAN, Midge’s three year old son, lays on the floor also “reading” the paper. MIDGE (CONT’D) Morning, Papa. Abe nods but keeps reading. MIDGE (CONT’D) Morning, Ethan. Ethan just keeps reading his paper. MIDGE (CONT’D) Morning Ethan. (nothing) Ethan? (nothing) Ethan? (nothing) Ethan? (nothing) Etha-- Oh, never mind. Midge starts off.   Rose walks up in a feather trimmed satin dressing gown like something out of an MGM musical. ROSE Did you get coffee? MIDGE And a great welcome from my son. ROSE (shrugs) Men. MIDGE Thanks for taking the kids last night.   Were they okay? ROSE We need to talk about the baby. MIDGE Why?   What’s the matter with her? 24.",
      "dialogue_count": 0,
      "word_count": 308
    },
    {
      "scene_number": 3,
      "slugline": "INT. BEDROOM - CONTINUOUS Very pink, very feminine, very Rose.   Rose and Midge enter and walk over to a bassinet. ROSE (pointing to the baby) That forehead is not improving. Rose lifts ESTHER, 1, out and lays her down on the bed. MIDGE What?   Are you sure? ROSE It’s getting bigger.   The whole face will be out of proportion. MIDGE But look at her nose.   It’s elongating now, see? ROSE The nose is not the problem.   The nose you can fix.   But this gigantic forehead... MIDGE Well, there’s always bangs. ROSE I’m just afraid she’s not a very pretty girl. MIDGE Mama, she’s a baby. ROSE I just want her to be happy.   It’s easier to be happy when you’re pretty. (looks at Esther and sighs) You’re right.   Bangs will help. Midge picks up the baby.   They start out of the room. ROSE (CONT’D) How did Joel’s little show go? MIDGE It went very well. ROSE I still don’t understand this whole thing.   Who is he performing for? MIDGE Anyone who shows up. 25.",
      "characters": [],
      "action_text": "ROSE And they pay you? MIDGE They pass a basket around at the end of your set and whatever’s in it you get to take home. ROSE If you need money, we can give you money. MIDGE We don’t need money.   Joel is funny and he likes to do his comedy. ROSE But how long are you going to be doing this?   Running around at night, taking money from strangers like a Schnorrer? MIDGE As long it’s fun. ROSE Hmm. (she taps Midge’s biceps) Six to nine more months left on those arms. MIDGE Really?   I’ve been doing those exercises with the soup cans. ROSE Forget the cans.   Buy a bolero. They exit. INT. LIVING ROOM - CONTINUOUS Midge and Rose walk in. MIDGE (calling out) Ethan!   Let’s go! ROSE Is everything ordered for next week? MIDGE Yes.   All done. 26. ROSE I thought we’d do dinner at your place.   Your dining room is bigger than ours. ABE (O.C.) Our dining room is fine. ROSE If you don’t entertain, it’s fine. Ethan comes out.   Midge puts Esther in a stroller. MIDGE I’ll call you later.   Bye, Papa. (to Ethan) Say good-bye, Ethan. (nothing) Ethan? (nothing) Ethan? (nothing) Eth-- oh never mind. Midge pushes the stroller and Ethan out the door. INT. MIDGE’S LIVING ROOM - EVENING Midge stands in the middle of the room wearing a black leotard and black tights measuring her ankles with a tape- measure.   Her friend IMOGENE is sprawled out on the couch, a pitcher of daiquiri’s and a couple of glasses sit on the coffee table.   The television is on.   Imogene is a round- faced, slightly dizzy lady, mid-twenties, who is probably never going to lose that last bit of baby weight.   She has a pen and a thick black leather binder on her lap. IMOGENE So, she’s going on and on about this miracle treatment she had done in Mexico.   It involved goat’s milk and avocados. MIDGE Right ankle 6.   Left ankle 6. IMOGENE (writes in the binder) They smear it on your face, wrap a hot towel around your head and put you in a boat... MIDGE Right calf 13.   Left calf 12 and three quarters. 27. IMOGENE (writ",
      "dialogue_count": 0,
      "word_count": 4300
    },
    {
      "scene_number": 4,
      "slugline": "EXT. APARTMENT BUILDING - NIGHT It’s raining and miserable out.   Roberto stands by the entrance doors having a smoke.   Midge, a coat thrown over her nightgown and the wine bottle still in her hand, walks out. Roberto spots her and rushes over. ROBERTO Mrs. Maisel?   Are you alright?   Do you need a cab? MIDGE (reaches into her pocket and pulls out the subway token) Nope.   Gonna take the subway. ROBERTO It’s miserable out here. MIDGE (indicating apartment) It’s miserable in there, too. Midge heads off to the subway. INT. SUBWAY CAR - NIGHT CLOSE ON Midge drinking straight from the bottle.   We WIDEN to reveal other riders watching her nervously.   Even the scary ones are slowly moving away from her. INT. GASLIGHT CAFE - NIGHT The crowd has thinned out a bit from earlier.   A very soggy and slightly tipsy Midge makes her way down the stairs.   She walks over to a bored waitress sitting at the bar. MIDGE I left my Pyrex here and I’d like it back. WAITRESS Your what? MIDGE Pyrex.   My Pyrex. WAITRESS (no idea what you’re talking about) Nope. MIDGE (exasperated) It’s a Pyrex. 51.",
      "characters": [],
      "action_text": "WAITRESS You keep saying that but... MIDGE Pyrex!   A glass baking dish.   Very durable, can go from hot to cold without cracking. WAITRESS We don’t serve food here. MIDGE I know.   It’s not yours.   It’s mine.   I brought it here. WAITRESS Why? MIDGE I made a brisket for... is that really important right now?   My dish is here.   I’d like it back. Can you make that happen? WAITRESS Where is it? MIDGE I don’t know.   I had hoped you’d have a clue. WAITRESS I don’t. MIDGE (beat) Hey, have you ever thought about being a secretary? The waitress looks at her a beat. MIDGE (CONT’D) (deep breath) Where do you wash the coffee cups? WAITRESS In the back. Midge smiles at her.   “Well?” WAITRESS (CONT’D) This place gets so weird late. The waitress pulls herself off the stool and begrudgingly ambles off.   Midge sits exhausted.   The young fragile sad poet finishes and the room applauds half-heartedly.   Midge takes the last swig from her bottle.   It’s empty.   She sighs and puts it on the bar.   The M.C. takes the stage again. 52. M.C That was deep, Christian.   I think. Who knows?   Okay, next up... (rummages in his pocket) ... Huh... hang on folks.   I’ll be right back. He gets off the stage. M.C (CONT’D) (calling off) Dottie!   Where is my set list? The audience starts talking amongst themselves.   Midge, eyes fixed on the stage, slowly gets up and steps up on it, almost as if in a trance.   She walks around, taking it in.   She stops, facing away from the audience. MIDGE (talking to herself) So, this is it, huh? The audience starts to notice her. MIDGE (CONT’D) This is the dream.   Standing up here on this filthy sticky stage all alone... if you couldn’t have that, you didn’t want me.   Was that it, Joel? Beat. BLONDE IN FRONT ROW Who’s Joel? Midge turns around startled, not realizing she was being watched.   There’s a bright spotlight on her.   She blinks, partially blinded. MIDGE Oh!   What? BLONDE IN FRONT ROW Who’s Joel? MIDGE My husband. A MAN WITH THE BLONDE WOMAN ",
      "dialogue_count": 0,
      "word_count": 4036
    },
    {
      "scene_number": 5,
      "slugline": "INT. APARTMENT - CONTINUOUS A spacious, stylish, flower filled living room. JOEL Are the kids alright? Midge looks around the room. MIDGE (turns to Joel) Is this where you live now? JOEL Well... MIDGE It’s nice.   Really nice. (to Joel) In fact it’s an awful lot like our place. JOEL What? MIDGE The building, the hallway, this room - all very similar to ours. That’s the couch I wanted to buy but you felt was too deep. JOEL I don’t remember what couch you wanted to... MIDGE I thought I’d find you squatting in some downtown smoke filled loft. Not two blocks away living the Methodist version of our life. With the methodist version of me. A ding is heard from the kitchen.   Midge looks at Penny. PENNY (wilting) Dinner. MIDGE Brisket? PENNY Pot roast. Penny rushes off. MIDGE The methodist version of brisket. 73.",
      "characters": [],
      "action_text": "JOEL Midge... MIDGE So, is that what you were missing, Joel?   Pot roast and Santa Claus? JOEL Of course not. MIDGE You said you didn’t want our life. But this is our life.   You didn’t go somewhere exotic and different you went across the street. JOEL I had to. MIDGE Why?   Tell me why? JOEL Because... after the other night, at the club, after I failed like that, I just knew - you’d never look at me the same again. MIDGE (look around once more, shakes her head) Okay.   I’ll have your things packed up and delivered here. She starts out. JOEL Midge, wait -- is that what you came here to say? She stops.   Beat. MIDGE No. Midge smiles at him sadly and walks out the door.  MONTAGE - PEGGY LEE’S “PASS ME BY” PLAYS  PEGGY LEE (sings) “I GOT ME TEN FINE TOES TO WIGGLE IN THE SAND / LOTS OF IDLE FINGERS SNAP TO MY COMMAND...” EXT. STREET - NIGHT As Midge walks defiantly down the street. 74. PEGGY LEE “A LOVERLY PAIR OF HEELS THAT KICK TO BEAT THE BAND / CONTEMPLATING, NATURE CAN BE FASCINATING...” INT. SUBWAY CAR - NIGHT As Midge stands holding a strap in the crowded car. PEGGY LEE “ADD TO THESE A NOSE THAT I CAN THUMB / AND A MOUTH BY GUM HAVE I...“ EXT. GREENWICH VILLAGE - NIGHT As Midge emerges from the subway at Christopher Street - PEGGY LEE “TO TELL THE WHOLE DARN WORLD IF YOU DON’T HAPPEN TO LIKE IT / DEAL ME OUT / THANK YOU PASS ME BY.” INT. SUSIE’S APARTMENT - NIGHT A dumpy basement apartment, basically a dark square with one narrow window through which you can see people’s feet walking on the sidewalk outside.   The only furniture in the place consists of a sad couch opposite the front door and a beat-up coffee table in front of the couch.   Piles of newspapers, magazines, and record albums are stacked everywhere.   Susie stands in her “kitchen” (a hotplate on the radiator) eating beans out of the pan she heated them in.   She finishes, tosses the pan, goes to the couch and shoves it over to the window wall.   She then shoves the coffee table in front of the couch",
      "dialogue_count": 0,
      "word_count": 1178
    }
  ]
}