{
  "slug": "the-last-of-us-103-long-long-time-2023",
  "title": "the last of us 103 long long time",
  "genre": "action",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 14160,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. WOODS - MORNING (D6)  The just-rising sun shines straight at us, filtered and dappled through red oaks and eastern pines. The soft, gentle creak of a New England woods. Bird songs. The hum of insects. A large pond. Bullfrogs. Dragonflies. Two old rock walls... a tiered mill dam, slouching from age. Streamwater pours through an opening that was once a sluice. A brook in a glade. Cold, crystal-clear water rolls by over smoothed stones. We hold on it, and then: A HAND, bruised and cut, lowers into the water. JOEL - winces as the water rolls over his bare hand. His breath puffs out in the frigid morning air. He's not wearing his coat. Shivering. But he keeps his hand in the water. Even though it hurts. After a few moments, his hand closes around a stone. He pulls it from the brook, and TOSSES it to the side, where it thunks softly on weedy grass. ON THE STONE - thunk, clack, thunk, time skipping as more stones hit the ground... the pile grows... Another little skip ahead, and we see: A CAIRN - seven stones, one stacked upon the other, from largest to smallest as the cairn rises. Joel places another stone on the top. Then a final one. It's done. He rests on his knees in front of the cairn by the brook by the woods by the sunrise... He's probably supposed to cry or something, but that's not happening. All he feels is anger at himself.   Couldn't save her. Can't save anyone. Fucking useless.  A moment or two, and then he makes a vaguely apologetic gesture to the pile of stones.  This is the best I can do . He gets up on his feet, and then looks back behind him toward the thick part of the woods. Hard to say what he's thinking. But it's nothing good.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 313
    },
    {
      "scene_number": 2,
      "slugline": "EXT. DEEPER IN THE WOODS - LATER (D6)  On Joel's boots. Crunching softly on the dead leaves. The occasional snap of twig. A slow, steady pace. On Joel's back - we follow him, his breath trailing behind as he moves inexorably through the woods.  crunch crunch crunch...  And then he stops. REVERSE TO REVEAL - ELLIE - cross-legged on the ground, Joel's jacket around her like a blanket, facing forward. Joel stands in the B.G. behind her. She doesn't turn around. Until she does. ELLIE You want your jacket back? He avoids her eyes the moment she turns around. And he doesn't answer. He just sits down next to his backpack, and pulls out some beef jerky. He tosses her some. Maybe like you would to a dog.  Okay. Fine. If that's how it is.   She takes it and eats some. They both chew in silence. Then: ELLIE I've never been in the woods. He gives a little shrug. ELLIE There's more bugs than I thought. beat (   ) Look, I-- JOEL I don't want your sorries. ELLIE I wasn't going to say I'm sorry. I was going to say I've been thinking about what happened. No one made you take me. No one made you or Tess go along with this plan. You needed a truck battery or whatever, and you made a choice. 2.",
      "characters": [],
      "action_text": "He looks at her. Wants to be disgusted, but sees how easily her emotions come. His eyes won't fill up. Hers do. ELLIE So don't blame me for something that isn't my fault. He starts to say something, but nothing comes. Because he has no argument for that. She's right.  And she's just a kid. What's wrong with you?   So after a bit, he gives her the tiniest acknowledgment. It isn't her fault. Good. She wills her eyes to dry. Then: ELLIE How much longer? JOEL Five hour hike. She nods. Grabs her backpack and stands up. ELLIE We can manage that. Yeah. Five hours. He can.  EXT. THROUGH THE WOODS - LATER (D6)  Joel and Ellie hike silently up an incline. Ellie keeps looking around like a tourist. She passes through a small cloud of moths. Holds her arm out, waves through them... it's beautiful...  EXT. STONE BRIDGE - LATER (D6)  Joel and Ellie from a distance, crossing an old stone bridge. No one else around. No one in sight.  EXT. COUNTRY ROAD - LATER (D6)  Ellie and Joel walk side by side, right down the middle of an old two lane road. Joel carries his rifle loosely in his hands. Looks to the sides of the road, toward the woods one way or the meadow the other way, as they follow the yellow divider line. 3. Ellie occasionally takes an extra skip or two to keep up. They continue in silence, and then: ELLIE You've gone this way a lot? Joel's surprised to hear her voice. Been so quiet for a while now. He nods.   Yes. I've gone this way a lot.  ELLIE No Infected? JOEL Not often. ELLIE So what are you looking out for? JOEL People. ELLIE Oh.   beat (   ) Are Bill and Frank nice? JOEL Frank is. ELLIE the side of his head (   ) How'd you get that scar? JOEL not a topic (   ) Come on. ELLIE What? Is it something lame, like you just fell down the stairs or something? He shoots her a look.   I didn't fall down any goddamn stairs.  ELLIE So what then? JOEL just to shut her up (   ) Someone shot at me and missed. ELLIE See? That's cool. You shoot back? 4. JOEL Yeah. ELLIE You get 'em? J",
      "dialogue_count": 0,
      "word_count": 3255
    },
    {
      "scene_number": 3,
      "slugline": "EXT.   LINCOLN   TOWNSHIP STREET - DAY (FB2)  A small lipstick cam is duct-taped to the transformer at the top of a POWER POLE. It aims down at: THE STREET - where armed soldiers in gas masks are herding townspeople on to the stakebed trucks. THE FEDRA OFFICER - face covered in a gas mask, stands with a clipboard. Another soldier is holding a thick stack of DRIVER'S LICENSES. He hands the license to the Officer. The Officer checks the name against his list. Hands the license back. Takes another one. OTHER SOLDIERS move in and out of the homes and stores that line this quaint, small-town New England street.  INT. DARK ROOM - SAME (FB2)  CLOSE ON BILL - dark eyes moving between monitors. Then... a SOUND from above. A door. Then footsteps coming down stairs. More than one person. Two at least. WIDE on BILL - from behind as he rises... just a silhouette against the glow of the monitors. A silhouette that has picked up a SHOTGUN. THE STEPS - thud right above. Boots walking directly on top of the ceiling. Bill tracks them from below as we hear the squawk of a radio from above the ceiling. Hard to make out the words. Then a muffled voice. SOLDIER (O.S.) No sir. It's empty. No sir, we're in the basement now. There's no one here. ON BILL - listening to the soldiers leave. At last, silence. Bill smiles up at the ceiling. The deepest satisfaction. BILL whispers (   ) Not today, you New World Order jackboot   fucks.  EXT. STREET - IN FRONT OF MOTHER'S HOUSE - MOMENTS LTR (FB2)  Two gas-masked soldiers emerge from an UNKEMPT COLONIAL. The weedy lawn, and shaded windows scream \"stay the fuck away.\" They head across the street to one of the trucks, jump on, and the trucks begin DRIVING OUT. 17.",
      "characters": [],
      "action_text": "The Mother sits on a makeshift bench on the back of the truck, holding her baby tight to her green dress. She nods to a faceless, gas-masked soldier sitting with them, to thank him for their salvation. He looks away, and her smile fades.   Something's wrong.  INT. DARK ROOM - MOMENTS LATER (FB2)  The convoy disappears out of view of the monitor. Bill waits for a moment, watching the empty monitor... ...then hits a switch, and FLUORESCENT LIGHTS flicker on, revealing we are in: A BUNKER - waaaay bigger than we thought. One large room, cinderblock walls, no windows. Bill's heading toward a LADDER that leads to a trap door in the ceiling, so we only get a moment to see what the room is filled with, but it's enough. Racks and racks of canned food. Chemicals. Medical supplies. Exposed electrical wiring and cables. Gas masks, camouflage, rubber gloves, nightvision goggles, stacks of clothes. Power tools, hand tools, table saw, workbench... And yes of   course   there's a Gadsden flag on the wall screaming \"Don't Tread On Me\" in black on yellow. But also-- GUNS. My god... the guns. Dozens of pistols, carbines, hunting rifles, AR-15's, shotguns... all resting in their places on a pegboard wall. Crates of ammo boxes. Plastic jugs of gunpowder. Clear bags of bulk brass casings and slugs. A bullet press. Bill slings the shotgun over his shoulder as he climbs. He pushes on the trap door, and:  INT. BASEMENT - DAY (FB2)  A STORAGE TRUNK that seems like it would be heavy but in fact is empty and light, lifts up along with the trap door it's been glued to. Bill emerges into the basement. Waits... no sound... then heads up the basement stairs to:  INT. BILL'S HOUSE - FOYER - MOMENTS LATER (FB2)  A door opens, and Bill emerges. He unslings the shotgun. Waits again. Listens. 18. It's perfectly quiet. So Bill racks the shotgun, and waits  again . No response.   Okay.   So he heads for the front door.  EXT. STREET - IN FRONT OF BILL'S HOUSE - MOMENTS LATER (FB2)  Bill walks across his ",
      "dialogue_count": 0,
      "word_count": 1180
    },
    {
      "scene_number": 4,
      "slugline": "EXT. BILL'S TOWN - TWO YEARS LATER - DAY - 2005 (FB3) TITLE: 2005  A CHAINSAW is cutting into a tree. BILL - chainsawing the last of a number of trees that we see have been cut down. He's making room for: FENCING. Electrical cables run from the partially installed fence, draping from   re-purposed   utility pole transformers back to: A SMALL FARM OF GENERATORS behind the church - apparently gathered up over time, all running off natural gas... CARS, TRUCKS, MOTORCYCLES are all parked in a long line in front of the VFW. Everyone's lawn has gone to shit. Everyone's house looks awful. Peeling paint. Weather damage. Fucked up lawns. Except for Bill's. Bill's looks BETTER than it ever did. Fresh paint. New gutters. Mowed lawn. And lovely window treatments framing the windows... MORE CABLES - running like nerve clusters from Bill's roof to various utility poles... heading out to wherever. And CAMERAS - everywhere. On poles. On roofs. Taped to mailboxes. Wires, wires, wires... IN BILL'S BACKYARD - his land has pushed back from where it had been hemmed in by woods. Now it's a few acres. VEGETABLES GROWING in rows and in planters. A SHED - REFRIGERATED - skinned and dressed DEER hanging in place. A COOP - bustling with hens. Beyond that... MORE FENCING. Concertina wire. Chicken wire, with mud and GRASS SEED smeared across it, has been laid over a DEEP PIT. Rusting PIPES jutting out of the ground toward anyone who might approach... not sure what those are for.   Yet.  But what we   do   know is this: this is both paradise and prison. And it has one resident.  INT. BILL'S HOUSE - KITCHEN - DAY (FB3)  CLOSE ON - a pan, slices of venison medium-rare... then out of the pan, deglaze, add carrots, sage, salt, cracked pepper... 21.",
      "characters": [],
      "action_text": "NOW AT THE TABLE - Bill sits alone. Table set perfectly. The meal, exquisitely plated. Glass of '85 Caymus. Bill eats quietly. Pleased. Secure. Alone. Then: BZZZZZZZT. Piezo alarm. Annoyed, he turns to: A STACK OF MONITORS - mostly repurposed TV's from neighboring homes. He uses a remote to cycle through some views on one of the monitors... yup, there it is... ON THE SCREEN - a lone Infected is approaching his fence from a side street. Bill puts the remote down and continues to eat, watching this like it's a TV show.  EXT. BILL'S FENCE - SIDE STREET - DAY (FB3)  THE INFECTED - walks slowly toward the fence. Its head swivels unnaturally from left to right to left to right--  twang...   its foot has moved through a TRIPWIRE. FOUR CONCEALED SHOTGUNS go off at once. It's deafening. We cut away before we can see the gore of it all.  INT. BILL'S HOUSE - CONTINUOUS (FB3)  Bill gives a little   heh   and then tucks back into his lunch.  EXT. BY THE GATE - SAFE ZONE - ANOTHER DAY - 2007 (FB4) TITLE: 2007  Bill's truck and boat pull up to the fenced perimeter. The truck bed and boat are completely full of more supplies. Power tools, wiring, electronics, piping. Lots of piping. Through the windshield, we see Bill click a remote. An automatic GATE rolls aside, and he drives in.  INT. BILL'S BUNKER - LATER (FB4)  Bill has a CORDLESS POWER DRILL clamped in place on his workdesk. The drill bit is a diamond-burred GRINDING DISK. There's a small transceiver taped to the top, and some wires feed back into small holes he's made in the casing. But right now, he's duct-taping a piece of metal to the side of the drill, adjusting it... there. That looks right. 22. He presses a button on a transmitter, and-- THE DRILL TURNS ON, the grinding disk SPINS, contacts the strapped-in metal-- SPARKS - shoot out in a nice directional line.   Perfect.   He stops the drill, and looks over at: A PILE OF TWENTY MORE OF THE SAME CORDLESS DRILLS - still in their boxes. And he's about to get to work on th",
      "dialogue_count": 0,
      "word_count": 2458
    },
    {
      "scene_number": 5,
      "slugline": "EXT. BILL'S HOUSE - STREET - DAY - 2010 (FB5)  BLAM. Bill's screen door flings open as Frank STORMS OUT, with Bill following. FRANK Oh FUCK you! Frank's hair is shorter. Bill's   beard is grayer.  TITLE: 2010  BILL Come on. Hey, would you stop? Frank stops in the street. Turns on him. FRANK Do I ask for things? Ever? No-- why am I saying that? This isn't even for ME. It's for   us. Bill gestures to the other houses on the street. Their unkempt lawns. BILL Who cares what they look like? FRANK I do! Our home is not just our house. It's everything around us. BILL Oh give me a fucking break-- FRANK I'm sorry, I forgot--   I live in   this  world--   you   live in a psycho bunker where 9-11 was an inside job and the government are all Nazis. BILL The government ARE all Nazis! FRANK Well, yeah, NOW, but not THEN!  keep it to a simmer (   ) I am asking for some paint and some gasoline for the lawnmower. That's all. I'll do everything else myself. Bill starts to speak, but: 32.",
      "characters": [],
      "action_text": "FRANK Bill, if you say \"resource management\" so help me I will run through one of your tripwires. Okay. Okay. Bill relents. BILL Just tell me why. FRANK I did.   trying to connect (   ) Paying attention to things is how we show love. This is my street too. Let me love it the way I want to. Before Bill can say yes... FRANK And I'm fixing up some of the shops. BILL Whoa whoa whoa-- FRANK Not the stupid ones. But the wine shop and the furniture store. And the clothing boutique. BILL The   boutique?   Are we hosting formal garden parties now? FRANK No, but we   are   going to have friends. Bill gets very, very serious. BILL Excuse me? FRANK not backing down (   ) We are going to make friends, and we will invite them to visit. BILL We don't   have   friends, Frank. We will never   have friends because there   are no friends to be had. 33. Frank weighs his next words carefully. Because he knows they're a bit explosive. FRANK I've actually been talking to a nice woman on the radio. A volcano explodes inside Bill. BILL You WH--  EXT. BILL & FRANK'S HOUSE - FRONT PORCH - ANOTHER DAY (FB6)  JOEL and TESS sit at a table. Lunch laid out before them. Tess eats with gusto, almost done. Joel just stares ahead. REVERSE TO REVEAL - Bill and Frank on the other side of the table. Frank is almost finished as well. Bill pokes at his food with a fork in one hand. He rests his other hand on a GUN on the table, basically aiming at Joel. TESS This is amazing. FRANK Right?   glances at Bill's gun (   ) Can you not, please? Bill keeps his hand on the gun. JOEL shrugs (   ) I'm the same way. FRANK Oh, you're a paranoid schizophrenic too? BILL annoyed (   ) I'm not schizophrenic. Tess redirects the conversation. TESS Can I just say-- gun aside, which I get-- how   nice   this is? I mean, to have a civilized meal in such a beautiful place? 34. THE STREET - has been transformed. Houses are painted. Lawns are mowed. Flowers in window planters. Trimmed hedges. TESS It's been a long time. Thank you.",
      "dialogue_count": 0,
      "word_count": 3496
    },
    {
      "scene_number": 6,
      "slugline": "EXT. THEIR SAFE ZONE - LATER (FB9)  SCORE ONLY - we see Bill and Frank from afar. Bill pushing the chair. We shouldn't know what they're talking about. That's only for them to know. DISSOLVE - the strawberry patch, now a HUGE BRAMBLE of fruit, wild and unkempt. A mad patchwork of red and green. DISSOLVE - the sun is lowering over the neighborhood. The houses. The garden. The pit where Bill once found a dirty, starving man...  INT. BILL & FRANK'S HOUSE - PARLOR - LATER (FB9)  Bill sits on the piano bench where it all began, right next to Frank, who is in his wheelchair. No need to kneel for this. Kneeling is for children. Bill puts a RING on Frank's finger. Then he helps Frank put a ring on his own finger. That's all they need to make it permanent. Two plain rings. And one simple kiss.  INT. BILL & FRANK'S HOUSE - DINING ROOM - NIGHT (FB9)  Frank sits right where he was the first time Bill fed him. Still in his tuxedo. Candles on the table. An open bottle of wine waiting to be poured. Bill enters and puts a plate down in front of Frank. Rabbit leg confit, haricot verts, cherry tomatoes, sweet potato puree. Of course. DISSOLVE TO - candles are lower. Bill and Frank are talking quietly to each other. Bill cuts Frank's food. Feeds him. DISSOLVE TO - a finished plate. Candles nearly gone. Frank looks ahead. A little scared. But ready. Score fades. The world comes back. Bill pours two glasses of wine. Then takes a baggie of CRUSHED WHITE POWDER from his pocket, stirs it into one of the glasses... takes a breath... then slides it to Frank. 48.",
      "characters": [],
      "action_text": "FRANK Will it be enough? BILL big time (   ) Yeah. Frank takes the glass with two hands. Then drinks it all down in one go. Bill watches him. So. It's done. Then Bill lifts his own glass, and drinks all of   his   wine down in one go as well. Frank looks at him, confused. Why would he gulp his wine down like-- wait. The bottle of wine was already open when they sat down. Oh. For fuck's sake. FRANK Was there already-- ? BILL Enough to kill a horse. Frank is stunned.   Why?  BILL This isn't the tragic suicide at the end of the play. I'm old. I'm satisfied. beat (   ) And you were my purpose. Frank takes that in, then: FRANK I do not support this. And I should be furious. But from an objective point of view, it's incredibly romantic. Frank holds his hand out. FRANK Take me to bed. Bill takes Frank's hand... and then puts it on top of his own as he wheels Frank out of the room. We follow behind them as they move into the foyer... down the hall... toward the open door of their room... their bed just visible to us. So we stop here and let them go ahead. We watch Bill wheel Frank into their room... 49. ...and then he closes the door, shutting us out of their final hour. The rest belongs to them. We DISSOLVE SLOWLY TO:  EXT. OUTSIDE THE PERIMETER FENCE - PRESENT DAY (D6)  Wind rustles through trees. A slight hum from the fence. Far off, the sound of running generators... Beyond that... homes. The lawns are decidedly UNMOWED. Six inches of growth. Dandelions. JOEL AND ELLIE - step into view. She looks at the fence. The town. Something feels creepy about it. ELLIE This is... JOEL distracted (   ) Yeah. He's studying the scene. Looking up at a CAMERA that's pointing down at them. Then back at the street beyond the fence. Huh. Joel hesitates for a moment, then walks up to the fence and types a code into a keypad by the gate. 7-2-0-1-2-6. There's a beep, and the HUM stops. Joel puts his left hand in his pocket, and carefully taps the fence with the gun in his right hand. No shoc",
      "dialogue_count": 0,
      "word_count": 3184
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MAIN STREET / GATE - SAFE ZONE - CONTINUOUS (D6)  Joel rolls down \"Main Street\". Ellie has the window down, grinning like an idiot, loving this. Joel hits the remote, and the FENCE GATE AHEAD slides open. As he drives, Ellie rifles through the glove compartment. JOEL Leave it. She holds up a CASSETTE TAPE.   You sure?   Joel glances over. Frank's handwriting on the case. MIX FOR BILL. JOEL Just put it back. Ellie-- Ellie doesn't care. Pops it in. And LINDA RONSTADT comes on. JOEL Oh no wait. This is good. This is Linda Ronstadt. You know who Linda Ronstadt is? ELLIE You know I don't know who Linda Ronstadt is. Joel lets the song wash over him. The car, the road, the music... good memories for once. JOEL loving it (   ) Oh man... ELLIE shrugs (   ) Eh. Better than nothing.  EXT. LONG ROAD TO SOMEWHERE - SUNSET (D6)  Sun hanging low in the sky. A single truck driving out toward the distant horizon. And for just this moment, the world is beautiful again. RADIO  Wait for the day, you'll go away Knowing that you warned me of the price I'd have to pay And life's full of flaws Who knows the cause?  (MORE) 62.",
      "characters": [],
      "action_text": "Living in the memory  RADIO   (cont'd)  of a love that never was 'Cause I've done everything I know to try and change your mind And I think I'm gonna love you for a long long time  We RISE up, letting the truck grow small in the distance, and the song plays out over credits as we:  FADE TO BLACK END OF EPISODE THREE  63.",
      "dialogue_count": 0,
      "word_count": 274
    }
  ]
}