{
  "slug": "the-midnight-sky-2020",
  "title": "the midnight sky",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 0,
  "characters": [],
  "total_words": 19714,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BARBEAU OBSERVATORY COMPOUND - NIGHT The silhouettes of the structures against the moon-swept snow.   The glowing sky sparkling overhead. VAN MORRISON (V.O.)  Let your soul and spirit fly into the mystic.  We FOLLOW THE MUSIC UPWARDS INTO THE NIGHT SKY... floating toward all those stars. EXT. ARCTIC WILDERNESS - NIGHT An Arctic Fox trots across the dim landscape. INT. COMPOUND - AUGUSTINE’S BEDROOM - NIGHT Augustine lies in bed, staring at the BUZZING ALARM CLOCK... watches the   7:03   changes to   7:04 ... finally reaches out to tap the clock... the BUZZING STOPS. Augustine rises up with some effort... painful and stiff.   He sits there a moment, catching his breath, then pulls open the top drawer of the night stand... reaches inside... a FEW MEDICINE BOTTLES sprawled on top of a thin mess of old papers and photographs.   The bottles all have something about   “...as needed for pain”   printed on the labels. He lifts one of the bottles... tosses a few pills into his mouth, then drops the bottle back inside.   The bottle rolls to a rest on a couple CREASED PHOTOGRAPHS... one with a PARTIAL GLIMPSE OF JEAN. Another photo is face-down... a faded-ink   June 14,   2008  scribbled on the back of the photo. INT. OBSERVATORY CONTROL ROOM - NIGHT Augustine stands at a window, sipping a cup of coffee.   That same constant blue-dusk outside... except for a SLIVER OF PINK staining the dark sky. A SHAPE APPEARS FROM THE SHADOWS... a POLAR BEAR with a BLUE TAGGING COLLAR.   It lumbers across the compound. AUGUSTINE Welcome back, George.   Just the two of us now. 9.",
      "characters": [],
      "action_text": "Augustine watches the Polar Bear wander up and over the crest of a hill, then grabs his coat from a table. EXT. BARBEAU OBSERVATORY COMPOUND - NIGHT Augustine follows the Polar Bear’s tracks in the snow... up the hill.   He’s breathing hard by the time he reaches the top... looks down to the snowy valley below.   There’s a rosy pink streak of sunlight across the white. The Polar Bear reaches that streak, then plops down, basking in the warm light... looking exhausted. Augustine sits stiffly on the ground. AUGUSTINE Our morning walks aren’t as easy as they used to be, huh, old man? Then Augustine and the Polar Bear both look up to the sky... waiting for something.   The sky suddenly turns to fire, a deep orange, then crimson.   Augustine closes his eyes... lets the warm sunlight hit his face. AUGUSTINE (CONT’D) But they’re worth it. A few moments of sun basking Augustine’s face, then almost as quickly as it appeared, the sun sinks away... the dim blue night returns. WOMAN’S VOICE (O.S.) And just like that it’s gone. Augustine opens his eyes... looks beside him... sees Jean standing in the snow, wearing just a t-shirt and shorts. She’s staring up at the sky. JEAN A lot like life. (smiles at Augustine) Comes and goes in a blink. Augustine stares at Jean... almost seems a little scared.   He closes his eyes... reopens them... JEAN IS GONE. INT. OBSERVATORY CONTROL ROOM - NIGHT Augustine at the telescope... peering through the lens... typing some data into a computer.   Then he FLINCHES IN PAIN... 10. just enough that he needs to steady himself against the desk... stands there a moment waiting for it to pass, then sits down... catches his breath. He notices the CHESSBOARD... pieces spaced around like a game was stopped in the middle.   He stares at the board a moment, then moves his black bishop... takes a white rook. INT. COMPOUND KITCHEN - NIGHT Augustine holds a bowl of cereal... pours a stream of soy milk over it.   He starts eating as he walks out. INT. COMPOUND CAF",
      "dialogue_count": 0,
      "word_count": 1387
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ARCTIC WILDERNESS - NIGHT The wind whips across the ground, swirling miniature snow- tornadoes over the surface. EXT. BARBEAU OBSERVATORY COMPOUND - NIGHT The steel hangar doors sway and slam in the gusts. INT. OBSERVATORY CONTROL ROOM - NIGHT ANGLE ON AUGUSTINE’S HAND pouring a glass of whiskey. Augustine’s standing in the far corner of the room with the bottle and glass... eyeing the Little Girl sitting in the doorway as he takes a drink. AUGUSTINE What the hell am I supposed to do with you? The Little Girl offers no answer. AUGUSTINE (CONT’D) What are you doing here? The Little Girl’s expression doesn’t change. AUGUSTINE (CONT’D) (angry) Well I know you’re not the world’s youngest goddamn astrophysicist.   I would have heard about you. Augustine’s tone frightens the Little Girl... tears fill her eyes.   She stares at the floor a moment, then stands... walks out.   Augustine stands there a moment... takes a drink. AUGUSTINE (CONT’D) Shit. Augustine puts down the glass... walks to the doorway... sees the Little Girl moving down a hallway, her yellow dress fluttering as she goes. AUGUSTINE (CONT’D) Hey. She doesn’t look back.   Augustine gives an ANNOYED GRUNT, then follows after her. 15.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 199
    },
    {
      "scene_number": 3,
      "slugline": "INT. COMPOUND HALLWAY - DUSK Augustine trails the Little Girl along the hall... watches her veer through a doorway.   He reaches it... looks in to see it’s a STORAGE CLOSET. The Little Girl drops down onto a pile of scavenged blankets and winter coats.   The closet’s white walls have several magic marker-drawn PURPLE FLOWERS (IRISES) on them. AUGUSTINE (glancing around closet) This is where you’ve been staying. Christ. (off the pictures) I guess you drew those? The Little Girl doesn’t answer.   Augustine just stares down at her a beat, then-- AUGUSTINE (CONT’D) Somebody’s gotta be coming back for you. INT. COMPOUND - STORAGE CLOSET - DUSK The Little Girl returns Augustine’s gaze. AUGUSTINE Because I can’t help you.   Do you understand?   I’m the wrong person. They hold a look... AUGUSTINE (CONT’D) I’m the wrong person. ...then Augustine turns... disappears from the doorway.   Gone for a long moment before he appears again. AUGUSTINE (CONT’D) (annoyed) Are you hungry? (mimes eating) Food.   Hungry? INT. COMPOUND CAFETERIA - DUSK Augustine sits on one side of the table, sipping a cup of coffee, watching the Little Girl directly across from him, gobbling down a microwaved hamburger. 16.",
      "characters": [],
      "action_text": "AUGUSTINE What about family?   Any brothers or sisters? The Little Girl doesn’t even look up... just keeps eating. AUGUSTINE (CONT’D) You’re not deaf, right?   You can hear me talking to you? Nothing.   Augustine SNAPS HIS FINGERS.   The Little Girl’s eyes roll up...   she heard that ... then goes back down to the food. AUGUSTINE (CONT’D) So that’s clear.   But you can’t talk.   Or just won’t.   Or just want to piss me off. (beat) Twelve years I’ve been here. Longer than you’ve been alive.   Always people around.   I was really looking forward to some alone time. Augustine’s eyes settle on the notepad beside her.   Another purple flower on the top page. AUGUSTINE (CONT’D) But you do draw a good flower. That an Iris? The Little Girl’s head immediately snaps upward... as if Augustine called her name.   They hold a look... Augustine trying to understand what just happened... the Little Girl waiting for more.   Then Augustine points at her. AUGUSTINE (CONT’D) Iris. The Little Girl nods... immediately goes back to eating. Augustine watches her a long moment, then-- AUGUSTINE (CONT’D) Okay. So that’s what we’ll call the Little Girl...   IRIS . INT. OBSERVATORY CONTROL ROOM - DUSK Augustine at a desk, holding the radio mic as he looks at the computer... that SPECK OF THE SPACESHIP AETHER still zoomed in on the screen. 17. AUGUSTINE (into radio mic) This is Barbeau Observatory.   Is anyone receiving this? Static.   Iris walks up beside Augustine... shares the view. He notices... watches her lean closer. AUGUSTINE (CONT’D) Don’t touch anything. Iris reaches toward the screen, but Augustine pulls her arm down... shakes his head. AUGUSTINE (CONT’D) No touching. (motions around the room) Anything. Iris look back to that speck on screen.   Augustine watches. AUGUSTINE (CONT’D) Aether. (taps the screen) It’s a spaceship.   Far away. Augustine points to another monitor zoomed in on a planet. AUGUSTINE (CONT’D) On its way back from a planet called K-23.   That was supposed to be ou",
      "dialogue_count": 0,
      "word_count": 2753
    },
    {
      "scene_number": 4,
      "slugline": "INT. OBSERVATORY CONTROL ROOM - NIGHT Iris meets Augustine at the door with a steaming cup of coffee. AUGUSTINE (annoyed) I keep telling you, I don’t need you to do that.   You’re gonna spill it on something important... or burn yourself. Iris just keeps holding the cup out... until Augustine begrudgingly takes it. Augustine drags off his outer layer of clothes. AUGUSTINE (CONT’D) No going outside on your own. Understand? He points at the door, shakes his head. AUGUSTINE (CONT’D) Still no outside for you. Iris understands enough to nod.   Augustine moves across the room to the radio controls, sipping the coffee.   Iris follows. AUGUSTINE (CONT’D) Hear anything while I was out there? Augustine looks to Iris... points at the radio. AUGUSTINE (CONT’D) Voices?   Noise? (points again) Anything? Iris shakes her head.   Augustine lifts the radio mic. AUGUSTINE (CONT’D) This is Barbeau Observatory. Eighty-one, fifty-four North. Seventy-five, one West.   Channels open for response. Augustine waits... waits... starts scanning more channels and frequencies... keeps getting nothing but that same static. Iris kneels on the floor... starts drawing on the back of a paper... a ROCKET LAUNCHING INTO THE SKY. 30.",
      "characters": [],
      "action_text": "AUGUSTINE (CONT’D) The damn antenna’s our problem. Doesn’t matter what direction we put it.   Just not strong enough to reach where we need it to. (to Iris) That’s why they’re not answering. They can’t hear us. Iris doesn’t look up from her drawing.   Augustine just watches her. AUGUSTINE (CONT’D) And you’ve got no idea the trouble you’re in. INT. COMPOUND CAFETERIA - NIGHT Augustine and Iris sit across from each other, both eating from microwaved trays.   Augustine watches Iris just picking at some vegetables. AUGUSTINE Yeah.   Nothing like some good green rubber for lunch.   I always told ‘em they needed to give us better meals.   Nobody listened. (beat) When I was in the Canary Islands, we’d get the freshest... Augustine stops... rolls his eyes... realizes he might as well just be talking to himself. ANGLE ON IRIS... just brushing the food around the tray... WHEN A VERY GREEN PEA ROLLS ACROSS THE TABLE TOWARD HER. Iris looks up.   Augustine rests his empty cup on it’s side, the opening facing Iris.   He nods to the pea... AUGUSTINE (CONT’D) Only thing peas are any good for. ...then FLICKS HIS FINGER. AUGUSTINE (CONT’D) You hit it.   Try to get in my cup. Pea soccer. Iris isn’t sure what’s going on. AUGUSTINE (CONT’D) You never played this? 31. Augustine dumps what’s left in Iris’ cup onto the tray... tilts hers over to match his.   Then he grabs the pea... flicks it... the pea bounces off the rim of her cup. AUGUSTINE (CONT’D) So close. (nods to her) Your turn. Iris half-smiles... steadies a pea in front of her... flicks it clumsily sideways. AUGUSTINE (CONT’D) God, you’re terrible. Iris smiles broader. AUGUSTINE (CONT’D) I’ve got some serious teaching to do here. Augustine grabs another pea... cocks his finger and thumb. AUGUSTINE (CONT’D) Like this.   Technique won the Lincoln Elementary Cafeteria Championship. Augustine flicks... another near miss.   Iris’ turn... she sends the pea sailing high over the cup, bouncing off Augustine’s neck. AND IRIS LAUGHS.   Au",
      "dialogue_count": 0,
      "word_count": 2004
    },
    {
      "scene_number": 5,
      "slugline": "INT. COMPOUND ENTRY - NIGHT Augustine kneels in front of Iris, pulling a knit cap over her ears... zipping up a too-big winter coat. AUGUSTINE Unless you’ve got a suitcase you wanna tell me about, this is the best I could find lying around. Augustine slides a small oxygen tank into Iris’ coat pocket... runs the mask up, strapping it around her nose and mouth.   She tries to push it away, but he holds it firm. AUGUSTINE (CONT’D) You have to. Augustine slips his own mask on. AUGUSTINE (CONT’D) So do I.   See. Augustine turns the nozzle of Iris’ tank.   The HISS of air flowing into her mask.   She startles at the burst of cool air against her. AUGUSTINE (CONT’D) It’s okay.   Just breathe. Augustine takes a deep breath into his mask.   Iris takes a small one... then larger... smiles. AUGUSTINE (CONT’D) Not so bad, right?   Don’t take it off.   No matter what. (motions to her mask) Never off. Augustine stands... looks out the door. AUGUSTINE (CONT’D) We ready? Iris reaches her tiny hand up, taking Augustine’s.   He looks down, almost surprised.   Then-- AUGUSTINE (CONT’D) Here we go. Augustine pushes the door open. The Arctic air hits them. They step out into it. 40.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BARBEAU OBSERVATORY COMPOUND - NIGHT Augustine and Iris walk through the snow toward the waiting snowmobile.   There’s a large sled attached, stacked with supplies, tent, gasoline cans, rifle, observatory gear. Augustine helps Iris on, then slides aboard in front of her. AUGUSTINE Hold onto me. Iris doesn’t move.   Augustine presses the starter button... the snowmobile ROARS TO LIFE... and Iris immediately wraps her arms around Augustine’s waist. Augustine turns the throttle... the snowmobile lurches forward... moves slowly across the grounds. Augustine stops beside a LARGE STEEL POLE.   He reaches up, opening a POWER BOX... pulls the lever, and THE ENTIRE OBSERVATORY GOES DARK. Augustine throws a last look over the shadowy silhouettes painted on the white snow, then twists the throttle... the snowmobile carries them into the darkness. INT. OBSERVATORY CONTROL ROOM - NIGHT Looking out through a frosty window.   A finger-drawn rocket ship flies toward a distant planet.   Beyond the drawing, we can see Augustine and Iris driving away. INT. AETHER SPACECRAFT - LITTLE EARTH - SPACE ANGLE ON A MONITOR... TWO TWIN BOYS IN MATCHING SOCCER JERSEYS fill the screen, excitedly talking over each other in Russian... recounting their most recent win, as their MOTHER smiles behind them. Then we see Ivanov in a chair, holding a REMOTE as he watches the video.   His face is emotionless... almost as if he’s staring at a blank screen. The Twin Boys playfully push at each other to get center stage as they talk.   Their Mother’s smile turns into a WONDERFUL LAUGH. Ivanov rewinds the video... it plays out again... that smile turning into a laugh. --IN THE KITCHEN AREA... Sully, Devi, and Thebes eat... Sully watching Ivanov. 41.",
      "characters": [],
      "action_text": "THEBES He’s going back to the early ones... watching them over and over. SULLY I can’t imagine what he’s feeling. The not knowing. THEBES At least the unknown allows some hope.   Something to hang onto. DEVI I keep thinking about my sister and her kids... what might be happening... how much I’d like to see them.   See anyone.   Even my ex, and I hate him. THEBES (to Sully) Who’s the first person you’d want to see back home? Sully considers the question, then half-grimaces and shakes her head. SULLY Think I’m sort of a lousy human being.   Haven’t fostered a lot of deep meaningful relationships. (shrugs) But I guess that’s why I’ve never been afraid during a launch... never felt like I was risking anything... leaving anyone behind. DEVI That’s sad. SULLY Is it?   I honestly don’t know.   I mean my mother was everything to me.   She taught me about the stars. Taught me to be curious.   Pushed me to join the program.   But then she got sick... and it all went so bad so fast.   When she was gone it was like... screw it, let’s fly.   Was nothing left for me down there. 42. THEBES I kind of get it.   I used space to leave my wife years before she left me. (off their looks) Our daughter... she drowned when she was three. DEVI God.   I’m sorry. THEBES We couldn’t get past it.   Or maybe just I couldn’t. SULLY All this time squeezed together up here, and you’ve never told us that. THEBES No point.   It was so long ago. DEVI I thought you were just split up like every other couple I know.   Do you guys have any other children? THEBES (shakes his head) Grace... my wife... she wanted to try again, but I... (shrugs) ...it’s like those people who as soon as their dog dies, they run out and get another one just like it.   Never made sense to me.   How can you just replace something you loved with every ounce of your heart? (beat) So instead I ran away.... took any mission I could find.   Stayed above the earth as much as possible. Then once after returning home, I walked into our ",
      "dialogue_count": 0,
      "word_count": 2052
    },
    {
      "scene_number": 7,
      "slugline": "INT. TENT - NIGHT Augustine awakening from his dream with a start.   Sees HE’S STILL HOLDING THE DETECTOR UNIT. Then he looks to the mound of Iris’ sleeping bag... touches it... Iris is gone. AUGUSTINE Shit. Augustine scrambles up, grabbing the rifle as he hurries out of the tent. EXT. ARCTIC WILDERNESS - TENT - NIGHT Augustine charges from the tent... immediately freezes... because Iris is sitting just beside the tent... ...staring off at the incredible AURORA BOREALIS FLOWING THROUGH THE SKY... dancing streams of green, purple, and blue lights. Iris looks at Augustine, a huge smile covering her face. Augustine catches his breath... relaxes... rests the rifle against the tent, then sits down in the snow next to Iris... shares the view. After a moment, Augustine turns his eyes from the incredible beauty... and watches Iris gazing up, in awe. EXT. ARCTIC WILDERNESS - NIGHT FROM HIGH ABOVE... the snowmobile is like a dot moving across a white world. EXT. ARCTIC WILDERNESS - NIGHT ON ARCTIC HARES... BOUNCING STRAIGHT UP HIGH IN THE AIR. The snowmobile glides over the snow.   Augustine pointing toward the Hares as they pass. AUGUSTINE (yelling back to Iris) Arctic Hares!   They jump up instead of out!   So they can see further! Iris just grins as she watches the pogo-hopping animals. 51.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 218
    },
    {
      "scene_number": 8,
      "slugline": "EXT. ARCTIC WILDERNESS - NIGHT The snowmobile stopped... idling.   Augustine as binoculars raised... peering off toward a GRAY SHAPE in the distance. AUGUSTINE I’m not sure. Augustine hands the binoculars to Iris.   She looks toward the shape. AUGUSTINE (CONT’D) Hang on. Iris grips onto Augustine as he turns the throttle... head toward that distant shape. EXT. ARCTIC WILDERNESS - CRASHED PLANE - NIGHT A PRIVATE JET rests tilted in the snow.   One wing severed off, with a flapping tarp over the gaping hole left behind in the fuselage. The wind has blown deep drifts against one side of the plane. There’s some loose luggage and supplies scattered in the snow. The snowmobile pulls up.   Augustine and Iris look over the scene. AUGUSTINE Trying to find a safe zone. (beat) Storm or ice might’ve brought them down.   Or they just left too late. Then Augustine climbs off. AUGUSTINE (CONT’D) Stay here. (hard) Here.   I mean it. Iris understands... nods. Augustine pulls the rifle and flashlight from the sled... moves toward the downed plane. AUGUSTINE (CONT’D) Hello?! No answer.   Augustine reaches the tarp... grabs a flapping corner... opens it to peer in. 52.",
      "characters": [],
      "action_text": "AUGUSTINE (CONT’D) Hello? Augustine steps inside. INT. PRIVATE JET - NIGHT Augustine’s flashlight beam floats over the wreckage... shredded steel... seats torn from their moorings... the charred remains of a small campfire on the floor. Augustine makes his way to the cockpit... the FROZEN CORPSE OF THE PILOT still strapped into the seat.   Another tarp hangs over the shattered windshield. TOOLS rest beside the RADIO UNIT. Augustine moves back past that flapping tarp... toward a PILE OF SHEET-COVERED SHAPES. Augustine hesitates... already knows what he’s going to find before he pulls back the sheet... reveals the FROZEN BODIES OF A FAMILY... a MOTHER and THREE CHILDREN. And that’s when a GLOVED HAND SUDDENLY GRABS AUGUSTINE’S ANKLE. Augustine jumps with a start... aims the light down onto WHAT’S LEFT OF THE FAMILY’S FATHER... frozen streams of blood from his frostbitten ears and nose.   All the fingers on his other UNGLOVED HAND are black. The Father makes a GUTTURAL BARK... a desperate plea for help. MOVEMENT from the front of the plane... Iris staring at the scene, wide-eyed. AUGUSTINE I told you to stay outside! Iris is too stunned by the scene to move. AUGUSTINE (CONT’D) Now!   Get the hell out!! Iris rushes back out through the tarp. Augustine looks over the bodies, then back down to the Father.   The man’s still gurgling... trying to speak. AUGUSTINE (CONT’D) I’m sorry. 53. Then Augustine turns off the flashlight... steadies the rifle in his hands... ...as WE DRIFT BACK TOWARD THAT FLAPPING TARP... the wind beating it against the fuselage when the GUNSHOT RINGS OUT. EXT. PRIVATE JET - NIGHT Augustine walks outside.   Iris stands between him and the snowmobile.   Her eyes are filled with tears.   Augustine slows beside Iris... rests a hand on her head... starts to speak, but instead just continues walking. He stores the rifle and flashlight back on the sled, then notices something in the distance... THE TWO WOLVES... watching from across the tundra. Augustine ga",
      "dialogue_count": 0,
      "word_count": 1742
    },
    {
      "scene_number": 9,
      "slugline": "INT. AETHER - LITTLE EARTH - SPACE Harper walks into the kitchen area... stops at the table... the deck of cards now spread out in a   Smiley Face   design. HARPER Goddammit. INT. AETHER - SULLY’S ROOM - SPACE Sully’s back in her bed, reading... HARPER (O.S.) You know that’s a win for me! ...then smiling. EXT. AETHER SPACECRAFT - SPACE The engines BLAST... FIRE ERUPTS... WHITE SMOKE CONSUMES US... FOR A LONG TIME... BEGINS TO CLEAR, and WE REALIZE IT’S A SNOW CLOUD BEING THROWN UP FROM THE BACK OF THE SNOWMOBILE. EXT. ARCTIC WILDERNESS - DUSK The world’s a little brighter than we’re used to. The snowmobile tears across the tundra, dragging the sled. Iris clings to Augustine, her face pressed sideways against his back, watching the world race past... spots a few SQUARE SHAPES in the distance. Iris tugs on Augustine’s jacket... points. Augustine slows... squints out at the shapes... veers toward them. EXT. ARCTIC WILDERNESS - DUSK Three rectangle-shaped steel pre-fab pods rest at various angles in the snow.   There is NORWEGIAN PRINT along each wall.   Transportation cables are still secured around them. Augustine and Iris climb off the snowmobile... walk through the snow toward the pods. AUGUSTINE We were supposed to get these. More office space for the observatory. 62.",
      "characters": [],
      "action_text": "Augustine pushes open a pod door... glances around inside. The walls are thick with foam insulation. AUGUSTINE (CONT’D) Plans changed I guess. (glancing up) Choppers must’ve just dumped ‘em here. A CLANK from beside him... Iris opening another pod door. AUGUSTINE (CONT’D) Easy. Augustine joins her... enters the pod. INT. STEEL POD - DUSK Augustine and Iris glance around the empty pod.   It’s like a newly constructed room... open light fixtures and exposed electrical outlets. AUGUSTINE Would’ve been nice.   Might’ve actually gotten my own place to work. Augustine turns... starts back out. AUGUSTINE (CONT’D) Oh well.   Got it eventually I guess. (off Iris) For a little while anyway. Iris follows Augustine to the door, but stops before stepping back outside. Augustine walks a short distance, then looks back... sees her. AUGUSTINE (CONT’D) Time to go. Iris doesn’t budge. AUGUSTINE (CONT’D) We can stop in a couple hours. Still nothing.   Augustine looks to the stowed tent on the sled, then back to Iris. 63. AUGUSTINE (CONT’D) It is a helluva lot warmer inside there. (beat, nods) But just for one night. INT. STEEL POD - NIGHT The lantern glows at the middle of the room.   Iris is in her sleeping bag beside it, drawing a woman’s face... with long purple hair. Augustine sits back against a wall, chasing some pain pills with some whiskey from his flask. AUGUSTINE That’s pretty.   Is that your mom? Iris holds it up so Augustine can get a better view. Augustine stares at it. AUGUSTINE (CONT’D) I knew a pretty face like that once.   Hair was a little different shade. Iris goes back to drawing. AUGUSTINE (CONT’D) And she was as loud as you are quiet.   When she’d laugh, everybody would turn and look. Augustine smiles. AUGUSTINE (CONT’D) I think she laughed so much because she was smarter than all the rest of us put together.   And she knew it. (beat) Tell me something about your life. Iris scribbles in more purple hair. AUGUSTINE (CONT’D) Anything will do. (off her silence) Iris",
      "dialogue_count": 0,
      "word_count": 1227
    },
    {
      "scene_number": 10,
      "slugline": "EXT. ARCTIC WILDERNESS - DUSK Augustine leads Iris up a snow-covered slope.   His steps are slow... weak.   He drops to his knees, COUGHING... spitting up blood, staining the white snow. He remains hunched over on all fours for a moment... until Iris rests her small gloved-hand on his back... and Augustine straightens... rises to his feet... continues the climb. EXT. ARCTIC WILDERNESS - DUSK An Arctic Hare sits motionless on the ground.   Suddenly a GUNSHOT blasts the ground just beside it... sends the Hare darting away. Then we see Augustine standing in the distance, rifle still aimed.   He and Iris watch the Hare bound out of sight. EXT. ARCTIC WILDERNESS - TENT - NIGHT Iris stands beside Augustine as he sets up the tent... using a rock to hammer the stakes into the hard ground. INT. TENT - NIGHT Augustine hands Iris the last of the protein bar.   She holds it without biting. AUGUSTINE It’s okay.   I’m not hungry. Iris still doesn’t eat.   Augustine shakes out a couple pain pills... shows them to Iris. AUGUSTINE (CONT’D) I like these more anyway. He tosses the pills into his mouth. Iris takes a tiny bite. AUGUSTINE (CONT’D) There should be food at Lake Hazen. More than we’ll ever need. (beat) And no peas I bet.   Just the good stuff.   Pizza and cheeseburgers. The wind rustles the tent... half-lifts a corner.   Augustine puts his weight on it, pressing the corner stake back down. 68.",
      "characters": [],
      "action_text": "AUGUSTINE (CONT’D) I used to think I wanted to be an explorer... lead the way across new worlds instead of just finding them for others to see. (beat) Now... not so sure I was ever built for that.   Younger days maybe. Augustine drifts over until he’s lying down. AUGUSTINE (CONT’D) What about you?   Are you going to explore when you grow up? (closes his eyes) If you do, find someone you like to do it with. Iris lies down beside Augustine... AUGUSTINE (CONT’D) And keep ‘em beside you forever. ...stares at his weathered face, then runs a small finger along a deep wrinkle... running up from the corner of his eye, across his forehead... down the other side. And Augustine’s asleep before she finishes. EXT. TENT - DUSK Augustine kneels in the snow, looking over the map.   He’s weak... sweating from fever... holding in coughs.   Iris kneels beside him.   The wind pounds against them, flapping the map over.   Iris grabs the edge to hold it down. AUGUSTINE We just need to stay headed in this same direction.   We get tired, we’ll take a break.   Someplace outta the wind. Augustine starts folding the tent back up. AUGUSTINE (CONT’D) We’ve got to be getting- Suddenly Iris bolts away.   Augustine turns to see where... then realizes the WIND HAS FILLED UP THE OPEN TENT... is pulling it loose from the stakes. AUGUSTINE (CONT’D) Oh, God. 69. Augustine jumps up. AUGUSTINE (CONT’D) I forgot to close it up!   Grab it! Iris nears the tent just as the last stake snaps free.   The tent starts rolling away like a giant orange ball. Augustine and Iris continue the chase, but the tent is just skimming across the snow... pulling away from them... finally POPS FULL OF WIND... lifts off into the air... AUGUSTINE (CONT’D) NO! ...flying away... higher... further. AUGUSTINE (CONT’D) Please. Augustine slows... can only watch it shrink in the distance. Iris stops running... looks back to Augustine. AUGUSTINE (CONT’D) (beaten) It’s the wrong way.   And we won’t catch it.   I can’t catch it. Augustin",
      "dialogue_count": 0,
      "word_count": 5402
    },
    {
      "scene_number": 11,
      "slugline": "INT. LAKE HAZEN - RADIO BUILDING - DUSK Augustine sits alone at the radio desk.   He pulls some PAPERS AND PHOTOGRAPHS from his backpack... starts to flip through them when a CRACKLE OF STATIC BURSTS FROM THE RADIO. SULLY (V.O.) Lake Hazen, this is Aether.   Are you receiving? Augustine drops the photos to hit the mic button. AUGUSTINE Loud and clear, Aether. SULLY (V.O.) Nice to hear your voice again, Lake Hazen.   Our comms system went offline. AUGUSTINE With a bang.   Wasn’t sure I was going to get you back. INT. AETHER - COMMUNICATION POD - SPACE Sully’s strapped into her seat. SULLY We’re operational now, and just got a visual on earth.   Unfortunately it seems to confirm everything you told me earlier. AUGUSTINE (V.O.) Afraid we didn’t do a very good job of looking after the place while you were away. SULLY Are you seeing any new data that might suggest possible safe entry points for us? AUGUSTINE (V.O.) No. Sully closes her eyes...   fuck . AUGUSTINE (V.O.) My best guess is all survivable areas are underground. 98.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 180
    },
    {
      "scene_number": 12,
      "slugline": "INT. LAKE HAZEN - RADIO BUILDING - DUSK Augustine lifts some papers from the desk... the PAGES HE PRINTED OUT AT THE OBSERVATORY. AUGUSTINE So I’d like to suggest something else. INT. AETHER SPACECRAFT - LITTLE EARTH - SPACE Sully, Harper, Ivanov, and Thebes stand around the table, all staring down at a flickering tablet screen filled with math equations. SULLY I wrote down exactly what he told me. HARPER (to Thebes) This make sense to you? THEBES If we wanted to fly back to K-23, yes.   It’s a pretty genius plan design actually.   Deviate our approach toward earth, then make gravity our friend to save fuel on the turnaround. IVANOV But why would we do that? SULLY Because he’s saying there’s nothing left for us down there. HARPER Do we know who this guy is yet? A moment of Sully realizing she doesn’t know. SULLY I didn’t have a chance to ask. Just ran this straight in here. IVANOV It doesn’t matter.   We’re not sling- shotting our way back out into space. 99.",
      "characters": [],
      "action_text": "SULLY He’s sure we’ll die down there. IVANOV He’s alive.   How’s that possible? Are you talking to Superman? THEBES The Poles would be the last areas hit. SULLY He told me air contamination levels were rising at his location.   And he sounded sick. IVANOV We still don’t know.   Not for sure. HARPER We all saw what it looked like. He’s giving us an option to consi- IVANOV -Everyone dies.   And when it happens, I want it to be down there.   Not here. (walks away) Not here. A BEAT, then-- HARPER How long before we have to make a decision? THEBES To adjust from the current course to this... and keeping our speed up... no more than a few hours. Harper looks to Sully, then walks out.  INT. MAUNA KEA OBSERVATORY - DAY High tech facility.   A BEARDED Augustine peers into a telescope.   He’s eight years older than the last time we saw him. He raises up from the telescope to scribble some notes... stops... because he’s just noticed Jean standing in the doorway.   She waves.  100.",
      "dialogue_count": 0,
      "word_count": 351
    },
    {
      "scene_number": 13,
      "slugline": "EXT. MAUNA KEA OBSERVATORY - DAY The domes perched high atop the island of Hawaii... above everything.   A thick carpet of clouds surrounds the peak. JEAN (V.O.) I was on the island, so I wanted to drop by and say hello. Augustine and Jean stand outside a dome.   Augustine’s holding some photographs just out of our focus... staring down at them. JEAN You can keep those. AUGUSTINE (as he looks at them) The rock I sent.   Did you tell her it was from me? Jean smiles... shakes her head. JEAN What do I keep telling you, Augustine?   If you want her to know you exist, you can do the introduction yourself. A LONG BEAT, as Augustine stares at one of the photos. AUGUSTINE This could have been different.   If you’d told me the truth... hadn’t left. Jean looks out over the incredible view surrounding them... then squints up to the sky. JEAN She would have known your name. That’s the only difference. Jean leans in to kiss Augustine’s cheek... JEAN (CONT’D) And we both know it. ...then starts walking toward a car. JEAN (CONT’D) Enjoy the view, Augustine.  101.",
      "characters": [],
      "action_text": "Augustine watches Jean climb into the car... pull away.   Then he looks out at the clouds... then back to the photographs. POV FROM BENEATH AUGUSTINE... and we can see that INK- SCRIBBLED   2008   on one of the photographs.  EXT. LAKE HAZEN WEATHER STATION - DUSK The sky is brighter... almost feels like day. SULLY (V.O.) Repeat. Lake Hazen, this is Aether. Are you still picking this up? INT. LAKE HAZEN - RADIO BUILDING - DUSK Iris kneels in a chair, wearing that yellow dress.   She uses the radio desk for leverage to spin herself around in circles. SULLY (V.O.) Are you there, Lake Hazen? Augustine moves slowly... weakly... across the room to the radio... eases into the chair... taps the mic. AUGUSTINE I’m here, Aether. INT. AETHER - COMMUNICATION POD - SPACE Sully strapped into her seat.   She isn’t wearing her headphones. SULLY I thought I might’ve lost you. AUGUSTINE (V.O.) Not yet.   Were you able to run the numbers on the course correction I gave you? Sully looks beside her... and we see Harper is in the pod also. HARPER Lake Hazen, this is Aether Flight Commander Gordon Harper.   Your numbers are intriguing. (MORE) 102. But they make me curious where you came up with them and how you know so much about our flight plan.   Who exactly are you? A LONG BEAT, then-- AUGUSTINE (V.O.) Augustine Lofthouse. Sully and Harper immediately look at each other.   They know that name.  AUGUSTINE (V.O.) And you’re on your way back from the planet I first saw almost forty years ago.   I wish I’d found it a year sooner... might’ve saved a lot of lives. HARPER Doctor Lofthouse... I’d hoped to meet you on our return... tell you all about your planet. INT. LAKE HAZEN - RADIO BUILDING - DUSK Iris has stopped spinning... just watches Augustine. HARPER (V.O.) This was definitely not the way I’d seen this conversation playing out. And I’m sorry. AUGUSTINE Nothing to be sorry for, Commander. What took place down here... you and your crew have the ultimate alibi. (beat) The question now i",
      "dialogue_count": 0,
      "word_count": 1133
    },
    {
      "scene_number": 14,
      "slugline": "EXT. AETHER - SPACE The RE-ENTRY POD disengages from Aether... blasts downward toward earth. INT. LAKE HAZEN - RADIO BUILDING - DUSK ANGLE ON A BEEPING AIR DETECTOR resting on the floor... it’s bouncing near the RED LEVELS.   Augustine’s hand reaches into frame... turns the detector off. Augustine sits on the floor against the wall... weak... sweat glistening on his face... deathly sick.   He shakes the LAST TWO PAIN PILLS from the bottle... tosses them into his mouth... lets the empty bottle roll away on its own. He closes his eyes... leans over to lie on the floor.   He’s there a few moments until the CRACKLE OF STATIC. SULLY (V.O.) ...Aether...   static ... receiving? Augustine doesn’t react. SULLY (V.O.) ... static ... Hazen...   static ... Aether. Then Iris crouches beside Augustine... begins shaking him awake.   Augustine’s eyes flutter open. AUGUSTINE’S POV ON IRIS... wearing that yellow dress as she nudges him again. SULLY (V.O.) Can you hear me? Augustine stares at Iris a moment, then struggles for the strength to rise... finally does... makes his way to the radio... drops into the chair, and hits the mic button. AUGUSTINE I hear you, Aether. Iris sits up on the edge of the desk beside Augustine. SULLY (V.O.) We’re headed into an ionization blackout so I’m going to lose you... 107.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 220
    },
    {
      "scene_number": 15,
      "slugline": "INT. AETHER - COMMUNICATION POD - SPACE Sully strapped in, headphones on.   She’s fiddling with the gold-streaked space rock as she talks. SULLY ...but I wanted to contact you first.   To thank you.   Commander Harper and I are returning to K-23. AUGUSTINE (V.O.) I’m glad.   The rest of the crew? SULLY Captain Ivanov and Specialist Thebes decided on re-entry. AUGUSTINE (V.O.) They have family down here? SULLY Yes. AUGUSTINE (V.O.) Weren’t there five of you? Sully nods a moment before replying. SULLY Flight Engineer Devi.   She suffered an accident during the flight. AUGUSTINE (V.O.) I’m sorry. SULLY With everything that’s happened down there, just losing one person up here... I’m sure it seems like it shouldn’t matter, but it does. (voice cracks a bit) Very much.   I’m sorry... I know you’ve probably lost so many. INT. LAKE HAZEN - RADIO BUILDING - DUSK Augustine pulls a couple photos from the pile... looks at a picture of Jean. AUGUSTINE I lost everyone that mattered a long time ago.   Made a bargain... traded them for the stars. (MORE) 108.",
      "characters": [],
      "action_text": "(beat) Now they’re just an old man’s regrets. SULLY (V.O.) They shouldn’t be.   You discovered so much up here. AUGUSTINE I just point.   You’re the explorer. Tell me what it’s like... to stand on it.   K-23. INT. AETHER - COMMUNICATION POD - SPACE Sully smiles at the thought. SULLY It’s amazing.   The colony site... it feels like Colorado.   Have you ever been there?   To the mountains? AUGUSTINE (V.O.) Yes. SULLY The air’s so crisp.   And the planet has that smell... CUT TO: EXT. COLORADO MOUNTAINS - DAY Augustine stands in an open meadow.   Mountains surrounding him.   His eyes are closed as he inhales. SULLY (V.O.) ...it’s like the pine trees are hidden somewhere... underground... waiting to burst through. INT. LAKE HAZEN - RADIO BUILDING - DUSK Augustine sits at the radio, eyes closed. SULLY (V.O.) I kept looking up expecting to see a blue sky.   But it was orange. AUGUSTINE (CONT'D) 109. AUGUSTINE From the light reflecting off Jupiter. SULLY (V.O.) It’s so beautiful.   I wish you could have seen it. Augustine’s eyes flutter open. AUGUSTINE Lake Haven will have to do. SULLY (V.O.) How did you end up there? Augustine lifts a FACE-DOWN PHOTO from desk... the one with the   2008   scribbled on the back.   He stares at an image the rest of us still can’t see. AUGUSTINE Thought maybe I could help someone. SULLY (V.O.) Well you definitely did.   And thank you again for that, Doctor Lofthouse. AUGUSTINE Augustine. SULLY (V.O.) Augustine. (beat) And I’m Iris. Then we SEE THE PHOTO AUGUSTINE IS STARING DOWN AT... A PICTURE OF A SMILING IRIS IN THAT YELLOW DRESS. AUGUSTINE I know. A tear slips from the corner of Augustine’s eye. AUGUSTINE (CONT’D) It’s very nice to talk to you. SULLY (V.O.) Well I hope you understand how- STATIC... a long, constant stream. 110. AUGUSTINE Hello?   Aether. (off the static) Iris?   Are you still there? Just that static.   Sully is gone.   But just in case-- AUGUSTINE (CONT’D) (into the mic) Have a good life. Augustine sits there a moment, s",
      "dialogue_count": 0,
      "word_count": 641
    }
  ]
}