{
  "slug": "the-queens-gambit-101-openings-2020",
  "title": "the queens gambit 101 openings",
  "genre": "drama",
  "format": "series",
  "scenes_count": 12,
  "characters_count": 0,
  "characters": [],
  "total_words": 13908,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT/EXT. PARIS HOTEL ROOM - MINUTES LATER 4   4  She comes back into the room and opens the curtains to reveal a grey PARIS morning outside. Having changed into a different dress, she steps into one shoe, hunts for the other... She shakes A GREEN PILL from a vial, spots a mini bar-sized bottle of Vodka on the dresser with a bit still left inside, puts the little bottle to her lips when-- SOMEONE STIRS ON THE BED. She turns, sees a shape under the covers. She stares, clearly trying to do the math as to just who the fuck is in her bed. She pops the pill. Drains the bottle. Grabs her shoes...  INT. PARIS HOTEL - HALLWAY - SAME 5   5  FOLLOW HER DOWN THE HALL to a grand staircase. She holds her shoes in one hand, runs the other over her dress, smoothing the wrinkles the best she can. Beth hurries down the stairs, passing a MAN holding the hand of a LITTLE GIRL on the way up. The little girl stares up at Beth as they pass... Beth crosses the ornate lobby, heads for another hallway--  INT. PARIS HOTEL - ANOTHER HALLWAY - SAME 6   6  As Beth hurries along the quiet hallway, pauses in front of large pair of doors and pulls on her shoes. She then pushes through the doors into--  A GIANT BALLROOM 7   7  As a hundred heads turn towards her. While the room is packed with people, it’s dead silent. They’ve been waiting. For   her . And now we hear   one   sound: THE WHIR OF CAMERAS. A DOZEN PHOTOGRAPHERS gathered at the entrance snap her picture. The crowd parts to reveal A TABLE at the very center of the room. A CHESSBOARD sits on top. TV CAMERAS have been set up. The size/look hinting that it’s sometime in the   mid sixties . Seated at the table waiting for her is VASILY BORGOV, forty. A frightening figure in a dark suit, Borgov is all eyebrows and frown. Beth approaches, quickly shakes his hand and sits down across from him. BETH I’m sorry. He nods, says nothing. A few more photos and then SILENCE. Beth watches Borgov make his first move. PUSH IN ON HER--  2.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 374
    },
    {
      "scene_number": 2,
      "slugline": "EXT. KENTUCKY HIGHWAY - DAY 8   8  VOICE What are we supposed to do with her?  AND NOW BETH AT 20 BECOMES BETH AT 9  The little girl staring at Camera. ANOTHER VOICE They’re sending someone.  BEGIN PANNING AWAY FROM BETH...  TO LOOK DOWN a ribbon of empty Kentucky Highway, hung with low fog, as the PAN CONTINUES ACROSS THE HIGHWAY-- VOICE Not a scratch on her. --to A TRAFFIC ACCIDENT. Car versus Truck.   Head on . The car flattened, is wedged deep under the front end of the bigger vehicle. The TRUCK DRIVER stands away from it smoking, eyes on A BODY that lies on the asphalt covered in a sheet. Now--  CONTINUE PANNING TO LOOK   UP   THE HIGHWAY ... TO FIND A COUPLE OF COPS standing there holding a LONG LINE OF TRAFFIC, the makes of the cars put us in the   late fifties.  SIRENS and FLASHING LIGHTS of rescue vehicles in the distance driving up the shoulder... COP #1 It’s a miracle. The other cop looks back down as CAMERA COMPLETES ITS CIRCLE and once again FINDS BETH, in a cotton dress, staring at the body on the ground. COP #2 I doubt she’ll see it that way. AS THE SIRENS GET LOUDER--  INT. CAR - DAY 9   9  Beth stares at the mole on the face of the chatty MATRON from Social Services behind the wheel. MATRON You understand, dear, your mother’s passed on? You know what that means, do you,   passed on?  (Beth nods)  (MORE)  3.",
      "characters": [],
      "action_text": "Well, I’m sure she’s gone on to a better place and, someday, you’ll get to see her again. BETH When? The woman looks at Beth, smiles, then looks ahead as they pull up to a trailer in the woods-- MATRON I imagine it must be very quiet living way out here. (more to herself) Very quiet...  INT. MOBILE HOME - DAY 10   10  The door opens and Beth follows the woman into the ragged and tired space. Dirty dishes are piled up around a small sink. MATRON Oh, my... The woman stays soft in the doorway as Beth enters, stares at a nearly empty glass of milk on the table sitting across from a coffee cup, LIPSTICK visible on the rim. From the b.g... MATRON (CONT’D) The funeral will be in a few days... Beth puts the cup to her lips as... MATRON (CONT’D) Of course, given the...   scope   of her injuries, the casket will be closed. The woman steps forward, puts a meaty hand on her shoulder. MATRON (CONT’D) Have you got a suitcase?  EXT. MOBILE HOME - DAY 11   11  Beth exits with a paper grocery sack full of her belongings. The Woman droning on as they walk to a dusty sedan, “KNOX COUNTY SOCIAL SERVICES” stenciled on the door-- MAN’S VOICE Elizabeth? She looks to where A MAN gets out of a car, a CAMERA around his neck. A REPORTER-- He snaps her picture...  CONTINUED: 9   9  MATRON (CONT'D)  4. MRS. DEARDORFF (V.O.)  Orphaned by yesterday’s collision on New Circle Road...  FREEZE - A NEWSPAPER PHOTO - BETH HARMON On the image of Beth looking out the window of the car... MRS. DEARDORFF (V.O.)  Elizabeth Harmon surveys a troubled future.  INT. MRS. DEARDORFF’S OFFICE - SAME 12   12  MRS. DEARDORFF -- a tall statue of a woman in horn rims -- reads the paper at her desk. A FILE open in front of her. MRS. DEARDORFF  Elizabeth, nine, was left without family by the crash...  EXT. KENTUCKY COUNTRYSIDE - DAY 13   13  As the sedan moves through the Kentucky countryside, Beth rests her head on the door, letting the wind hit her face. MRS. DEARDORFF (V.O.)  Her mother, Alice Harmon, was pronounced ",
      "dialogue_count": 0,
      "word_count": 739
    },
    {
      "scene_number": 3,
      "slugline": "EXT. METHUEN HOME FOR CHILDREN - DAY 17   17  Mrs. Deardorff exits the building, smiles as the sedan pulls up alongside her. She opens the passenger door and smiles-- MRS. DEARDORFF You must be Beth. Beth gets out, clutching a brown grocery bag, takes in Mrs. Deardorff, the woman all put together in a woolen skirt and matching silk blouse ringed with big pearls.  INT. METHUEN HOME - DAY 18   18  As Mrs. Deardorff carries Beth’s bag inside, the Social Worker in the sedan already peeling rubber out of there behind them. Beth watches her go. MRS. DEARDORFF Mr. Fergussen, this is Elizabeth Harmon. Fergussen nods to Beth as he quickly passes by, goes through a door, opening it long enough for us to hear the following goodie from inside-- GIRL’S VOICE  You’re all fucking cocksuckers!  She looks at Fergussen, who gives her an   I’m on it   look. FERGUSSEN (calling off) Jolene! That mouth is gonna be the death of you! MRS. DEARDORFF (smiles at Beth) This way, dear-- Other girls nod stiffly to Mrs. Deardorff as they pass. GIRLS Good-morning, Mrs. Deardorff. MRS. DEARDORFF Good-morning, girls.  INT. GIRLS' WARD - DAY 19   19  Mrs. Deardorff shows Beth to a metal bed by the door to the bathroom. Clearly the worst spot in the room. Made even more apparent as we hear the TOILET FLUSH and a GIRL exits, looks surprised to see the head of the orphanage right there. MRS. DEARDORFF Shoo.  6.",
      "characters": [],
      "action_text": "The girl hurries off as Mrs. Deardorff opens the drawers under the bed... MRS. DEARDORFF (CONT’D) You can put your clothes down here. And there’s a shelf for your tooth brush and any other personal items there. She watches as Beth unpacks her few things from the bag. MRS. DEARDORFF (CONT’D) I know that, at this moment, all you’re feeling is loss. But after grief brings you low, prayer and faith will lift you high... high enough for you to see a new path for yourself. Beth just keep unpacking, doesn’t look at her. MRS. DEARDORFF (CONT’D) I think, Elizabeth, you’re going to find a much different life here, a better one than you might have had. Mrs. Deardorff puts a hand on Beth’s shoulder. MRS. DEARDORFF (CONT’D) And I’m certain that you and I are going to be good friends. Now Beth turns around and looks up at her. MRS. DEARDORFF (CONT’D) Now about that hair...  INT. BATHROOM - DAY  Mrs. Deardorff watches MRS. LONSDALE cut Beth’s hair.  INT. LINEN SUPPLY ROOM - DAY 20   20  Shelves full of clothing arranged by color. Mrs. Deardorff turns to the newly shorn Beth and holds up a plain shift to the girl’s body. MRS. DEARDORFF That should do nicely. She nods to Beth’s dress. MRS. DEARDORFF (CONT’D) Off with that rag.  CONTINUED: 19   19  7. Beth pulls her old dress over her head, looks at her name hand embroidered in the shape of a heart. Mrs. Deardorff takes it from her, holds it out away from herself. MRS. DEARDORFF (CONT’D) I think we’ll burn this one. Beth looks at her, is about to react when she hears LAUGHTER, turns to see a couple of girls watching her from the doorway-- A few GIRLS peek in as Beth hugs her skinny self. MRS. DEARDORFF (CONT’D) Shoo. A BELL SOUNDS and Mrs. Deardorff smiles at Beth. MRS. DEARDORFF (CONT’D) One more stop.  CUT TO A LARGE JAR OF GREEN PILLS 21   21  BOOM UP to reveal CHILDREN LINED UP beyond a window where now Fergussen passes out pills and cups of water. NOW TRACK DOWN TO THE END OF THE LINE TO BETH as Mrs. Deardorff rests a hand on he",
      "dialogue_count": 0,
      "word_count": 1187
    },
    {
      "scene_number": 4,
      "slugline": "INT. GIRLS' WARD - NIGHT 24   24  Everyone in bed. Beth is the only one awake. She lies there listening to the girls in the other beds, coughing, turning and muttering. A SHADOW crosses her bed as the NIGHT ORDERLY walks past. A DISTANT PHONE RINGS, A TOILET FLUSHES. VOICES DOWN THE HALL. She looks up at the ceiling. BRANCHES from the trees outside the window form eerie, CRISSCROSSING SHADOWS on the ceiling. She sees Jolene, a few beds over, taking her pill NOW. Jolene looks back at Beth, shakes her head and lays down. Beth rolls over on her side and curls up tight.  INT. GIRLS' WARD - MORNING 25   25  As Beth wakes up, doesn’t feel so good. Mrs. Deardorff walks into the ward and everybody straightens up.   Good Morning Mrs. Deardorff.  MRS. DEARDORFF Good morning, Girls. This is Mr. and Mrs. Spellman. A YOUNG COUPLE shyly enters behind her, apparently “shopping” for a kid. Beth watches as the girls all quickly put delicate HEADBANDS in their hair. Beth doesn’t have one. She turns as the couple comes her way. But Beth looks awful. They take one look at her and turn away.  EXT. EXERCISE YARD - DAY 26   26  The girls are all doing various forms of exercise. Beth watches Jolene and some other girls on a jump rope. She invites Beth over. BETH I’ve never done it. JOLENE Never? BETH No. JOLENE Try it. Beth tries to jump in with Jolene, but catches the rope with her foot. Beth feels like an idiot. Jolene smiles and takes her hand--  11.",
      "characters": [],
      "action_text": "JOLENE (CONT’D) Hang onto me and jump when I jump... Beth does and misses. JOLENE (CONT’D) Try again. Beth does and soon she’s doing it in rhythm with the older girl. JOLENE (CONT’D) Now you’re getting it.  INT. MULTI-PURPOSE ROOM - “VITAMIN LINE” - DAY 27   27  As Beth receives her pills, turns to go without taking them-- FERGUSSEN Hey-- Harmon! She turns back. He points to the cup. FERGUSSEN (CONT’D) Take your pill. She has no choice. Takes the pills.  INT. GIRLS' WARD - NIGHT 28   28  Another night of no sleep. Movement and voices down the hall. The shadows from the trees on the ceiling more menacing than ever. Beth curls up, knows it’s going to be a long night. KNOCKING ON A DOOR OVER...  INT. MOBILE HOME - NIGHT (FLASHBACK) 29   29  A younger Beth lying on the couch, awake, listening to the hushed conversation. MAN’S VOICE Alice, come on. Open the door. It’s taken me a whole month to find you. ALICE/BETH’S MOTHER For good reason. Beth slips out off the couch... ALICE You shouldn’t be here. MAN’S VOICE I could say the same to you.  CONTINUED: 26   26  12. Beth looks to the doorway of the mobile home, it’s ajar, her mother ALICE stands there calmly talking through the crack to a MAN we can’t quite see. ALICE I’m living my truth. MAN Your   truth ? You went to Cornell. ALICE That was a mistake. One of many. Beth creeps closer, tries to see who’s out there. MAN Alice. Sweetheart. Whatever you’re doing, whatever   this   is, it’s nuts, even for you. ALICE I don’t expect you to understand. I don’t expect anyone to understand. MAN What I   understand   is that you’re not taking care of yourself. And with that, Beth watches as he drops a VIAL OF PILLS THROUGH THE CRACK. Alice ignores them. MAN (CONT’D) Just let me come in and talk to Lizzy. Make sure she’s okay. ALICE You think I’d   hurt   her? She’s happy here. She’s where she belongs. MAN Do you honestly think our daughter  belongs   in a trailer, the middle of nowhere. ALICE Who says she’s “our” daughter? MAN Alice",
      "dialogue_count": 0,
      "word_count": 1165
    },
    {
      "scene_number": 5,
      "slugline": "INT. BASEMENT - SAME 35   35  Beth comes down the stairs, comes around the corner, and THE BACK OF THE JANITOR comes into view. He sits on a metal stool near the furnace, a single bare bulb overhead, scowling at the green and white board in front of him. Beth looks at the board. The funny-shaped pieces on the green and white squares. He glances at her, then back to the board. Beth moves to the far side of the basement and clops the erasers together, watching the janitor the entire time. She stares at the man through the billowing cloud of chalk dust growing all around her-- The janitor is in his fifties, heavyset, nothing particularly friendly about him. MR. SHAIBEL. She finishes the job and starts to leave, this time crossing closer to the game, getting a good look at THE BOARD as she passes. Fascinated by it. It almost seems to   move . He looks up at her and she bolts up the stairs...  INT. CORRIDOR - DAY 36   36  As Beth runs up the corridor with the erasers...  INT. GIRLS' WARD - NIGHT 37   37  Beth lies awake, listening to the noises of the night, but this time, instead of gutting it out, she reaches down and dumps the PILL from her toothbrush holder into her palm and swallows it. She lies back and stares up at the CEILING... ...The CRISSCROSSED SHADOWS FROM THE TREES OUTSIDE begin to SLOWLY STRAIGHTEN OUT AND FORM SQUARES. Beth stares at them, watches as the ceiling becomes a GIANT CHESSBOARD. The door opens, the shaft of light from the hall ruining the chessboard on the ceiling as Mr. Fergussen checks in on the girls, then backs out again. Beth looks up at the ceiling as the board reappears...  INT. GIRLS' WARD - MORNING 38   38  Beth wakes up, refreshed, feeling better than she has. MRS. DEARDORFF Good morning, girls. She turns to see Mrs. Deardorff enter the ward. EVERYONE Good morning, Mrs. Deardorff.  16.",
      "characters": [],
      "action_text": "MRS. DEARDORFF Mary-Sue? She walks over to A LITTLE BLOND GIRL who listens to the head mistress. Mrs. Deardorff turns to go, but turns back with one more thought-- she snaps her fingers and points to the little girl’s head. Clears her throat. The little girl quickly puts on her little headband. MRS. DEARDORFF (CONT’D) Don’t dawdle. And she walks out. Beth watches as the little girl starts quickly collecting her things. JOLENE Not fair. Beth turns to see Jolene now standing beside her. JOLENE (CONT’D) She came here after you. (turns to Beth) Most of us are lifers. Been here a long time. Nobody’s gonna come for us now. We’re too old. (then) Or too black. Beth takes that in, watches as Mrs. Deardorff helps her pack up her things.  INT. MULTI-PURPOSE ROOM - “VITAMIN LINE” - MORNING 39   39  As Beth receives her “vitamins,” turns away, walks around the corner and then pockets the green one. She looks up and sees Mr. Shaibel far down the corridor go into the basement. HEAR THE GIRLS SINGING OVER...  INT. CHAPEL - MORNING 40   40  Miss. Lonsdale leads the girls in singing   Bringing in the Sheaves . Beth, bored out of her skull, slips out of her seat, motions to MISS. LONSDALE that she “has to go.” Miss Lonsdale frowns. Beth indicates “really bad.”  INT. CORRIDOR - MORNING 41   41  The singing in the b.g. as Beth hurries to the stairs--  CONTINUED: 38   38  17.",
      "dialogue_count": 0,
      "word_count": 579
    },
    {
      "scene_number": 6,
      "slugline": "INT. BASEMENT - DAY 42   42  Beth slowly comes up behind Mr. Shaibel. He reaches out and touches one of the knights... thinking... She comes closer, the shadow of her head falling on the board-- MR. SHAIBEL What do you   want , child? She stands still. He turns to her. MR. SHAIBEL (CONT’D) You should be in   chapel . Saying the word like he bit into something rotten. BETH What’s that game called? MR. SHAIBEL You should be upstairs with the others. BETH I don’t want to be with the others. I want to know what game you’re playing. He looks up at her a moment, then shrugs. MR. SHAIBEL It’s called chess. She takes a step back and he resumes his game. Beth watches as he stares at the pieces. Motionless. As if he hates them. She watches him reach out and pick a piece up by its top with his fingertips, hold it for a moment as though holding a dead mouse by the tail and then set it on another square. BETH Will you teach me? Mr. Shaibel says nothing, doesn’t even register the question. All we get are the DISTANT SINGING VOICES. She tries again... BETH (CONT’D) I want to learn to play chess. Mr. Shaibel reaches out a fat hand to one of the larger black pieces, picks it up deftly by its head and sets it down on a square on the other side of the board. Not looking at her-- MR. SHAIBEL I don’t play strangers.  18.",
      "characters": [],
      "action_text": "The flat voice is like a slap in the face. She stands there a moment, then turns and runs back upstairs.  INT. GIRLS’ WARD - NIGHT A43   A43  As the girls all jump into their beds. Beth sneaks a pill and lies back just as Fergussen turns off the lights. FERGUSSEN Sweet dreams, ladies. And shuts the door. Beth concentrates on the ceiling, watches as it once more forms squares...  EXT. EXERCISE YARD - DAY 43   43  Jolene plays dodge ball. Beth steps up beside her, watches as the older girl catches the ball one handed, and sends it back like a bullet, knocking over the girl who threw it. BETH You were right, the vitamins work better at night. JOLENE How many you take? BETH I don’t know-- Sometimes I skip a day, or a bunch of days, then take two or three. I like the way it feels. JOLENE I bet you do. And now Jolene lifts a cigarette she’d been keeping at her side to her lips, takes a quick hit. Jolene sees Fergussen looking her way, smiles, shows him some leg as she says to Beth-- JOLENE (CONT’D) You just be careful you don’t get too used to that feeling.  INT. CORRIDOR - DAY 44   44  As Beth runs up the corridor with the erasers...  INT. BASEMENT - DAY 45   45  Beth cleans the erasers, watching Mr. Shaibel at the chess board. He doesn’t look up. Finally she walks over. Takes a breath. Then--  CONTINUED: 42   42  19. BETH I’m not a stranger. (then) I live here. (no answer) I already know some of it, from watching. MR. SHAIBEL (finally) Girls don’t play chess. Beth takes a step closer, points at, but doesn’t touch, one of the rooks-- BETH That one moves up and down or back and forth. All the way, if there’s space to move in. But that one can only go up. That tall one can go any way it wants. Mr. Shaibel remains quiet. She’s turning to go when-- MR. SHAIBEL And this one? And her heart leaps as he points to a bishop. BETH On the diagonals. He points to a knight. BETH (CONT’D) One square diagonal plus one square straight. He looks up at her. Considers. Then-- MR. SHAIBEL Le",
      "dialogue_count": 0,
      "word_count": 1477
    },
    {
      "scene_number": 7,
      "slugline": "INT. GIRLS' WARD - NIGHT 56   56  Beth lies in bed. MOVING CHESS PIECES ABOUT THE CEILING... BETH (quietly) Check.  INT. CORRIDOR - DAY 57   57  Beth once more walks to the basement door, tries it. LOCKED. She smacks it with one of the erasers, then walks away.  EXT. METHUEN HOME - DAY 58   58  Beth walks out into a grey day and begins clopping the erasers together. LAUGHTER OS. Beth looks off and sees several LOCAL KIDS standing just outside the grounds. One of the BOYS lights a cigarette, waves-- A BIT OF THUNDER and Beth hurries back inside.  INT. GIRLS' WARD - NIGHT 59   59  LIGHTNING AND RAIN out the windows. WHISPERED VOICES and Beth turns to see SHADOWS IN THE BATHROOM. Beth gets out of bed...  INT. BATHROOM - NIGHT 60   60  VOICES INSIDE. Beth enters, comes around the corner and sees Jolene and Fergussen. She sits in his lap, facing him. FERGUSSEN Shit-- Beth runs out.  INT. GIRLS' WARD - NIGHT 61   61  As Beth gets into her bed and pulls the covers up over head. Jolene comes into the dark room and stands over Beth’s bed a moment. She then REACHES OUT AND BRINGS HER FIST DOWN ON THE SHAPE UNDER THE COVERS. Beth’s cry cut off as Jolene rips the sheet back and leans close to her-- JOLENE What did you see? BETH Nothing. JOLENE That’s right. You saw nothing. So you   say   nothing.  25.",
      "characters": [],
      "action_text": "Beth nods and Jolene then flings the sheet back over her and quietly slips back into her own bed.  INT. CORRIDOR - DAY 62   62  Beth walks to the basement door. Half-heartedly reaches for the door, but this time-- IT’S UNLOCKED. She stands there a moment, caught off guard. Then--  INT. BASEMENT - DAY 63   63  She goes down the stairs, comes around the corner to see Mr. Shaibel sitting at the chessboard, the pieces ready. Beth begins cleaning the erasers. Risks glancing at him-- Mr. Shaibel nods to the board. As if nothing happened. She hesitates, then comes over and sits down across from him. He’s already made the first move. They begin to play. They say nothing to each other, but respond quickly to the other’s moves. Beth glances up at him, can see tension and  likes it . She begins to push a pawn toward the sixth rank. He responds. Moves his knight. She moves the pawn. He moves his knight back. She smiles at the wasted move, trades her bishop for the knight. Soon, her pawn is one move away from becoming a queen. He looks at it sitting there. Reaches out and angrily topples his king. Neither of them says anything. But it’s her first win and we see on her face that it feels pretty damn good. MR. SHAIBEL You’re gloating. BETH I’m not. MR. SHAIBEL It was close. BETH I still beat you. MR. SHAIBEL You could have beat me sooner. (then) You should learn the Sicilian Defense. BETH What’s that? He reaches for the board--  CONTINUED: 61   61  26. MR. SHAIBEL When white moves to king four, black does this. He moves the pieces on the board into position. BETH Then what? He moves the knight as-- MR. SHAIBEL Knight to KB 3. BETH What’s KB 3? MR. SHAIBEL King’s bishop 3. Where I just put the knight. BETH The squares have names? MR. SHAIBEL If you play well, they have names. BETH Show me. MR. SHAIBEL Not now. (then) Let’s play again.  A SEQUENCE OF SHOTS 64   64  Beth running up the corridor with the erasers. Beth in line for her pills. Beth playing with Mr. Shaibel. Beth stashing",
      "dialogue_count": 0,
      "word_count": 2763
    },
    {
      "scene_number": 8,
      "slugline": "INT. GIRLS' WARD - NIGHT 80   80  Beth takes several of the green pills. Lies back and begins to play on the ceiling. MR. GANZ (V.O.) I brought my own set...  CUT TO A WOODEN BOX 81   81  As it’s opened to reveal polished wooden chess pieces nestled in red felt. As they’re lifted out, we WIDEN TO REVEAL: THE BASEMENT. A chess board of black and white squares now set up on the table. Nobody speaks while... Mr. Shaibel, having set up his board in the usual place, now sets another milk crate for Mr. Ganz’s board, the two boards side by side. Beth sits on a crate in the foot or so of space between them. None of them speak. Beth reaches out and hefts one of the wooden knights, feels the weight of it, looks at the fine wood grain, the felt at the bottom. She instantly wants this chess set. Mr. Ganz gently takes back the knight from Beth’s hand and sets it on its home square. MR. GANZ We thought you could play us both. BETH At the same time? He nods. She has white for both games. She makes a move on each board. As they both respond, She doesn’t even have to pause to think about the continuations for either board. She makes her moves and now looks out the window and waits. She seems deeply relaxed, almost in a dream. MR. GANZ Beth? I’ve moved my bishop to bishop 5. BETH (not looking) Knight to K-5. He nods, studies the board, moves-- MR. GANZ Bishop to Knight four. BETH Queen to queen four.  38.",
      "characters": [],
      "action_text": "She still hasn’t looked at the board. The bush and its pink blossoms outside the high window has her attention. MR. SHAIBEL Knight to queen’s bishop three. BETH Bishop to knight five. As opposed to Mr. Shaibel’s gruff tone, Mr. Ganz’s voice now has a strange softness... MR. GANZ Pawn to knight three. BETH Queen to rook four check. Behind her, JUST OUT OF FOCUS, Mr. Ganz inhales sharply. A moment, then-- MR. GANZ King to bishop one. BETH (still not turning) That’s mate in three. First check is with the knight. The king has the two dark squares, and the bishop checks it. Then the knight mates. MR. GANZ Sweet Jesus. He shakes his head, checks his watch. MR. GANZ (CONT’D) I have to go now. He stands, grabs his satchel, remembers something, pulls out a CAMERA... looks at Beth... MR. GANZ (CONT’D) Would you mind, Beth, if I took your picture? I’d love to tell the kids in the chess club about you. She’s not sure. Looks at Mr. Shaibel. MR. GANZ (CONT’D) How about you stand beside Mr. Shaibel? She gets up, moves to Mr. Shaibel’s side. Both are awkward. She rests her hand on his shoulder. Startling him.  CONTINUED: 81   81  39. MR. GANZ (CONT’D) Say... Queen! Mr. Shaibel says nothing, but-- BETH (flat) Queen. A FLASH AND--  INT. COMMON ROOM - DAY 82   82  The kids are all watching a movie called “ HOW TO ACT AT DINNERTIME.”  ON BETH  Watching the movie with a bored detachment as now behind her Fergussen makes his way into the room and scans their faces. He spots Beth, sitting with Jolene. He leans over the older girl and taps Beth on the shoulder. Jolene notes the closeness of his lean, gives him a look, as Beth gets up and follows Fergussen out of the room--  INT. CORRIDOR - DAY 83   83  A frightened Beth follows a silent as usual Fergussen, her thick brown shoes squeaking on the linoleum behind him. He leads her to the door with the frosted glass window,   HELEN DEARDORFF. SUPERINTENDANT.   Beth takes a breath--  INT. MRS. DEARDORFF’S OFFICE - SAME 84   84  Beth walks in an",
      "dialogue_count": 0,
      "word_count": 1283
    },
    {
      "scene_number": 9,
      "slugline": "INT. MULTI-PURPOSE ROOM - “VITAMIN LINE” - MORNING 87   87  As Fergussen hands Beth the little paper cup. She turns to go, looks down into it, sees TWO ORANGE VITAMIN TABLETS and turns back to him. BETH There’s one missing. FERGUSSEN That’s it. Next. Beth doesn’t move as the girl behind her pushes against her. GIRL BEHIND HER It’s my turn, Harmon. BETH Where are the green ones? FERGUSSEN You don’t get them anymore. Beth stands on tiptoe, looks behind Fergussen to the BIG GLASS JAR FULL OF GREEN PILLS. Still there and still nearly a third full. She points at it-- BETH There they are. Right behind you. FERGUSSEN I know where they are, Harmon. But I’m not giving you any. It’s a new State law-- No more tranquilizers for kids. Go figure. GIRL BEHIND HER  Harmon. It’s my turn . Fergussen waves at her. FERGUSSEN  Go thou further off; bid me farewell and let me hear thee going.  BETH What? FERGUSSEN Beat it.  INT. GIRLS' WARD - NIGHT 88   88  Beth tries to sleep, but can’t. She leans over, peers into her toothbrush holder. ONLY ONE PILL LEFT. She hesitates, then takes it.  44.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 197
    },
    {
      "scene_number": 10,
      "slugline": "INT. CAFETERIA - MORNING 89   89  Beth eats, notices that her hands are shaking. Under the table, her legs bounce, she crosses them over twice.  INT. MULTI-PURPOSE ROOM - DAY 90   90  As Beth walks by the pharmacy window, sees the JAR OF PILLS still sitting there, over half full.  INT. BATHROOM - NIGHT 91   91  Beth stands at the sink brushing her teeth when Jolene comes up to the sink beside her, begins brushing her own teeth. JOLENE I hear tell you’re going to   exhibit  yourself. Beth looks at her. JOLENE (CONT’D) Going to play chess in front of people. BETH Who told you? JOLENE Child, I just know things. BETH Did Mrs. Deardorff tell you? JOLENE Never go near that lady. It was Fergussen. He told me you were going to the high school downtown. Day after tomorrow. BETH Fergussen? JOLENE As you well know, he and I been friendly from time to time. (then) I appreciate you keeping your mouth shut. I wasn’t sure you could. Beth nods. Jolene resumes brushing... BETH Did Fergussen give you any green pills? Extra ones? Jolene turns and looks at her hard. Then her face softens.  45.",
      "characters": [],
      "action_text": "JOLENE No, honey. I wish he would. But they got the whole state after ‘em for what they been doing with those pills. BETH They’re still there. In the big jar. JOLENE That a fact? I ain’t noticed. (keeps looking at Beth) You having withdraw symptoms? BETH I don’t know. What are those? JOLENE You getting edgy? (then) Yeah, you are. Jolene finishes drying her hair. Beth stares up at her, the light coming behind her frizzy hair, her big wide eyes. Beth looks at herself in the mirror, far less impressed. JOLENE (CONT’D) You look around, they’ll be some jumpy orphans around here the next few days.  INT. GIRLS' WARD - DAWN 92   92  Beth lies in bed, wide awake. Staring at an empty ceiling.  EXT. METHUEN HOME - DAY 93   93  As a car pulls up. And now Mr. Ganz gets out followed by a big, sweet-faced girl -- SHIRLEY MUNSON.  INT. GIRLS’ WARD - DAY 94   94  Beth sits on her bed, her face in her hands when Fergussen appears in the doorway-- FERGUSSEN Harmon? (she looks up at him) You alright? She nods, gets up.  INT. METHUEN HOME - CORRIDOR - DAY 95   95  As a pale Beth walks behind Mr. Ganz and Shirley. The big girl looks back--  CONTINUED: 91   91  46. SHIRLEY Do you play the King’s Gambit? BETH No. SHIRLEY It’s my favorite. Beth nods distractedly. SHIRLEY (CONT’D) Did you know Chess is older than Checkers? BETH No. SHIRLEY By like four hundred years. They’re at the front door when-- JOLENE (V.O.) Wait! They all turn to see Jolene come running up to them. She gives Mr. Ganz one of her sly smiles... JOLENE Is it okay if I talk to Beth for just a second? Wish her luck? MR. GANZ (checks his watch, then) Sure. Go ahead. Jolene takes Beth hastily aside and puts something in Beth’s hand. Kisses her on the forehead. JOLENE Good luck. She then waves at Mr. Ganz, and skips off to class. Beth looks at her hand, sees THREE GREEN PILLS.  INT. DUNCAN HIGH SCHOOL - DAY 96   96  Quiet as Beth now follows Shirley and Mr. Ganz through the school. She takes in the posters and banners that line",
      "dialogue_count": 0,
      "word_count": 2624
    },
    {
      "scene_number": 11,
      "slugline": "INT. MRS. DEARDORFF’S OFFICE - DAY 110   110  Beth stands facing Mrs. Deardorff. Several of her teachers ring the room. MRS. DEARDORFF Your behavior has come as a profound shock to all of us. Nothing--   nothing--   in the history of the Methuen Home has been so deplorable. It must not happen again. BETH I can’t sleep without the pills. MRS. DEARDORFF All the more reason why you should not have them. BETH You shouldn’t have given them to us in the first place. MRS. DEARDORFF  I will not have back talk from a child.  (stands, leans forward) If you speak to me like that again, you will regret it. Beth already regrets it, takes a step back. Mrs. Deardorff adjusts her glasses. MRS. DEARDORFF (CONT’D) Your library and playground privileges have been suspended. You will not attend the Saturday movies and you will be in bed promptly at eight o’clock in the evenings. Do you understand. (Beth nods)  Answer me . BETH Yes. MRS. DEARDORFF Furthermore, you will be in chapel thirty minutes early and will be responsible for setting up the chairs and then putting them away once chapel has finished. If you are in any way remiss in this duty, Miss Lonsdale has been instructed to report to me.  (MORE)  55.",
      "characters": [],
      "action_text": "If you are seen whispering to another child in chapel or in any class, you will automatically be given ten demerits. You understand the meaning of ten demerits, Elizabeth? (Beth nods) Answer me. BETH Yes. MRS. DEARDORFF Miss Lonsdale informs me that you have often left chapel for long periods. That will end. You will remain in chapel for the full ninety minutes on Sundays. You will write a summary of each Sunday talk and have it on my desk by Monday morning. And Elizabeth... BETH Yes, ma’am. Mrs. Deardorff now sits back down. MRS. DEARDORFF No more chess.  INT. MULTI-PURPOSE ROOM - “VITAMIN LINE” - MORNING 111   111  As Beth gets to the front, the hasp has been replaced with a much stronger one. Four screws each. Fergussen looks at her and opens his arms to the pharmacy... FERGUSSEN Wanna help yourself? She shakes her head and holds out her hand. He hands the vitamin to her, watches her swallow it and move off.  INT. CHAPEL - MORNING 112   112  Beth sets up the heavy wooden folding chairs under the uncomfortable eye of Miss Lonsdale. MISS LONSDALE (V.O.) It’s like a disease, something we can become infected with...  INT. CHAPEL - LATER 113   113  As Beth tries to stay awake listening to Miss Lonsdale...  CONTINUED: 110   110  MRS. DEARDORFF (CONT'D)  56. MISS LONSDALE ...which is why we all have to be vigilant against the threat of a godless communism spreading like plague here in the United States. Senator McCarthy is anything but the fear monger a few in the press would have us think. All one has to look at are photos of Russia to see what it could be like   right here...  INT. MULTI PURPOSE ROOM - DAY 114   114  Beth walks in, stands there looking at the “scene of the crime” when Jolene comes up behind her. JOLENE You should’ve seen yourself. Up on that stool. Just floating around up there... and Deardorff hollering at you. BETH It felt funny. JOLENE Shit, I bet it felt   good . (then) What you gonna do at night? BETH I’m gonna stay awake as long as I can reading",
      "dialogue_count": 0,
      "word_count": 652
    },
    {
      "scene_number": 12,
      "slugline": "INT. CORRIDOR - DAY 115   115  Beth trudges along. She pauses to watch another KID emerge from the basement carrying erasers. Beth tries to see down the stairs as the door slowly closes behind him.  EXT. METHUEN HOME - DAY 116   116  Snow falls.  INT. MULTI-PURPOSE ROOM - SAME 117   117  A CHRISTMAS TREE in the center. Decorations ring the room. JOLENE (V.O.) There’s always more adoptions around Christmas.  INT. GIRL’S WARD - DAY 118   118  Jolene and Beth look at TWO EMPTY BEDS. BETH Both pretty ones. JOLENE Both   blonde . Jolene walks out of the room. Beth starts to put on her socks when Fergussen comes into the ward, calls from behind her-- FERGUSSEN Harmon! (She turns to him) You’re moving. Follow me. She goes with him across the ward to the far wall where one of the empty beds sits, under the window. It’s a bit larger than the others and has more space around it. FERGUSSEN (CONT’D) You can put your things in the nightstand. She looks at him.   Really?  FERGUSSEN (CONT’D) It’ll be nicer over here. She looks around the ward. This is the best bed in the ward. Fergussen is making a note on his clipboard when she reaches out and touches his arm-- BETH Thank you.  58.",
      "characters": [],
      "action_text": "FERGUSSEN Thank   you . He nods towards Jolene.   For keeping quiet.   He walks out. Beth sits down on the bed and stares out the window at the falling snow.  INT. CORRIDOR - DAY 119   119  The kids all come out of class. Beth looks down the corridor and sees Mr. Shaibel at the end of the long hallway mopping. While the kids go the other way, towards the door that leads to the yard for recess, she starts down the hallway to him... She stops where the floor is wet and stands for a good long while before he finally looks up at her. BETH They won’t let me play anymore. I’m sorry. (he says nothing) I’m being punished. I-- She looks at his face. It registers nothing. BETH (CONT’D) Please... Mr. Shaibel... She touches his arm. He freezes. BETH (CONT’D) Can you help me? He looks at her for a moment as if he’s going to speak. But instead, he resumes mopping. Beth watches him, then-- BETH (CONT’D) I wish I could play more with you. She then turns and walks back down the hall. She watches as he mops his way to the end, then, glances once her way, and then drops the mop in the bucket and opens a door-- Beth stands there in the hallway watching as he rolls the bucket inside, the door shutting behind him. She stares at the door another moment, then turns and runs away.  INT. GIRLS’ WARD - NIGHT 120   120  As Mr. Fergussen sticks his head in the ward and shuts off the lights... MR. FERGUSSEN  The darkest night is the bridge to the brightest tomorrow.  CONTINUED: 118   118  59. Beth reaches under the mattress and takes one of her stashed green pills. She sees Jolene slip into bed, the two share a look, then lie back on their respective beds.  ON BETH FROM ABOVE  As she looks up at the ceiling. And now... slowly... THE UPSIDE DOWN PIECES LINE UP IN OUR PERIPHERAL--  FROM BETH UP TO THE CEILING  As she begins to play a game. The pieces move faster and faster. Before long, she’s playing two games. Now three. Four. Five... and so on. The light in the room changing, going from dark to ",
      "dialogue_count": 0,
      "word_count": 868
    }
  ]
}