{
  "slug": "the-first-101-separation-2018",
  "title": "the first 101 separation",
  "genre": "drama",
  "format": "series",
  "scenes_count": 15,
  "characters_count": 0,
  "characters": [],
  "total_words": 10500,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PRIVATE JET - NIGHT 12   12  Cordine is already on the plane. Laz climbs aboard.  LAZ  Bob.  CORDINE  We could’ve come in the same car.  LAZ  We could’ve.  As Laz settles into a seat not facing Cordine and uncaps a  waiting bottle of water--  CORDINE  I want to talk about Hagerty.  Laz ignores him. As he retrieves a sleeping pill and washes  it down with the water, the JET PILOT boards--  JET PILOT  Gonna be a little bumpy on the way  out. Fire in the mountains is  throwing up some thermals.  The two men nod and the pilot heads into the cockpit.  CORDINE  Near where you live, right?  LAZ  Wind’s blowing the other way.  Laz leans back and closes his eyes. A beat.  CORDINE  I think we should reconsider.  Laz keeps his eyes closed.  LAZ  Lauren’s already en route.  CORDINE  I just think - from NASA’s  perspective - Hagerty’s a wild card  and we should--  8.",
      "characters": [],
      "action_text": "Laz opens his eyes and drills Cordine with them.  LAZ  We had this discussion. Then we had  it again. We can go for number  three, but I just took an Ambien,  and I’m even more stubborn when I’m  sleepy. Shall we continue?  Cordine says nothing. Laz closes his eyes again.  INT. VISTA HQ - BUILD FACILITY - DAY 13   13  Pretesh, Min, and Greg are standing in front of the half-  built HAB 3 wearing smocks, surgical masks, latex gloves, and  plastic hair caps. Min shows them a small, rubber washer  encircling a valve.  MIN  We ran the raw data again and our  shake-bake analysis is off. We  favored the wrong results.  GREG  The entry heat could be greater  than its combustion limit.  PRETESH  It’s at least six centimeters under  the shield.  MIN  We’re worried about free air.  Greg pokes his pinky finger into the tube.  GREG  Trapped here. Pressure might push  it through the lock.  She points to a coil of nylon rope in a compartment about a  foot away from the valve.  MIN  Could get this far.  (turns back to him)  Which is exactly what I said when I  got outvoted by the other  departments.  9.",
      "dialogue_count": 0,
      "word_count": 356
    },
    {
      "scene_number": 2,
      "slugline": "INT. FAIRBANKS, ALASKA - HOTEL - NIGHT 14   14  Lauren is on her phone, looking out the window at the  blizzard. On the other end we hear--  CHIEF ACCOUNTANT (O.S.)  About 46 over because of OT this  week.  LAUREN  How can we make it up?  INTERCUT WITH--  INT. VISTA HQ - CONFERENCE ROOM - DAY 15   15  A glass-walled conference room at the far end of the office  bull-pen. About a dozen DEPARTMENT HEADS gathered.  HEAD ACCOUNTANT  I’m working with Sam on materials.  SAM (HEAD OF PURCHASING)  Avisma will sell us titanium for 10  percent less. It’s a Russian  company, so NASA might not--  LAUREN  You tested the samples?  SAM  Pretesh says they’re good.  LAUREN  Alright, I’ll talk to Bob.  (shifting focus)  Press?  HOLLY  We’ve got the big four, plus CNN,  Bloomberg, and MSNBC. They all want  one-on--  A knock on the glass. Everyone looks over to see Pretesh. He  mouths “Lauren?” Sam points to the speaker phone and mouths  “On now.” Pretesh opens the door.  LAUREN (O.S.)  Holly?  10.",
      "characters": [],
      "action_text": "PRETESH  Hi Lauren - it’s Tesh.  (to the others)  I need the room.  TIME CUT to Lauren sitting on the edge of the bed. She looks  stressed, but not shaken. She glances at her watch.  LAUREN  He’s in the hearing...  PRETESH (O.S.)  I’m not saying we have to stop the  countdown...  CUT BACK to the Conference Room. Pretesh is alone.  PRETESH (CONT’D)  At least not yet. We should have a  better sense in a couple of hours.  LAUREN  Keep the circle tight. I don’t want  this distracting him...  INT. WASHINGTON - RAYBURN BUILDING - HEARING ROOM - DAY 16   16  A closed hearing. Laz and Cordine are seated before the  Appropriations Committee. Seated with them is Senator  MARGARET SAYERS (early 60s, a Republican from Texas). She’s  Ann Richards, if Richards was a conservative. They’re joined  by the NASA ADMINISTRATOR - Cordine’s boss - DEIDRE KENT  (early 50s, politically savvy with the polish of a career  bureaucrat).  The Chairman of Committee is TED WINTHROP (mid 40s, a  Republican from Wyoming). Among others are Rep. HAL SCHNEIDER  (early 70s, Democrat from Massachusetts) and GAIL OGELBY  (late 30s, Republican from Mississippi).  OGELBY  We’re getting into double digits.  SCHNEIDER  Billions that aren’t going to  schools, to infrastructure...  11. SAYERS  Mr. Chairman. Congress has already  committed to this plan.  WINTHROP  We approved 70 billion. Not 80.  That’s 15 percent over-budget.  LAZ  No, it’s right on budget. We told  you 85 when we first proposed. You  said make it 70 or we get nothing.  Sayers discreetly touches Laz’s arm, a signal that says he  should soften his tone. But Laz continues--  LAZ (CONT’D)  We all knew we’d have to come back  for more. Our plan is still less  than half of what my colleagues at  NASA were proposing.  Deidre shoots a look at Cordine while--  WINTHROP  Our job’s to make sure we’re  spending the taxpayers’ money  responsibly. Your job is to justify  that you are.  CORDINE  Mr. Chairman - if we can get back  to the specific line items,",
      "dialogue_count": 0,
      "word_count": 1722
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ALASKA WOODS - DAY 23   23  Hagerty emerges from the tent with the husky. The snow is  deep but falling lightly now. The wind has died down.  TIME CUT to him crouched over a propane stove. He holds both  ends of the snapped belt over the flame, melting the rubber,  then presses them together, fusing them. Holds the fused  portion over the flame once again, pressing the bond together  with his gloved hands. Then pushes the belt into the snow to  solidify the bond.  TIME CUT to Hagerty fitting the belt back into the engine.  The sky is clear now. He hears rotor blades. Looks up through  the tree branches and sees a helicopter dart by overhead.  TIME CUT to Hagerty on the snowmobile, priming the fuel pump  then starting the ignition. The machine sputters to life. He  hops off and inspects the engine. The belt is working. Closes  the cover lid and remounts the snowmobile. It lurches forward  through the deep snow.  EXT. HAGERTY’S CABIN - DAY 24   24  A couple hours later. As Hagerty emerges from the woods into  a clearing, we see a small cabin ahead - a modest abode that  looks like a collision of the 19th and 21st centuries. The  structure itself could be out of a Jack London novel. But the  roof is covered with solar arrays and a large satellite dish  and antennas. Nearby are half a dozen 30-foot-tall, modern-  looking wind turbines.  A few dozen yards from the cabin is the helicopter we saw  earlier. Lauren is standing beside it in a big parka. She  walks toward Hagerty as the snowmobile comes to a stop.  LAUREN  Thought you might’ve bailed.  HAGERTY  Got caught in the blizzard.  He retrieves the frozen trout from the snowmobile --  HAGERTY (CONT’D)  Hungry?  LAUREN  I could eat.  20.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 303
    },
    {
      "scene_number": 4,
      "slugline": "INT. HAGERTY’S CABIN - MAIN ROOM - DAY 25   25  TIGHT on the filleted trout frying in a pan. We pull back to  see Hagerty at the stove, Lauren at small table.  The two-room cabin is tidy. Essentials only. But in one  corner is a computer station with several monitors. Top of  the line equipment.  LAUREN  I emailed so many times, I grew  calluses.  HAGERTY  I read all of them.  LAUREN  Why didn’t you answer?  HAGERTY  Didn’t know if you were serious or  just testing the waters.  LAUREN  Well I hope me flying to your  doorstep shows how serious we are.  Hagerty plates the fish and brings it to Lauren.  HAGERTY  What about Cordine?  LAUREN  Approved.  HAGERTY  He must’ve put up a fight.  LAUREN  Laz always wins the important ones.  That’s why I work for him.  HAGERTY  So how does this work?  LAUREN  In person. You fly back with me.  HAGERTY  I’m not a wine and dine guy.  21.",
      "characters": [],
      "action_text": "LAUREN  The head of the Appropriations  Committee is coming in.  HAGERTY  You need to show me off.  LAUREN  It’s a few handshakes.  HAGERTY  Before I’ve said yes.  LAUREN  I’m an optimist.  HAGERTY  You know what my demand will be.  LAUREN  Laz is prepared to address that.  HAGERTY  Will I get a yes or a or no?  LAUREN  You have to talk to him yourself. I  won’t speak on his behalf.  Hagerty cocks his head with deliberation. Then--  HAGERTY  You eat. I’ll pack.  On Lauren - relief. Hagerty disappears into the bedroom.  INT. HAGERTY’S CABIN - BEDROOM - DAY 26   26  A fork scrapes across the plate in the other room as Hagerty  packs a duffel with clothing. He takes a couple shirts down  from hangers on a pole which stretches above the single bed.  Among the shirts is a NASA flight jacket. He looks at the  insignia for a moment. Resumes packing.  22.",
      "dialogue_count": 0,
      "word_count": 313
    },
    {
      "scene_number": 5,
      "slugline": "EXT. HAGERTY’S CABIN - DAY 27   27  The helicopter rotors swirl to life, kicking up billows of  snow beneath. It lifts off the ground.  INT. HELICOPTER - DAY 28   28  Hagerty and Lauren in the back, the husky crammed in too.  Hagerty looks out the window, as the pristine Alaskan  landscape stretches beneath them.  EXT. SANTA MONICA MOUNTAINS - DAY 29   29  In stark contrast to the snowy peaks - the arid Santa Monica  mountains. Smoke is billowing upwards from a ridge- line. In  the distance, we see a private plane making a wide turn to  position itself for final approach.  EXT. SANTA MONICA AIRPORT - DAY 30   30  The camera is beneath the fuselage of the plane. We see the  plane’s shadow appear over the runway, get closer, then hear  the squelch of the tires, as they contact the ground with  puffs of burnt rubber.  EXT. VISTA HQ - DAY 31   31  An Electric Minivan pulls through a security gate at the  entrance of a massive building that stretches for a quarter  of a mile. The VISTA logo in three-story letters along the  side. The van parks in a space next to the entrance. Laz,  Sayers, Cordine, and Winthrop get out. Laz’s ASSISTANT is  waiting. Holds open the door as they enter.  INT. VISTA HQ - HALLWAY - DAY 32   32  They approach a set of double doors. Above them is a sign  which reads: BUILD FACILITY. Laz holds his phone up to a  scanner. The doors unlock with a click. As Laz opens the  door, we hear the hum of machines, a beeping forklift, metal  against metal, a symphony of construction.  23.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 275
    },
    {
      "scene_number": 6,
      "slugline": "INT. VISTA HQ - BUILD FACILITY - DAY 33   33  EXTREME WIDE SHOT from above, as the foursome make their way  down a central corridor. The room is vast. One area is  dedicated to satellites. Another to the HAB 3 build. A  prototype section for the Lander/Mars-Ascent Vehicle (LMAV).  An air-lock portion with engineers in sterilized jumpsuits  and hoods doing post-assembly cleaning and stress testing. A  laser cutting and welding section.  And at the far end of the room - dominating an entire side -  the assembly of a massive rocket.  INT. PRETESH’S OFFICE - DAY 34   34  Pretesh and Min are showing Alvin a copy of the valve--  PRETESH  When we changed the washer from  metal to rubber, we did three shake  and bakes. Two were within the  margin, one wasn’t.  ALVIN  How does a red flag like that--  MIN  You were pushing us on the launch.  PRETESH  (more diplomatic)  Everyone was under pressure. I know  you were too.  ALVIN  Give me odds.  MIN  8 to 1.2 percent catastrophic.  ALVIN  What’s the fix?  PRETESH  We can’t get inside with the arm,  so our focus is entry angle.  MIN  My team’s crunching numbers.  24.",
      "characters": [],
      "action_text": "ALVIN  (to Pretesh)  Freeze the countdown?  PRETESH  We could use more time.  ALVIN  Alright. I’ll freeze it.  (as he exits)  Get me within the margin.  INT. VISTA HQ - BUILD FACILITY - DAY 35   35  Sayers and Winthrop are dwarfed by the massive rocket they  are standing near, gazing at it. Laz and Cordine are a few  yards away talking to Alvin.  WINTHROP  When do I get to meet Hagerty?  SAYERS  They’re in the air now.  WINTHROP  I want a picture with him. Next to  one of these.  SAYERS  I’m sure we can make that happen.  Laz and Cordine approach them as Alvin walks off.  LAZ  Countdown’s frozen.  WINTHROP  Why?  LAZ  There’s a valve we’re taking a look  at. Our engineers are working on  the problem.  WINTHROP  We talking hours, or...  LAZ  Hopefully. Might be days.  25. WINTHROP  (to Sayers)  I’ve got to be back for the  leadership caucus Thursday morning.  LAZ  We’ll do our best.  SAYERS  (to Winthrop)  These sort of things are common.  WINTHROP  (to Laz)  Seems serious.  LAZ  Everything’s serious 80 million  miles from earth.  WINTHROP  I’d like to pray.  Winthrop takes Sayers’ hand. He means an   actual   prayer.  They’re all a little taken aback by it.  WINTHROP (CONT’D)  Bob?  Cordine takes Winthrop’s other hand, going with the flow.  WINTHROP (CONT’D)  (to Laz)  I know you’re not a believer...but  if you’ll indulge me.  Sayers shoots a look to Laz. Time to play nice. Laz takes  Sayers’ and Cordine’s hands to complete the circle. Winthrop  bows his head and closes his eyes.  WINTHROP (CONT’D)  Dear heavenly father...  Sayers and Cordine follow suit, bowing their heads and  closing their eyes. Laz keeps his open. We start to hear a  deep drone from the baritone sax...  26. WINTHROP (CONT’D)  Please give your guidance and  blessing to the engineers...  INT. VISTA HQ - PRETESH’S OFFICE - DAY 36   36  Pretesh, Min, and a team of six other engineers in a heated  discussion. Greg finishes an equation on a dry erase board,  then Min crosses something out, pointing to",
      "dialogue_count": 0,
      "word_count": 699
    },
    {
      "scene_number": 7,
      "slugline": "INT. VISTA HQ - BUILD FACILITY - DAY 40   40  WIDE SHOT of the four linking hands from above. Tiny in  relation to the booster rocket. The drone gets louder.  WINTHROP  Amen.  INT. MUSIC STUDIO - DAY 41   41  A SAXOPHONE PLAYER is playing the baritone sax that we’ve  heard throughout the episode thus far. Circular breathing.  Cheeks and veins straining, eyes closed, sweat on the brow.  He’s swaying back and forth slowly, as he wills the unbroken  drone into being.  EXT. 249 MILES ABOVE EARTH - DAY TO NIGHT 42   42  As the drone continues, we see the ISS serenely orbiting  earth, passing from day into night, the sun disappearing  behind the earth.  INT. ISS - NIGHT 43   43  The drone is replaced with a SWISHING sound.  KAYLA FORD (early 40s, African-American) is floating in micro  gravity looking out the window. Her face lit up by the sun’s  blue reflection on earth.  KAYLA  Hank.  HANK (mid 50s) is working at the other end of the  compartment. He looks over.  HANK  You can see that fire in the Santa  Monica mountains.  He floats over. Looks out the window. Kayla points.  KAYLA  Right there.  28.",
      "characters": [],
      "action_text": "HANK  Yeah, I see it.  KAYLA  Big one, huh?  We CUT TO their POV and see the west coast of North America  below, major metropolises, a web of bright lights, Los  Angeles dominating. Just to the north of the city is a string  of glowing fire lines, reddish orange in contrast to the  yellow-white electric light. Fingers of smoke stretch for  twenty miles to the east. As we slowly push in on the tangle  of fire lines and smoke, we hear the sound of a raging a  fire.  EXT. SANTA MONICA MOUNTAINS - NIGHT 44   44  Fifty foot flames. Trunks and branches snapping and  crackling. The relentless violence of nature.  EXT. LAZ’S MANSION - NIGHT 45   45  An electric minivan winds up the driveway of a sprawling  Italian villa. We can see the orange glow of the forest fire  in the far distance behind the mountains.  INT. LAZ’S MANSION - NIGHT 46   46  DAVID, Laz’s butler, shows Hagerty and Lauren into a large  living room. Everything is packed up in boxes. The walls and  floors are bare. Most of the furniture is pushed to one side  of the room along with the boxes and rolled up rugs, except  for one sofa and two chairs placed in the center. A bubble-  wrapped Warhol self-portrait is leaned up against one wall,  upside-down.  Laz is sitting on the sofa. He doesn’t stand when Hagerty and  Lauren enter.  LAZ  Forgive the appearance.  HAGERTY  Moving out or moving in?  LAZ  Out.  29. HAGERTY  Not the fire...  LAZ  Divorce.  HAGERTY  Been there.  LAZ  (re the chairs)  Please.  Hagerty and Lauren sit in the chairs opposite the sofa.  LAZ (CONT’D)  Why Alaska?  HAGERTY  Where my mother grew up.  LAZ  Back to your roots.  HAGERTY  Something like that.  LAZ  Not because Bob shit-canned you.  Hagerty looks to Lauren. What can she do? Laz is Laz.  LAZ (CONT’D)  He gave me his version. I want  yours.  HAGERTY  NASA’s plan was too convoluted. Too  expensive. They were never going to  get it off the ground. I was vocal.  That rubbed Bob the wrong way.  LAZ  There’s a political element to  bring",
      "dialogue_count": 0,
      "word_count": 2061
    },
    {
      "scene_number": 8,
      "slugline": "INT. VISTA HQ - BULL-PEN - LAUREN’S CUBICLE - DAY 54   54  Laz, Cordine, and Lauren in the thick of it.  LAZ  You wanted a NASA guy. I’m getting  you a NASA guy.  CORDINE  Former   NASA.  LAZ  We’re all pros, Bob. You can work  with someone you fired.  CORDINE  He doesn’t respect authority.  LAZ  Because he was right. You were  dragging your asses.  During which Lauren gets a text message.  CORDINE  This is still a NASA venture.  LAZ  It’s a   joint   venture.  LAUREN  The Congressman just announced  Hagerty.  CORDINE  What...?  LAUREN  On camera.  The two men are stunned for a moment.  LAZ  Well that’s that.  CORDINE  Did you put him up to it?  40.",
      "characters": [],
      "action_text": "LAZ  I’m a prick, but I’m not a two-  faced prick.  INT. LAZ’S GUEST HOUSE - DAY 55   55  Hagerty is in the living room watching coverage of Winthrop  on TV. He looks as though he’s barely slept.  WINTHROP (ON TV)  ...expect to meet with him today,  and we’ll go from there.  Hagerty numb. The coverage CUTS TO a NEWS ANCHOR--  NEWS ANCHOR  Colonel Tom Hagerty commanded two  missions and oversaw the astronaut  training program before leaving  NASA three years ago...  We see footage of Hagerty on a moon walk.  NEWS ANCHOR (CONT’D)  He’s conducted more space flights  than any American, second only to  Sasha Illyich of Russia...  There’s a knock at the door. During the coverage...  HAGERTY  It’s open.  It’s David, the butler.  DAVID  Car’s here for you.  HAGERTY  Let me take Apollo for a quick walk  first.  DAVID  Whenever you’re ready.  As David leaves, Hagerty crouches down and takes Apollo’s  face in his hands.  41. HAGERTY  Leash or no leash?  Apollo swivels his head free and barks.  HAGERTY (CONT’D)  Alright - no leash.  Hagerty’s cell phone vibrates on the coffee table. He looks  at it, decides to ignore. Turns off the TV instead. Heads to  the door, as the phone continues to vibrate--  HAGERTY (CONT’D)  Come on, boy.  INT. VISTA HQ - HALLWAY/PRETESH’S OFFICE - DAY 56   56  We FOLLOW Laz, as he briskly makes his way down the hallway  to Pretesh’s office. Opens the door. The camera whirls around  to Pretesh and his team, all turning to look at the boss.  LAZ  Tell me there’s progress.  PRETESH  We may have something.  EXT. BEL AIR STREET - DAY 57   57  WIDE shot of Hagerty walking slowly along the road - all  gated houses on lush estates. Sprinklers going full force in  one of them. Apollo is trotting along ahead, sniffing here  and there. In the distance we can see the smoke rising from  the Santa Monica mountain fire.  A HUMMER-ESQUE vehicle barrels down the road, blaring music  and whizzing past Hagerty and his dog. Hagerty watches the  vehicle disappear over the",
      "dialogue_count": 0,
      "word_count": 809
    },
    {
      "scene_number": 9,
      "slugline": "INT. VETERINARIAN’S OFFICE - DAY 59   59  Apollo squirms as Hagerty and a VET’S ASSISTANT hold him down  on an examination table. The VETERINARIAN gives Apollo a shot  in the hindquarter. Apollo lets out a high- pitched whine.  Hagerty runs a hand along Apollo’s snout.  HAGERTY  It’s okay, buddy. It’s alright.  In a few moments, Apollo slackens from the sedation.  VETERINARIAN  There’s a couple deep bites -  here...and here. We’ll have to  stitch those up. I’ll want to do a  rabies and tetanus treatment too.  DRIVER (O.S.)  Colonel.  The DRIVER has entered. Holds out a phone.  DRIVER (CONT’D)  Mr. Ingram’s office. Say they’ve  been trying to reach you.  INT. VISTA HQ - MISSION CONTROL - DAY 60   60  Sayers is introducing Winthrop to Alvin and Martha. Lauren is  on her phone about twenty yeard away, keeping an eye on them.  LAUREN  He’s getting antsy. I need you to  spend some face time with him.  INTERCUT WITH --  INT. VET’S OFFICE - WAITING ROOM - DAY 61   61  Hagerty on the Driver’s cell phone.  HAGERTY  When we’re done here.  LAUREN  How long?  44.",
      "characters": [],
      "action_text": "HAGERTY  Could be a while.  LAUREN  I know he jumped the gun. I’m sorry  for that. We’re not trying to  corner you.  HAGERTY  It’s not about him. I won’t leave  my dog. He’ll sense if I’m gone.  LAUREN  Please Tom - do me this favor.  INT. PRETESH’S OFFICE - DAY 62   62  The office is crammed with people now, including Laz,  Pretesh, Min, Wei, Vivek, Greg, Alvin, the Mission Geologist,  and several Engineers. With a paucity of chairs, most people  are standing. Min is holding up a model of HAB 1, slowly  rotating it.  MIN  All we need is about sixty seconds  of relief on this side, so if we--  Cordine enters. People move aside to make room for him in the  cramped space.  CORDINE  Please. Continue.  INT. VISTA HQ - BUILD FACILITY - DAY 63   63  Lauren escorts Hagerty toward the large booster rocket, where  Winthrop and Sayers are waiting with a photographer. Winthrop  lights up at seeing Hagerty.  WINTHROP  Colonel, it’s an honor.  As they shake hands--  WINTHROP (CONT’D)  Not everyday I shake hands with a  man who’s been to the moon. Just  wish my son could be here with me.  45. SAYERS  Studying astrophysics at M.I.T.  HAGERTY  Great program.  WINTHROP  Too far from home. And chock full  of liberals. But if you want to  study space, you make sacrifices.  Winthrop laughs. Hagerty forces a smile.  WINTHROP (CONT’D)  I’d like to take a picture, if you  don’t mind - to send to him.  HAGERTY  Of course.  As Hagerty and Winthrop walk toward the rocket--  WINTHROP  Maggie tells me I opened my trap  too soon about you coming on.  HAGERTY  No worries.  WINTHROP  Well, sure as heck hope you say  yes. I don’t want to allocate all  this money to build a ship that  doesn’t have the best skipper.  PHOTOGRAPHER  Right there is great.  Winthrop throws his arm around Hagerty with a big, toothy  smile. Hagerty manages half a smile. Camera flashes.  PHOTOGRAPHER (CONT’D)  Thank you.  WINTHROP  (to Hagerty)  So tell me - what was it like? The  first time you set foot on the  moon? What",
      "dialogue_count": 0,
      "word_count": 1105
    },
    {
      "scene_number": 10,
      "slugline": "EXT. VISTA HQ - FRONT ENTRANCE - CONTINUOUS 68   68  ...the BRIGHT SUNLIGHT. Keeps walking through the front  parking lot, away from the building, away from everyone. The  notes are furiously fast now.  There are satellite trucks parked out front now to cover the  landing. Laz heads in the opposite direction.  He stops about 30 yards away from the entrance. And as he  stops, the music abruptly stops too.  We finally COME AROUND on him. He’s got his eyes closed. Lets  the sun shine down on his face. Breathing.  He pulls out his phone. Speed dials. On speaker. A double-  ring, like they have in the U.K.  An ELDERLY WOMAN’S voice answers. It’s a middle class  Yorkshire accent.  ELDERLY WOMAN (V.O.)  Hallo?  LAZ  Hi mum.  LAZ’S MOTHER (V.O.)  This is a nice surprise.  Her voice is a balm.  LAZ  Sorry to call so late.  LAZ’S MOTHER (V.O.)  Isn’t today your big day?  LAZ  Supposed to be. How are you?  LAZ’S MOTHER (V.O.)  Oh fine. Had our final rehearsal  tonight for the Carlisle concert.  Everyone’s nervous, of course.  LAZ  I’m going to have to come see the  choir sometime.  51.",
      "characters": [],
      "action_text": "LAZ’S MOTHER (V.O.)  You’d rather be caught dead than in  a church.  LAZ  True.  LAZ’S MOTHER (V.O.)  It’s a nice program. Vitry and  Machaut. Philip gave me one of the  featured sopranos.  LAZ  Let’s have a taste. Over the phone.  LAZ’S MOTHER (V.O.)  (laughs)  I’m embarrassed.  LAZ  It’s just me.  LAZ’S MOTHER (V.O.)  Well...okay, but just a little. I  haven’t done my vocal exercises.  She clears her throat, then begins to sing a portion from  Guilliame de Machaut’s “La Messe de Nostre Dame.” Her voice  is tinny through the phone, but soothing and confident. Its  measured melody an antidote to the unsettling saxophone  assault we heard moments before.  Laz sits down on the ground between two cars. Leans his back  against a wheel well. Holds the phone between his knees and  listens, as though it’s a blood transfusion.  As her singing continues, we SMASH CUT TO:  INT. VISTA HQ - RECEPTION - DAY 69   69  Laz entering the front doors - calm and re-energized. We stay  with him again, but this time from the front, moving  backwards as he moves forward. As he passes through the  double-doors to the main bull-pen, additional voices come in,  filling out the full harmony of Machaut’s piece.  52.",
      "dialogue_count": 0,
      "word_count": 394
    },
    {
      "scene_number": 11,
      "slugline": "INT. VISTA HQ - BULL-PEN/PRESS AREA - CONTINUOUS 70   70  We retrace the same route as before, but TIME CUTTING to leap  through it faster, the music continuing.  INT. VISTA HQ - MISSION CONTROL - DAY 71   71  Laz makes his way back inside. Assumes his usual place in the  back. Lauren approaches.  LAUREN  You okay?  LAZ  I’m good.  As the music continues we CUT TO a tracking shot of Mission  Control staff waiting anxiously.  CUT TO half a dozen news cameras pointed at the Mission  Control room, one of the cameramen chewing his lip.  Over the P.A. --  MARTHA (O.S.)  Transmission delivery in 5..4..3...  We CUT TO Martha and Alvin at their station.  MARTHA (CONT’D)  2...1...landing sequence initiated.  Countdown to confirmation 9 minutes  14 seconds.  Martha leans back in her chair. Alvin remains forward, elbows  on the table.  ALVIN  Wish the speed of light was about  twenty times faster.  The music continues as we move through a MONTAGE--  -- Winthrop and Sayers in the back. Sayers staring at the big  screen. Winthrop’s head bowed in prayer.  -- Hagerty looking up at the screen, as still as a statue.  53.",
      "characters": [],
      "action_text": "-- WIDE SHOT outside the control room, where scores of staff  have gathered to watch on monitors.  -- the empty rocket tube, work lights still inside, but no  technicians there.  -- WIDE SHOT of the long central corridor, devoid of anyone.  -- Exterior of the VISTA Headquarters, the satellite trucks  dwarfed by the massive logo.  -- Two car mechanics working under the hood of a side- swiped  Prius in a rundown auto shop on Lincoln Blvd. Another  mechanic gets their attention to show them live coverage on  his phone.  -- A homeless man pushing a cart down the sidewalk, a  cardboard sign on his back: I HAVE DREAMS TOO.  -- People in business attire waiting in line at a food truck  in downtown L.A. All watching their phones.  -- Third graders in a classroom. All of them watching  coverage on a TV that’s been brought into the room.  -- Directly above the city of Los Angeles, a clover-leaf  highway intersection dominating the center of the frame,  every lane jammed with traffic. Slowly PULLING BACK...  -- The Santa Monica mountains - raw nature in contrast to the  urban sprawl of the city. A wisp of smoke.  -- A burned-out log in a sea of scorched and naked tree  trunks, the remains of the forest fire. A small bird  fluttering onto one of the logs - the only bit of color in  black and ashen landscape.  Then the bird flying off, whipping the camera toward the sky  in a failed attempt to follow it.  -- Taking us to the interior of the ISS - Kayla and Hank  floating as they stare at a computer screen, the same imagery  on the big screen at Mission Control.  We shift focus from them to a small socket wrench floating  behind them, slowly spinning as it inches across the cabin.  Which takes us to--  54.",
      "dialogue_count": 0,
      "word_count": 500
    },
    {
      "scene_number": 12,
      "slugline": "EXT. MARS ORBIT - DAY 72   72  The HAB 1 ENTRY MODULE floats serenely above the curvature of  the red planet below. With several short bursts, the  thrusters angle the bottom of the module toward the surface.  A burst from a side thruster initiates a gentle rotation. A  final sequence of bursts stops the angling and rotation, then  one long burst slows the module down enough to succumb to  Mars’ gravity. It begins a gradual descent. We see the  faintest glimmer of entry burn start to glow on the lip of  the module.  INT. VISTA HQ - MISSION CONTROL - DAY 73   73  73 Martha and Alvin at their station, both waiting for the  transmission to come through. We can tell from a shift in  body posture that it’s arrived. Alvin looks to Martha.  PROPULSION  Thruster sequence check. Entry  angle confirmed at 23.78 degrees.  Rotation at 1.14 rpm.  INTERCUT between Martha and the following--  MARTHA  Trajectory.  TRAJECTORY  On course check, speed: two one  zero five with uniform decrease  eight nine seven kilometers per  second.  MARTHA  Heat readings.  HEAD OF SYSTEMS  Variable from 650 to 935 Celsius.  CUT TO Pretesh, Vivek, and Min toward the back.  VIVEK  (to Pretesh)  That’s in our zone.  Pretesh holds up both hands, fingers crossed on each.  55.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 213
    },
    {
      "scene_number": 13,
      "slugline": "EXT. MARS ATMOSPHERE - DAY 74   74  The HAB 1 module screaming toward the Mars surface, a massive  burn glow enveloping the entire craft, strongest on the  lowest part of the lip angled most toward the ground. But as  the atmospheric resistance slows the module, the burn glow  starts to reduce, finally disappearing altogether. Then  another thruster burst, which slows down the rotation to  almost nothing. As it slows, the MUSIC FADES until it is  gone.  INT. VISTA HQ - MISSION CONTROL - DAY 75   75  The tension is felt by the stillness of the room, people  barely breathing.  TRAJECTORY  Rotation 0.09 rpm...  Silence as they wait for the next phase. Then--  MARTHA  Chute deployment?  She waits for a response.  MARTHA (CONT’D)  Chute deployment?  A beat, then--  SYSTEMS  Parachute deployed.  A few people clap, but most don’t. One of them is next to the  Head of Systems who whispers--  SYSTEMS (CONT’D)  Not yet.  MARTHA  Eight seconds until secondary  chute.  On Sayers and Winthrop. Then to Pretesh and his team.  VIVEK  (to Pretesh)  56.  (MORE)",
      "characters": [],
      "action_text": "If the washer had burned, it  would’ve affected the primary  chute. I think we’re gonna--  MIN  Shut up. We’re not down til we’re  down.  SYSTEMS  Secondary chute deployed.  We can sense the tension starting to let up in the room.  They’re not home free yet, but they survived the burn phase  and the chute deployment. The two stages everyone was most  worried about.  TRAJECTORY  Speed remains constant.  Not good. Tension ripples back through the room.  MARTHA  Repeat trajectory. You said speed  is constant?  TRAJECTORY  Now it’s increasing. Point eight  terminal velocity. Point nine...  SYSTEMS  Erratic rotation.  PROPULSION  Retro-thrusters have kicked in...  We CUT BACK TO Pretesh, Vivek, and Min.  MIN  Too high.  EXT. MARS - DAY 76   76  The module is six kilometers above the surface, plummeting  fast.  Its primary and secondary chutes are tangled, causing it to  spin wildly, the tangled chutes unable to slow its descent  and the thrusters doing little to slow descent at this speed,  especially at this height and with the erratic spin.  57.  VIVEK   (CONT'D)",
      "dialogue_count": 0,
      "word_count": 346
    },
    {
      "scene_number": 14,
      "slugline": "INT. VISTA HQ - MISSION CONTROL - DAY 77   77  Laz, Cordine, and Pretesh are standing over Martha and  Alvin’s shoulders now, staring at their screens.  LAZ  The landing thrusters...  ALVIN  It’s not enough at this speed.  PRETESH  The rotation’s too variable to  counteract.  HEAD OF SYSTEMS  Impact in nine...eight...seven...  Lauren has walked over to Holly now.  LAUREN  Can we get Laz out of his  interviews?  HOLLY  You’re killing me.  LAUREN  How is this good press?  SYSTEMS  ...three...two...one.  A beat, then Martha, trying not to sound defeated--  MARTHA  Telemetry.  HEAD OF TELEMETRY  We’ve lost contact.  A wave of disappointment through the room. These people are  all professionals. They’ve seen dozens of launch and landing  failures, but never one as important as this.  On Hagerty, stoic.  CUT TO Sayers and Winthrop. She steals a glance at him. He’s  shaking his head.  58.",
      "characters": [],
      "action_text": "We CUT TO Laz and Pretesh. Pretesh looks devastated but is  trying to keep it together.  PRETESH  It wasn’t the valve. I’m guessing  it was something with the  deployment mechanism.  LAZ  Full diagnostics.  PRETESH  I’m sorry, Laz.  LAZ  We’ll land the next one.  Lauren and Cordine approach.  CORDINE  I’ll do the press, if you’d rather  not.  LAZ  Let’s do it together.  EXT. MARS - DAY 78   78  From the saxophone, we hear one long, somber note. The camera  glides over the Martian red dust, pristine and untouched,  angled down so the ground fills the frame. As the note begins  to taper off, the camera slows, and we see the gnarled  wreckage of the HAB, smoldering from the crash. The tattered  and scorched parachutes stretching a hundred yards, as though  the module were bleeding cloth.  INT. MUSIC STUDIO 79   79  TIGHT on the Saxophone player, as the tapering note retreats  into silence. Then he takes a breath, removes the reed and  opens the valves, dumping the built up spit onto the ground.  Over which we hear--  LAZ (O.S.)  We can’t predict everything. That’s  the nature of space exploration...  59.",
      "dialogue_count": 0,
      "word_count": 330
    },
    {
      "scene_number": 15,
      "slugline": "INT. VISTA HQ - OUTSIDE MISSION CONTROL - DAY 80   80  Laz and Cordine are speaking to a scrum of press.  LAZ  We try, we fail, we try again.  CORRESPONDENT #1  But once you send people, if  there’s a failure...  CORDINE  Will people die? Obviously we want  to prevent that. But it’s possible.  LAZ  It’s not just possible, it’s  probable. Colonizing a new planet  is the biggest challenge humanity  has ever faced.  CORRESPONDENT #2  Even if the cost is human life.  LAZ  We’re doing this to perpetuate  human life.  EXT. VISTA HQ - FRONT ENTRANCE - NIGHT 81   81  Laz and Cordine are walking Sayers and Winthrop out the door  to their waiting minivan. They’re mid-conversation.  WINTHROP  Not saying it won’t happen, but  it’s a much tougher sell now.  LAZ  I hope we can count on you.  WINTHROP  The only thing I’ve learned from  politics is never to make promises.  (as he climbs in)  But get Hagerty out East. My people  will be much more amenable to an  American hero than a limey  billionaire.  60.",
      "characters": [],
      "action_text": "Being a limey, Laz appreciates the dry humor of this.  INT. VISTA HQ - BUILD FACILITY - NIGHT 82   82  The HAB 3 unit. Pretesh is there with his team.  PRETESH  Let’s dismantle the entire system.  Lay it out, piece by piece...  INT. LAUREN’S HOME - NIGHT 83   83  Lauren enters the house, looking exhausted. Makes her way  into the living room, where she sees a CONGRATULATIONS sign  draped above the archway to the dining room, balloons  everywhere. Dell waiting for her in a chair.  DELL  I left it up on purpose.  Off her look--  DELL (CONT’D)  Take this.  He hands her a balloon.  INT. LAZ’S GUEST HOUSE - NIGHT 84   84  Hagerty puts a bowl of water on the ground. Apollo, bandaged  and still a bit out of it, laps up the water. Hagerty runs a  hand through his mane. A knock.  HAGERTY  It’s open.  Laz enters.  LAZ  (seeing Apollo)  How’s he doing?  HAGERTY  A few cuts. He’ll be fine.  Laz steps closer to pet him, but Apollo barks.  61. HAGERTY (CONT’D)  Doesn’t make friends easily.  LAZ  Was it just the two of you up  north?  HAGERTY  Just the two of us.  LAZ  Your mother’s not from Alaska. She  lived there for less than a year  when your grandad was working the  rigs in Prudhoe.  HAGERTY  Did you check before or after I  lied to you?  LAZ  Before.  HAGERTY  Why didn’t you call me out on it?  LAZ  You don’t embarrass a man you’re  trying to convince.  HAGERTY  I haven’t said yes yet.  LAZ  Why did you go?  Hagerty just shakes his head.  LAZ (CONT’D)  Forget I asked.  Laz crouches down and lets Apollo sniff his hand. This time,  Apollo doesn’t bark and lets Laz pet him.  HAGERTY  The sky.  Laz looks up.  62. HAGERTY (CONT’D)  When it’s clear - in the winter -  you can see it all. Twenty-three  hours of night. As cold as space.  If I was never gonna get the chance  again, it was the next best thing.  LAZ  Now you’ve got your chance.  HAGERTY  Still no final say?  LAZ  I can’t promise it any more than  you can promise the crew they’ll  survive. But I’ll do my best.  The logi",
      "dialogue_count": 0,
      "word_count": 1074
    }
  ]
}