{
  "slug": "the-post-2017",
  "title": "the post",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 4,
  "characters": [
    "FRITZ",
    "YOUNG WOMAN",
    "BRADLEE",
    "MEG"
  ],
  "total_words": 20795,
  "total_dialogue": 4,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DINING ROOM, DUPONT CLUB - MORNING It’s breakfast, there’s a soft hum of conversation. The glass windows on one side show off the D.C. skyline. BEN BRADLEE (late 40s, articulate but short-tempered) sits with his back against the view. He has a red pencil in hand and reads the draft of a story: “ Senate Told Nixon Aid to Laos Illegal ”. Chryon:   June 9, 1971  Bradlee rubs his eyes and looks around the room. There are MEN scattered amongst the tables reading newspapers. Bradlee squints to get a better look - every paper is “The New York Times”. He frowns and looks back at the story - bored. KAY (O.S.) Am I late? KATHARINE “KAY” GRAHAM (mid 50s) speaks with trained intent - never letting something slip that she hasn’t considered many times over. She’s well put together but not ostentatious. BRADLEE (surprised) Mrs. Graham. KAY I thought we said 8:30. BRADLEE Yes, I was just catching up on a few things. She nods once and sits. A WAITER arrives. WAITER (to Kay) May I get you anything? KAY A cup of tea, please. WAITER Mr. Bradlee? BRADLEE Thanks, but another cup and I’ll be flying to the office. Neither Kay nor the waiter get it. The waiter leaves. KAY Is there something you wanted to  talk about?",
      "characters": [],
      "action_text": "He reaches into his bag and pulls out a magazine, folded to a certain page, and shows it to her. BRADLEE Have you seen this? KAY Of course. She doesn’t take it as he intended, so now it hangs limply between them. He reads - BRADLEE “Men are more able than women at executive work and in certain situations. I think a man would be better at this job I’m in than a woman.” Did you say that? KAY It’s an interview with me. BRADLEE But do you believe it? KAY Do you not? BRADLEE (annoyed) It doesn’t particularly matter what I believe - I’m not the Publisher of the Washington Post. She gives a noncommittal acknowledgment. A moment passes. BRADLEE (CONT’D) Well, I’m in a tough position with it. KAY Why is that? BRADLEE How am I supposed to put a paper together with someone who doesn’t think they should be in charge? KAY I didn’t say that. BRADLEE It was implied.  2. KAY Forgive me, but I disagree. BRADLEE Forgive   me , but that doesn’t particularly matter. I’m pretty sure the consensus is in my corner. KAY There are corners? BRADLEE (sighs) That’s not what I meant. KAY Playground fights aren’t going to get us anywhere, Mr. Bradlee. BRADLEE That’s why we’re in a restaurant, not a sandbox. She presses her lips together - a nervous tic she’s never been able to shake. Maybe to stop her from saying something she shouldn’t. BRADLEE (CONT’D) We’ve been getting mail - letters - from women. Asking you to correct your quote.  She’s taken aback but covers.  KAY That’s ridiculous. BRADLEE I’m not so sure that it is. KAY Well, that won’t be happening.  He sighs, a moment passes.  BRADLEE I’m not trying to be combative. I... we’re still new at this. She gives him a look.  3. BRADLEE (CONT’D) The two of us. Working together. As editor and, look, I don’t see a point in letting things fester. KAY I agree. BRADLEE Good. I - KAY I’d like you to tell me what you’re doing with the Style section. The term “style” comes out as if it has vinegar attached to it. He crosses his arms and sits back in t",
      "dialogue_count": 0,
      "word_count": 1196
    },
    {
      "scene_number": 2,
      "slugline": "INT. CAR - SAME TIME Kay reads the article. It’s clear she’s read it many times and is perhaps more insecure about what she said than she let on. The car pulls into another underground garage and stops. INT. LOBBY, WASHINGTON POST - SAME TIME Bradlee walks in, his shirt damp from the humidity and walk. He throws his copy of the magazine into a nearby trash can and climbs onto an elevator. INT. EXECUTIVE FLOOR, WASHINGTON POST - SAME TIME The elevator doors open, Kay’s posture straightens, jaw tightens, she steps off. The energy is tense, stiff, quiet. Along the wall are two portraits: EUGENE MEYER (1875-1959), Kay’s father, and PHIL GRAHAM (1915-1963), Kay’s late husband. They watch over her as she passes to her office at the end of the hall. END OPENING CREDITS INT. BULLPEN, WASHINGTON POST - MORNING Bradlee steps off a different elevator and looks across the bullpen: a constant soundtrack of typewriters, the din of the news on a TV set, random conversations that come in spurts and starts. He smiles to himself - this is home. The serenity lasts for just one moment when - MEG I want to ask them about the vets again. MEG GREENFIELD (40s, no-nonsense) instantly annoys him. He doesn’t stop walking. BRADLEE No. MEG They’re throwing their medals into the Potomac and we’re OK with the White House’s “no comment”? BRADLEE I need you to write something about the protest.  8.",
      "characters": [],
      "action_text": "MEG Which one? BRADLEE The United-Women’s-whatever-they’re- called. Go and... I don’t know. Just get them to not hate us right now. MEG I take it Mrs. Graham won’t be retracting - BRADLEE Go away. She grins and heads off as Bradlee approaches his office, handing his briefcase to his secretary, CYNTHIA. BEN BAGDIKIAN (50s, Turkish, resolute) is waiting for him. BRADLEE (CONT’D) (to Cynthia, annoyed) I thought you told them not to hover? CYNTHIA They don’t listen. BRADLEE This is going to annoy me, isn’t it. BAGDIKIAN Have you seen Sheehan around? BRADLEE Neil? Have we started letting the Times just take up office space here? BAGDIKIAN He hasn’t been at the briefings in a while. BRADLEE What’s a while? BAGDIKIAN Weeks. BRADLEE (surprised) Weeks?  9. BAGDIKIAN Yea. BRADLEE No, I haven’t seen him. BAGDIKIAN OK. Bagdikian walks off abruptly, as he customarily does. Something about this sticks in Bradlee’s craw. BRADLEE (annoyed) Get someone to find out what Sheehan’s been up to. Cynthia nods. He heads off down the hallway. INT. GENE’S OFFICE, WASHINGTON POST - MOMENTS LATER GENE PATTERSON (late 40s, thinning hairline) reads over some pages. There’s a knock on the door, Bradlee stands there. Gene sighs and sits back in his chair. Bradlee enters. BRADLEE Did you do it so she’d say tit? GENE Just an added bonus. Beat. BRADLEE I can’t say that I’m all that disappointed. GENE Nothing but honest. BRADLEE It’s not like either of us get anything out of the other being miserable. GENE You’re right on that. BRADLEE Are you miserable? GENE It’s been... difficult.  10. BRADLEE I’m the “it” in that sentence? GENE Yes. Bradlee thinks about that and nods. BRADLEE Mrs. Graham said you’ll be staying on for a couple of months. GENE She asked me to. BRADLEE If you don’t want to, I’ll - GENE No, I’d like to see things get sorted properly. Bradlee nods and extends his hand across the desk. BRADLEE A shame it didn’t work out - I hope you know I respect you. Gene rises and accepts the handshak",
      "dialogue_count": 0,
      "word_count": 4794
    },
    {
      "scene_number": 3,
      "slugline": "INT. KITCHEN, GRAHAM HOUSE - NIGHT Lally sits at the table, reading the article from earlier. Kay steps in, Lally looks up. KAY Can’t sleep? Lally shakes her head. Kay sees what she is reading and frowns, moving to the stove. KAY (CONT’D) Tea? LALLY OK. A moment passes. Kay fills the teapot. KAY What time is Yann dropping Katharine off tomorrow? LALLY He said 10. KAY And he won’t stay? LALLY (warning) Mom. Kay offers a thin smile and nods, backing off. She sits while the water boils. KAY (re: the magazine) I thought I’d thrown that out. No she didn’t. LALLY It’s a... it’s a good article. The page is open to a photograph of Kay laughing with Truman Capote at the Black & White Ball. A different version of her than the one in the boardroom - glamorous, in her element. LALLY (CONT’D) (gentle) I just wish that maybe you’d... take, I don’t know, a little more pride in -  37.",
      "characters": [],
      "action_text": "KAY Pride? I can - LALLY That’s not the right word. You just - you come across like - I don’t know. You’re in one of the most powerful positions in the country, Mom. And it just seems like... you don’t want it. There’s a lot of people who look up to you. KAY I think that’s a bit dramatic. The teapot sings, ending the conversation. Kay pours them tea. Lally moves on. LALLY So what will happen now? Kay gives her a look. LALLY (CONT’D) With The Times. With what they’re printing. KAY I’m not sure. It’s in Mr. Bradlee’s hands at the moment. LALLY But aren’t you curious? KAY Of course but it’s not my place to interfere. LALLY Didn’t you   get   them the story? KAY You don’t understand how it works. Lally goes to speak but realizes it’s a moot point. KAY (CONT’D) Your father always seemed to have the right answer. (beat) At the meeting today. Paul and Marvin, well, they feel that the Board and the trust should share the same voting power.  38. Lally is taken aback. LALLY That’s crazy. It’s never - KAY It will be fine. I spoke with Fritz and he’s going to take care of it. I was just... I was surprised. That’s all. LALLY (treading carefully) Did they ever... suggest anything like this when Dad was in charge? KAY No. No. Absolutely not. Phil would’ve never stood for it. LALLY So... why are you? Kay stares at her a beat. LALLY (CONT’D) I mean... I know Dad had a different relationship with them - KAY Yes, of course - LALLY Why wouldn’t you just tell them it’s not going to happen? KAY That just wouldn’t be appropriate. Lally sighs, exasperated. INT. BRADLEE’S OFFICE, WASHINGTON POST - MORNING Bradlee sits on the phone, same clothes as the night before. Howard across from him. Gene walks in. GENE Anything? HOWARD Nope. He’s on the phone with a kid from our New York office. Sent them to the hotel.  39. BRADLEE (into phone) What do you mean you ran away? GENE Hotel? HOWARD The Times has the 11th floor of the Hilton. BRADLEE (into phone) Yes. I understand. GENE I’m sorry? Bradlee h",
      "dialogue_count": 0,
      "word_count": 2867
    },
    {
      "scene_number": 4,
      "slugline": "INT. TAXI, BOSTON - DUSK Bagdikian rubs his eyes, the Boston skyline looming ahead, roads nearly empty. They pause at a stop sign by the river. The TAXI DRIVER points at a deserted intersection with a payphone. TAXI DRIVER You sure you want to go up there? Bagdikian looks up at the street signs, they coincide with what he has written down. EXT. INTERSECTION, BOSTON - MOMENTS LATER Bagdikian grabs his bag and shuts the taxi door. He waits for the car to leave, then heads to the payphone. He dials. BAGDIKIAN (into receiver) It’s Bagdikian. Yes, I’m at the corner. Whatever is said doesn’t please Bagdikian. BAGDIKIAN (CONT’D) What the hell do you mean walk to - I just let the cab go! Fine, fine. I’ll be there soon. He slams the phone down on the receiver. Then one more time to do it right. He starts to walk down the path of the river. EXT. CONVENIENCE STORE, BOSTON - A LITTLE LATER Bagdikian stands at another payphone, getting more instructions. He hangs up and turns in yet another direction. EXT. MOTEL, OUTSIDE OF BOSTON - NIGHT It’s dark now. A taxi pulls up outside a run down, out-of-the- way motel. Bagdikian climbs out and looks around. He goes to one of the rooms and knocks. The curtains move to the side but he can’t make anyone out. The door opens and DANIEL ELLSBERG (40s, big eyebrows) stands there, an apologetic smile on his face. ELLSBERG Ben.  54.",
      "characters": [],
      "action_text": "BAGDIKIAN (a sigh of relief) Dan. ELLSBERG Come in. Bagdikian does. Ellsberg looks around a moment before shutting the door behind him. INT. BRADLEE’S OFFICE, WASHINGTON POST - NIGHT Bradlee sits as his desk reading. His hand toys with his unkempt hair while he notes a few things. There is a knock on the door. He looks up, surprised to see Kay standing there. His mood is icy. BRADLEE Mrs. Graham? KAY My secretary gave me your note. She holds a slip in her hand. BRADLEE You didn’t need to come down. I just wanted to let you know where we stood. She nods her head once, considering. KAY May I come in? He gestures to the chair in front of him. She sits and takes in the sight of the office - she hasn’t been in here since he took the job. He knows this. KAY (CONT’D) Mr. Bagdikian is on his way to Boston? BRADLEE Should be there by now. KAY Who is he meeting with? Beat. BRADLEE I’m not going to tell you that.  55. She nods - understanding the protection of a source. KAY You think he’ll be able to retrieve the documents? BRADLEE (loaded) I hope so.  KAY That’s quite a coup. BRADLEE We’ve got good reporters.  She purses her lips. KAY You’re going to stay until you hear from him? BRADLEE It’ll be awhile. KAY Your wife doesn’t mind you staying so late? BRADLEE She minds. But here I am. KAY And your children? He looks at his watch - BRADLEE Long asleep by now. Or should be. KAY Should be and will be are always difficult with children. BRADLEE Truer a statement has never been made. She looks around, noting the minimal personal touches. Only a few photos: one of JFK and Bradlee laughing, Bradlee and Phil Graham, and one of Bradlee and a YOUNG MAN (20) in an Army uniform.  56. KAY I haven’t been in here since Russ left. Bradlee nods - he knows. KAY (CONT’D) Your son? He follows her gaze to the photo behind him. He nods. BRADLEE From my first marriage. KAY Volunteered? BRADLEE Couldn’t stop him. KAY Mine too. (careful) He’s, well, he’s home? BRADLEE Sort of. Peace Corps. KAY Mine t",
      "dialogue_count": 0,
      "word_count": 2854
    },
    {
      "scene_number": 5,
      "slugline": "INT. KITCHEN, BRADLEE HOUSE - CONTINUOUS Bradlee sits at the table, phone to ear, head in hand. The cord is stretched inconveniently across the room so if anyone wants to walk in, they have to duck. Tony makes sandwiches. BRADLEE I’m   still   on hold. TONY On hold with who? BRADLEE Huh? TONY Who are you on hold with? BRADLEE The lawyers. Supposedly. Though at this point they could’ve transferred me to the Guam Embassy and I wouldn’t know. TONY You do that all the time. BRADLEE Call Guam? TONY Say something without knowing that I’m here.  Howard pokes his head in, getting Bradlee’s attention. BRADLEE Yea? HOWARD (hushed) Some of this stuff. It’s... it’s heavy. Even just going through it. I’m wondering if we could get Mrs. Graham to come and take a look. Tell us if - BRADLEE That’s not her job, Howard. HOWARD (annoyed) Then what is? Because we’re sitting here going through all of -  70.",
      "characters": [
        "FRITZ"
      ],
      "action_text": "BRADLEE (firm) Go back to work. After a moment, Howard does. Bradlee watches him go. Tony turns to him.  TONY There’s an embassy for Guam? BRADLEE Of course, there’s an embassy for - (into receiver) Yes! Yes. This is Ben. Bradlee. Of the Washington. Post. I’m trying to get - He’s clearly put on hold again. He slaps his hand on the table four times - each one harder than the last. TONY It might help if you were more condescending. Why don’t you just call Mrs. Graham? BRADLEE Hm? TONY Jesus - BRADLEE I was teasing that time. I can tease. No he can’t. BRADLEE (CONT’D) Because if I call Mrs. Graham without knowing what the lawyers are going to say then the first thing she’s going to do is call the lawyers and I’ll be on hold with both of them. At least this one cuts out the middle man. TONY Except you’re still on hold. He glances over at her. BRADLEE What are you doing back there?  71. TONY Making sandwiches. BRADLEE For who? She stares at him and shakes her head. She puts the sandwiches on a platter and walks out, ducking under the cord. The front door opens - Bradlee turns. He sees ROGER CLARK (late 30s), ANTHONY ESSAYE (40s), and a few other LAWYERS arrive. CLARK Mr. Bradlee? BRADLEE Who are you? CLARK We’re from Royall, Koegell, & Wells. Koegell is pronounced “Kegel”. HOWARD (to Meg re: Koegell) What’d he say? She would roll her eyes but she’s too tired. BRADLEE The lawyers? CLARK That’s right. BRADLEE (irritated) Who the hell am I on hold to talk to then? CLARK Probably me. Bradlee slams the phone down and walks to them - INT. LIVING ROOM, BRADLEE HOUSE - CONTINUOUS BRADLEE Your firm needs to work on its communication skills.  72. CLARK We’ll get right on that. He extends his hand - CLARK (CONT’D) Roger Clark. Bradlee shakes it, briefly, and walks towards the back. BRADLEE OK. Follow me. MEG Ben - I think we need to get a writer over here. We’re going to need to get someone - BRADLEE Call Chalmers. MEG He’s... not going to be happy about that. BRADLEE Call him! Bra",
      "dialogue_count": 1,
      "word_count": 4038
    },
    {
      "scene_number": 6,
      "slugline": "INT. BRADLEE’S OFFICE, WASHINGTON POST - SAME TIME An awkward silence hangs between Bradlee, Kay, and Fritz - who has a legal pad on his lap. BRADLEE You’re sure they’re going to call. FRITZ Yes. BRADLEE I met the AAG once. Tiny hands. Kay hides a smile. After a few moments of unbearable silence... the phone at Cynthia’s desk rings. After a moment - CYNTHIA (O.S.) It’s the Assistant Attorney General. BRADLEE Put him through. Bradlee takes a deep breath, Kay doesn’t know what to expect. Bradlee’s phone rings and he puts it on speaker. BRADLEE (CONT’D) This is Bradlee. I have Mrs. Graham and Mr. Beebe here with me. BALILES (O.S.) Good morning, this is Assistant Attorney General Gerald Baliles. BRADLEE Hello, Mr. Baliles. Fritz begins making notes. BALILES (rote) Mr. Bradlee, I have been advised by the Secretary of Defense that the material published in The Washington Post this morning contains information relating to the national defense of the United States and bears a top-secret classification.  93.  (MORE)",
      "characters": [
        "YOUNG WOMAN"
      ],
      "action_text": "As such, the publication of this information is directly prohibited by the provision of the Espionage Law, Title 18, United States Code, Section 793. Fritz closes his eyes tight. Kay and Bradlee exchange a glance. BALILES (O.S.) (CONT’D) Moreover, further publication will cause irreparable injury to the defense interest of the United States. Accordingly, I respectfully request that you publish no further information of this character and advise me that you have made arrangements for the return of these documents to the Department of Defense. Bradlee looks to Fritz who gives him another nod of the head. BRADLEE Thank you for the call, Mr. Baliles, but we respectfully decline. BALILES (O.S.) Thank you for your time. The call ends. The moment hangs there briefly. KAY What’s next? Fritz sighs and stands. FRITZ We’re going to court. Today. They’ll try and prove we knowingly published something that was a danger to the US government. BRADLEE Did he call us spies? FRITZ Not as glamorous as you thought, is it.   (beat) I’ll call when I have more news. For now... keep them writing.  94.  BALILES (CONT'D)  (MORE) We’ve opened the door. No reason closing it until they order us to. KAY Will it come to that? FRITZ Most assuredly. (to Bradlee) You wanted a fight. Fritz leaves, she looks at Bradlee. KAY Mr. Bradlee? BRADLEE (in a daze) Hm? KAY When was the last time you slept? BRADLEE The day before I started this job. Beat. Bradlee wonders why she’s still there. BRADLEE (CONT’D) Mrs. Graham? KAY I spoke to Mr. McNamara. BRADLEE (surprised) What? You - will he - KAY He’s not a villain. BRADLEE You don’t have to be a villain to do villainous things. KAY He won’t be a source for you. BRADLEE (frustrated) Mrs. Graham -  95.  FRITZ (CONT'D) KAY (standing) I think I’ll go with Fritz to the hearing. BRADLEE They probably won’t let you in. Why did you tell me if you’re not going to let me - KAY Because I didn’t want you to think I was afraid to ask. He’s stunned by this. A moment hangs b",
      "dialogue_count": 1,
      "word_count": 1069
    },
    {
      "scene_number": 7,
      "slugline": "INT. DEN, BRADLEE HOUSE - NIGHT Marina is asleep in front of the TV. He smiles. He moves to turn it off but sees that it’s special news program on Vietnam produced by ECO. He sits for a minute. NEWSREEL “... The truth of the matter is, the Paris Peace Talks, hailed as a major breakthrough in 1968 have, by 1971 achieved nothing. The delegates still turn up, make accusatory speeches and leave. Week in week out, the delegates play their parts but its all become a puppet show without an audience. And in the meantime, the war goes on and the casualty lists mount...” Bradlee grits his jaw as he watches. INT. STUDIO, BRADLEE HOUSE - A LITTLE LATER Tony sits on a stool, painting in splattered overalls. A record player plays softly, a cigarette smokes in an ashtray. Bradlee walks towards the studio with a beer. Eventually he leans on the doorway. She knows he’s there but she doesn’t need to acknowledge it. BRADLEE I thought that one was finished. TONY You’re thinking of a different one. BRADLEE Oh. Their conversation is slow. At ease. He walks to the worn-out recliner he sat in for many nights in the early days of their marriage. Now, it’s cluttered with papers. He moves them off and sits. BRADLEE (CONT’D) Your daughter snuck down to watch TV again. She looks at him. TONY You look terrible.  99.",
      "characters": [
        "BRADLEE"
      ],
      "action_text": "Besides, you asked for the blame in the first place. You can’t put that on anyone else now that you’re up shit’s creek. BRADLEE (smiling) You sure know how to cut to the quick. TONY Of course. It’s why you married me. BRADLEE Ah, is that why, I keep forgetting. It’s a joke, but there’s some truth to it. He watches her again - lost in thought. BRADLEE (CONT’D) What do you think of her? TONY Who? Our daughter? BRADLEE (laughing) No, Mrs. Graham. TONY I don’t know her. BRADLEE That’s never stopped you from having an opinion before. She takes her time with it, turning to look at him. TONY I think... she’s in a position she never thought she’d have and I’m sure plenty of people don’t think she should be in. If I were her... I wouldn’t even know where to start.  101.  TONY (CONT’D)",
      "dialogue_count": 1,
      "word_count": 531
    },
    {
      "scene_number": 8,
      "slugline": "INT. BOARDROOM, WASHINGTON POST - MORNING Copies of The Washington Post are dropped. Each headline details the progress that’s been made on the case:   “GESELL UPHOLDS PREVIOUS RULING IN ‘PENTAGON PAPERS’ CASE, APPEAL HEADED TO FEDERAL COURT” ,   “COURT FINDS IN FAVOR OF POST, RESTRAINING ORDER UPHELD ”, “ TIMES AND POST CASES ENJOINED, CASE HEADED TO SUPREME COURT ”, “ SUPREME COURT HEARING ON ‘PENTAGON PAPERS’ SET FOR EMERGENCY SATURDAY HEARING ”. IGNATIUS slams each paper onto the table. Kay watches patiently from her normal seat; Fritz looks on. The past week has taken a toll. They look exhausted. IGNATIUS And   now   our IPO is being reconsidered. A murmur amongst the board members. FRITZ They’re just doing their due diligence. This is a big offering. IGNATIUS Due diligence? FRITZ Yes, Paul. And what is it - IGNATIUS Please don’t ask what I’m insinuating. I think it’s clear: ever since Mrs. Graham took over we have seen not only a steady decline in profits but, now, a jump off the cliff! Kay lets it happen - but she’s not happy about it. IGNATIUS (CONT’D) I was brought here because of my experience and never have I seen such a disregard for the best intentions of a company. If I offer my opinion and it is ignored once, I’ll let it go. Twice, I’ll raise my hand. Three times - I must speak! If no one else will, I will stand up for the interests of our Board. That’s a dagger to Kay’s heart. Fritz surveys the room, he can’t tell whose side the boardmembers are on.  102.",
      "characters": [
        "MEG"
      ],
      "action_text": "IGNATIUS (CONT’D) Mrs. Graham, your decision to allow The Post to become involved in this crusade is beyond reprehensible. You’ve repeatedly allowed Mr. Bradlee and his - group - to have his way with this paper. Through weak and misguided leadership. And, frankly, it is something I am sure that neither your father, nor your husband - She stands, surprising everyone - not the least of which, herself. KAY That will be quite enough. It is perfectly clear, Mr. Ignatius, that you and I have very different opinions of how to run this company. However, whether you agree with my decisions or not, I have made them. Not you. Ignatius is almost red with anger. KAY (CONT’D) If it is your intention to bully me into leaving this company, I assure you - that is not going to happen. If you truly believe that the correct step is for me to step down, please - take a vote. But I recommend you do it after the hearing tomorrow. You may not think I know much, but I can tell you your headline will sell much better if you fire a felon. Not just a woman. (beat) And I hate to disappoint you, Mr. Ignatius, but Phil Graham never cared for bullies and he wouldn’t have cared for you. She leaves the room, emboldened. The boardmembers shocked. INT. GENE’S OFFICE, WASHINGTON POST - DAY Bradlee knocks, Gene looks up. BRADLEE You got a minute?  103. GENE Sure. Bradlee walks in and shuts the door behind him. BRADLEE You coming to the hearing tomorrow? GENE I think I should probably stay here. In case the world decides to keep rotating while you’re all in court. Bradlee laughs once. GENE (CONT’D) You alright? BRADLEE No... I - I need to ask a favor. GENE (joking) Hang on, let me write this down. Bradlee’s mood is serious, Gene’s expression changes. GENE (CONT’D) Jesus, Ben. What? BRADLEE If this thing goes bad. Which... I don’t know. I thought it would be over by now and it’s not so - GENE They’re just - BRADLEE When Fritz Beebe tells you it doesn’t look good... it doesn’t do much to bolster confidence",
      "dialogue_count": 1,
      "word_count": 3446
    }
  ]
}