{
  "slug": "the-old-man-and-the-gun-2018",
  "title": "the old man and the gun",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 15164,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. JOHN HUNT’S HOUSE - MORNING A lock clicks, a doorknob turns. Hunt enters his modest two- story home to see... ...a hand-painted HAPPY BIRTHDAY DADDY sign hanging from the mantle. It’s accompanied with THUMPING FOOTSTEPS coming down the hall, which are themselves followed by a glimpse of ALEX, 9, and AILEEN, 6, John’s two kids. They appear in the hallway for a moment and then vanish as they chase each other from room to room. Typical morning chaos. MAUREEN HUNT, 30s, African-American, is sitting at the kitchen table, making edits to a manuscript. She’s pretty, somewhat exhausted, 5 months pregnant. MAUREEN Good morning. He kisses her quickly on the back of the neck. One sweet moment all to themselves, as the chaos reigns around them. She opens her mouth, about to say something, but... JOHN HUNT Don’t say it. MAUREEN Say what? I wasn’t gonna say anything. JOHN HUNT Okay. MAUREEN You’re the one who forgot JOHN HUNT I said - MAUREEN I’m not mad. It was just dinner. JOHN HUNT You’re mad. MAUREEN You been drinking? JOHN HUNT No. 18.",
      "characters": [],
      "action_text": "MAUREEN Good. Can you take the kids to school? I’ve been up three nighs in a row now... JOHN HUNT Me too... MAUREEN Yeah, but I was up all night with him. Touching her belly... MAUREEN (CONT’D) Kicks a little harder than your guy, I’m guessing. JOHN HUNT I hope so. MAUREEN Also, do you have any cash? Alex has his field trip today. JOHN HUNT Yeah, probably... MAUREEN Okay. And also... He puts his fingers to her lips to shush her up. MAUREEN (CONT’D) I’m sorry about yesterday. JOHN HUNT I’m sorry too. My fault. MAUREEN I love you. JOHN HUNT That you can say. Just keep saying that. MAUREEN And happy birthday. INT. BATHROOM - DAY John Hunt sits on the commode, reading a self help book. 19.",
      "dialogue_count": 0,
      "word_count": 313
    },
    {
      "scene_number": 2,
      "slugline": "INT. / EXT. JOHN HUNT’S POLICE CAR - MORNING John drives Alex to school. It’s still raining. Alex knocks his galoshes together in time with the windshield wipers. JOHN HUNT But it’s your choice, right? ALEX Yeah. JOHN HUNT So pick whatever you want. It’s all about what you want to be. What about baseball, you still like that? Alex shrugs. JOHN HUNT (CONT’D) Well, you’ve gotta pick something you like. It doesn’t matter what it is, just that you like it. ALEX Do you like your job? JOHN HUNT I love my job. They pull up outside their destination. A NEIGHBORHOOD BANK. I-35 hums in the background. JOHN HUNT (CONT’D) You want to come in with me or wait in the car? ALEX I’ll wait. JOHN HUNT Okay. I’ll be back in a second. And write yourself a note to your teacher, we’re gonna be a little late. He gets out, leaving the keys so Alex can listen to the radio. He unfolds an umbrella and runs towards the bank, ignoring the CHEVY STATION WAGON that is parked innocuously across the street... 20.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 185
    },
    {
      "scene_number": 3,
      "slugline": "INT. CHEVY STATION WAGON - CONTINUOUS FORREST TUCKER sits alone in the front seat of that Chevy. He’s got a hat on. He sports a neat, brand new mustache that upon closer inspection is most certainly glued on. He is finishing up painting his fingertips with CLEAR NAIL POLISH. The wipers tick intermittently, letting the wash of rain water accumulate before beating it back and offering a momentarily clear perspective on... ...the BANK across the street, and JOHN HUNT hurrying into it. Forrest puts the cap back on the polish and gives his hand a shake to dry his fingers. He doesn’t seem to be in any particular rush. Next, he presses a HEARING AIDE into his left ear. The wire slips down behind his hair, disappearing into his collar. Then he reaches into the glove compartment and calmly, deliberately takes out a CAREFULLY POLISHED .45. INT. 1ST NATIONS BANK - CONTINUOUS John Hunt closes his umbrella as he enters the bank. He steps up towards the counter. There’s only one teller working behind the glass, and a bit of a line. He takes his place. Behind him, THE BANK DOORS OPEN AGAIN. Forrest enters, a briefcase in hand. He quickly sizes up the place. The line for the teller, the customers and the MANAGER, who is standing in the doorway of his office. Forrest makes a beeline straight for the manager, a diminutive fellow whose name-tag reads ARTHUR OWENS. FORREST Excuse me, sir. I’m looking for the manager... MR. OWENS Well that’d be me. What can I do for you this morning? FORREST I wanted to ask about a loan. Small business. 21.",
      "characters": [],
      "action_text": "MR. OWENS Sure, I think we can help you with that. What sort of business are we talking about? Forrest discreetly pulls aside the bottom of his suit jacket and flashes the gun tucked in his waistband. He grins. FORREST This kind. INT. MANAGER’S OFFICE / 1ST NATIONS BANK - CONTINUOUS They step into the manager’s office, which has a big window looking out into the rest of the bank. Forrest takes the liberty of closing the door behind them. FORREST Go ahead, sit down. Mr. Owens does so, and then takes a seat behind his desk. Forrest sits down opposite him setting his briefcase down on the desk. FORREST (CONT’D) How’re you feeling today? MR. OWENS Not so great, since you’re asking. FORREST Well, day’s still young. Mr. Owens sighs and nods. INT. 1ST NATIONS BANK - CONTINUOUS Through the glass doors of the office, Forrest and Mr. Owens can be seen chatting. At one point, Forrest nods in the direction of the bank lobby, and Mr. Owens looks nervously in that direction. A moment later, Mr. Owens leaves the office. Forrest follows him, and loiters outside his door. Mr. Owens approaches the bank’s SECURITY GUARD and gestures to him, muttering for him to follow him behind the counter. Meanwhile, JOHN HUNT advances in line. He checks his watch. 22.",
      "dialogue_count": 0,
      "word_count": 496
    },
    {
      "scene_number": 4,
      "slugline": "INT. JOHN HUNT’S POLICE CAR - CONTINUOUS Alex sits in the car, shuffling through songs on the radio stations. INT. 1ST NATIONS BANK - CONTINUOUS Forrest watches behind the counter, where Mr. Owens is going from teller to teller, filling the briefcase... ECU: Mr. Owens presses a SILENT ALARM BUTTON under the counter. He looks up at Forrest... ...who makes eye contact. Almost as if in response, Forrest TOUCHES his hearing aide, pressing it A moment later, Mr. Owens reappears from behind the counter, the briefcase hanging heavy from his hand. ECU: the briefcase changes hands. FORREST Thank you kindly. Forrest turns to go... ...and BUMPS INTO an oblivious John Hunt as he does so. Hunt drops his withdrawal slip, it goes fluttering through the air... ...and Forrest CATCHES IT. JOHN HUNT Oh - thanks. He glances at Forrest and for a moment FREEZES. Forrest WINKS at him, and departs... ...leaving John, momentarily stunned. Did he RECOGNIZE that guy? He turns to look, but Forrest is already gone. INT. JOHN HUNT’S POLICE CAR - CONTINUOUS As Alex kicks back, nodding his head to the pop tune that’s still playing, he notices the bank door opening in the rearview mirror. Is it his dad? No sir. Just an old man, leaving the bank and heading to his car across the street... He returns to the stereo, turning up the volume... 23.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 231
    },
    {
      "scene_number": 5,
      "slugline": "INT. 1ST NATIONS BANK - MOMENTS LATER John Hunt, still a little sidetracked, finally makes it up to the window, only to be interrupted by - BANK SECURITY GUARD Ladies and gentlemen... John turn. He looks over his shoulder, just in time to see the security guard LOCKING THE DOORS FROM THE INSIDE. MR. OWENS (calling out) Excuse me ladies and gentlemen...please remain calm. It is my duty to inform you that this bank has just been robbed. There’s an IMMEDIATE UPROAR from the customers and other employees. INT. CHEVY STATION WAGON - CONTINUOUS Back in the car, which is now in motion, as Forrest PEELS AWAY from the bank. The rain still coming down hard. Forrest glances at the rearview mirror, making sure he’s not being tailed. Then he reaches up to his lip with his free hand and PEELS THE MUSTACHE from his face. He can hear SIRENS in the distance. INT. 1ST NATIONS BANK - CONTINUOUS Minor chaos. The manager is trying to keep everyone calm. John Hunt in particular. JOHN HUNT - but my son is out there and - MR. OWENS Sir, please, the police will be here momentarily - JOHN HUNT For Christ’s sake! I’m with the police! I’ve been trying to tell you. I will help you out if you can just unlock that door - EXT. PARKING LOT - CONTINUOUS The Chevy pulls up in a parking lot. The KEYS are thrown in a gutter. 24.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 245
    },
    {
      "scene_number": 6,
      "slugline": "EXT. 1ST NATIONS BANK - DAY The front door has been unlocked, and John is rushing out through the crowd of police officers to his car. He knocks on the window. Alex looks up and unlocks the door. An obstreperous police sergeant named SHELBY OFFERMAN notices John as he heads towards the building. OFFERMAN Wait - John? What are you doing here? Hunt just shakes his head. Exasperated, embarrassed. EXT. PARKING LOT - CONTINUOUS A parking lot in a shopping mall. Forrest climbs out of the walks from the Chevy to the CUTLASS. He throws the suitcase in the trunk, and then casually climbs into the front seat, starts the engine and pulls away... INT. 1ST NATIONS BANK - DAY Alex is in the bank now, sitting on a chair outside the office while his father joins Offerman and Lt. Kelley and a few other detectives in interviewing the bank manager. MR. OWENS He was...older. Fifty, sixty - OFFERMAN White hair? MR. OWENS I don’t know. He had a hat on and - JOHN HUNT (trying to be helpful) He had a mustache, a brown... Everyone looks at John, who understandably is feeling a bit awkward at the moment. PUSH IN ON: sketch artist doing a COMPOSITE DRAWING. A pretty okay likeness of Forrest with a mustache. MOMENTS LATER: John Hunt has broken off into a separate conversation with another detective (DET. COTTER). He seems preoccupied. We dip in and out of the respective conversations. 25.",
      "characters": [],
      "action_text": "DETECTIVE COTTER You know what’s funny, I was talking to Gene Dentler in Fort Worth the other day and he said something real similar happened over there, just outside Burleson... JOHN HUNT Similar how? DETECTIVE COTTER Old guy, sticking up a bank... Hunt processes this information, twisting it around a private thought already forming in his head. Meanwhile, the other conversation has been continuing thusly: OFFERMAN How old exactly? MR. OWENS I’d say he was about fifty or sixty. OFFERMAN More like sixty? MR. OWENS Yeah. OFFERMAN Or fifty? MR. OWENS Yeah, fifty or sixty. LT. KELLEY What do you think, John? That sound about right? John Hunt looks up from his conversation with Detective Cotter, takes a moment to catch up and then nods his head. JOHN HUNT ...Yep. They all chuckle. Hunt shakes his head... ...and while doing so, notices through the office window that MAUREEN has arrived to pick up Alex. She spots him and gives him one of those looks. 26. OFFERMAN And he was armed? MR. OWENS Yes, he had a gun. OFFERMAN But he never pointed it at you? MR. OWENS No. OFFERMAN You just did what he said? MR. OWENS Well, yes. Because I knew he had the gun. OFFERMAN He showed it to you. MR. OWENS Yes. But also - I mean, he was - he was sort of a gentleman. EXT. HIGHWAY - DAY That very gentleman is speeding down the highway, headed who knows where, high as a kite on the adrenaline that’s pumping through his veins. A grin on his face, wind in his hair. He ROLLS DOWN the dirty mud spattered window and lets the fresh air rush against his face. INT. POLICE STATION - DAY John Hunt bursts into his cubicle at the police station. He goes rooting through some files in his desk drawer. LOOKING FOR SOMETHING. INT. FORREST’S HOUSE - DAY CRRRRAAAAACCCK. The floorboards in Forrest’s closet come up, and his face, sporting a new mustache, appears in their wake. He begins to unload STACKS OF CASH into the space below. Another robbery on the books. As he unloads his latest haul, we track through th",
      "dialogue_count": 0,
      "word_count": 2201
    },
    {
      "scene_number": 7,
      "slugline": "INT. SQUAD CAR - DAY Indeed, that young Hunt is laughing as the car speeds over bumps and potholes. The light flares exuberantly behind his head as they drive. Great big golden flashes. INT. POLICE STATION - CONTINUOUS Hunt continues. JOHN HUNT Here I am, two weeks out of the army...now I’ve got the windows down, adrenaline’s going all...bum- bum-bum-bum-bum-bum-bum-bum...and I’m thinking to myself: I don’t want to be anywhere else but here, right now. Chasing after this dude. I was the best I’d ever been. I coulda gone on doing that forever. LT. KELLEY But you caught him. JOHN HUNT Oh yeah. He didn’t get that far. We blew his tires right out there on the 10 and got him surrounded. I was down behind the door with my gun out. EXT. ARIZONA HIGHWAY - DAY Young John Hunt PEERS OVER THE DOOR of the cop car, just two eyes squinting. He sees... A MAN behind the wheel of the Chevy Caprice, which is spun out on the road, its tires blown, its hood smoking. He’s wearing the uniform of a Brinks Driver. We can’t quite see his face but we know exactly who it is. There are shouts of “get out of the car” and “drop the weapon,” but they’re all muffled. The man, Forrest, moves to get out of the car. Just as the door opens, we cut back to: INT. POLICE STATION - CONTINUOUS John Hunt leans back in his chair. JOHN HUNT I see him get out of the car and he’s just smiling like he’s the happiest guy in the world. He looked as happy right then as I’d felt chasing him. I just laughed. (MORE) 35.",
      "characters": [],
      "action_text": "And then he pulls out a gun and we take him down. LT. KELLEY You shot him. JOHN HUNT Everyone shot him. He got hit six times. Somehow he survived. He’s laying on the ground and I happen to be standing there and as he gets put in the ambulance... EXT. ARIZONA HIGHWAY - DAY Young John Hunt walks past the flashing lights of the ambulance, towards where Forrest is being put on a stretcher. INT. POLICE STATION - CONTINUOUS JOHN HUNT ...I can’t tell for sure but I think he winks at me. (beat) At the trial he got a lesser sentence because he says his gun was never loaded. Which maybe it wasn’t, I don’t know. LT. KELLEY And that’s this guy. He taps the mug shot. JOHN HUNT That’s this guy. The smiling guy. And here he is and he winked at me again. LT. KELLEY So now what? JOHN HUNT Now what... (beat) Well, I’m gonna talk to Offerman about going to California, see what I can dig up on where this guy’s been. LT. KELLEY I’ve never been to California! JOHN HUNT (CONT'D) 36. JOHN HUNT Don’t get your hopes up. I want you to poke around here, see if there’ve been any other stickups nearby that fit our dude’s profile... LT. KELLEY Okay. And when you get back? JOHN HUNT ...Well, I guess we’re gonna catch him. (beat) This is the fun part. HOLD on Hunt before... INT. BARBERSHOP - CONTINUOUS The predominant sound in the barbershop is the BUZZ of electric hair clippers. Forrest is the only customer in the place. It’s an old boy’s type place. Centerfolds up on the walls, a permanent haze of cigarette and cigar smoke griming up the walls. Forrest is seated in the chair, smock draped over his shoulders, getting his hair cut by an older guy named EDDIE YURKOW. He’s got jailhouse tattoos creeping out from under the sleeve of his barber’s shirt. FORREST Easy, easy, easy... YURKOW Relax, relax. What’d you put in your coffee this morning? FORREST I’m just happy to be here, bud. YURKOW Well, count on me to turn that frown upside down. All I got are rainy days from here until who knows when. Yurkow",
      "dialogue_count": 0,
      "word_count": 4697
    },
    {
      "scene_number": 8,
      "slugline": "EXT. FIELDS / HORSE RANCH - DAY A cool, misty morning out in the country. From somewhere comes the sound of horses hooves. CAMERA HOVERS overhead, LOOKING DOWN ON... TWO HORSES. With riders astride them. They trot at a brisk pace along a path in an open expanse of pasture, one a fair bit ahead of the other. It’s Jewel and Forrest. Out on a first date. Jewel clearly knows how to ride, and is dressed for it. She slows down now and turns about to see Forrest, valiantly pretending he knows what he’s doing. He’s wearing brown corduroy pants and a matching jacket - a fine outfit, if a little ill-suited for riding. JEWEL Can you keep up? FORREST Oh yeah. I’m just enjoying the scenery. She trots down a gentle hill that extends down to a lake. When she gets to the bottom, she looks back up. What she sees is: Forrest, still at the top, astride his horse, backlit by the sun, looking just like a cowboy. He looks thusly heroic for about a second - and then he begins to make his way down the hill. Awkwardly, haphazardly. But it makes her laugh. EXT. STABLES / HORSE RANCH - DAY Jewel and Forrest lead the horses through the long stables. JEWEL I’ve had Wiley here since he was born. And Autumn, we bought, and I fell in love with her right away... Her horse leans over the edge of his corral to nuzzle her outstretched hand. FORREST This is all is yours, huh? 59.",
      "characters": [],
      "action_text": "JEWEL Yeah. For now at least. I keep thinking about selling it all...it’s more than I can handle most of the time. On my own at least. But these guys keep me happy. FORREST That’s something. JEWEL Yep. Forrest bends down to scrape some mud off his shoe with a stick. Then he stands upright and looks over the horizon. INT. POLICE STATION - DAY John Hunt returns to the police station. The station which seems abuzz with activity - a steady murmur meets him as soon as he steps through the door, along with a SHOUT from Offerman, who’s standing in his office door. OFFERMAN Looks like your rainy day robber is at it again, John! INT. OFFERMAN’S OFFICE / POLICE STATION - DAY Offerman throws one file after another down on his desk. OFFERMAN Albuquerque. El Paso. Sweetwater. Odessa. Abilene. And then over here you got Little Rock. Uncertain. Shreveport. They keep coming in... JOHN HUNT Jesus. Where from? LT. KELLEY I did some poking around, like you said. And once I did... JOHN HUNT How many? INT. JOHN HUNT’S HOUSE - NIGHT A giant CORKBOARD is laid out on John Hunt’s living room floor. Multiple state maps are pinned to it, representing a general layout of the Southwest. 60. Little Aileen Hunt is helping her daddy poke RED PUSHPINS into various points on the map. John has a stack of police files that he’s going through, pulling city names from each one. JOHN HUNT Seventy eight...seventy nine... He points to another spot on the map. She sinks a pin into it. JOHN HUNT (CONT’D) Eighty. What’s after eighty? AILEEN I dunno. JOHN HUNT Eighty-one. AILEEN Eighty-one. JOHN HUNT There we go. See, we’re make a trail. It’ll lead us right back to... AILEEN The bad guy? JOHN HUNT Yeah. The bad guy. And the bad guy came from... INT. POLICE STATION - DAY Now Offerman is looking at John’s map, which he’s brought to the office. OFFERMAN How the fuck does a guy as old as my dad who’s spent his entire life being a crook break out of prison for the seventeenth time, rob almost 100 banks across six s",
      "dialogue_count": 0,
      "word_count": 3642
    },
    {
      "scene_number": 9,
      "slugline": "INT. FORREST’S CAR - CONTINUOUS He sits there, in the shadows, listening to the sound of John Hunt on the police radio. All that furor and bluster gets further and further away, receding into a mess of crackles that then becomes nothing but white noise. Forrest listens to that snowy static for a little longer, and then SHUTS OFF the radio. That’s it for John Hunt. As Forrest sits there, the bittersweet strains of Jackson C. Frank’s BLUES RUN THE GAME kicks up on the soundtrack. JACKSON C. FRANK  Catch a boat to England, baby, maybe to Spain.  He kills the engine and gets out of his car.... EXT. OVERPASS - CONTINUOUS ...walks across the street... JACKSON C. FRANK  Wherever I have gone, wherever I’ve been and gone. Wherever I have gone, the blues are all the same...  ...and gets in ANOTHER CAR that’s parked there. A beat up old VOLVO. Not quite his normal style. INT. / EXT. JEWEL’S HOUSE - NIGHT The song continues instrumentally as there comes a POUNDING on Jewel’s front door. JEWEL Just a minute... Jewel undoes the latch and opens the door to find Forrest standing there. He launches right in to what he has to say, speaking fiercely, with conviction, like he’s rehearsed it. FORREST Listen, Jewel. I’ve gotta hit the road tomorrow morning. I don’t know when I’ll be back and...I just wanted... He pauses. Like he wants to say something else. Everything he planned on saying is on the tip of his tongue. 77.",
      "characters": [],
      "action_text": "But he doesn’t say it. FORREST (CONT’D) I just wanted to tell you. JEWEL Where are you going? FORREST I don’t know yet.   I’ll figure it out on the way. JEWEL Okay. So... FORREST So yeah. JEWEL I thought you were gonna ask me if I wanted to come with you. For just a second, a single split second, it almost looks like Forrest’s eyes are filling with tears. He hides it with a sad chuckle. FORREST I thought I was too. Jewel looks around, like she’s looking for a solution to this situation. JEWEL What if...what if you just stayed here instead? FORREST Here? JEWEL Here. With me. You could just...lay low... In that moment, Forrest looks like he really, really wants to do that. But he sticks to his guns. FORREST I can’t stay here. Have you seen the news? JEWEL Yeah. 78. FORREST I got everyone all over looking for me. I gotta keep moving. JEWEL You don’t think a girl like me could take care of a guy like you? He ponders this for as long as he can. He clearly wants to say yes. Or maybe we just want him to say yes. But it’s not going to happen. FORREST Maybe I’ll call you sometime. JEWEL Okay. He looks at her one last time, and then turns... ...walks back to his car... ...gets in... ...and DRIVES OFF. Jewel stands there. Hair blowing in the wind. Watching as his car disappears in the distance. Before too long even the sound of it is gone. She waits there a moment more. Realizing that this strange chapter of her life is over. And then... ...suddenly... ...the distant hum of that car fades back in against the wind. Jewel cranes her neck... Forrest’s car comes ROARING BACK. He pulls right up to her driveway. FORREST I changed my mind. Let’s go. But we gotta take your car. A tremendous smile breaks across her face. 79.",
      "dialogue_count": 0,
      "word_count": 580
    },
    {
      "scene_number": 10,
      "slugline": "INT. JEWEL’S CAR - NIGHT The Jackson C. Frank song is still playing. The lyrics return. JACKSON C. FRANK  Maybe tomorrow, honey, Someplace down the line, I'll wake up older, So much older, mama, Wake up older And I'll just stop all my trying.  They’re driving. Fast. Recklessly. They’ve switched cars. Jewel is in the driver’s seat, Forrest kicking back, enjoying the ride. The highway lights whipping by outside. No words exchanged. INT. JEWEL’S CAR - DAWN Now the sun is rising. They’ve switched seats. Forrest is driving. Jewel is passed out in the passenger seat. Sleeping sweetly. EXT. SHOPPING CENTER - MORNING The car pull over into a shopping center. A strip mall somewhere in the middle of America. JACKSON C. FRANK  Catch a boat to England, baby, Maybe to Spain, Wherever I have gone, Wherever I've been and gone, Wherever I have gone The blues are all the same.  As the car comes to a stop, the song ends. INT. JEWEL’S HOUSE - CONTINUOUS Forrest kills the engine. Jewel is still sound asleep. He looks at her for a long time... ...and then looks out the window, at the stores in the strip mall. INT. PAWN SHOP - MOMENTS LATER A BELL CHIMES. There’s a SWING OF DAY LIGHT as a door opens. 80.",
      "characters": [],
      "action_text": "ECU ON: Forrest’s REFLECTION in a glass case, in a pawn shop crammed to the brim with old junk. He’s the only customer in there. Probably the first of the day. He’s looking at jewelry. Rings in particular. He quickly begins to peruse the glass case near the front of the store, and the register. He catches a glimpse of his face in the glass, haggard and worn down and looking much older. The PAWN SHOP OWNER, 50s, approaches from the depths of the shop. PAWN SHOP OWNER Something I can help you find? FORREST Are these all the rings you got? PAWN SHOP OWNER We got some more, some fancier ones. What do you want a ring for? FORREST Oh, for a girl. PAWN SHOP OWNER Well, I coulda guessed that much. What kind of girl do you want a ring for? FORREST The marrying kind, I hope. PAWN SHOP OWNER Oh. Diamond or gold? FORREST ...Gold. PAWN SHOP OWNER Seeing a fella like yourself get hitched gives me hope. FORREST How so? PAWN SHOP OWNER Means I’ve still got time, right? I’ve got something real nice I think you’ll like. Lemme show you... 81. He turns to the back of the shop. He opens a cabinet, behind which is a SAFE. Click click click. The combination falls into place and the safe door opens. Another click. Not from the safe. Cold and all too familiar. FORREST Hold still. The Owner turns around just enough to see FORREST’S GUN, gently pointed at him. FORREST (CONT’D) Now take whatever it was you were going to show me and whatever else you’ve got in there and put ‘em in a bag and hand it over. The pawn shop owner hesitates. FORREST (CONT’D) Go on. The pawn shop owner hesitates some more. His head hung, in disappointment or shame or something like that. FORREST (CONT’D) Go on now. PAWN SHOP OWNER What sort of bag? FORREST Any bag will do. The Owner looks around him, not wanting to make eye contact with Forrest. He finds a brown paper bag and begins pulling things out of the safe. Forrest watches with an eagle eye. FORREST (CONT’D) The register too. PAWN SHOP OWNER Why are you doing th",
      "dialogue_count": 0,
      "word_count": 626
    },
    {
      "scene_number": 11,
      "slugline": "INT. JOHN HUNT’S HOUSE - DAY John Hunt is sitting at the kitchen table in his undershirt. Holding a NEWBORN BABY, patting her on the back, trying to get her to keep from CRYING. John stands up, finally. The baby just won’t stop crying. JOHN HUNT It’s okay. It’s okay. Come on. Mama will be back soon. He walks out of the room, patting her on the back, pacing, trying to get her to shush. We HOLD on the kitchen. Suddenly, the TELEPHONE RINGS. It keeps ringing, and ringing. CAMERA PUSHES TOWARDS IT. The baby’s still crying, and that crying grows louder... ...as John finally returns, baby in arm and grabs the phone from the receiver. JOHN HUNT (CONT’D) Hello? Beat, as he listens, and then... JOHN HUNT (CONT’D) What?!? Whoever’s on the other end keeps talking. As John nods and listens, the door opens and Maureen returns home with the kids. JOHN HUNT (CONT’D) And that was it? She hurries over to him and takes the crying baby from his arms, just as he’s saying... JOHN HUNT (CONT’D) Okay. Okay thanks. I appreciate it. He hangs up the phone and goes back to the table and sits down. Maureen is nursing the baby. MAUREEN How was she? 83.",
      "characters": [],
      "action_text": "JOHN HUNT She missed you. He sits there for a while longer. JOHN HUNT (CONT’D) Forrest Tucker just got caught in Boston. MAUREEN Really? JOHN HUNT Yeah. Just got pulled over. MAUREEN Oh. Wow. (beat) So now what? JOHN HUNT I guess he’ll go to prison. MAUREEN Oh.   (beat) That’s too bad. John nods. JOHN HUNT I really wanted to catch him. The baby girl breaks away from Maureen and begins to cry again. The baby girl breaks away from Maureen and begins to cry again. Maureen stares at her husband for a long time. MAUREEN I’m not so sure you did. INT. COURT ROOM - DAY A JUDGE’S GAVEL slams down. The court is adjourned. A clamor rises as every begins to get up. John Hunt sits in the back of the court room. He stays seated, watching through the crowds of people, catching glimpses of FORREST, being handcuffed by the BAILIFF. Just glimpses and nothing more. There’s a sea of people between them. 84. John scans that crowd. He catches a glimpse of GAILE, getting up, hurrying out before she has to confront anyone. In the front row he see’s Jewel, but doesn’t linger on her. He doesn’t know who she is. Now the crowd of people are moving down the aisle. Forrest is at the center of the storm, moving calmly, totally accepting his fate. But as he walks past John, the crowd parts just so, at just the right moment. The two men see each other... ...and Forrest WINKS at him. And then he’s gone. John turns back to the front, to the empty court room. FADE TO: INT. JAIL CELL - NIGHT With a heavy sigh, Forrest Tucker lays down on the thin mattress of his jail bed and stares at the ceiling. His breathing falls into a simple rhythm. In and out. In and out. INT. JOHN HUNT’S HOUSE - NIGHT John Hunt lays in bed next to Maureen. Same composition. Filling the frame in exactly the same. Breathing the same way too, matching that rhythm, staring into the same space. INT. JAIL CELL - NIGHT CAMERA BEGINS TO PULL BACK...away from Forrest.   His breathing only gets louder. It carries over to... FADE TO: INT.",
      "dialogue_count": 0,
      "word_count": 1246
    },
    {
      "scene_number": 12,
      "slugline": "INT. LIVING ROOM - DAY Forrest sits at a desk by a window. Outside BIRDS ARE CHIRPING and FLOWERS are blooming. He puts some paper into a TYPEWRITER, rolls it forward. He types a few sentences.  My name is Forrest Tucker. I was the best bank robber there ever was. I was born in...  He stops and looks out the window. It’s now SNOWING. He looks at his hands as they hover over the keyboard. They TREMBLE. INT. DOCTOR’S OFFICE - DAY ECU: Forrest’s hand, STILL TREMBLING. DOCTOR What you’re looking at is standard osteoarthritis. Relatively mild, and perfectly normal at your age. It’s just a sign of wear and tear, I’m afraid. Forrest looks perturbed. This   shouldn’t   be perfectly normal. INT. BEDROOM - NIGHT Forrest sits down on the bed with a PHONE BOOK. He licks his thumb and begins to page through it. Then he picks up the telephone and dials a number. INT. JOHN HUNT’S HOUSE - CONTINUOUS Maureen answers the telephone as she helps a ten-year-old girl with her homework. MAUREEN Hello? FORREST (V.O.) Hello...is John Hunt in? MAUREEN He’s still at work, have you tried him at the station? 89.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 196
    },
    {
      "scene_number": 13,
      "slugline": "INT. BEDROOM - CONTINUOUS FORREST No. I will. Thank you. (beat) Goodnight. He doesn’t notice Jewel in the doorway behind him. EXT. NEIGHBORHOOD - DAY Forrest and Jewel take an early evening walk down the street. Autumn is setting in, and a wind blows the leaves about them. They WALK for a while, to the end of the block, a long dolly shot, and then Forrest STOPS for a moment, staring out ahead of them like he sees something headed his way. INT. JEWEL’S HOUSE - DAY Jewel is asleep. Taking a nap. Forrest’s hand touches hers. FORREST Jewel, honey. Wake up. She stirs, and awakens to see him kneeling beside her. FORREST (CONT’D) I gotta run some errands. You need anything? She smiles sleepily. JEWEL No. How long will you be gone? FORREST Not long. He leans in and kisses her on the cheek. JEWEL What was that for? FORREST You just make me happy. She touches his hand, gently, knowingly sending him off. JEWEL Go do what you’ve gotta do. I’ll be here. 90.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 177
    },
    {
      "scene_number": 14,
      "slugline": "EXT. PAYPHONE - DAY Forrest walks up to a payphone, beaten down and weathered by the open sun. In goes his quarter. He dials a number. INT. JOHN HUNT’S OFFICE - CONTINUOUS We find JOHN HUNT now. A little bit older. A little bit grayer, and not just in his mustache. He looks weary, worn out. All the joie de vivre that Forrest brought into his life has faded. He’s sitting at a new desk in his own office, having graduated from a cubicle. The walls behind him are marked with images of death and violence. His PHONE RINGS. JOHN HUNT John Hunt here. FORREST (V.O.) Hey Mr. Hunt... Hunt takes a moment to recognize the voice. A gleam appears in his eyes. JOHN HUNT Forrest Tucker. I heard you got out. FORREST (V.O.) You’re not in robbery anymore. JOHN HUNT Nah. They put me in homicide. FORREST How you like it? JOHN HUNT I hate it. He leans back in his chair. The tension in his shoulders slips away. A smile turns up the corners of his mouth. JOHN HUNT (CONT’D) It’s good to hear from you. I think about you all the time. (beat) You staying clean? 91.",
      "characters": [],
      "action_text": "FORREST Well... JOHN HUNT You doing good? A long, long pause. JOHN HUNT (CONT’D) Forrest? You doing good? FORREST I’m about to be. With that, he HANGS UP THE PHONE. EXT. PAYPHONE - CONTINUOUS He reaches down and pulls his ascot up over his nose. He walks away from the PAYPHONE and CROSSES THE STREET... ...heading straight towards a BANK. Just as he walks through the front door, he reaches into his waistband and pulls out a COLT. 45. CAMERA HOLDS ON THE BANK FOR A LONG TIME. Gradually, we begin to push in. There’s the faintest sound of commotion on the inside. We keep pushing, pushing...towards the front door. And then, at the last second, the door opens, Forrest Tucker runs out and... CUT TO BLACK 92.",
      "dialogue_count": 0,
      "word_count": 329
    }
  ]
}