{
  "slug": "the-conjuring-2013",
  "title": "the conjuring",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 18,
  "characters_count": 5,
  "characters": [
    "CINDY O.C.",
    "LORRAINE",
    "ANDREA",
    "ED",
    "JUDY"
  ],
  "total_words": 25458,
  "total_dialogue": 13,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. PERRON HOUSE - MASTER BEDROOM - NIGHT A matching bedroom set has been set up.   Numerous boxes are stacked and waiting to be unpacked as -- -- Carolyn pulls some clothes from a wardrobe box at the foot of her bed and walks them into -- THE CLOSET Just as she begins to hang them up -- the noise of CREAKING WOOD draws her attention to the ceiling -- where it sounds like someone’s trying to walk quietly -- then it stops. She’s a little unnerved -- walks back out into THE BEDROOM and crosses to a nearby window.   Looks out to a tree, its leaves rustling in the wind.   She cranes her head to see if any of the branches are touching the roof above the closet.   Can’t tell. Just as she’s about to turn away, she notices Sadie down in the yard near the front porch below, nervously pacing back and forth. ROGER O.C. I don’t know what her problem is. I’ve tried ten times to get her to come inside. She turns, sees Roger setting a box down amongst the others. ROGER Last box for tonight.   I’m beat. CAROLYN We can’t just leave her out there, she might run away. ROGER I’ll find something to tether her to.   Maybe a night outside will help change her mind. As Roger heads back out -- CAROLYN You weren’t just on the roof, were you? He turns around -- huh? CAROLYN (cont’d) I heard something, sounded like footsteps. ROGER It’s an old house honey, it’s going to make some noises.  7. (CONTINUED)",
      "characters": [],
      "action_text": "The lights flicker for a moment -- ROGER (cont’d) ...Oh great. CAROLYN Maybe grab a flashlight too -- Roger heads out. DISSOLVE TO: INT. MASTER BEDROOM - LATER Carolyn’s eyes open -- she’s awakened to what sounds like the distant screams of hundreds of children -- but that can’t be right.   She glances to Roger, who is sound asleep.   She slips out of bed to investigate. CUT TO: EXT. HOUSE - BACK PORCH - RIGHT AFTER Carolyn comes out the back door.   Listens -- it’s much louder.   Her attention is drawn to the woods directly behind the house where the screaming is coming from. A HAND touches her shoulder -- she about jumps out of her skin.   She whirls.   Roger is standing right behind her. ROGER Whoa -- sorry. Carolyn slowly turns back around to face the woods. CAROLYN What   is   that? ROGER (amused) Tree frogs -- about as big as softballs.   They’re fucking. She looks back at him over her shoulder -- CAROLYN And you know this because? ROGER I used to catch them as a kid at my Grand-dad’s. Carolyn looks back out into the night. CAROLYN Sounds like some pretty rough sex. Roger playfully pulls her into an embrace --  8. CONTINUED: (CONTINUED) ROGER I think it’s going to take some time for this city girl to get used to this country living. CAROLYN I think you’re right. She snuggles up -- CAROLYN (cont’d) (coy) You still too tired? ROGER Those frogs make you horny? CAROLYN No -- you do. As they head in, Carolyn’s gaze drifts back over her shoulder one more time into the darkness -- still slightly uneasy. CUT TO: EXT. HOUSE - LATER Clouds have moved in, swallowing any illumination from the moon and stars, giving the house an ill-boding presence.   The frogs have stopped, replaced by a lingering, unholy silence. DISSOLVE TO: INT. HOUSE - UPSTAIRS HALLWAY - MORNING Carolyn, wearing a robe, comes out of the bedroom -- side steps a few boxes.   Morning light streaks in through several windows, illuminating the fact that the Perrons are far from being unpacked. The bathroom",
      "dialogue_count": 0,
      "word_count": 1138
    },
    {
      "scene_number": 2,
      "slugline": "INT. LECTURE HALL - NIGHT ED and LORRAINE WARREN (early thirties) are up on a stage standing behind a podium.   An audience of three hundred captivated college students are seated before them as rough film footage rolls on a LARGE SCREEN of a despondent looking man, rail thin, late 20’s, sitting in a chair.   His eyes are black, matching his hair.   His skin is pasty white.   A Catholic priest is next to him, reciting Latin from a bible in barely audible words. ED -- He was a French Canadian farmer with nothing more than a third grade education -- yet after being possessed by a demon, spoke some of the best Latin I had ever heard -- sometimes backwards.   He had been molested by his father, who also exposed him to bestiality. (beat) Evil found its home in this man because he was conflicted, and forced into this -- he never had a choice. (beat) He thought he was saving his wife by shooting her -- like his father did to his mother. LORRAINE If you look at his eyes, you can see them tearing blood onto his shirt. Maurice’s white T-shirt slowly starts to get blotted with drips of blood; dark, crimson red.   He suddenly SCREAMS OUT IN PAIN, his body writhing -- LORRAINE (cont’d) And upside down crosses started appearing on his body. We see Ed lifting up the side of Maurice’s shirt, exposing for the camera -- -- TWO UPSIDE DOWN CROSSES pushing OUT at his skin from the inside.   Camera closes in. The audience can’t believe what they’re seeing. ED That’s good, Jerome, why don’t you hit the lights -- As the house lights kick back on, we see JEROME DAVIS (20’s), Ed and Lorraine’s technical assistant standing in the back of the lecture hall.   He has longish hair, wears cords and a flannel shirt.   A leather necklace with peace sign is draped around his neck.   He turns the projector off. TIME CUT TO:  12. (CONTINUED)",
      "characters": [],
      "action_text": "Ed and Lorraine are in the middle of a Q & A with the audience.   A male student with a tie-dyed shirt and wild Afro is standing up -- LORRAINE -- We investigate roughly a hundred or so cases a year. AFRO Cool.   Thanks. As Afro takes a seat, hands go up.   Ed points to another student who wears GLASSES four rows back.   He gets to his feet. GLASSES This is some creepy shit you two do for a living -- Subtle laughs escape from the crowd. GLASSES (cont’d) So how do you keep these things from going after you? ED We don’t get personally involved with people we’re working with or what we’re investigating -- it makes you emotionally vulnerable which gives them a way in.   And of course, our faith in God. He sits back down.   Hands fly up again -- Lorraine points to a female student with a PONYTAIL in the front row, who gets to her feet.   She seems a little hesitant to speak, then -- PONYTAIL ...I wake up at night sometimes and it feels like someone’s laying next to me.   Have you ever dealt with anything like that before? LORRAINE Many times. (beat) Does it scare you? PONYTAIL I’m a little freaked, yeah. LORRAINE Freaked is normal, do you feel threatened? PONYTAIL ...Not really.   It’s just weird. LORRAINE (gentle) Come here for a sec --  13. CONTINUED: (CONTINUED) Lorraine moves up to the edge of the stage, joining the girl who does the same. LORRAINE (cont’d) Give me your hands. The girl offers them to her.   Lorraine takes hold, then closes her eyes.   A moment later -- LORRAINE (cont’d) The bed you sleep in, belonged to your Grandmother, didn’t it? PONYTAIL (amazed)  Yeah.  LORRAINE And you were very close before she died. Ponytail is getting blown away -- PONYTAIL She raised me. Lorraine opens her eyes -- LORRAINE It’s her. Ponytail’s eyes well as she tries to contain her emotions. LORRAINE (cont’d) You need to let her know that you’re okay so she can move on. She still worries about you. PONYTAIL How do I do that? With a gentle smile... LORRAINE Next time you have ",
      "dialogue_count": 0,
      "word_count": 1226
    },
    {
      "scene_number": 3,
      "slugline": "EXT. GARDEN - NIGHT A full moon spotlights THE SCARECROW like it’s standing center stage.   It’s now surrounded by a FULLY FLOURISHING GARDEN; tall rows of corn stalks, bright yellow squash, red tomatoes and beans. DISSOLVE TO: INT. HOUSE - UPSTAIRS HALLWAY - SAME It’s late.   Carolyn has a basket of laundry tucked under her arm as she heads down the hallway toward her room at the end. She stops at the closed bathroom door which has a phone cord running across the floor from Cindy’s room into it. CINDY O.C. ... School basically sucks, there’s no cute guys... and there’s so many friggin bugs... Carolyn just sighs as she opens the door.   Sees Cindy standing in front of a mirror, phone to ear, comparing two different colors of eye shadow, closing one eye at a time -- CAROLYN Bed.   Five minutes. She closes the door. CUT TO: INT. ANDREA’S ROOM - SAME Paper butterflies adorn her walls.   Stuffed animals line a small shelf above a vanity mirror and dresser.   An Easy Bake oven and Barbie play-set are lined up neatly against a wall. Andrea is under her covers in a frilly four posted bed, head propped slightly by a pillow as she reads a book.   A lamp on a nightstand next to her cascades a four foot radius of light. Her body tightens as she catches a quick glimpse of something furry jumping onto her bed, but her book has obscured a full view -- -- she slowly lowers it to get a better look -- finds the cat she saw earlier standing on the foot of her bed. It’s looking right at her. ANDREA How’d you get in here? As she sits upright, the cat scurries off the bed and out of her room into the hallway --  17. (CONTINUED)",
      "characters": [
        "CINDY O.C."
      ],
      "action_text": "Andrea scrambles out from under the covers and quickly follows.   She looks out her door in time to see the cat slip into Cindy’s room just down the hall. INT. HALLWAY - CONTINUOUS As Andrea moves to Cindy’s room, she can hear her sister still talking on the phone in the bathroom.   Her mom is folding clothes on the bed in the master bedroom at the end, unaware of her presence. INT. CINDY’S ROOM - RIGHT AFTER Andrea stands in the doorway looking to see where the cat went.   Her face is hit by a PURPLE HUE cascading from a BLACKLIGHT hanging above a bed; posters of The Jackson Five, peace signs and Alice in Wonderland, all glow from the light.   Scattered clothes litter the floor.   The bed’s unmade. Andrea can’t see the cat anywhere, then she hears it  HISSING   from under the bed. ANDREA What’s wrong, Kitty? Andrea comes into the room and over to the bed. She kneels.   As she looks underneath, her eyes immediately fall upon a Raggedy Anne doll -- seemingly staring at her -- scares her slightly.   The hissing starts up again, but she can’t see where the cat is as her vision is obscured by other dolls stuffed under the bed. She reaches in and moves a couple aside -- sees the cat, but her breath gets caught in her throat -- -- the blacklight has made its eyes look wild, almost demonic as it stares at something that’s seemingly right behind her.   She snaps a look back over her shoulder, but nothing’s there. The cat suddenly bolts right past her -- the movement startling Andrea, who instinctively recoils.   She watches the cat slip through a partially opened closet door into the darkness beyond. As she gets to her feet, Carolyn appears in the doorway. CAROLYN Hey, you’re supposed to be asleep. ANDREA I saw that cat again, it went into the closet. Andrea heads to it.   A very curious Carolyn flips a light switch on the wall as she enters --  18. CONTINUED: (CONTINUED) CAROLYN Really...? She joins Andrea at the closet.   Opens the door wider. Carolyn reaches overhead and",
      "dialogue_count": 1,
      "word_count": 2522
    },
    {
      "scene_number": 4,
      "slugline": "INT. WARREN HOUSE - KITCHEN - LATER Ed reaches for a phone hanging on the kitchen wall.   As he dials a number, he smiles when he sees a photo of Judy on the counter next to him.   It’s framed in Fudgesicle sticks, and made to look like a church with a cross. Scribbled along the bottom is, “I love you, daddy”. CUT TO: WOMAN’S VOICE (V.O.) Father Jordan -- Ed Warren is on the phone for you. INT. CATHEDRAL OF THE HOLY CROSS - OFFICE - SAME Walking into an opulent office full of antique furniture and religious icons, is FATHER JORDON (late thirties). He takes a seat in a chair, then picks up a phone on his desk. FATHER JORDON Hey Ed -- how’d it go? ED (V.O.) The house was empty -- FATHER JORDON That’s good news.   I appreciate your help. ED (V.O.) You bet. (beat) Was your father any better today? FATHER JORDON Yeah -- we actually got him up and walking around.   I think he’s going to be fine.   Thanks for asking. CUT TO: INT. JUDY’S ROOM - NIGHT Lorraine and Judy, who’s now wearing pajamas, sit on the edge of the bed as Lorraine finishes braiding Judy’s hair. JUDY Grandma really snores. Lorraine chuckles. LORRAINE C’mon, let’s get you into bed. Lorraine stands and lifts the covers.   Judy slides in under them.  27. (CONTINUED)",
      "characters": [
        "LORRAINE"
      ],
      "action_text": "ROGER Fucking Florida.   Two week turn arounds.   I start tomorrow. She’s shocked that he just cussed in front of the kids. DISSOLVE TO: INT. HOUSE - BEDROOM - LATER THAT NIGHT Andrea is in bed, sound asleep.   Pouring rain pelts against her window -- her eyes snap open.   She finds herself facing the grey cat back on her bed -- its ears drawn back, HISSING through exposed fangs -- ready for a fight -- it’s eyes slowly tracking something moving just behind her. Andrea’s peripheral vision suddenly picks up the OUTLINES OF TWO HANDS with only THREE FINGERS ON EACH pressing out from within her pillow case, folding her pillow up on the sides, closing in on her face -- The cat HISSES, then leaps to the floor. CUT TO: INT. PERRON HOME - MASTER BEDROOM - SAME Carolyn and Roger are rattled from a dead sleep by Andrea’s blood curdling scream -- both scramble out of the covers to get to her. SMASH CUT TO: INT. ANDREA’S ROOM - RIGHT AFTER Roger’s to the doorway first.   Looks in to see the bed’s empty.   Eyes shift looking for his girl, but areas of the room are swallowed in darkness. ROGER Andrea...? Carolyn joins him.   Roger hits the switch on the wall, shedding light on Andrea, who’s curled up in a corner, hyperventilating with fear.   The tears are flowing as she stares at her bed. TIME CUT TO: HALLWAY - LATER Roger is pissed as he faces Carolyn just outside their bedroom, where Andrea can be seen tucked into their bed, now sleeping. Carolyn’s an emotional wreck.   Wipes tears with a tissue. Both speak in hushed tones --  29. CONTINUED: (CONTINUED) ROGER Demons peering in through windows, cold spots, doors rattling, voices -- everyone was fine until you started putting all this scared, city-girl bullshit in their heads. CAROLYN No I haven’t -- there’s something wrong with this place. ROGER Then how come I haven’t seen it? CAROLYN I don’t know. (pleading) I’m scared to death, Roger.   We need to get someone out here, a priest or someone. ROGER To do what? CAROLYN I have no",
      "dialogue_count": 1,
      "word_count": 995
    },
    {
      "scene_number": 5,
      "slugline": "INT. DOWNSTAIRS HALLWAY - CONTINUOUS Just as Roger comes into the hallway -- HE SEES the kitchen door closing shut.   As he moves toward it -- it starts to BANG against the door jam in bursts of three. Bangbangbang.   Bangbangbang.   Roger’s mind is racing -- what the hell? The banging stops the minute he gets to the door.   The house falls into an awful silence.   He opens the kitchen door -- -- looks inside.   A night-light cascading from a socket next to the sink, kicks out enough glow to see that no one’s in there.   A soft breeze coming in through the kitchen window caresses the curtains.   His mind settles -- that must’ve been it. DISSOLVE TO: EXT. BARN - DAY Roger is pulling out in his big rig.   Carolyn is standing outside the house, wrapped in a sweater.   She looks soul weary as she watches him drive off. DISSOLVE TO: INT. CINDY’S ROOM - NIGHT Cindy’s listening to some music as she sits on her bed, doing homework.   Her bedroom door opens and her mom pokes her head in. CAROLYN How’s the homework going? CINDY It’s going. CAROLYN Andrea and I are going to bed. CINDY I’ll be in, in a little bit. DISSOLVE TO: LATER. Just as Cindy finishes her homework, her bedroom door begins to make a soft, repetitive bangbangbang noise -- like something’s pushing against it from the other side. CINDY (softly) Mom...? No response.  31. (CONTINUED)",
      "characters": [
        "ANDREA"
      ],
      "action_text": "Keeping her eyes on the door, Cindy slides out of bed. Moves toward it as the bangbangbang continues, the soft impact barely rattling the door.   She hits the brakes when she sees a shadow of something appear in the gap between the base of the door and the floor. Cindy digs deep for courage, then continues toward it. She’s a foot away and the banging suddenly stops.   She waits in silence, listening... that’s when -- -- the door slowly opens on its own.   Cindy takes a cautionary step backwards, but -- -- nothing’s there.   She takes reluctant steps up to the door jamb and cranes her head both directions in the hallway for a look.   All clear.   She sees that her mom’s door is open a couple of inches. INT. HALLWAY - CONTINUOUS Two steps into the hallway, Cindy pauses momentarily -- reacting to some sort of foul smell.   She then moves forward, and as she’s about to step into her mom’s room -- she stops mid-stride -- her face goes taut -- -- standing next to the bed is AN APPARITION of a woman; dark matted hair, white white skin -- her body awkwardly hunched forward over Carolyn and Andrea, who are sleeping, completely unaware of her presence. The Apparition slowly cranes her head toward Cindy. Stares at her with pupil-less, snow-white eyes.   She suddenly surges toward Cindy lightning fast, passing right through her body, and vanishes. Off Cindy’s scream -- SMASH CUT TO: EXT. CATHOLIC CHURCH - FRONT LAWN - HARRISVILLE - DAY Simple white structure with a steeple. FATHER THORNTON; late 20’s, is getting ready to take down letters from a small, glass encased marquee posted into the ground that says: A CHURCH IS A GIFT FROM GOD...ASSEMBLY REQUIRED. CAROLYN O.C. Excuse me, Father Thorton? He looks over to see Carolyn approaching -- CUT TO: EXT. CHURCH GROUNDS - RIGHT AFTER Father Thorton and Carolyn share a table under the shade of a large willow.  32. CONTINUED: (CONTINUED) FATHER THORTON -- It sounds to me that it’s far beyond just needing a blessing. Let me make a call",
      "dialogue_count": 1,
      "word_count": 3447
    },
    {
      "scene_number": 6,
      "slugline": "INT. MOTEL ROOM - NIGHT Lorraine is sitting on the edge of a queen-size bed, the cradle of a dial phone to her ear, listening.   She makes eye contact with Ed, who enters from outside, carrying a small suitcase and the cardboard box with the tape recorder and kitchen clock inside. LORRAINE Well that’s very nice of grandma... seeing as it’s so far past your bed time and you have school tomorrow. Ed grins, places the box and suitcase on a dresser. LORRAINE (cont’d) Yes honey, daddy’s right here. (listens) I love you too. She holds out the phone for Ed, who takes a seat next to her -- mouths “she promised”.   Ed seems somewhat amused -- ED Hi pumpkin, what’cha doing up so late? While he listens -- ED (cont’d) Oh, Tennessee Tuxedo was on? TIME CUT TO: INT. MOTEL - BATHROOM - LATER CU on Lorraine soaking in the tub filled with bubbles -- her eyes are closed. Widen.   We see that her head is tilted back on Ed’s chest, who is soaking with her, stroking her arms.   Steam rises. ED You seem kinda quiet, you okay? LORRAINE It’s just hitting close to home. Andrea reminds me so much of Judy. ED I know.   We’ll get it fixed. DISSOLVE TO: INT. MOTEL ROOM - LATER Lorraine exits the bathroom, donning a robe.   She’s towel drying her hair.  46. (CONTINUED)",
      "characters": [],
      "action_text": "Doesn’t like the look she gets from Ed, who is clad in a pair of pajama bottoms, sitting on the edge of the bed with the tape recorder in his hands. LORRAINE What’s wrong? ED Carolyn’s voice didn’t record. Listen. He hits play -- WE HEAR: ED (V.O.)(cont’d) My name’s Ed Warren.   It’s November 1st, 1972.   I’m sitting here with Carolyn Perron who, with her family, has been experiencing supernatural occurrences -- okay, go ahead. A long silence follows -- ED (V.O. (cont’d) And what happened after that? Another long silence.   Ed clicks it off, looks to Lorraine -- not sure what to make of it. CUT TO: INT. PERRON HOUSE - STAIRCASE - NIGHT Cindy is heading up the staircase with a glass of milk in hand when water slowly cascades down from the stairs above her and slowly caresses her feet before moving on down to the next stair.   She looks up   -- -- eyes go wide.   Standing on a stair, several up from her, is a YOUNG BOY (12), soaking wet, dressed in vintage clothing.   His skin is stark white and rotting in places, and he has a non-stop flow of water dribbling out his mouth. Cindy drops the glass -- it shatters.   She screams.   A second later, a very concerned Carolyn shows up at the top of the stairs.   Cindy can barely get the words out -- CINDY There was a boy standing right there -- She points to where she saw him -- he’s gone, but the water is still present and dripping down the stairs. DISSOLVE TO:  47. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 497
    },
    {
      "scene_number": 7,
      "slugline": "INT. MOTEL ROOM - NIGHT A night light flowing out from the open bathroom door casts a light glow over Ed and Lorraine, who are sound asleep in the bed. O.C. A SOFT CLICK -- then WE HEAR the tape recorder kicking on by itself. ED (V.O.) My name’s Ed Warren.   It’s November first, 1972. The sound of Ed’s voice is LOUD, snapping Ed and Lorraine out of their sleep, unbelieving.   Both sets of eyes target the tape recorder sitting on a small table near the foot of their bed. ED (V.O. I’m sitting here with Carolyn Perron who, with her family, has been experiencing supernatural occurrences -- okay, go ahead. Where as this part of the tape was blank earlier -- it’s now filled with an INDISCERNIBLE, HAUNTING WHISPER that sounds female -- it continues, until -- ED (V.O.) What happened after that? The tape recorder then suddenly SHUTS OFF -- LORRAINE Ed, the clock. He looks where her gaze is locked -- she’s staring at the Perron clock next to the recorder.   The time on it reads 5:15.   They look at it, transfixed.   It never moves to: 5:16. DISSOLVE TO: EXT. MAIN STREET - HARRISVILLE - DAY Small town.   Stores and businesses line both sides of the street.   Light traffic. Ed and Lorraine are driving through.   They pass the Catholic church.   The marquee in front reads: LET GOD GIVE YOU A GREAT DAY. Ed continues for another block, then pulls over, coming to a stop in front of MATHEWS DRY GOODS store.   It’s simple, with two large windows, separated by an entrance. A second story sits above it. CUT TO:  48.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 274
    },
    {
      "scene_number": 8,
      "slugline": "INT. MATHEWS DRY GOODS STORE - RIGHT AFTER S.O. of a bell that rings when Ed and Lorraine enter the store.   Inside is filled with a potpourri of dry goods. SHANNON MATHEWS, a woman in her late 30’s, and a teenage girl are behind a long counter that stretches from the front of the store to a set of steps leading upstairs in the back.   A lava lamp sits next to a register. Shannon’s busy cutting a piece of fabric for a customer when she looks up. SHANNON Ed and Lorraine? They both smile. ED Thanks for seeing us. Shannon looks to the teenage girl next to her -- SHANNON Maddy, finish cutting this for Mrs. Doornbos, will ya? Maddy nods that she will, and although she takes the scissors from Shannon, her eyes never leave Ed and Lorraine -- neither are sure what it’s all about. Shannon looks to Ed and Lorraine -- SHANNON (cont’d) Why don’t you follow me. She grabs a large coffee mug off the counter and heads to a set of stairs in the back of the store.   Ed and Lorraine follow. SHANNON (cont’d) You gotta ignore my niece, she goes to school with the Perron girls -- she’s heard about what’s been happening out there. INT. STORE - STAIRS - CONTINUOUS As they head up -- SHANNON Before the Perron’s bought it, that place had been empty for as long as I can remember. (beat) Please excuse the mess up here, my Nana’s been the Historian for almost sixty years, and when she got Parkinson's, things just sort of -- well, you can imagine.  49.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 272
    },
    {
      "scene_number": 9,
      "slugline": "INT. MATHEWS DRY GOOD’S - UPSTAIRS - CONTINUOUS They come up off the last stair into a large, disheveled looking room packed with stacks of books, filing cabinets, piles of old newspapers and photos -- SHANNON I took over the job, but haven’t had much time to put into it. Shannon heads over to a nearby table that stands in the middle of the room, where pictures, maps, journals and other documents are piled in two large boxes. SHANNON (cont’d) I pulled everything together for you I could find, but there’s some stretches of time missing.   I’ll keep looking and send you anything else I might find. DISSOLVE TO: INT. PERRON HOUSE - MASTER BEDROOM - NIGHT Carolyn is getting ready for bed.   There’s a flare in the window from headlights coming down the driveway.   She moves to the window and looks out -- -- it’s Roger returning in the rig. CUT TO: INT. KITCHEN - SOON AFTER Roger looks clearly irritated as he reaches for a bottle of scotch in a cabinet.   Carolyn is leaning against the counter, arms folded, trying to stay strong. ROGER I can’t believe you did this behind my back. CAROLYN We have to do something.   It’s getting worse. ROGER I told you I didn’t want anymore of this bullshit. CAROLYN They said you haven’t seen anything because it wants to create   “this”,   this conflict between us. Roger half laughs to himself as he uncorks the bottle. ROGER Of course they did.  50. (CONTINUED)",
      "characters": [
        "LORRAINE"
      ],
      "action_text": "He pours a stiff one. ROGER (cont’d) And how much are they charging for this little investigation? CAROLYN Nothing. She moves over to Roger and takes his hands in hers before he can lift the glass to his mouth -- CAROLYN (cont’d) I’m scared to death and so are the girls -- and I hate what it’s doing to us. She looks at him eye to eye -- CAROLYN (cont’d) Please Roger.   For me --   please . DISSOLVE TO: INT. WARREN HOUSE - KITCHEN - EARLY MORNING Ed enters, looking half asleep.   Goes to the coffee pot -- LORRAINE O.C. You’re gonna have to make some more. Ed looks to an alcove off the kitchen, spotting Lorraine, who has all the info they got from the Historian spread out on a small desk.   She’s holding a hand written journal. ED How long have you been up? LORRAINE Since four -- couldn’t sleep. She looks at him -- there’s an intensity in her eyes. LORRAINE (cont’d) It’s no wonder that family is going through what they are. TIME CUT TO: An old, very weathered photograph of the Perron farm house. Widen - we see that Ed is holding the picture, a pile of others are next to him.   He nurses a cup of coffee.  51. CONTINUED: (CONTINUED) Lorraine then slides over an old black and white photograph of an obese woman sitting in a wicker chair, flanked by a boy (wears glasses) and a girl, who both look about ten. LORRAINE And that woman I saw in the basement who shot herself -- I think it’s this woman who lived there in the thirties -- last name is Walker.   She had two children who mysteriously disappeared in the woods -- it’s probably why she killed herself.   I’m assuming those are them -- ED Wow -- LORRAINE And I’m not done.   What was the original five hundred acre farm, has been divided, and sold off -- She unfurls an old map next to her.   Points to a spot. LORRAINE (cont’d) There was a boy who drowned in this pond -- he lived in a house over here. Her finger slides across the map to another location close by -- LORRAINE (cont’d) And a hunter who died in the woods -- he l",
      "dialogue_count": 1,
      "word_count": 904
    },
    {
      "scene_number": 10,
      "slugline": "EXT. RHODE ISLAND - TWO LANE ROAD - SUNSET Ariel pov - of the Warren’s Plymouth as it slaloms its way along a country road illuminated by a brilliant sunset. It turns off onto the Perron’s driveway.   Parks by the house. CUT TO: EXT. PERRON HOUSE - DRIVEWAY - SAME Ed and Lorraine get out of their car with BRUCE LEVY (30).   Clean cut, wears khakis.   Gym built muscles gives his shirt a tight fit. They move around the back of their car. Ed opens the trunk.   Inside are four large bags of groceries, a cardboard box, which now holds Ed’s tape recorder, the Perron’s clock, a bible, a camera case, some note pads, and dozens of film canisters. Bruce takes a beat, looking around. BRUCE Nice place. Lorraine’s attention is drawn to Jerome’s VW van turning onto the driveway and heading toward the house. LORRAINE Good, Jerome’s here. Jerome drives up right next to them and parks.   Climbs out.   He’s munching on a large cookie.   Smiles to them -- JEROME I forgot how bitchin’ Rhode Island is. He notices Bruce -- LORRAINE Jerome, this is Bruce Levy. JEROME Oh, the cop -- nice to meet you, man. As they shake hands. JEROME (cont’d) I heard you’re not much of a believer. BRUCE You might say that.  54. (CONTINUED)",
      "characters": [],
      "action_text": "JEROME You know you can’t shoot ghosts, right? ED Easy on him, Jerome.   C’mon, let’s get unloaded. CUT TO: EXT. PERRON HOUSE - FRONT DOOR - RIGHT AFTER A troubled looking Carolyn has the door open as Jerome, Ed and Bruce pile in, each loaded with monitors, VCRs, gauges, and various pieces of camera equipment, etc. Lorraine follows, carrying a box. Cindy and Andrea are looking down from the landing upstairs. ED We’d like to do the main set up in the living room if that’s okay? CAROLYN Yes, of course -- ED This is Jerome, and Officer Levy. BRUCE Bruce is fine. The guys nod hellos and move on just as Roger enters from the kitchen. CAROLYN Ed and Lorraine, this is my husband, Roger. Even though Ed sees the doubt in Roger’s eyes -- ED I hope we can help you out here. ROGER  Yeah   -- me too. (to Carolyn) I’ll be in the barn. Roger heads out front as Ed continues into the living room with Jerome and Bruce. Lorraine looks to Carolyn -- sincere. LORRAINE How are you holding up? Sees she’s not. CUT TO:  55. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 411
    },
    {
      "scene_number": 11,
      "slugline": "INT. KITCHEN - RIGHT AFTER Lorraine is standing against the counter, listening to Carolyn -- CAROLYN ...Water was just pouring out of his mouth. LORRAINE This is good -- Off Carolyn’s surprised look -- LORRAINE (cont’d) We want the activity.   It gives us the proof we need. All Carolyn can do is manage a slow, reluctant nod of approval.   Silent tears begin to cascade down her cheeks. Bruce enters, carrying the bags of groceries, interrupting the moment -- isn’t quite sure what to do. Lorraine nods to the kitchen table, which has two baskets of folded laundry sitting on it. LORRAINE (cont’d) Why don’t you just put them over there. He does.   Leaves.   Carolyn looks over to the groceries -- CAROLYN -- You didn’t have to do that. LORRAINE Are you kidding me?   Jerome will eat you out of house and home, believe me, it’s the least we can do. Carolyn manages a slight smile. LORRAINE (cont’d) (re; folded clothing) Those have to go upstairs? DISSOLVE TO: INT. BARN - DAY The door opens.   A column of outside light slides in, barely stretching to the Chevy pickup in the back.   Roger comes in.   As he reaches for a wall switch -- CUT TO:  56. (CONTINUED)",
      "characters": [
        "ANDREA",
        "ED"
      ],
      "action_text": "Camera’s pov - over his shoulder toward the truck.   We’d swear there was the silhouette of a woman sitting inside, seemingly looking at Roger, but the second the light comes on, it illuminates a vacant interior. Resume - Roger heads over to the truck. DISSOLVE TO: EXT. HOUSE - LATER Ed comes out of the house carrying a tripod and a 35mm camera.   Heads for the barn.   Bruce exits a few beats behind him, un-spooling cable. CUT TO: INT. BARN - RIGHT AFTER Roger has a jack positioned toward the front of the pickup and is working one end of a tire wrench to crank it up off the floor.   There’s a small toolbox next to the jack. ED O.C. Nice ride.   Fifty-five? Roger looks back over his shoulder to see Ed coming in. ROGER Six. ED Two-eighty-three small block? ROGER (impressed) You know trucks. Roger finishes jacking up the truck.   He flips the “safety” lever into the lock position on the jack. ED My dad had a side-step with the big back window.   Every Saturday, we were working on her. (beat) What’re you doing? ROGER Just repacking the bearings. Bruce enters, continues un-spooling the cable as he approaches Ed. ED Well -- don’t mind us, we’ll only be a few minutes.  57. CONTINUED: (CONTINUED) ROGER Knock yourself out. Roger starts to unscrew the lugs. Ed mounts the camera onto the tripod.   Takes the other end of the cable from Bruce and plugs into the side of the camera. ED Did Jerome give you the EFD? BRUCE If that’s what this is -- He extracts a small hand-held meter from his pocket. Hands it to him. BRUCE (cont’d) What’s it do? As Ed begins to hook it up -- ED When there’s an energy present, the needle on it will begin to fluctuate, usually between 1.7 and 3 mega-hertz, and that triggers the camera to start shooting. Roger looks over to him as he pulls the tire off.   Sets it down. ROGER And you’ve actually caught things on film? ED Well yeah -- that’s the point. Roger, quietly amused, focuses back on the truck. Notices oil dripping from the drain pain.   Rolls onto",
      "dialogue_count": 3,
      "word_count": 2897
    },
    {
      "scene_number": 12,
      "slugline": "INT. PERRON STATION WAGON - PERRON DRIVEWAY - NIGHT Roger drives up to the house, has the girls with him. His headlights drag over the Warren’s parked car. He pulls to a stop.   As he and the kids get out, he notices the barn door is open.   Light on.   He heads for it as the girls continue to the house. CUT TO: INT. BARN - RIGHT AFTER Roger walks in to find Ed working on the pickup.   The front’s been jacked back up.   There are two pieces of firewood lodged under the front axle for extra stability. He’s up to his elbows in grease as he packs the bearings. ED I noticed you didn’t finish the bearings.   Hope you don’t mind -- just looking for something to do. ROGER Not at all. ED Got anymore more grease? ROGER Yeah. Roger walks over to the work bench.   Opens a cabinet above it and grabs a can from a shelf.   Pops it open as he heads over to Ed and hands it to him. ED Thanks. Roger grabs a nearby wooden crate.   Takes a seat on it. Watches Ed work. ROGER Carolyn told me you going to be a priest -- Ed ponders for a moment -- does he want to share this? ED That was the plan -- but when I got to my Ordination, I started having my doubts, and realized I wasn’t going to be good enough, I don’t have the strength they need. So I gave it up. Roger takes a beat. ROGER I could scratch my head ‘til I’m bald and never figure out why you do what you do --  70. (CONTINUED)",
      "characters": [],
      "action_text": "ED Remember as a kid being afraid to hang your hand off the edge of your bed because you thought something underneath was going to grab it? Roger nods somewhat skeptically. ED (cont’d) Well... mine got grabbed. As Ed throws more grease on the bearings -- ED (cont’d) Something yanked me to the floor. It was too dark to see under the bed, but I ran my ass out of that room as fast as I could.   My dad didn’t believe me, so he dragged me back in there and told me I had to face my fears.   I buried myself under the covers, scared to death cause I could still hear it under my bed.   Then I remembered what a nun had told me in catechism, “God will be there for all who need. He is your protector.”   So I grabbed my Davy Crockett knife from my nightstand and got off the bed and told whatever was under there that God was going to kick its ass if it didn’t leave.   I just kept saying it over and over - - and it finally went away.   Never came back. Ed looks back to Roger -- ED (cont’d) It was the best thing my dad ever did for me.   I put my faith in God every day after that, and have been checking under beds ever since. Ed finishes packing the bearings.   Caps it. O.C. They hear the crunch of gravel under car tires. Roger looks out the barn to see Jerome and Bruce pulling up in Jerome’s van. DISSOLVE TO: INT. KITCHEN - LATER Bruce enters, carrying a coffee mug.   Yawns.   A CLOCK ON THE COUNTER reads: 3:10 AM.   He sets the mug on the counter next to a coffee pot, pours himself another cup. Goes to the fridge, and takes out a milk carton from the top shelf, closes the door.  71. CONTINUED: (CONTINUED) Sets it next to his coffee cup on the counter, then turns to a shelf above the sink for the sugar.   As he’s reaching for it -- A LOUD BANG echoes as the fridge door is SLAMMED SHUT. Bruce spins -- looks to it, startled and confused as he’s the only one in the kitchen, then -- -- he sees that the milk carton is no longer next to his coffee cup. A DRIPPING NOISE draws his attenti",
      "dialogue_count": 0,
      "word_count": 1146
    },
    {
      "scene_number": 13,
      "slugline": "INT. LIVING ROOM - CONTINUOUS -- where he joins Carolyn and Roger, who have their eyes glued the MONITOR as the camera keeps strobing through the dark hallway.   Lorraine, Bruce and Jerome come up right behind him -- CAROLYN Oh my God. They look to the monitor showing Cindy’s room.   As she and Andrea sleep peacefully, THEIR BREATHS are FREEZING ON EXHALE. JEROME That’s gotta be one of the fastest temp drops I’ve ever seen. CUT TO: INT. CINDY’S ROOM - SAME The CAMERA IN THE CLOSET starts FLASHING, strobing the room with bursting with white light.   The girls start to stir. Intercut - It’s really hard for Roger to stay still -- Cindy’s eyes pop open -- she sits up.   Freaks as the intermittent light gives her staccato glances of something staring in at her through the window -- -- it’s the beast she saw before as a shadow.   She SCREAMS! Andrea bolts upright in fear, then -- THE LOUD, ECHOING SOUND OF A SLIDE-BOLT CLOSING OVER AND OVER, joins the mayhem -- it’s coming from the closet. Roger can’t stand it -- takes off out of the room -- The SLIDE BOLT NOISE suddenly stops -- along with the FLASHES, casting the room back into darkness. The girls dash out the bedroom door into the hallway just as Roger gets there, both folding into his arms. The CAMERA at the end of the hallway STROBES A FLASH -- the girls scream again, fearful of what they can’t see. INT. HOUSE - STAIRS - SAME Ed is heading up as the camera at the top, pops off another FLASH.   A second later -- -- the CAMERA in the downstairs hallway FLASHES, drawing Ed’s attention back down the stairs.  74. (CONTINUED)",
      "characters": [],
      "action_text": "He waits for more flashes, but nothing happens.   Lorraine steps out of the living room and looks up to him -- ED Whatever it is, it came back down. DISSOLVE TO: INT. MASTER BEDROOM - NIGHT Roger is holding Andrea in his arms, sitting on the edge of the bed, while Carolyn is latched onto Cindy, cuddled on the other side.   He looks to her -- ROGER  Hey...  Her eyes meet his.   He tries to say something, but can’t find the words -- CAROLYN  ...It’s okay.  CUT TO: INT. CINDY’S ROOM - CLOSET - RIGHT AFTER Bruce is filming Jerome, who is holding an EFD out front of him as he slowly moves about the closet.   He pushes clothing aside to get closer to the wall behind.   Ed is at the entrance, unloading film from the camera on the tripod.   Lorraine watches. Jerome pulls the EFD away from the wall -- JEROME I’m not getting anything. Roger joins the group. LORRAINE How are the girls? ROGER Better. Ed looks to Roger. ED They said that bolting noise definitely came from in here? ROGER ... Yeah . ED Is there anything behind this wall? Ed knuckle taps the panel --  75. CONTINUED: (CONTINUED) ROGER No idea. ED Do you mind if we take a look? ROGER I don’t care what the hell you do to it. CUT TO: SOON AFTER Tight on a section of wood paneling being pried back off the wall with a hammer. Widen -- to see Ed sliding the hammer up and down along a panel’s seam to loosen it.   He finally pulls it back off the wall -- Lorraine is the first to see -- -- A SMALL 2’ x 2’ TRAP DOOR framed within another wall that latches from the outside via a SLIDE BOLT -- -- A WOMAN’S VERY OBESE HAND, fingers like sausages, aggressively SLAMS it CLOSED, then SLIDES A LATCH across to lock it. Resume - Lorraine and the others are looking at the trap door. Ed kneels down.   Undoes the latch.   Slowly opens the door.   It’s too dark to see anything beyond. ED Can someone get me a flashlight -- ROGER Yeah, there’s one in our room. Roger disappears for a moment.   Lorraine puts her hand on Ed’s shoulder -- LORRA",
      "dialogue_count": 0,
      "word_count": 734
    },
    {
      "scene_number": 14,
      "slugline": "INT. CRAWL SPACE - CONTINUOUS Lorraine can barely make it out, but sees that the crawl space seems to open up. LORRAINE Looks like there’s some sort of room. Her flashlight suddenly dies -- casting her into total darkness.   She palms it a couple of times -- gets the beam to shine again. As she points the light down the crawl-space ahead -- -- A YOUNG BOY AND GIRL, full of angst and panic, scramble toward Lorraine, PASSING RIGHT THROUGH her body - - it’s the two she saw in the photograph earlier. Resume - Lorraine is slightly startled, but continues into the room ahead. INT. HIDDEN ROOM - CONTINUOUS Lorraine slowly stands, her flashlight quartering the darkness.   Cobwebs everywhere reflect off the light.   It falls upon a makeshift bed with an old, dust covered blanket, which has SLINKY TOY sitting on it.   Lorraine picks it up -- sees a wooden box next to the bed with other toys in it. She lets her light wander, discovering that every wall is completely covered with THE SAME PHRASE scrawled in crayon, over and over.   She moves closer.   Sees what it says; I’M SORRY MOMMY.   I’M SORRY MOMMY.   I’M SORRY MOMMY.   I’M SORRY MOMMY... Lorraine stops -- senses something.   She slowly moves the light off the wall and angles it to her forearm -- IT’S COVERED IN GOOSEBUMPS.   And for a second, her heart skips a beat -- there’s something else she sees -- -- the light cascading past her forearm down to the floor illuminates BATHSHEBA’S DIRTY, CRUSTED BARE FEET, straddling her own -- from behind.   Before Lorraine can turn around -- -- she is aggressively shoved into the wall.   The movement jars the flashlight and slinky from her grasp and drops to the floor. SMASH CUT TO: INT. CLOSET - SAME Ed reacts the noise and immediately heads into the crawl space.  77. (CONTINUED)",
      "characters": [
        "ED"
      ],
      "action_text": "ED Lorraine...? INT. SMALL ROOM - SAME Lorraine is reaching for the flashlight on the floor just as Ed crawls in. LORRAINE I’m alright. (beat) It was her, Ed. She looks hard to him -- definitely impacted. LORRAINE (cont'd) I’ve never felt anything so dark. (beat) We have to get her out of this house -- CUT TO: INT. CLOSET - RIGHT AFTER As Ed and Lorraine come out, Ed looks to Jerome, direct -- ED Grab the cameras -- I want to see what we got. DISSOLVE TO: INT. DOWNSTAIRS BATHROOM - LATER Ed and Jerome’s movements are fast and precise as they are busy converting the bathroom into a small darkroom; a photo enlarger is on the counter with three solution trays lined up next to it.   A small rope has been strung up along a shower rod.   As Jerome pours developer into one of the trays, Ed finishes screwing in a light bulb and flips the wall switch, washing the room deep in crimson. CUT TO: INT. LIVING ROOM - RIGHT AFTER Lorraine is sitting before the monitors, her eyes on the one revealing the master bedroom, where Roger is cuddling Andrea on the bed, who is sound asleep.   Carolyn is next to him, doing the same with Cindy, who is also asleep. Chirping crickets and croaking frogs drift in through an open window next to her.  78. CONTINUED: (CONTINUED) -- A loud THUD pulls her attention outside to where she sees something flopping on the ground by the barn, dust rising -- as if there were some sort of struggle. Bruce walks into the room carrying a cup of steaming coffee. LORRAINE Keep your eyes on the monitors for me, will you.   I’ll be right back. Lorraine heads out of the room. CUT TO: EXT. PERRON HOUSE - RIGHT AFTER Lorraine moves toward the flopping movement, which seems to be slowing with each step she takes.   As she gets to it, the flopping stops.   Sees it’s an enormous barn owl -- neck broken, eyes wide open.   Dead.   A compassionate look sweeps over Lorraine’s face, until she hears -- -- A DISTANT BLEND OF VOICES; pained, fearful, full of anxiety.   She follows",
      "dialogue_count": 1,
      "word_count": 1620
    },
    {
      "scene_number": 15,
      "slugline": "INT. KITCHEN - RIGHT AFTER Ed, Lorraine, Carolyn and Roger are standing at the table, looking at a photograph -- Jerome stands aside, holding two more photos in his hand. LORRAINE He’s the boy I saw in the hidden room. Angle on the photo - although grainy and transparent, it’s definitely the same boy with glasses Lorraine saw, but he’s at the top of the stairs, heading down. JEROME Now check this out. He drops a second picture.   Although it’s the same angle, the boy is now five steps further down the stairs.   He’s got a terrified look on his face as he’s looking back up over his shoulder at something at the top of the stairs. ROGER What’s he looking at? JEROME This -- Jerome drops the third photo from his hand onto the table before them.   The image of the boy is gone, but at the top of the stairs is the dark presence of Bathsheba Sherman -- although grainy and transparent as well, her image is a lot more defined, and what stands out more than anything are -- -- her pupil-less, snow white eyes. LORRAINE It’s her. Roger and Carolyn’s eyes are wide, transfixed. ROGER ...Why would he be frightened of her?   He’s dead. LORRAINE From our perspective, yes.   But from that child’s, she’s as real to him as you are to me. (beat) She may have died a witch, but she’s come back with a strength only Satan can give her -- CUT TO: INT. LIVING ROOM - SAME CU on the mantle where the cross Ed set up, topples with a soft “clink”.  83. (CONTINUED)",
      "characters": [],
      "action_text": "Widen -- A SECOND CROSS set on top of the Grandfather clock, falls onto a rug below with a muffled thud. A THIRD CROSS on the coffee table joins suit.   The noise stirs Bruce, then -- ANDREA O.C. (soft, sleepy)  Cindy, stop it.  His eyes shift to over to her.   Although she’s semi- asleep, she thinks someone’s messing with the back of her hair. Bruce watches in total shock as the back of Andrea’s hair seems to rise up on its own. He slowly grabs his camera to document it. CUT TO: Camera’s pov - as a groggy Andrea reaches behind and irritatingly swats at something that’s not there.   Her long hair continues to rise -- ANDREA I said to stop it. This time, she opens her eyes and sees that no one’s doing it, but -- -- Her hair SNAPS TAUT and she’s aggressively yanked off the chair and onto the floor.   She screams as she begins to get wildly snaked all over the floor -- Although Bruce drops the camera to its side -- it keeps rolling, giving us a side view of Bruce moving over to Andrea and grabbing onto her. Resume - Whatever has hold of Andrea’s hair, is strong enough to keep moving them both as Bruce tries to protect her, enveloping the young girl with his large body, tumbling this way, then that way, when -- -- the two of them are slammed into the coffee table where Bruce takes most of the impact -- pieces of wood go flying. Ed and Lorraine come running in -- Ed joins the fight, struggling to hold Bruce/Andrea in one place -- it isn’t working. The fight continues -- Andrea is wild-eyed, screaming hysterically -- her hair stretched to its limit. Roger comes racing in, then Carolyn, who seems less disturbed -- ROGER  Ohmygod.  84. CONTINUED: (CONTINUED) Bruce and Andrea hit the corner of the sofa, which pushes it four feet across the wood floor -- then they’re immediately dragged once again -- Roger attempts to latch on to them -- the strain on Andrea’s hair looks like it’s going to be pulled out of her scalp, until -- WHOOSH!   A PAIR OF SCISSORS slices right through ",
      "dialogue_count": 0,
      "word_count": 1039
    },
    {
      "scene_number": 16,
      "slugline": "EXT. WOODS - RIGHT AFTER Lorraine makes her way through the woods, literally retracing her steps from before.   As she approaches the clearing, she can see -- -- Carolyn sitting on the wall of the cemetery with her back to her.   Light pierces down through the thick canopy above. LORRAINE Carolyn...? Carolyn doesn’t turn around.   Lorraine slowly approaches. LORRAINE (cont’d) Are you okay? As Lorraine nears, it’s hard to tell if it’s the afternoon light and shadows are playing tricks with her eyes, but it looks like, from the side view, there’s something off about Carolyn’s face -- it almost looks like another woman’s -- Carolyn slowly swivels her head to Lorraine -- which seems normal now, but there’s a distance in her eyes. CAROLYN  Yes...?  LORRAINE What’re you doing here? Lorraine notices that Carolyn is holding the SLINKY she saw in the hidden room. DISSOLVE TO: INT. WARREN’S PLYMOUTH - RIGHT AFTER Ed and Lorraine drive along a country road. LORRAINE She said she just wanted to see it.   And she was holding the slinky I saw in that room. (beat) As far as I’m concerned, the church can’t get there fast enough. DISSOLVE TO: EXT. BOSTON - DAY High camera angle - drops down onto the Warren’s Plymouth as they drive across Bunker Hill Bridge and into downtown Boston.  87. (CONTINUED)",
      "characters": [],
      "action_text": "Camera keeps dropping down.   We’re close enough to see the Plymouth pull curbside to: EXT. CATHEDRAL OF THE HOLY CROSS - BOSTON - CONTINUOUS Ed parks in front of a very large, impressive stone structure with peaked roofs and stained glass.   As Ed and Lorraine get out of the car, THEY HEAR the soft, angelic singing voice of a young boy emanating from the open front doors of the church. They head up the stone steps to the open doors.   The singing continues. CUT TO: INT. CHURCH - RIGHT AFTER Ed and Lorraine enter.   They are dwarfed by its massive size.   The center aisle splits through numerous rows of pews.   Up front, a choir director stands off to the side during a rehearsal, as a young boy sings his heart out. An all boys choir stand silent behind them. Ed dips his fingertips into a bowl sculpted from marble, full of Holy water.   Says a silent prayer, then crosses himself.   Lorraine follows suit. The two of them are approached by Father Jordon.   Greets them with a warm smile. FATHER JORDON Let’s see what you’ve got. DISSOLVE TO: Camera’s skewed pov of - THE LAST FEW SECONDS WITH BRUCE AND ANDREA thrashing about the floor, just as she gets her hair cut by Roger. Wide to see, we’re -- INT. CHURCH - FATHER JORDON’S OFFICE - DAY Ed and Lorraine are sitting down with Father Jordon. Thick curtains are pulled across a paned window.   Father Jordon turns off a projector next to him that’s been throwing the sequence onto a screen set up against a wall.   We see Ed’s tape recorder on the table as well. Ed and Lorraine look to Father Jordon for his response. He seems a little stunned. FATHER JORDON You weren’t kidding -- I’ll get this to the Archbishop right away. DISSOLVE TO:  88. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 532
    },
    {
      "scene_number": 17,
      "slugline": "EXT. WARREN HOUSE - FRONT DOOR - EVENING Ed and Lorraine exit their car.   Judy comes out the front door and Lorraine runs to her, swooping her up in her arms.   Ed’s mom is in the background. DISSOLVE TO: SUPERIMPOSE: SIX DAYS LATER INT. DINER - DAY Lunch crowd.   Don McLean’s “American Pie” plays in the b.g. as Cindy and Andrea are sitting on bar stools at a linoleum counter, picking through lunch. Out of ear shot, and seated at a booth opposite the counter, is Roger.   He’s with Ed and Lorraine, and looks stressed out. ROGER But you said it’d only take a couple of days. ED We don’t know why it’s taking so long.   Father Jordon says that the Vatican keeps telling him to be patient, but I’m driving to New York tomorrow to see if Father Langston can find out what’s going on.   He’s a high level Cardinal we’ve worked with before -- and knows the Archbishop pretty well. ROGER I’m just so worried about Carolyn. I think all the stress has been too much.   She’s not herself at all -- hasn’t showered, doesn’t wear makeup, is barely sleeping. And she just disappears for hours at a time. Off their look -- CUT TO: INT. MATHEWS DRY GOOD’S - DAY A set of knitting needles are placed on a counter. Widen - we see it’s a very unkept Carolyn who has placed them there to purchase.   Shannon’s niece, Maddy, is at the cash register, a little uneasy. MADDY Do you need any yarn?  89. (CONTINUED)",
      "characters": [
        "JUDY"
      ],
      "action_text": "Carolyn shakes her head no. DISSOLVE TO: EXT. SAINT PATRICK’S CATHEDRAL - NEW YORK CITY - NEXT DAY A massively impressive structure of stone, stained glass and towering cathedrals. Ed is in a phone booth on the corner, the phone pressed to his ear -- ED Father Langston called the Vatican directly and they told him it   had  been presented by the Archbishop, but there’s some issues. LORRAINE (V.O.) Issues -- what’s that supposed to mean? ED He didn’t know, they wouldn’t elaborate. CUT TO: INT. WARREN HOUSE - KITCHEN - SAME Lorraine’s sitting at the desk. LORRAINE What’re we going to do? ED (V.O.) I don’t know --   I’m going to hit the road, it’s going to be midnight before I get home as it is. LORRAINE Alright, be safe.   Love you. ED (V.O.) Love you, too. CUT TO: INT. WARREN HOUSE - KITCHEN - LATER The phone rings.   Lorraine enters the kitchen and answers it. LORRAINE Hello? (listens) Hey Jerome --  90. CONTINUED: (CONTINUED) O.C. The doorbell rings. LORRAINE (cont’d) (calling out) Honey, I’m on the phone, can you see who that is? CUT TO: INT. WARREN HOUSE - FOYER - SAME Judy comes down the stairs. JUDY Okay, mom. She continues to the front door.   Opens it to see a UPS DELIVERY MAN standing before in a crisp brown uniform. Holds an over-sized manila envelope. JUDY (cont’d) Hi. UPS Well hi back.   Would you be part of the Warren family? JUDY Yep. UPS Well then, here you go. He hands her a large manila envelope. UPS (cont’d) Have a nice day. JUDY Thanks! He leaves. CUT TO: INT. KITCHEN - RIGHT AFTER Judy walks in -- Lorraine’s still on the phone. LORRAINE -- Ed’s about to lose his mind. Lorraine looks to her -- sees the envelope and reads the return address: it’s from Shannon in Harrisville.   She motions for Judy to put it on the desk, which she does. Judy grabs a small basket off the kitchen counter.   Looks to her mom --  91. CONTINUED: (CONTINUED) Just as she hangs up -- an ear curdling SCREAM from Judy ERUPTS FROM THE HENHOUSE. Lorraine’s body goes tight, then ",
      "dialogue_count": 1,
      "word_count": 1025
    },
    {
      "scene_number": 18,
      "slugline": "INT. WARREN HOUSE - KITCHEN - SOON AFTER Lorraine walks Judy in.   Dumps the slinky in the trash can. DISSOLVE TO: INT. MASTER BEDROOM - NIGHT Lorraine and Judy, who’s now wearing pajamas, sit on the edge of a four posted, chiffon-canopied bed as Lorraine finishes braiding Judy’s hair.   She has calmed down significantly. JUDY Did you call daddy and tell him? LORRAINE He’s on the road honey, I’ll tell him when he gets home. TIME CUT TO: MASTER BEDROOM - LATER A shaft of moonlight piercing through a window, stretches across Lorraine’s face in bed.   Lorraine’s EYES SUDDENLY POP OPEN, startled.   She looks to Judy, who’s talking in her sleep, saying: JUDY  I’m sorry mommy, I’m sorry mommy.  The words chill her to the bone.   She gives Judy a slight nudge -- LORRAINE  Judy.  Judy doesn’t awaken, continues -- JUDY  I’m sorry mommy, I’m --  LORRAINE Honey -- She shakes her harder.   Judy’s words fade as she rolls over, sound asleep. Lorraine slowly sits up, digesting the current event. She gasps -- -- someone is standing in the far corner of the room. -- it looks like Bathsheba Sherman staring right at her, but -- -- it’s not a ghostly image -- IT LOOKS REAL.  94. (CONTINUED)",
      "characters": [
        "ED",
        "LORRAINE"
      ],
      "action_text": "Keeping her eyes on the corner, Lorraine reaches her hand over to turn on the lamp.   Flips the switch -- illuminating the corner, where -- -- there is no woman.   Only a narrow corner cabinet. Lorraine lets out a sigh -- LORRAINE (cont’d) Get a grip, Lorraine. CUT TO: INT. MASTER BATHROOM - RIGHT AFTER Lorraine, now wearing pajamas, finishes washing her face, then exits, turning the light off. INT. MASTER BEDROOM - CONTINUOUS She walks over to the bed where Judy is sound asleep. Crawls under the covers.   As she reaches to turn off the light -- her blood pressure races north -- the SLINKY she threw away is right there. The four posts on her bed begin CREAKING -- she slowly looks up -- -- stretched out upon the canopy, is Bathsheba Sherman -- the contours of her eyes, face and body clearly outlined as she descends closer and closer -- the force of which causing each of the bed posts to strain, bending inward like they’re made of rubber. Lorraine remains paralyzed, unable to move... chilled by the ominous reality of this unholy spirit. Lorraine digs deep and finds some inner strength to get herself moving -- scoops Judy up.   Dashes out through the bedroom doorway just as the door whips closed right behind her. CUT TO: EXT. DENNY’S RESTAURANT - NIGHT Ed comes out with a thermos.   Gets into the car. INT. WARREN’S PLYMOUTH - CONTINUOUS As he sets the thermos down on the passenger seat, his heart skips a beat -- -- The PICTURE OF JUDY dangling from the mirror has changed.  95. CONTINUED: (CONTINUED) The CROSS is now broken and hanging upside down, and Judy’s eyes are white, void of pupils, identical to Bathsheba Sherman’s in the earlier photograph. SMASH CUT TO: INT. DENNY’S RESTAURANT - RIGHT AFTER Ed is using a phone at the front counter -- CUT TO: INT. WARREN HOUSE - SAME Camera slowly moves through the house.   Everything is still.   The only thing we hear is the PHONE RINGING and RINGING -- no one answers. SMASH CUT TO: INT. WARREN’S PLYMOUTH - NIGHT Ed’s hauling ",
      "dialogue_count": 4,
      "word_count": 4779
    }
  ]
}