{
  "slug": "the-wolf-of-wall-street-2013",
  "title": "the wolf of wall street",
  "genre": "drama",
  "format": "film",
  "scenes_count": 25,
  "characters_count": 0,
  "characters": [],
  "total_words": 31324,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. STRATTON OAKMONT III - BULLPEN - DAY   (FEB ‘95) 14   14  Arms akimbo, Jordan stands above the bullpen, a huge open space with tightly packed rows of maple colored desks. JORDAN (V.O.) But most of all, in any country in the world, money can buy you love. Fuck the Beatles. His 300 BROKERS, mostly young men with their jackets off, scream wildly.   They worship him. JORDAN (V.O.) With that in mind, at the tender age of 22, after marrying my girlfriend Teresa-- SCENES 14A - 18 OMITTED 14A   14A  EXT. WALL STREET - DAY   (MAY ‘87) 19   19  An express bus pull up -- its sign reads “Wall Street”.... JORDAN (V.O.) --I headed to the only place that befit my high-minded ambitions... Jordan emerges, kisses TERESA goodbye, then joins a sea of Commuters heading to work. JERRY FOGEL (PRE-LAP) You are lower than fucking pond scum. INT. L.F. ROTHSCHILD - BULLPEN - DAY   (MAY ‘87) 20   20  Computers, telephones everywhere.   At their desks, 45 shirt-sleeved BROKERS read their Wall St. Journals, readying for war.   Like an eager puppy, Jordan follows broker JERRY FOGEL, 30, thick-lipped and bow-tied... JERRY FOGEL You got a problem with that? (reads name tag) Jordan? JORDAN Nope.   No problem at all.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   6. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "JERRY FOGEL Your job is ‘connector’, which means you'll be dialing the phone over 500 times a day, trying to ‘connect’ me with business owners. And till you pass your Series 7, that’s all you’ll be doing.   Sit. Jordan takes a seat at the desk next to Fogel’s. JERRY FOGEL (CONT’D) Just so you know, last year I made over 300k and the other guy you'll be working for made a million. JORDAN (V.O.) A million dollars?   I could only imagine what a douchebag that guy must be. A manicured hand lands on Jordan’s shoulder.   It’s MARK HANNA, 30s, charismatic, movie-star handsome. MARK HANNA Jordan?   Mark Hanna. (re: Fogel) Good, you’ve met Jerry.   One of the smartest guys in the office .  Who’s ever sucked a dog’s cock out of loneliness. Fogel’s smile turns to a frown.   He hands Jordan a stack of 3x5 index cards. JERRY FOGEL Smile and dial.   And don’t pick your fucking head up till one. MARK HANNA Don’t mind Jerry, his father raped him as a child.   Besides, I'm senior broker here, he's a worthless piker.   I heard you pitched stock at your job interview. JORDAN Had to do something to stand out. MARK HANNA I fuckin’ love that!   Let’s grab lunch later.   Windows good with you? JORDAN Great.   Yeah.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   7. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library Hanna gives him a wink, looks at the clock on the giant electronic stock ticker encircling the room -- 9:30 a.m. MARK HANNA Let’s fuck!! RING!!!   Absolute pandemonium at the BELL signalling the opening of the stock market.   Feet fly off desks; Brokers and their Connectors dial phones like mad.   The CAMERA PUSHES IN on JORDAN, mesmerized as he takes in the ROAR. BROKER #1 (to Broker #2) Miniscribe's a fuckin’ steal! Thirty eight bucks a share! MARK HANNA (into headset) Your broker in West Virginia? What are you buying, a coal mine? It's the 80s, the game is high- tech. BROKER #2 (to Broker #3) Fuckfa",
      "dialogue_count": 0,
      "word_count": 714
    },
    {
      "scene_number": 2,
      "slugline": "INT. WINDOWS ON THE WORLD - DAY   (MAY ‘87) 21   21  CLOSE ON a COKE SPOON whose contents disappear up a nostril.   PULL BACK TO REVEAL... The lunchtime power spot with panoramic views of the city.   At a corner table, a paranoid Jordan looks around as Hanna does another bump of coke.   None of the other DINERS seem to notice or care. MARK HANNA (offering the spoon) Got enough for one more?   Tootski? JORDAN No.   Thanks though. Hanna slips the vial into his pocket as HECTOR, the tuxedoed Maitre’D, approaches. HECTOR Mr. Hanna, what can I bring for you on this glorious afternoon? Hanna surreptitiously palms Hector a $100; Jordan notices. MARK HANNA Here’s the game plan, Hector. Bring   us two Absolut Martinis straight up.   Precisely seven and a half minutes after you deliver those you’ll bring two more, then two more every five minutes until one of us passes out. HECTOR An excellent strategy, sir. JORDAN Actually, I’m good with 7-Up. Jordan might as well have farted at the table. MARK HANNA First day on Wall Street, Hector. Give him time. (Hector offers menus) No thanks, I’m not eating. Hector heads off. JORDAN You can get high during the day and still function?  The Wolf of Wall Street   Buff Revised Pages   3/5/13   9. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "MARK HANNA High is the only way to do this fucking job.   Guy who coined the term “three-martini lunch” was a woman.   Cocaine and hookers, my friend, the keys to success. Jordan smiles, not sure if Hanna is kidding. JORDAN I gotta say, I’m really excited about being part of your team. I wanna do all I can for our clients and -- MARK HANNA (reciting an ad) “Here at L.F. Rothschild, our clients aren’t just important, they’re family.”   Just as long as we get our taste first.   Remember something, Jordan, your top priority in this job: make us  money.   If the clients get rich along the way, bully for them. Got a girlfriend? JORDAN Wife.   She cuts hair. Mark swallows a comment about that.   Gets to business. MARK HANNA OK, first rule of Wall Street. Nobody -- and I don’t care if you’re Warren Buffet or Jimmy Buffet -- nobody knows if a stock’s going up, down or fucking sideways, least of all stock brokers.   But we have to pretend we know.   Make sure you stay relaxed.   Nobody wants to buy something from someone who sounds like they haven’t gotten laid in a month.   Take breaks when you feel stressed, jerk off if you can. You like jerking   off, right? JORDAN Well... sure. MARK HANNA Good, jerking off is key.   And I highly recommend cocaine, which will make you dial faster, which is good for me.   Churn ‘em and burn ‘em, baby.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   10. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library A BUSBOY stops by with a fresh napkin for Mark who thanks him.   Then, discreetly as possible, Mark removes a fresh vial of cocaine tucked within and takes a quick snort. Jordan realizes: that’s why he palmed the maitre d’ $100. JORDAN (V.O.) For the next six months I learned the ways of Wall Street. INT. STRIP CLUB - NIGHT   (OCT ‘87) 22   22  As STRIPPERS grind in b.g, Jordan parties with Mark Hanna and dozens of BROKERS and TRAINEES.   Jordan sips a martini and s",
      "dialogue_count": 0,
      "word_count": 953
    },
    {
      "scene_number": 3,
      "slugline": "INT. INVESTOR’S CENTER - DAY   (DEC ‘87) 27   27  The antithesis of L.F. Rothschild, with cheap furniture and a dozen misfit “BROKERS” giving loud, obnoxious sales pitches.   Jordan enters, a modern man among cave people. DWAYNE, slovenly, 35, with a walrus mustache, looks up. JORDAN I’m looking for Investor’s Center? DWAYNE That’s us, hey.   Dwayne. JORDAN (as they shake hands) Jordan Belfort, I called earlier. I was a broker with Rothschild. Dwayne motions Jordan to a seat.   Nearby, a Broker in ratty Keds, TOBY WELCH, is screaming into his phone. TOBY WELCH I’m tellin’ you, this stock is goin’ up!...   Cause I know, okay?!...   I have inside information! Jordan looks at him, appalled at what he’s hearing. JORDAN Where are your quotrons? DWAYNE No quotrons, we sell off the pink sheets -- penny stocks. Dwayne slides Jordan a large thin book; its pages are literally pink.   He explains as Jordan flips the pages: DWAYNE (CONT’D) Company don’t have enough capital to be listed on NASDAQ, their shares trade here. (points to the book) Like these guys, Aerotyne?   They make radar detectors out of a garage in Dubuque. JORDAN Six cents a share?   Who buys this crap? DWAYNE Schmucks mostly.   Mailmen, plumbers, people thinking they can get rich quick.   They answer our ads, Popular Mechanics, Hustler.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   13. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "JORDAN The spread on these is huge. DWAYNE So’s your commission, that’s the point.   Blue chips stocks you get what, one percent?   Pink sheets are fifty. JORDAN Wait a second.   You’re telling me if I sell two thousand dollars worth of stock, my commission is a thousand bucks? DWAYNE Technically, yeah, but not even the biggest schmuck buys two thousand dollars of this shit. INT. INVESTOR’S CENTER - (LATER THAT) DAY   (DEC ’87) 28   28  As others Brokers bark into phones, Jordan sits, phone cradled in his shoulder, making notes. A few beats, then: JORDAN (into phone) Mr. Fleming, good morning, Jordan Belfort with Investor’s Center in New York City.   You recently responded to one of our ads... A few of the other Brokers glance over, eavesdropping. JORDAN (CONT’D) The reason I’m calling is that an extremely exciting investment opportunity crossed my desk today. Typically our firm recommends no more than five stocks per year: this is one of them... A few more Brokers look over... JORDAN (CONT'D) Aerotyne International is a cutting edge tech firm out of the Midwest, awaiting imminent patent approval on a new generation of radar equipment... LATER.   Now all the Brokers listen in rapt attention.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   14. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library JORDAN (CONT’D) -- so if Aerotyne’s shares rise to only a dollar -- and our research indicates they could go much, much higher -- your profit on a mere three thousand dollar investment would be upwards of fifty thousand...   That’s right, you could pay off your mortgage. Seconds tick by; an eternity, then he starts writing: JORDAN (CONT’D) Four thousand dollars, will that be check or money order?... Thank you, sir. Jordan hangs up, scrawls out a “buy” ticket. JORDAN   (V.O.) (CONT’D) Just like that I made two grand. The other guys looked at me like I’d just discovered fire. Toby Welch and the other cav",
      "dialogue_count": 0,
      "word_count": 694
    },
    {
      "scene_number": 4,
      "slugline": "INT. KACANDES DINER - BAYSIDE - DAY   (JUN ‘88) 30   30  Wearing a suit, Jordan sits in a booth reading the   Wall Street Journal as a WAITRESS serves the food.   DONNIE AZOFF, preppy-looking, 25, with horn-rims and bright white teeth approaches from the takeout counter. DONNIE That your Jag in the lot? JORDAN Yeah. DONNIE Nice ride.   Donnie Azoff. JORDAN Jordan Belfort. DONNIE I’ve seen it around.   We live in the same building.   Twelfth floor? (Jordan nods) What do you do, bro? JORDAN Stock broker. DONNIE Kids furniture, me and my brother- in-law.   Making any money? JORDAN Seventy grand last month. DONNIE Get the fuck out.   You made seventy grand in one month. JORDAN Seventy two actually. Donnie studies him, isn’t sure if he’s full of shit. DONNIE Tell you what.   You show me a pay stub with $72,000 on it, I’m quitting my job right now and coming to work with you. As Jordan retrieves his briefcase to find a paystub --   *  SCENE 30A OMITTED 30A   30A *  As Jordan hands Donnie his paystub and sure enough, it’s 30B   30B *  north of seventy-two k.   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   16. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "DONNIE (CONT’D)   *  Holy shit. Jordan watches as Donnie crosses to a pay phone and dials. JORDAN (V.O.) And he did quit his job, which I thought was a little weird. I mean I had just met this fucking guy. A few beats, then into phone: DONNIE Yo Paulie, it’s Donnie...   Yeah, listen, I quit. Jordan studies Donnie as he continues his conversation... JORDAN (V.O.) There were other things about him too, like his phosphorescent white teeth and the fact that he wore horn rims with clear lenses to look more Waspy.   He also married his first cousin -- SCENE 31 OMITTED 31   31  INT. BAR - DAY   (JUN ‘88) 32   32 *  Jordan sits in mid-conversation with Donnie over beers. DONNIE No problem, if we have a kid who’s a retard, we’ll just leave it on the steps of some institution. And as they continue drinking... JORDAN (V.O.) He was also a closet drug fiend. I’d known him less than a week before he talked me into smoking crack. EXT. BACK OF BAR - DAY   (JUN ‘88) 33   33 *  Jordan and Donnie get high. Donnie holds a flame under a crack pipe.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   17. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library JORDAN (V.O.) The weird thing was when he’d do  crack, his face would contort into this bizarre, frozen mask like the Phantom of the Opera. Donnie does a hit of crack; his jaw twitches, then his facial muscles contort, locking up like a stroke victim. After a few beats, he hands the pipe to Jordan. DONNIE You now, take a hit! Jordan takes a deep hit and holds it.   A beat, then: JORDAN Omigod, I fuckin’ love you!! JORDAN (V.O.) I knew I had to make him my partner. INT. INVESTOR’S CENTER - DAY   (SEP ‘88) 34   34  Jordan looks on as Donnie works the phone like a madman. JORDAN (V.O.) Which turned out to be a great  move - Donnie was a fast learner who transitioned into the penny stock business quickly. EXT. STRATTON OAKMONT I - AUTO SHOP - DAY   (SEP ‘88) 35   35  Jo",
      "dialogue_count": 0,
      "word_count": 2073
    },
    {
      "scene_number": 5,
      "slugline": "INT. STRATTON OAKMONT I - AUTO SHOP BULLPEN - DAY 54   54  Donnie talks on the phone to a Client. DONNIE Let me ask you this, sir -- had I been your broker for the past three to four years and made you money on a consistent basis, you probably wouldn’t say you need to think about it, you’d probably say pick me up three or four thousand shares, am I right? CLIENT #2 (O.S.) Maybe. INT. STRATTON OAKMONT I - AUTO SHOP BULLPEN - DAY 55   55  (APR ‘90) The place is crowded; now 20 Brokers make up the sales force.   Sea Otter pitches a client. SEA OTTER Wait a second.   You mean to tell me if I put you in Union Carbide at 7 and took you out at 32-- INT. STRATTON OAKMONT I - AUTO SHOP BULLPEN - DAY 56   56  (MAY ‘90) Even more crowded, with 30 Brokers. ROBBIE FEINBERG If I put you in Texas Instruments at 11 and took you out at 47-- INT. STRATTON OAKMONT I - AUTO SHOP BULLPEN - DAY 57   57  (JUN ‘90) More Brokers still - now there’s 45. CHESTER MING --Walmart at 16 and took you out at 95, you wouldn’t say Chester pick me up 10,000 shares?   C’mon. CLIENT #3 (O.S.) Well yeah, in that case I would.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   25. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 244
    },
    {
      "scene_number": 6,
      "slugline": "INT. STRATTON OAKMONT II - BULLPEN - DAY (NOV ‘90) 58   58  New offices now, a real brokerage firm.   The bullpen is large, with 75 Brokers at polished maple desks, sitting before computers talking into headsets. DONNIE So the problem is that I don’t have the luxury of a track record. Sir, let me reintroduce myself to you.   My name is Donnie Azoff-- CUT TO: 58A   58A  RUGRAT --Nicky Koskoff--   *  CUT TO: 58B   58B  CHESTER MING Chester Ming-- CUT TO: 58C   58C  PETER DEBLASIO Peter DeBlasio from Stratton Oakmont in New York City-- CUT TO: 58D   58D  TOBY WELCH --and I plan on being the top broker in my firm this year. CUT TO: 58E   58E  SEA OTTER So what about this?   We start small with 500 shares, a cash outlay of $20,000. CUT TO: 58F   58F  KALIL   *  If the stock goes up 10%, will that make you a rich man?   Of course not. CUT TO: 58G   58G  KIMMIE BELZER If if goes down 10%, will it make you a poor man?   No.. CUT TO: 58H   58H  The Wolf of Wall Street   Buff Revised Pages   3/5/13   26. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "CHESTER MING What this trade will do is serve as a benchmark for future business. CUT TO: 58J   58J  PETER DEBLASIO The downside is minimal and the upside is a long-term relationship with a broker on Wall Street who will consistently make you money. CUT TO: 58K   58K  JORDAN Your only regret will be that I didn’t call you six months ago. CUT TO: 58L   58L  CLIENT #1 (O.S.) (to Robbie Feinberg) All right. CUT TO: 58M   58M  CLIENT #2 (O.S.) (to Sea Otter) Give me 300 shares. CUT TO: 58N   58N  CLIENT #3 (O.S.) (to Peter DeBlasio) 1200 shares. CUT TO: 58P   58P  CLIENT #4 (O.S.) (to Jordan) I’ll take 5000 shares. INT. STRATTON OAKMONT II - BULLPEN - DAY   (APR ‘91) 59   59  4PM the place goes nuts as Jordan emerges from his office   *  holding a spread sheet.   He addresses the crowd of 100 BROKERS, which now includes a dozen WOMEN. JORDAN Everybody have a good week? Applause; war whoops.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   27. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library JORDAN (CONT’D) I’d like to read you something. (reads spread sheet) Month end, March 1991!   $28.7 million in gross commissions - all   *  in Stratton issues. Not bad for   *  penny stocks, huh boys? Not bad   *  for dumpin’ penny stocks.   *  The place goes WILD with applause. JORDAN (CONT’D) And to celebrate with a weekly act of debauchery, I have offered our lovely sales assistant Danielle Harrison ten thousand dollars to   *  have her head shaved! Jordan motions to DANIELLE HARRISON, 19, pretty, sitting   *  in a chair nearby.   Behind her, Rugrat uses clippers to shave her thick brown mane.   The place goes nuts. JORDAN (CONT’D) FYI, Danielle tells me she’s using the money for breast implants!   Is this a great company or what?!! More wild applause as Jordan signals across the bullpen to Donnie.   We hear the opening strains of “Stars & Stripes Forever” as he opens the door to a COLLEGE MARCHING BAND ",
      "dialogue_count": 0,
      "word_count": 654
    },
    {
      "scene_number": 7,
      "slugline": "INT. STRATTON OAKMONT II - JORDAN’S OFFICE - DAY 68   68  (SEP ‘91) Jordan finishes up an interview with a FEMALE FORBES REPORTER - ALIYAH FARRAN.   They shake hands, then he smiles for the camera - CLICK! JORDAN (V.O.) A total fucking hatchet job. INT. JORDAN’S MANHATTAN APARTMENT - LIVING ROOM - MORNING 69   69  (OCT ‘91) A gorgeous place; city views.   As Teresa sits nearby, a distraught Jordan paces, holding the copy of Forbes. JORDAN That conniving little twat! (reading) “The Wolf of Wall Street”. TERESA (on the bright side) Your hair looks good. JORDAN “Jordan Belfort, a twisted version of Robin Hood who takes from the rich and gives to himself and his merry band of brokers”. TERESA There’s no such thing as bad publicity, sweetie. INT. STRATTON OAKMONT II - BULLPEN - LATER THAT DAY 70   70  Bustling with activity.   Jordan enters, crosses toward his office.   Off to the side of the bullpen, he notices three dozen YOUNG MEN in business suits.   He approaches his assistant JANET, 20s, dressed all in black. JORDAN The hell’s all this? JANET The Forbes article.   They’re applying for jobs. They spot Jordan, start clamoring, waving their resumes. JOB APPLICANTS Mr. Belfort!   Over here!   Sir!  The Wolf of Wall Street   Buff Revised Pages   3/5/13   29. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "JORDAN (V.O.) Forbes had made me a superstar. Every day dozens of money-crazed kids beat a path to my door with resumes they hadn’t even bothered to spellcheck. Jordan crosses through the packed bullpen, where 150 BROKERS, no older than 22, are crammed elbow to elbow talking into phones.   Some have pets, which they tend to while they work -- iguanas, snakes, turtles, even a chimp.   Others are getting shoulder rubs by Masseuses or being fitted for suits by a TAILOR.   Over the above: JORDAN (V.O.) If we hired ‘em, they dropped out of college overnight and blew whatever allowance they had on a new suit from our in-house tailor. The median age of our brokerage couldn’t get served in the bar down the street. INT. FBI BREAK ROOM - DAY   (OCT ‘91) 71   71  PATRICK DENHAM sits sipping coffee as he reads Forbes. JORDAN (V.O.) Not this guy though -- what the fuck is he even doing here?   He read the Forbes article, too, but he already had a job. INT. STRATTON OAKMONT III - DAY   (MAR ‘92) 72   72  CLOSE ON two BROKERS wrestling while others cheer them on.   PULL BACK to reveal the place from the opening.   300 young Brokers and their hot ASSISTANTS work the phones. JORDAN (V.O.) Within months, we doubled in size, moved to even bigger offices. Two other Brokers pump themselves up, chest-bumping and screaming like football players. JORDAN (V.O.) It was a madhouse, a greed-fest, with equal parts cocaine, testosterone and body fluids.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   30. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "dialogue_count": 0,
      "word_count": 499
    },
    {
      "scene_number": 8,
      "slugline": "INT. STRATTON OAKMONT III - MEN’S ROOM - DAY (MAR ‘92) 73   73  In a stall, two Brokers snort coke, while another Broker fucks a Sales Assistant perched on the sink. JORDAN   (V.O.) I had to declare the office a fuck- free zone between the hours of 9 and 7, but even that didn’t help. Taped to the mirror we see a MEMO -- inside a red circle, two anatomically correct stick figures fuck doggy-style, a red line slashing through them. JORDAN (V.O.) Actually the madness started on our very first day, when one of our brokers, Ben Jenner, christened the elevator by getting a blowjob from a sales assistant. INT. STRATTON OAKMONT III - LOBBY - DAY (JAN ‘92) 74   74  Two dozen Brokers cheer, watching through the rising glass elevator as BEN JENNER, 25, gets a blowjob from a brunette SALES ASSISTANT.   *  JORDAN (V.O.) Her name was Pam and to her credit, she did have an amazing technique, with this wild twist and jerk motion. INT. STRATTON OAKMONT III - JORDAN’S OFFICE - DAY 75   75  (FEB ‘92) As Pam blows Jordan, Donnie fucks her from behind. JORDAN (V.O.) Eventually Ben married her, which was pretty amazing considering she blew every guy in the office. INSERT POLAROID - (JUN ‘92) 75A   75A  A wedding photo of Ben and Pam. JORDAN (V.O.) He got depressed and killed himself three years later.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   31. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "INSERT POLAROID - (JUN ‘95) 75B   75B  A crime scene photo; Ben in his underwear, dead on a bathroom floor, a gun near his head, which oozes blood. JORDAN (V.O.) Anyway, in an attempt to maintain order, I hired my dad Max as defacto CFO and head of the Gestapo. INT. JORDAN’S PARENTS’ APARTMENT - LIVING ROOM - NIGHT 75C   75C  MAX BELFORT sits smoking, watching a rerun of “The Equalizer” on TV.   His wife, LEAH, does needlepoint. JORDAN   (V.O.) We called him Mad Max because of his hair-trigger temper, which could be set off by something as innocuous as a ringing telephone. The phone RINGS. MAX Who the hell has the goddamn gall to call this house on a Tuesday evening!   Goddammit! JORDAN (V.O.) But then the weirdest thing would happen.   Though he’d never been near England, he’d pick up the phone and affect an ever-so-slight British accent. Greatly agitated, Max stomps toward the phone. JORDAN (V.O.) This was his other persona -- the super polite, ever-gracious Sir  Max. MAX (into phone) Hello?...   Yes, Gene, right-eo. Good-good then...   Cheerio. JORDAN (V.O.) It was absolutely bizarre.   He’d hang up... MAX (hangs up phone) Goddamn fucking halfwit!  The Wolf of Wall Street   Buff Revised Pages   3/5/13   32. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library JORDAN (V.O.) And become Mad Max all over again. Max curses a blue streak as he stomps back to his chair. SCENE 76 OMITTED 76   76  INT. STRATTON OAKMONT III - JORDAN’S OFFICE - DAY 77   77  (MAR ‘92) Holding a HEADSHOT of the Dwarf from the opening, Jordan sits talking with Donnie, Robbie and Rugrat. JORDAN What if he gets hurt? ROBBIE   *  He’ll be wearing a helmet.   Plus they’ve got, like, superhuman strength anyway. DONNIE   *  I did hear you're not supposed to   *  make direct eye contact.   If you   *  look at them too long in their   *  eyes they get freaked out - their   *  wires cross.   *  JORDAN   *  I think there’s a limit to how ",
      "dialogue_count": 0,
      "word_count": 3587
    },
    {
      "scene_number": 9,
      "slugline": "INT. NAOMI’S BEDROOM - NIGHT 86   86  Rocky yaps incessantly as Jordan pounds away atop Naomi. JORDAN (V.O.) For eleven seconds. Jordan cums loudly, convulsively. JORDAN I’m sorry, I-- NAOMI Did you cum? JORDAN (nods; gasping) Yeah, but I’m still hard. Jordan looks down at her. JORDAN (V.O.) (CONT’D) Being inside her... was like your cock went to heaven and God himself was cupping your balls. And as they start fucking again... INT. STRATTON OAKMONT III - JORDAN’S OFFICE - DAY 87   87  (JUN ‘92) Jordan sits at his desk, telephone to his ear. JORDAN (V.O.) I couldn’t get enough. INT. NAOMI’S APARTMENT - DAY   (JUN ‘92) 88   88  CLOSE ON Naomi, who talks on the phone, smiling.   We PULL BACK to see the apartment is packed with flowers. JORDAN (V.O.) Every chance we got, we’d sneak off together... INT. LIMOSINE - NIGHT (AUG ‘92) 89   89  Giggling like a child, Jordan pours coke from a vial, creating a little mound atop one of Naomi’s breasts. JORDAN Hold still, don’t move. (to the Driver) Watch the potholes!  The Wolf of Wall Street   Buff Revised Pages   3/5/13   47. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "More giggling, then he snorts the coke off her breast, burying his face in it as he climbs on top of her.   Naomi laughs uncontrollably as the limo glides to a stop.   The door opens from outside -- the Doorman? TERESA (O.S.) Get out of the fucking car. Jordan looks up, locks eyes with Teresa.   He jumps off Naomi, stumbles out, closing the door behind himself. EXT. JORDAN’S MANHATTAN APARTMENT BUILDING - CONTINUOUS 90   90  JORDAN What are you doing home?   TERESA  That whore from the party? How could you do this to me?! The limo takes off.   Teresa starts crying... JORDAN I thought you were at the beach house, I-- TERESA I married you when you had nothing-- JORDAN Teresa... I don’t know what to say. TERESA You’re like a totally different person. JORDAN I’m not.   I’m sorry.   I made a mistake, okay? TERESA Tell me you don’t love her. JORDAN I... TERESA (off his silence) Jordan? Jordan says nothing.   Finally, Teresa starts sobbing. JORDAN (V.O.) I felt horrible. Jordan holds her, letting her cry.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   48. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library JORDAN (V.O.) Three days later I filed for divorce and moved Naomi into the apartment.  INT. JORDAN’S MANHATTAN APARTMENT - DINING ROOM - DUSK 91   91  (SEP ‘92) Completely remodelled, all new furniture.   Jordan and Naomi sit at the table, set for a candle-light dinner. JORDAN (V.O.) Say what you will, but the Duchess did have style.   She brought in a decorator, feng shui’d the place-- she even hired a gay butler. NICHOLAS THE BUTLER, 40s, enters with hot towels on a silver tray. JORDAN Thank you, Nicholas. Jordan takes a towel, wipes his face.   Naomi smiles. JORDAN (V.O.) (CONT’D) He was smart, sophisticated, really great.   Except for that one time... SCENES 92 - 94 OMITTED 92   92 *  INT. JORDAN’S MANHATTAN APARTMENT - LIVING ROOM - NIGHT 95   95 *  A GAY ORGY is in progress, a dozen naked",
      "dialogue_count": 0,
      "word_count": 2521
    },
    {
      "scene_number": 10,
      "slugline": "INT. JORDAN’S ESTATE - MASTER BEDROOM - DAY (FEB ‘95) 116   116  Amid billowing piles of white Chinese silk, Jordan sleeps on his back, snoring blissfully. JORDAN (V.O.) It   was heaven on earth. On screen WE SEE:  18   MONTHS LATER  Splash!   A glass of water hits him in the face. NAOMI Wake up, you bag of shit! Soaking wet, Jordan sits upright to see Naomi standing over him in a tiny pink chemise, holding an empty glass. JORDAN The fuck are you doing?! NAOMI Who’s Venice? JORDAN What?! NAOMI Who is she?!   Some little hooker you fucked last night? JORDAN What?   No!   Naomi! And as Naomi storms off for a re-fill... INT. HOTEL ROOM - THE NIGHT BEFORE   (FEB ‘95) 117   117  Jordan lies on the ground, hands tied with a lit candle   *  up his ass.   *  JORDAN   *  Venice, where are you?   *  VENICE, A Blue Chip Hooker, enters, pulls out a candle   *  and straddles him. She drips wax on his back and pulls   *  his hair.   *  INT. JORDAN’S ESTATE - MASTER BEDROOM - DAY (FEB ‘95) 118   118  Back to scene.   Naomi holds another full glass, rocking back and forth on the balls of her feet like a fighter.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   58. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "NAOMI You were calling her name in your sleep! JORDAN I can explain everything. NAOMI Go ahead.   More lies from the man who lies for a living! JORDAN No, really.   Donnie and me, we’re investing in a condo development in Venice. NAOMI Italy?! JORDAN California, baby. NAOMI Yeah, right. JORDAN Duchess, come on. NAOMI Don’t ‘Duchess’ me, you scumbag. You think I don’t know what you’re up to?   You’re a father now and you act like an infant! Splash!   She nails him again, crosses for more water. JORDAN Fuck. Naomi!   Why are you so mad? NAOMI Where do you want me to start? How about you flying in here on your stupid helicopter at three in the morning waking up Skylar?! EXT. JORDAN’S ESTATE - YARD - NIGHT   (FEB ‘95) 119   119  Jordan crash-lands the helicopter on the driving range.   *  He exits, gives Captain Dave a salute, fights his way   *  through the bushes, then stumbles toward the house and   *  falls into the pool, stoned out of his skull.   Security   *  floodlights come on and the alarm sounds.   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   59. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library NAOMI (O.S.) Does it even matter to you that I just had that driving range sodded with Bermuda grass? INT. JORDAN’S ESTATE - MASTER BEDROOM - DAY (FEB ‘95) 120   120  Back to scene.   Naomi holds another glass of water. NAOMI But why should you give a shit? You're not the one who researched the fucking thing and dealt with the fucking golf course people! JORDAN You’re an aspiring landscape architect?!   But what happened to wine connoisseur?   Oh wait, that was last month! NAOMI Fuck you! Naomi winds up with the water glass.   Jordan stands tall, puffs himself up, arms flexed at his sides. NAOMI (CONT’D) Stop flexing your arms, you look like a fucking imbecile. (re: his crotch) And don’t think that impresses me much. Jordan looks down: he has a morning erection. JORDAN I wasn't flexing ",
      "dialogue_count": 0,
      "word_count": 660
    },
    {
      "scene_number": 11,
      "slugline": "INT. JORDAN’S ESTATE - STEAM SHOWER - DAY 120A   120A  Jordan stands in the steaming shower. JORDAN (V.O.) Next it was a steam so I could sweat out whatever drugs were still in my system. INT. JORDAN’S ESTATE - MASTER BATHROOM - CONTINUOUS 120B   120B  Jordan looks at himself in the mirror.   His eyes are bloodshot - he looks like shit. JORDAN (V.O.) After that I’d assess the damage. Jordan looks at a Visine bottle - “Recommended Dosage - Two Drops”. He squirts six drops in each eye. JORDAN (V.O.) What kind of maniac abuses eye drops? INT. JORDAN’S ESTATE - DRESSING ROOM - DAY (FEB ‘95) 121   121  Fully dressed and standing amid hundreds of suits, Jordan pops two white pills, swigs some juice. JORDAN (V.O.) Then I’d get dressed, take my “back pills” to get me started, then attempt to make up with her. INT. JORDAN’S ESTATE - SKYLAR’S ROOM - DAY (FEB ‘95) 122   122  Jordan enters the tiny pink wonderland.   On the fluffy pink carpet is Naomi, now in a minidress hiked above her hips, Manolo Blahniks showing polished red toes.   Between her legs sits SKYLAR, their 5-month-old daughter. JORDAN Hey, Skylar. NAOMI (little girl voice) Good morning Daddy.   Where’s my kiss? Jordan kisses the baby, picks her up.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   61. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "JORDAN (playing along) Does Daddy get to kiss both his girls? NAOMI Ohhh, no!   Daddy doesn't even get to touch Mommy for a very, very long time. Naomi lays back on her elbows, thighs parted - she’s wearing no panties.   The wind goes out of Jordan. JORDAN C’mon, Nay, please.   You know how sorry I am.   I swear I-- NAOMI (cutting him off) Daddy shouldn’t waste his time. And from now on it's going to be nothing but short, short skirts around the house!   And Mommy’s so sick and tired of wearing panties, uhhh.   In fact she’s decided to throw them all away. (parting her thighs) So take a good look.   You’ll be seeing an awful lot of it around the house, but no touching.  She licks her lips seductively.   Jordan sets Skylar aside, starts grovelling. NAOMI (CONT’D) What’s wrong, Daddy? Naomi slips her index finger in her mouth, starts sucking it.   Jordan can barely speak. JORDAN C’mon, why are you doing this? I said I’m sorry. NAOMI (pouting) Ohhhh poor, poor Dada. He loves to say how wrong he is when he’s ready to come in his own pants. Isn’t that right Dada? Mommy loves Daddy so, so much and there’s nothing she wants to do more right now than to make love to Daddy all day long. Well, I guess it’s time for Daddy to be taught his first lesson.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   62. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library Naomi runs her fingers over her stomach and on to her inner thigh, then up toward her vagina.   Jordan watches transfixed, then a change comes over him... JORDAN I wouldn’t do that if I were you Mommy. I think Mommy should hear a story before she decides to please herself like that. Can Daddy tell Mommy a story? (off her nod) And does mommy promise to keep her legs spread wide, wide open the whole time? (she nods dreamily) Good.   Once upon a time there was a great big mansion in Long Island and the people who lived there had lots and lots of money.   ",
      "dialogue_count": 0,
      "word_count": 2848
    },
    {
      "scene_number": 12,
      "slugline": "INT. FUTURE VIDEO - DAY   (FEB ‘95) 135   135  Barry Kleinman sits at his desk, talking on the phone. BARRY KLEINMAN Jordan, hey.   Listen, I got a subpoena.   The FBI wants a copy of your wedding video. On Jordan.   Uh-oh. JORDAN (V.O.) The F-B-fucking-I? INT. FIRING RANGE - DAY 135A   135A  Wearing goggles and protective headphones, square-jawed FBI Agent Patrick Denham takes target practice. BO DIETL   (V.O.) Name’s Denham, he’s an agent in the New York office. JORDAN (V.O.) What’s his problem? BO DIETL (V.O.) He’s a boy scout, thinks you’re Gordon Gekko. EXT. RAO’S - NIGHT - ESTABLISHING (MAR ‘95) 135B   135B *  INT. RAO’S RESTAURANT - NIGHT (MAR ‘95) 136   136  The East Harlem institution.   Jordan sits across a table over pasta with private investigator BO DIETL, 40s. JORDAN But my goddamn wedding video? BO DIETL Got your whole inner circle in one place, faces and names. He’s hoping it rattles you, or maybe your wife, so that she starts nagging you to turn witness. JORDAN (that’s laughable) What? He wants me to rat on myself?  The Wolf of Wall Street   Buff Revised Pages   3/5/13   72. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "BO DIETL (shrugs) Good news is I made some calls, DEA, Justice?   No one but him even knows who you are. JORDAN Can you bug him or something, tap his phone? BO DIETL Jordan, relax.   First off, you don’t fuck with these guys, not that way.   Secondly, I got a P.I. license, you know? JORDAN Maybe I should call him, see what he wants. BO DIETL No! Anybody does that should be your lawyer. What you do is eat your dinner, drink your drink, and forget about it. Cuz as far as I hear he doesn’t have shit. Jordan nods, wheels turning, pretending to do as told. SCENE 136A OMITTED 136A   136A *  EXT. BATTERY PARK MARINA - DAY (LATE SPRING ‘95) 137   137  As Agent Denham steps into frame, another FED, AGENT   *  HUGHES, beside him, both G-man stoic in impenetrably dark   *  glasses -- JORDAN (O.S.) Patrick? Hey! C’mon aboard! They look up. On the yacht Naomi, Jordan stands waving, drinking wine with two Blue Chip HOOKERS in bikinis. JORDAN (CONT’D) Plank’s right down there. Denham shares a look with his cohort: it’s almost a joke, this display of wealth before a federal agent. Moments later, they step aboard. AGENT DENHAM Mr. Belfort, I’m Agent Denham. This is Agent Hughes.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   73. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library JORDAN Heya! This is Nicole and, um...Heidi. Girls, Patrick and...? AGENT DENHAM Agents Denham and Hughes. Your message said you wanted to speak privately. JORDAN It did. I do. (off Denham’s stare) Oh, they’re just friends. (to the girls) Give us a minute, okay? The Hookers head below deck. Jordan shoots Denham a wink-- check out that ass! JORDAN (CONT’D) Can I get a glass? Got wine open or any kinda booze. Shrimp and lobster’re over there if you’re hungry. AGENT DENHAM Bureau forbids us from drinking at sea. Jordan surprised: the guy has a sense of humor. JORDAN I have something for you, I just gotta find it. Have a seat, will ya?",
      "dialogue_count": 0,
      "word_count": 2126
    },
    {
      "scene_number": 13,
      "slugline": "INT. ZURICH AIRLINES - FIRST CLASS - NIGHT (SUMMER ‘95) 144   144 *  Jordan boards, slurring, drooling, completely wasted. JORDAN (to a Stewardess) Sweetheart!   Look at you ! And as he hugs her, then stumbles toward his seat... INT. ZURICH AIRLINES - FIRST CLASS - DAY (SUMMER ‘95) 145   145 *  Quiet; morning sunlight bleeds through the window. Jordan’s eyes flicker open.   He yawns, looks around, tries to get up; he can’t move.   He looks down, sees six seat belts restraining his arms and legs.   Jordan looks over at Donnie, mouth agape, asleep next to him. JORDAN Donnie.   Donnie, wake up. DONNIE Nuuhh? JORDAN Untie me, shitbag.   You think this is funny? DONNIE I didn’t tie you, the captain did. He almost tasered you. JORDAN Why? FLASHBACK -- 146   146  As PASSENGERS scream, Jordan wildly humps a STEWARDESS, the CAPTAIN struggling to restrain him. JORDAN   (V.O.) This was fucking great.   I hadn’t laundered a dime yet and already I was under arrest. INT. ZURICH AIRLINES - FIRST CLASS - DAY (SUMMER ‘95) 147   147 *  A pensive Jordan sits, mind racing. JORDAN (V.O.) Worse yet was the plastic baggie of ludes that Donnie’d stuffed up his ass.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   81. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "Jordan trades looks with Donnie, who shifts uncomfortably. JORDAN (V.O.) But before he could even get a hemorrhoid-- INT. GENEVA AIRPORT - CUSTOMS OFFICE - DAY 147A   147A *  Jordan sits with two CUSTOMS OFFICERS.   *  JORDAN (V.O.)   *  --the whole thing was quashed by   *  our friend the Swiss banker. Which   *  was lucky for me, since so far I’d   *  been able to keep Agent Fuckface   *  unaware of the trip.   *  Another CUSTOMS OFFICER enters, whispers something to the   *  others.   They shake Jordan’s hand and he leaves.   *  EXT. GENEVA - SHOPPING DISTRICT - DAY (SUMMER ‘95) 148   148  A limo pulls up at an office building.   Jordan emerges with Rugrat and Donnie.   *  INT. BANQUE REAL DE GENEVE - LOBBY - DAY (SUMMER ‘95) 149   149  JEAN-JACQUES SAUREL greets them. 30s, suave. The lobby is ultra-modernist. SAUREL Jordan Belfort!   At last! Nicholas has told me so much. RUGRAT Jordan, Jean-Jacques Saurel. JORDAN Nice to make your acquaintance. This is some lobby you got. SAUREL Ah, yes.   We gave our designer an unlimited budget and he exceeded it.   Come!   You must tell me all about your adventure with the stewardess over coffee! They disappear upstairs. SCENE 150 OMITTED 150   150  The Wolf of Wall Street   Buff Revised Pages   3/5/13   82. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "dialogue_count": 0,
      "word_count": 446
    },
    {
      "scene_number": 14,
      "slugline": "INT. BANQUE REAL DE GENEVE - SAUREL’S OFFICE - DAY 151   151  Jordan, Rugrat and Donnie drink coffee with Saurel and one other SWISS BANKER.   It’s an impressive office, with   *  an enormous fish tank. DONNIE We have a joke in America. “Heaven is a place where the police are Brits, the chefs are Italian, the car mechanics are German, the prostitutes are French and the bankers are Swiss.”   I never got it ‘til now -- look at those fucking fish!   Come here, little guy... SAUREL Yes, we have the same joke here. Only sometimes the English are chauffeurs and the chefs are French.   The Germans, alas, are always mechanics; no one wants to grant them more authority than that. Polite laughter.   Jordan, not as impressed by the fish, cuts straight to the point: JORDAN I'm curious about your bank secrecy laws. SAUREL Excusez-moi, Jordan, Swiss custom requires ten minutes of idle chit- chat before business can be discussed. (a smile) Of course, let’s get “down to it.” What would you like to know? JORDAN Under what circumstances would you be obligated to cooperate with an FBI or U.S. Justice Department investigation? SAUREL  Ca depend . JORDAN  Ca depend ?   Ca depend   on what?  The Wolf of Wall Street   Buff Revised Pages   3/5/13   83. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "SAUREL Whether America plans to invade Switzerland in the coming months. RUGRAT Want me to see if tanks are rolling down the Rue de la Croix? More chuckles.   Through Jordan’s forced smile: JORDAN   (V.O.) What I’m asking, you Swiss dick, is are you going to fuck me over. SAUREL   (V.O.) I understand perfectly, you American shitheel. Saurel smiles. SAUREL The only way the Banque Real de Geneve would cooperate with a foreign legal body is if the crime being pursued also happened to be a crime in Switzerland.   But there are very few Swiss laws pertaining to your “rumored” improprieties. Which is why Mr. Azoff’s joke is most appropriate: from a financial standpoint you are now in heaven, and we welcome you.   If the U.S. Justice Department or FBI or SEC or IRS sent us a subpoena, it would become   papier-toillette .   We would wipe our ass with it. Everyone’s impressed.   Except Jordan. JORDAN Unless it was an investigation into stock fraud -- which is a crime in Switzerland.   Then you’d have to cooperate. SAUREL (now he’s impressed) Yes, we would.   Assuming the account is under your name. However, if it were in the name of a nominee of yours... They take each other in.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   84. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library JORDAN   (V.O.) Was that yodeling I just heard or did you just say what I thought you said? SAUREL (V.O.) Yes!   Yes! As the meeting wraps up with handshakes, Jordan’s V.O. overwhelms Saurel’s V.O.. JORDAN (V.O.) He was telling me to use a rathole.   Problem was: sneaking a U.S. rathole into Switzerland was a chance I couldn’t take.   What I needed was somebody with a European passport. SCENES 152 - 153 OMITTED 152   152  EXT. LONDON FLAT - DAY (SUMMER ‘95) 154   154  Naomi’s Aunt Emma answers the door. AUNT EMMA Jordan? JORDAN (big smile, sweating) Surprise. EXT. HYDE PARK - DAY   (SUMMER ‘95) 155   155  Amid towering tree",
      "dialogue_count": 0,
      "word_count": 1932
    },
    {
      "scene_number": 15,
      "slugline": "EXT. STRIP MALL - PARKING LOT - LONG ISLAND - DAY 170D   170D  (LATE SUMMER ‘95) Brad waits by his Range Rover as Donnie’s Rolls careens into the lot.   He emerges, briefcase in hand. DONNIE Fu Manchu!   Kung fu! Donnie starts doing spastic karate moves.   Is he high? Sure looks like it.   Brad looks pissed, and Donnie starts laughing.   Actually he’s dead sober. DONNIE (CONT’D) I’m just fucking with you, man. Jesus, the look on your face. (Brad isn’t laughing) Hey, sorry if I got outta line the other day, I was just, that was the drugs talking... BRAD S’cool, just... gimme the case. DONNIE (he doesn’t) You know, I always kinda regretted you didn’t come to work with us at Stratton.   It’d be so cool having you around, man. BRAD (growing impatient) Yeah, well... DONNIE You’d be one of us, we’d go out- partying together, you wouldn’t have to dress like a mall rat guinea prison bitch all the time. Donnie grins, obviously still smarting from Brad’s slap. Brad just wants to take the money and be done. BRAD Give me the money. A DISTANCE AWAY, a COP in a patrol car notices Brad gesturing to Donnie for his briefcase.   He nudges his partner: check this out. DONNIE Can I come over and help tape this to your wife?   “Eez so focking steeky!   Take eet off, Bra-hod!” Brad composes himself, lest he kill the guy.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   92. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "BRAD I’m gonna give you a pass. DONNIE You’re what? BRAD I’m gonna give you a pass. DONNIE You’re gonna give me a pass? BRAD Yes.   Just gimme the money. DONNIE You’re gonna give me a pass? Okay... (offers the case) Why don’t you stick your pass up your Slavic cunt’s pussy. That does it.   Brad attacks.   Donnie throws the case at him, which opens on impact, money spilling out.   Brad instinctively tries to contain it... and that’s when the POLICE SIRENS start.   Here comes the patrol car. BRAD Shit! Donnie bolts.   With no time to get to his car, Brad takes off on foot, bleeding briefcase in hand, toward a video store where he stashes his .38 in the return box. POLICE Freeze!   Don’t move! Brad drops to his knees, briefcase at his feet.   From a distance, Donnie peers around a corner to watch him get arrested, knowing he fucked this up. SCENES 170E - 178 OMITTED 170E   170E  INT. STRATTON OAKMONT III - DONNIE’S OFFICE - DAY 178A   178A *  (LATE SUMMER ‘95)   *  Donnie is seated at his desk, freaking out and trying to   *  figure out what to do. He exits.   *  INT. STRATTON OAKMONT III - JORDAN’S OFFICE - DAY 179   179  (LATE SUMMER ‘95) With a flourish, Donnie presents a bottle full of ludes.   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   93. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library DONNIE Jord, do I have a surprise for   *  you. Twenty real lemons! A retired   *  pharmacist friend of mine’s been   *  sitting on these the last 15   *  years.   *  JORDAN You fucking serious?! CLOSE ON -- a Lemmon 714 Quaalude; pure white, with trademark ridged edges. JORDAN (V.O.) (CONT’D) The Lemmon 714 was the Holy Grail of Quaaludes, outlawed since the ‘80s and three times as powerful as anything available today.   For a Quaalude addict, it was like finding a 1952 Chateau Margaux. CLOSE ON -- Donnie gauging Jordan’s excitement, waiting for the right moment to admit his fuck-up. DONNIE(V.O.",
      "dialogue_count": 0,
      "word_count": 1618
    },
    {
      "scene_number": 16,
      "slugline": "EXT. STAIRCASE - NIGHT (LATE SUMMER ‘95) 189   189  The Lamborghini is parked at the bottom, twenty steps down.   He starts to crawl down the stairs, stops.   Tries again.   Can’t figure out how to do it. JORDAN (V.O.) Fuck!   The kid makes it look so easy! An icy wind blows through his T-shirt. JORDAN (V.O.) Think, you motherfucker, think! (a few beats; then) Wait, I’ve got it! Jordan slowly curls himself into a ball. JORDAN (V.O.) I can roll! Forcing himself over the edge, Jordan begins to descend the steps, one at a time.   Thump. Thump.   Then faster. Thump- Thump-Thump.   Faster still.   He loses control, takes all the steps at once.   Thump-Thump-Thump-Thump- Thump-Thump.   He lands with a crash on the asphalt, drags himself up and into the Lamborghini. INT. JORDAN’S LAMBORGHINI - NIGHT   (LATE SUMMER ‘95) 190   190  Ignition on, Jordan sits hunched over, chin resting on the steering wheel.   Just then, the car phone RINGS. With great effort, he pushes the speaker phone button: JORDAN ...ello? NAOMI (O.S.) Omigod!   Jordan, where are you?! JORDAN Whazz a marra? NAOMI (O.S.) It’s Donnie, he’s totally out of control!   He’s on the other line with some Swiss guy! Jordan’s face reads horror. JORDAN Whaa?!!   No!!  The Wolf of Wall Street   Buff Revised Pages   3/5/13   99. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "NAOMI (O.S.) I can’t understand you!   Just get home, hurry! Naomi clicks off.   And as Jordan puts the car in gear... JORDAN (V.O.) They say God protects drunks and babies.   I was praying the same held true for drug addicts. EXT. HEGEMAN’S ROAD - NIGHT   (LATE SUMMER ‘95) 191   191  Peering over the wheel like an old lady, Jordan slowly maneuvers the Lamborghini down the dark road. JORDAN (V.O.) I was less than a mile from home and drove slower than shit. EXT. JORDAN’S ESTATE - NIGHT   (LATE SUMMER 95) 192   192  Jordan pulls up in the Lamborghini, shuts the ignition. JORDAN (V.O.) Somehow I made it alive, not a scratch on me or the car. INT. JORDAN’S ESTATE - FAMILY ROOM - NIGHT (LATE SUMMER ‘95) 193   193  CLOSE ON the TV, where a POPEYE cartoon is playing. PULL BACK to reveal Skylar watching.   As Jordan staggers in, Naomi approaches... JORDAN Where Zonnie?! NAOMI In the kitchen. SCENE 194 OMITTED 194   194  INT. JORDAN’S ESTATE - KITCHEN - CONTINUOUS 195   195  Phone to his ear and at least as stoned as Jordan, Donnie stands at the counter.   *  DONNIE (into phone) --zee money, I wazza move izz to Zwizzyland...  The Wolf of Wall Street   Buff Revised Pages   3/5/13   100. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "dialogue_count": 0,
      "word_count": 448
    },
    {
      "scene_number": 17,
      "slugline": "INT. SAUREL’S BEDROOM - NIGHT 195A   195A  (LATE SUMMER ‘95) Having been just woken up, Jean-Jacques Saurel sits up in bed, phone to his ear, a perplexed look on his face. SAUREL What language are you speaking, Mr. Azoff? INT. JORDAN’S ESTATE - KITCHEN - CONTINUOUS 196   196  (LATE SUMMER ‘95) With Naomi looking on, Jordan staggers toward Donnie like a drunk Frankenstein. JORDAN Ge ozza zone!   Ge ozza iz!! DONNIE Waz?   Iz zoggin oo anzali! JORDAN GE OZZA ZONE!! With all the strength he can muster, Jordan RIPS the phone from the wall, throwing it skittering across the floor with a CLANG. NAOMI What the fuck are you doing?! DONNIE Wazza fuh is wrong wizzz oooo?!! I wuzz awwing to!! (Jordan grabs him) Wazza mazzer?!   Wazza yoo razy?!! Skylar looks on from the next room, crying as Jordan tries to shake some sense into Donnie. Naomi crosses to   *  Skylar and rushes her out of the room.   *  JORDAN Zee vone!!   He nah zuppose zoo dalk on zee vone!! DONNIE Wuzz?!! JORDAN ZE NAH ZUPPOSE ZOO DALK ON ZEE VONE!!   WUZZ AAZZEN TOZAY WIZ ZOD?! DONNIE WUZZ?!  The Wolf of Wall Street   Buff Revised Pages   3/5/13   101. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "JORDAN WUZZ ZOD IN ZAW?! DONNIE WUZZ?! Fuck it.   Jordan releases Donnie. Donnie crawls into the   *  dining room and starts shoving ham into his mouth in an   *  effort to sober up.   Just then, we HEAR a horrible   *  GAGGING sound.   Donnie holds his throat as he falls   *  backward choking, taking out the entire glass kitchen table with a tremendous CRASH! Naomi rushes back in.   *  NAOMI Omigod, he’s choking!   Jordan, do something!! Just then, WE HEAR the triumphant Popeye FANFARE -- Jordan looks to the TV, where POPEYE pours a can of spinach down his gullet.   Instantly, his chest and arm muscles swell to five times their size. Jordan goes to get his coke.   He snarfs up two fat spoonfuls and -- like that -- his chest swells and he takes a deep breath and he dashes back to the rescue... Jordan rushes back to Donnie, who is now blue. NAOMI (CONT’D) He’s not breathing! Jordan places his fingers over Donnie’s artery.   Nothing. NAOMI (CONT’D) Save him! Jordan kneels, starts furiously pumping Donnie’s chest, breathing air into his lungs in rhythmic bursts. JORDAN (V.O.) This stupid sonovabitch!   All Donnie ever did was fuck me up and now I had to save his life ‘cause I took a CPR class when the baby was learning to swim.   Just for the record, I want it noted: not for a second did I even think about letting him choke to death, even though it would’ve saved me an awful lot of headaches. Donnie still isn’t breathing.   Jordan flips him over, tries the Heimlich -- we hear a CRUNCH as he breaks Donnie’s ribs.   He flips him back over, but he’s almost completely blue.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   102. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library JORDAN He won’t come back! NAOMI Don’t let him die!   He has children! One last try.   Jordan takes a massive breath, blowing as hard as he can into Donnie’s lungs.   Donnie’s stomach distends like a balloon, then suddenly a ",
      "dialogue_count": 0,
      "word_count": 760
    },
    {
      "scene_number": 18,
      "slugline": "INT. POLICE STATION - DAY (LATE SUMMER ‘95) 201A   201A *  A MAN steps up to get his mug shot taken, but it’s Brad, not Jordan.   FLASH.   Turn to the side.   FLASH. JORDAN (V.O.) But they couldn’t arrest me, the cops had no proof I’d been behind the wheel.   Meanwhile, Brad did a   *  few months in jail for contempt   *  because he wouldn’t rat Donnie out.   They never found his gun, though, so they finally had to let him go. SCENES 202 - 202A OMITTED 202   202  EXT. HORSE FARM - LONG ISLAND - DAY (OCT ‘95) 202B   202B  Jordan watches an INSTRUCTOR lead Skylar on a pony. Nearby Naomi holds newborn PARKER.   Manny Riskin and Max stand beside Jordan. MANNY RISKIN You’re a lucky guy, Jordan. Legally I’ve never seen anyone slip a noose the way you do. Christ, you’re lucky to be alive  much less not in jail. JORDAN I don’t believe in luck. MANNY RISKIN That’s what all lucky people say. It’s time, Jordan.   Let me make a deal with SEC.   Before your luck runs out. Skylar waves from the pony and Jordan waves back. JORDAN What kind of terms? MANNY RISKIN You plead guilty to a handful of securities violations -- stock manipulation, high pressure sales tactics, ticky-tack shit like that.   You pay a few million dollars in fines and in exchange the SEC fucks off for all time. JORDAN And Stratton?   What happens there?  The Wolf of Wall Street   Buff Revised Pages   3/5/13   104. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "MANNY RISKIN You’d have to walk away.   Let Donnie take over. (that one hurts) Now the FBI’s a different animal. They can still pursue you for criminal wrongdoing.   But with you on the sidelines, my guess is your best friend Agent Denham’ll be left standing around with his dick in his hand. Jordan digests that. MAX You beat them, Jordan.   You won. Sail into the sunset with your wife and kids while you can. MANNY RISKIN God knows you’ll never have to work again. As Jordan looks at his picture-perfect family, WE HEAR THE ROAR OF A CROWD... SCENES 202C - 202D OMITTED 202C   202C  INT. STRATTON OAKMONT III - BULLPEN - DAY 202E   202E  (SPRING ‘96) The troops ROAR as Jordan takes center stage. JORDAN I’m sure many of you have been hearing rumors lately, about me, about the future of this firm, and that’s what I’d like to talk to you about today. (a few beats, then) Five years ago when I started Stratton with Donnie Azoff, I knew the day would eventually come when I’d be moving on.   It’s truly with a heavy heart that I tell you that day is here. The place erupts in a chorus of “No!”, “Don’t go!”, etc. Jordan raises his hand for quiet. JORDAN (CONT’D) Thank you for that and for your years of incredible loyalty and admiration.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   105. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library The point is though, that under Donnie’s leadership, along with Robbie Feinberg and Nicky Koskoff moving into key management positions, this place is gonna be better than ever! A smattering of applause.   Jordan notices a few Brokers gravely shaking their heads. JORDAN (CONT’D) And the fact that I'm gone won’t stop me from giving Donnie advice, not that he needs any-- DONNIE (jumping in) Why would anyone in their right mind not follow JB's advice? Donnie looks petrified; he’s used to being an offensive tackle, not the quarterback. JORDAN Before I go, there’s something I ",
      "dialogue_count": 0,
      "word_count": 1375
    },
    {
      "scene_number": 19,
      "slugline": "INT. STRATTON OAKMONT III - JORDAN’S OFFICE - DAY 202H   202H  (SPRING ‘96) Janet enters Jordan’s office, leaves a stack of legal papers on his desk. JORDAN (V.O.) Within days, subpoenas started flying.   They were burying me in paper -- INT. STRATTON OAKMONT III - BULLPEN - DAY (SPRING ‘96) 202Ha   202Ha  Donnie pisses on a subpoena, to applause. JORDAN (V.O.) -- notices to produce documents, depositions.   Donnie couldn’t drink water fast enough. INT. S.E.C. - CONFERENCE ROOM - DAY (SPRING ‘96) 202J   202J *  As Manny Riskin looks on, Jordan sits across from the three SEC Attorneys and a COURT REPORTER. JORDAN (V.O.) They interrogated everybody, it went on for months.   It was total fucking harassment... A SERIES OF CUTS -- (SPRING ‘96) 202K-Q   202K-Q *  Various Stratton Brokers are deposed: Robbie; Rugrat, Peter DeBlasio, Sea Otter; Chester Ming. JORDAN (V.O.) ... but not a single Strattonite cracked.   Donnie and I were given strict instructions not to leave the country... SCENES 202R - 207 OMITTED 202R   202R *  EXT. YACHT NAOMI - AFT DECK - DAY (SUMMER ‘96) 208   208  JORDAN (V.O.)   *  ...so we took our wives to Italy.   *  Each of us had a couple of million   *  we needed to deposit anyway --   *  ON A DUFFEL BAG FULL OF MONEY just resting on deck.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   109. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "JORDAN (V.O.) -- this seemed the most civilized way to transport it overseas. ON ANOTHER BAG, this one brimming with bottles of pills, bags of pot, vials of coke.   Jordan and Donnie cut up lines as a HOSTESS serves Bloody Marys. HOSTESS Can I get you anything else, gentlemen? JORDAN I have a rare condition that requires me to drink one of these every fifteen minutes.   If you could set your egg timer, I’d appreciate it. She goes.   The blow is ready for inhaling.   Jordan and Donnie are doing a “you first, no, you first” routine with a rolled up $100 when a CELL rings.   Donnie grabs it. DONNIE Rugrat! Bongiorno, my bald eagle!   *  SCENES 208A - 208B OMITTED 208A   208A *  INT. STRATTON OAKMONT III - OFFICE - DAY (SUMMER ‘96) 208C   208C *  RUGRAT We may have a problem. Your   *  friend, Steve Madden, he’s   *  unloading shares.   *  EXT. YACHT NAOMI - DAY (SUMMER ‘96) 208D   208D *  Donnie reacts as Rugrat expounds. DONNIE What?!   You’re fucking kidding?!   *  RUGRAT   *  No. I wish I was.   *  DONNIE   *  (to Jordan)   *  Rugrat says Steve Madden’s   *  unloading shares.   *  JORDAN   *  What?! (Grabs Donnie’s phone)   *  Rugrat, what the fuck?   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   110. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library (Hands Donnie his phone) Call the   *  sonovabitch! Hold on a second.   *  BACK AT STRATTON...   *  RUGRAT   *  I’m looking at the screen and huge   *  chunks of Steve Madden are being   *  sold. We’re not doing it so it’s   *  gotta be Steve. He’s the only   *  person who owns that many shares.   *  ON THE BOAT...   *  Jordan cups the phone, looks to Donnie who shrugs. DONNIE He’s not picking up. JORDAN Your fucking friend is trying to fuck me.   And you know where he’s trying to fuck me?   Up the ass. (back to Rugrat) I need some time to think.   *  Jordan thinks, snorts a line to think better. JORDAN (V.O.) Even though I owned 85% of St",
      "dialogue_count": 0,
      "word_count": 1374
    },
    {
      "scene_number": 20,
      "slugline": "EXT. MEDITERRANEAN SEA - NIGHT   (SUMMER ‘96) 209   209  The perfect storm.   As the Naomi tips at a 45-degree angle, a thick wall of gray water comes rising over her side, slamming onto the bridge with a thunderous CRASH. JORDAN (V.O.) Well talk about your shitty vacations... Six Jet Skis plummet off the deck into the raging sea. INT. YACHT NAOMI - BRIDGE - NIGHT (SUMMER ‘96) 210   210  Donnie and Naomi stand on the bridge where Captain Ted   *  Beecham holds the ship's wheel with both hands, the radio blaring in the background. Jordan enters.   *  JORDAN   *  What the fuck is going on?   *  CAPTAIN TED   *  Jet skis just went overboard.   *  RADIO VOICE Gale warning!   Gale warning!   *  CAPTAIN TED The waves are twenty feet and building! JORDAN Can’t you turn us around?! CAPTAIN TED We’ll get broad-sided and tip over! RADIO VOICE Gale warning!   Gale warning! Naomi turns to Jordan, furious with him. NAOMI You happy now, you piece of shit?   *  We’re gonna drown.   *  JORDAN I’m a master diver. We will not   *  drown, I promise you. I got you,   *  baby.   *  (realizing she’s   *  probably right; to Donnie) The ludes!  The Wolf of Wall Street   Buff Revised Pages   3/5/13   115. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "DONNIE What? JORDAN Get the fucking ludes!   *  DONNIE They’re below deck! There’s like three feet of water down there! JORDAN I can’t die fucking sober! As Donnie heads off -- NAOMI What is he crazy? Where’s he   *  going? Donnie!   *  INT. BELOW DECKS - CONTINUOUS 210A   210A *  Donnie retrieves the ludes.   *  INT. YACHT NAOMI - BRIDGE - CONTINUOUS 210B   210B *  Captain Ted stares through his binoculars. CAPTAIN TED Jesus Christ!   *  TIME CUT TO:   *  Donnie returns with ludes - feeds to Jordan and then   *  himself.   *  JORDAN What’s happening?!   *  CAPTAIN TED   *  Rogue wave!   *  Jordan grabs Naomi.   All at once the boat dips down at an   *  impossibly steep angle, until it’s pointing almost   *  straight down.   Captain Ted jams the throttle and the   *  boat jerks forward, rising up the face of a giant rogue   *  wave, which curls over the top of the bridge and...   *  KABOOM! -- Blackness.   Slowly, painfully, the boat pops   *  up from beneath the water, its helicopter RIPPING from   *  the deck and crashing into the sea.   *  CAPTAIN TED (CONT’D) (into radio) Mayday!   This is Captain Ted Beecham aboard the Yacht Naomi! This is a Mayday!  The Wolf of Wall Street   Buff Revised Pages   3/5/13   116. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library We are going down at the head fifty miles off the coast of Rome and we require immediate assistance! INT. ITALIAN NAVAL DESTROYER - BELOW DECK - NIGHT 211   211 *  (SUMMER ‘96) Off to the side, Jordan watches as Naomi, their Friends, and the yacht’s Crew Members dance to blaring techno music.   A small group of Italian SAILORS cheer them on. JORDAN (V.O.) The nice thing about getting rescued by Italians is that the first thing they do is feed you and make you drink red wine. Then they make you dance. Jordan watches as the dancing continues, then casually glances out a porthole, where WE SEE the distant lights of a PLANE making its way acr",
      "dialogue_count": 0,
      "word_count": 2013
    },
    {
      "scene_number": 21,
      "slugline": "EXT. JORDAN’S ESTATE - POOL AREA - DAY   (SEP ‘98) 226   226  ON SKYLAR AND PARKER, playing with a NANNY and Rocky the dog.   Jordan watches them, sitting by his pool, drinking an O’Douls, weighing his options. Donnie pops into the yard, in “Uncle Donnie” mode. DONNIE Hey, everybody!   How’re the happiest people in Long Island? Hi, Rocky!! (joining Jordan) Hate that fucking dog. JORDAN Tell me about it.   It’s getting old, starting to shit inside the house again. Jordan offers Donnie an O’Douls; Donnie declines. DONNIE How you doing, brother?   How was the food in jail? JORDAN Lobster Newburg sucked.   They gave me some jewelry though. He shows off the electronic bracelet around his ankle. DONNIE Wonder if they got one in my size. Fuckin’ Rugrat, that wig-wearin’ hump.   Tell you one thing: I’m never eating at Benihana’s again. Where’s Naomi? JORDAN Inside.   Pissed. Donnie sees Naomi in a window.   He waves but she barely registers him. DONNIE What’s up her ass? JORDAN Had to mortgage the home to make bail.   Probably gonna hafta sell it to pay my lawyers.   If we fight this thing. Donnie weighs that.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   123. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "DONNIE The Feds say anything about coming after the rest of us? Jordan thinks, then shakes his head no. DONNIE (CONT’D) You know, we’re all behind you. Everyone at the office. (he removes an envelope, hands it to Jordan) We bought back your mortgage.   All the founding partners threw in a million apiece.   Figured none of us would have it if it weren’t for you. Jordan’s profoundly touched.   Donnie squeezes his shoulder.   A real moment of friendship. DONNIE (CONT’D) You gotta fight this thing, baby. Jordan nods. JORDAN (V.O.) Like I said, loyalty meant a lot to me.   Without your friends and family standing behind you, you’re fucked. INT. U.S. ATTORNEY’S OFFICE - CONFERENCE ROOM - DAY 226A   226A *  (SEP ‘98)   *  Jordan sits with Nolan Drager across from FBI Agent   *  Denham, U.S. Attorney LUCAS SOLOMON, 50s, and Assistant   *  U.S. Attorney ROCHELLE APPLEBAUM, 30s, humorless.   *  LUCAS SOLOMON   *  There’s a term we have around   *  here, we don’t like to use it   *  often, only when circumstances   *  dictate.   It’s called a “Grenada.”   *  Inspired by our government’s   *  invasion in 1983 of the island   *  nation of only 90,000 people,   *  basically it stands for any case   *  we get which is pretty much unlose-   *  able.   We could show up late and   *  drunk to court, fuck up left-right-   *  and-center and still we’d win.   *  Mr. Belfort, you, sir, are a   *  “Grenada.”   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   124. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library ROCHELLE APPLEBAUM   *  You’re looking at real prison   *  time.   Money laundering gets you   *  as much as 20 years.   Case   *  couldn’t be stronger if we’d have   *  caught you with your cash in your   *  mattress.   *  Solomon pushes a box full of evidence across the table.   *  Jordan eyeballs Denham.   *  LUCAS SOLOMON   *  Read the discovery.   *  JORDAN   *  That your life’s work in the box?   ",
      "dialogue_count": 0,
      "word_count": 1010
    },
    {
      "scene_number": 22,
      "slugline": "INT. JORDAN’S ESTATE - MASTER BEDROOM - CONTINUOUS 230A   230A *  TIME CUT: Jordan is fucking Naomi. It’s the best he’s   *  felt in days. While he’s lost in it, she’s lost interest,   *  going through the motions perfunctorily.   *  JORDAN   *  I love you, Nay. I love you so   *  much. I’ve loved you from the   *  first time I saw you.   *  NAOMI   *  Fuck you.   *  That stops him.   *  JORDAN   *  What?   *  NAOMI   *  I fucking hate you.   *  JORDAN   *  What are you talking about?   *  NAOMI   *  You don’t give a shit about how I   *  feel. All you care about is   *  yourself.   *  JORDAN   *  That’s not true. What do you mean?   *  NAOMI   *  You wanna fuck me? Fine. Fuck me   *  hard like it’s the last time.   *  JORDAN   *  Hold still. Why are you moving   *  like that?   *  NAOMI   *  Go ahead, fuck me!   *  JORDAN   *  What are you doing baby?   *  NAOMI   *  Cum for me. Cum for me, baby. Like   *  it’s the last time.   *  JORDAN   *  You want me to cum, baby?   *  NAOMI   *  Yeah, cum for me baby, cum!   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   127. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "After a beat... He cums. Jordan rolls off Naomi. They lie   *  in uncomfortable silence.   *  NAOMI (CONT’D)   *  Jordan, that was the last time. I   *  want a divorce.   *  JORDAN   *  What are you talking about?   *  NAOMI   *  I want a divorce.   *  JORDAN   *  What? What are you talking about?   *  Now? After we just made love?   *  NAOMI   *  And I wanted to puke.   *  Naomi gets up.   *  NAOMI (CONT’D)   *  I don’t love you anymore Jordan. I   *  haven’t for a long time.   *  JORDAN   *  You don’t love me? Isn’t that   *  convenient. Now, you don’t love   *  me? Now while I’m under federal   *  indictment with a fucking bracelet   *  around my ankle? Now, all of a   *  sudden, you decide you don’t love   *  me?   *  NAOMI   *  Yes, that’s right.   *  JORDAN   *  What kind of a person are you?   *  NAOMI   *  You married me. This is how it’s   *  gonna be. Listen Jordan. I’m   *  taking custody of the kids. If you   *  agree to the divorce right now, I   *  will allow you visitation. Don’t   *  try to fight it. It will save us   *  both a lot of money and I have a   *  feeling you’re gonna need it.   *  Naomi exits to the dressing room. Jordan gets up, follows   *  after her.   *  JORDAN   *  I’ve got news for you. You’re not   *  taking my kids.   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   128. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library NAOMI   *  I already spoke to my lawyer. He   *  said even if you don’t get   *  convicted I can still get custody.   *  JORDAN   *  My lawyers are more powerful than   *  yours. You’re not taking my kids!   *  You vicious cunt!   *  Naomi slaps Jordan. Jordan hits her back and exits.   *  JORDAN (CONT’D)   *  Fuck you! You’re not taking my   *  kids. You fucking bitch!   *  CUT TO:   *  INT. HALLWAY - CONTINUOUS 230B   230B *  Jordan grabs a pair of scissors and starts slashing the   *  couch. He retrieves a stash of coke from the couch",
      "dialogue_count": 0,
      "word_count": 1382
    },
    {
      "scene_number": 23,
      "slugline": "INT. STRATTON OAKMONT III - JORDAN’S OFFICE - DAY 233   233  Jordan and Donnie sit at the coffee table over takeout sushi. JORDAN The trial won’t be for months, so obviously I’ll be counting on you to pick up the slack. DONNIE Whatever you need, bro.   You know that. Jordan reaches in his jacket for a yellow slip of PAPER. JORDAN And you know how much that means to me.   Hey, you know what I wanted to ask you? Jordan catches Donnie’s eye, pushes the PAPER over in front of him. JORDAN (CONT’D) The Steve Madden deal, did he ever come through on that? Donnie looks down at the paper, reads Jordan’s writing:  “DON’T INCRIMINATE YOURSELF.   I’M WEARING A WIRE.”  JORDAN (CONT’D) Remember he was supposed to kick back like four mil from that one account? DONNIE Uh... tell you the truth I was so fucked up, I don’t really remember anything about that. Donnie slips the paper in his jacket, gives Jordan a look -- “Thank you.”   Jordan nods. JORDAN Well if you talk to him, let me know.   You want the last yellowtail? DONNIE Why not? JORDAN (V.O.) And thus began my career as a government cooperator.   I was a rat...  The Wolf of Wall Street   Buff Revised Pages   3/5/13   132. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 226
    },
    {
      "scene_number": 24,
      "slugline": "INT. JORDAN’S ESTATE - MASTER BEDROOM - DAY   (NOV ‘98) 234   234  Jordan lays alone, asleep in bed.   We hear the DOORBELL. JORDAN (V.O.) But I wasn’t losing any sleep over it. After a few beats, Violet knocks, enters.   Jordan stirs. VIOLET I’m sorry, Mr. Jordan.   You got a visitor. INT. JORDAN’S ESTATE - FOYER - DAY   (NOV ‘98) 235   235  Jordan descends the stairs in sweats and T-shirt.   Agents   *  Denham and Hughes are waiting.   *  AGENT DENHAM I need you to get dressed. JORDAN Why?   What’s going on? AGENT DENHAM You’re going to jail. Agent Denham holds up the slip of yellow paper that Jordan gave to Donnie.   And on Jordan’s look... JORDAN (V.O.) Donnie Azoff, my partner.   My best friend. EXT. JORDAN’S ESTATE - DAY 235A   235A *  A tractor-trailer is parked out front as a group of   *  MOVERS carry out paintings and antique furniture under   *  the supervision of several FBI Agents in windbreakers.   *  JORDAN (V.O.)   *  After months of legal wrangling,   *  I was finally sentenced to prison.   *  WE SEE Jordan’s various cars -- Porsche, Mercedes,   *  Ferrari, BMW -- loaded onto a large transport vehicle.   *  INT. STRATTON OAKMONT III - BULLPEN - DAY 235B   235B *  Jordan stands addressing his 700 Brokers.   WE SEE the   *  eager young FACES, hanging on his every word.   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   133. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "JORDAN (V.O.)   *  I gave up everyone, and in return   *  got three years in some hellhole   *  in Nevada I’d never even heard of.   *  Like Mad Max’d said, the   *  chickens’d come home to roost.   *  Whatever the fuck that means.   *  INT. FEDERAL COURTROOM - QUEENS - DAY   (MAR ‘99) 236   236 *  Sentencing.   Jordan’s mother is there, tears in her eyes.   *  NOLAN DRAGER   *  I hope your Honor would agree that   *  Mr. Belfort has distinguished   *  himself in terms of his   *  cooperation in this white collar   *  fraud.   Mr. Belfort has helped the   *  government win convictions over   *  two dozen serious offenders and   *  helped them recover millions of   *  dollars to be made available for   *  restitution to the victims.   *  HON. RAYMOND SAMITZ   *  The sentence of the court shall be   *  48 months in Federal Prison.   *  (pause)   *  Please remand the defendant.   *  Max rolls his eyes: Jordan’s so guilty it hurts. As   *  Jordan is led away by GUARDS...   *  INT. STRATTON OAKMONT - DAY 236A   236A *  Donnie sits in his office, hears something -- a small   *  army of FBI AGENTS, led by Agents Denham and Hughes,   *  arrest half the office: Sea Otter, Robbie, Kimmie, etc..   *  As the FBI cleans house, Donnie sits on his couch.   *  SCENES 237 - 244 OMITTED 237   237 *  INT. SUBWAY - DAY (MAR ‘99) 245   245  CLOSE ON DENHAM, reading a New York Times article on Jordan’s sentencing.   He looks satisfied with his accomplishment, until he looks up... ... and realizes he’s right where Jordan said he’d be: commuting home on the subway, like any other piker.  The Wolf of Wall Street   Buff Revised Pages   3/5/13   134. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "dialogue_count": 0,
      "word_count": 551
    },
    {
      "scene_number": 25,
      "slugline": "INT. PRISON VAN - DAY (MAR ‘99) 246   246  Jordan rides in back, stares out the window, thinking about all he’s done.   The van stops as it arrives at the PRISON GATE. JORDAN (V.O.) I’m not ashamed to admit, when we arrived to prison, I was absolutely terrified... GUARD (O.S.) Belfort!   Fuckin’ move! Jordan leaps to his feet. JORDAN (V.O.) I needn’t have been. EXT. MINIMUM C PRISON - DAY (SPRING 2000) 247   247  A tennis ball hits pavement and WE PAN UP TO JORDAN, in prison fatigues but playing doubles with three other PRISONERS, all white middle-aged EXECUTIVE TYPES. JORDAN Sorry, just out.   What is that, forty-thirty? As the game continues, Jordan serving, the CAMERA PULLS UP TO SEE THE WHOLE PRISON YARD: one group of inmates does Tai Chi while another has formed a book club. JORDAN (V.O.) For a brief, fleeting moment, I’d forgotten I was rich and lived in America. BLACK OUT. INT. HOTEL BANQUET HALL - EARLY 2000’S - DAY 248   248 *  CLOSE ON A MOVIE SCREEN: DIFFERENT INTERVIEWS...   *  AFRICAN KID   *  I watch him speak and what he says   *  is motivational about life.   He   *  tells about life and how you can   *  be more rich.   *  CHINESE KID   *  He is going to teach us how to be   *  successful, how to set our goals.   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   135. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library",
      "characters": [],
      "action_text": "INDIAN KID   *  I will build my future by using   *  Jordan Belfort as my mentor.   *  MEXICAN KID   *  Choosing what is good from him and   *  being a millionaire.   *  Two hundred people attend Jordan’s “Straight Line   *  Persuasion” seminar, watching a massive screen (on which   *  these KIDS have appeared).   *  ON-SCREEN: THE “JB” LOGO APPEARS, FOLLOWED BY CLIPS OF   *  JORDAN giving seminars in different locations (see   *  addendum below), edited in with footage of looming   *  economic uncertainties.   *  Then: a MAN WITH A MIC steps out...   *  MAN WITH A MIC   *  Ladies and gentlemen, please join   *  me in welcoming to Auckland, New   *  Zealand... Mr. Jordan Belfort!   *  BIG APPLAUSE as Jordan takes the stage, waving.   This   *  might go on a while.   If so, there COULD be TITLES:   *  Jordan Belfort spent 22 months in federal prison   *  and paid $100,000,000 in fines.   *  THEN:   *  His cellmate was, no fucking joke, Tommy Chong.   *  THEN:   *  Since his release, he’s become a multi-millionaire again   *  as a motivational speaker.   *  When the applause finally dies down...   *  ...Jordan doesn’t speak.   Instead he walks down to the   *  front row of his audience, studying faces.   He picks one.   *  Takes a pen from his coat and offers it to him.   *  JORDAN   *  Sell me this pen.   *  The Kiwi, embarrassed, takes a moment, then:   *  KIWI IN AUDIENCE   *  Well, it’s a good pen, it’s a   *  ballpoint --   *  Jordan takes the pen back with a smile.   Hands it to the   *  next person.   *  The Wolf of Wall Street   Buff Revised Pages   3/5/13   136. Script provided for educational purposes. More scripts can be found here: http://www.sellingyourscreenplay.com/library JORDAN   *  Sell me this pen.   *  As the next person tries...   *  WE RAKE ALONGSIDE HIS AUDIENCE, transfixed, desperate for   *  Jordan’s knowledge, desperate to be molded, to be rich...   *  JORDAN (O.S.) (CONT’D)   *  Sell me this pen...Sell me this   *  pen... Sell me this pen...",
      "dialogue_count": 0,
      "word_count": 616
    }
  ]
}