{
  "slug": "the-incredible-burt-wonderstone-2013",
  "title": "the incredible burt wonderstone",
  "genre": "drama",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 4,
  "characters": [
    "LUCIUS",
    "RANCE",
    "BURT",
    "HAINES"
  ],
  "total_words": 22251,
  "total_dialogue": 4,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BURT’S SUITE/INT. ANTON’S SUITE - MORNING  In a SPLIT-SCREEN we see BURT WONDERSTONE and ANTON  LOVECRAFT, 30’s, being woken up by alarm clocks in their  separate, but equally luxurious bedrooms.   Burt glares  at his clock and with a gesture, makes its hand run  backward a few hours.   Anton grimaces at his clock and  with a similar gesture, turns it into a bunny rabbit  which hops away.   Anton grins at the camera playfully.  INT. BURT’S BATHROOM/INT. ANTON’S BATHROOM - SHORT TIME  LATER  Anton is in the shower, lathering up when he drops the  bar of soap.   He holds out his hand and the soap  “magically” levitates back into his hand.   Burt steps up  to his mirror to shave.   He is about to apply shaving  cream but thinks better of it.   He nods at himself and  his stubble instantly disappears.   Tiny flecks of blood  appear on his cheeks.   He nods again and they are  instantly covered with bits of toilet paper.   Burt winks  at the camera.  INT. PENTHOUSE HALLWAY - MINUTES LATER  We see two doors across from each other, one labeled  “BURT” and the other “ANTON.”   Both doors open  simultaneously and Burt nods to Anton as the latter  crosses into Burt’s suite.   Both are wearing bathrobes.  INT. BURT’S KITCHEN - MOMENTS LATER  Burt stands at the counter while Anton sits at a table.  Burt cracks an egg over a plate and fully cooked  scrambled eggs pour out of the egg shell.   He cracks  another egg and strips of bacon fall out.   He holds a  third egg over a coffee mug and coffee pours out.  He hands the plate and mug to Anton who picks up a tiny  egg from a bowl on the table and cracks it over his  coffee.   Cream pours out.   Then a second tiny egg  produces sugar.  INT. BURT’S LIVING ROOM - MINUTES LATER  Burt and Anton remove their robes, revealing their stage  costumes.   They smile to each other purposefully, then  grasp hands and RUN toward the plate glass window which  overlooks the entire Strip.   Are they committing  suicide?  BURT WONDERSTONE   3/17/2010   2.",
      "characters": [],
      "action_text": "They SMASH through the glass as the screen over the  audience goes BLACK.  CUT TO:  INT. BURT AND ANTON THEATER - CONTINUOUS  MUSIC CUE: “The Reflex” by Duran Duran  As the music comes BOOMING out, Burt and Anton appear on  wires overhead, holding hands as they fly in over the  audience and alight on the stage.  We notice that Burt has gained some weight since the  intro film was shot.   In fact, he looks about ten years  older.  Burt and Anton LEAP/DANCE around the stage.   Then Burt  turns to the cheering crowd.  BURT  Ladies and gentlemen, welcome.   I’m  Burt Wonderstone.  ANTON  And I’m Anton Lovecraft.  BURT  But then, you already knew that.  The music segues into Elmer Bernstein’s nostalgic theme  from “To Kill a Mockingbird.”  ANTON  What you may not know is that Burt and  I have been magical friends and  partners since we were young boys.  BURT  That’s right.   We’ve always known that  there was something a little bit  different about our friendship.  ANTON  When we were alone in Burt’s bedroom,  we did things no normal boys would  dare.  BURT  In fact, when we were together, we  would break the very laws of nature.  ANTON  Remember our games of “hangman,” Burt?  BURT WONDERSTONE   3/17/2010   3. BURT  I sure do, Anton.   But we didn’t play  it quite the way other kids did.  “The Reflex” resumes playing as two STAGEHANDS roll in a  large HANGMAN’S SCAFFOLD.   Burt and Anton’s longtime  assistant, NICOLE, early-30’s, enters.  ANTON  Ladies and gentlemen, our beautiful  assistant, Nicole!  The two men grind “sexily” against Nicole to the driving  beat of the music.   She reacts with MOCK FEAR at the  sight of the scaffold as Burt and Anton lead her up the  stairs to the waiting noose, still grinding against her  as they go.  Her “protests” grow more strenuous as Burt ties her  hands and Anton places the noose around her neck, all  the while rubbing their bodies against hers.  ANGLE ON the AUDIENCE, smiling ear to ear with  anticipation.  Anton places a hood o",
      "dialogue_count": 0,
      "word_count": 3678
    },
    {
      "scene_number": 2,
      "slugline": "INT. BURT’S BEDROOM - DAY  We see a rapid TIME LAPSE series of shots as Burt and  Anton practice a variety of tricks.   Throughout, we see  the pages of their “enchanted” notebook filling up with  sketches and descriptions of ideas for elaborate  illusions.   We hear passing snippets of their childish  voices excitedly discussing tricks:  BURT (V.O.)  We could pull a rabbit out of a hat.  ANTON (V.O.)  Or pull a hat out of a rabbit!  BURT (V.O.)  Or turn ice into water!  (realizing)  Wait, forget that one.  As the boys grow a couple years older, Burt’s room  morphs into a veritable magic salon complete with  rabbits, doves and other paraphernalia.   A poster of  Doug Henning is replaced by a poster of David  Copperfield.  They have set up a miniature theater using Legos.   Two  Lego “magicians” stand on stage before an audience of  Lego men.  BURT (CONT’D)  (demonstrating with the  Legos)  What if we disappear and then reappear  in the audience?  ANTON  Everyone does that.  BURT  Yeah, you’re right.  (beat)  What if we made   the audience   disappear?  Burt swipes away the entire Lego crowd with his arm.  ANTON  That’d be amazing.   But how?  BURT  I don’t know.   There’s got to be way...  BURT WONDERSTONE   3/17/2010   19.",
      "characters": [],
      "action_text": "We see evolving sketches in the notebook of various ways  of making an audience disappear with X’s through them--  they won’t work.  In one shot, Anton and Burt, now around 16, try on their  new magician costumes.   They regard their childish sign  with their names “Albert Weinselstein & Anthony Lufkin”  and exchange a dubious look.  DISSOLVE TO:  INT. SYNAGOGUE FUNCTION ROOM - DAY  CLOSE ON a new professionally-made sign reading, “The  Incredible Burt Wonderstone & Anton Lovecraft.”   We pull  back to see a lavish bar mitzvah party is in progress.  All eyes are on the entertainment, Burt and Anton, now  20.   Burt wears a top hat with a yarmulke perched on it.  The crowd applauds for their last trick.  BURT  Ladies and gentleman, thank you.  You’ve all been mensches.  ANTON  And mazel tov to Aaron.   For our final  illusion today, it is our honor to  present you with this beautiful lunch.  Anton dramatically lifts the lid from a silver tray  revealing an enormous honey-baked ham.   The crowd GASPS  and RECOILS in disgust.  BURT  Oy vey.   This can’t be right.   Anton,  is this your doing?  ANTON  Not me, Burt.   The caterer must be a  goy.  Burt places the cover back on the tray.  BURT  Okay, everybody stay calm.   There’s an  old Jewish saying: “when life gives you  ham, turn it into...  He yanks off the lid to reveal the ham is now a brisket.  BURT (CONT’D)  ...brisket!”  BURT WONDERSTONE   3/17/2010   20. The crowd cheers as they advance hungrily on the meat.  BURT (CONT’D)  I’m Burt Wonderstone!  ANTON  And I’m Anton Lovecraft!  BURT  Together, we’re “The Incredible Burt  and Anton”!  In the back of the room, we see a MAN in a suit nod  approvingly.  RISE TO FAME MONTAGE  MUSIC CUE: “(Oh, Oh, It’s) Magic” by Pilot  INT. AGENCY OFFICE - DAY  Burt and Anton sit across a desk from the man from the  bar mitzvah.   They shake hands with him.   They’ve got  their first agent.  INT. WAREHOUSE - NIGHT  Burt and Anton pore over blueprints and sketches of  elaborate cont",
      "dialogue_count": 0,
      "word_count": 1126
    },
    {
      "scene_number": 3,
      "slugline": "EXT. WONDERSTONE ISLAND - DAY  Some BUSINESSMEN applaud as Burt, in a hard hat, cuts  the ribbon on a condominium construction site on the  beach of the tropical island he has purchased.  Burt smiles and gestures toward a sign that reads  “Wonderstone Island: Paradise That’s No Illusion.  Luxury condos starting in the low $7 millions.”  PULL BACK to reveal an ominous, GIANT VOLCANO SMOKES in  the background.  INT. WAREHOUSE - NIGHT  Anton sits by himself building a contraption for a  trick.   He sadly looks at the door.   Burt clearly isn’t  coming.  END OF MONTAGE  INT. BURT AND ANTON THEATER, BACKSTAGE - PRESENT DAY  We return to the present where Burt stands opposite  adult Willy Carano and his family.  BURT  I’m sorry.   I meet a lot of people.  WILLY’S WIFE  (to Willy)  I told you he wouldn’t remember you.  He’s the biggest magician in the world,  dummy!  WILLY  Well, sorry to bother you, Mr.  Wonderstone.  BURT  (distracted)  Hmm?   Oh, not a problem.   Hope you  enjoyed the show.  The Caranos head off as Anton approaches Burt.  ANTON  Hey, was that Willy Carano from  school?!  BURT WONDERSTONE   3/17/2010   24.",
      "characters": [
        "LUCIUS"
      ],
      "action_text": "BURT  (abruptly)  No.   Just some fan.  He walks off, leaving a perplexed Anton.   Burt passes  the stagehand we saw earlier.  BURT (CONT’D)  Is she over here?  The stagehand nods.   Burt spots Miranda, the volunteer  from “Man Head/Lady Body,” he immediately morphs back  into his congenial stage persona.  BURT (CONT’D)  Hi.   Thank you for waiting.   Did you  enjoy the show?  MIRANDA  It was so killer.  BURT  That’s sweet of you.   Tell me your  name?  MIRANDA  Miranda.  BURT  Miranda, if you will give me just ten  minutes to change and take off this  makeup, I would love to continue this  conversation.  MIRANDA  That would be so killer.  BURT  Perfect.  (calling to stagehand)  Jeff.   Can we get Miranda some Fiji  water, please?  And he goes.  INT. SMALL ROOM - SHORT TIME LATER  Burt, now in casual, expensive clothes, sits with  Miranda on a sofa making out.   There’s a small bar  against one wall and a flat screen TV on another.  BURT WONDERSTONE   3/17/2010   25. MIRANDA I can’t believe I’m really making out with Burt Wonderstone. BURT Neither can I. MIRANDA It’s so cool to see your place. BURT This isn’t my place. SFX: DING Suddenly, one entire wall of the room slides open revealing a palatial penthouse hotel suite.   The room they’ve been in was just the elevator. They step out into-- INT. BURT’S SUITE - CONTINUOUS BURT This is my place. Miranda takes in the ornate decor and breathtaking view up the Strip. MIRANDA It’s beautiful. BURT I know.   And I don’t even pay for it. (then) Okay, let’s get started.   If I could have you stand over here for a moment. Burt guides Miranda over to a green screen set up on one wall of the room.   A camera on a tripod sits across from it--   and behind it sits the stagehand from backstage, Jeff.   She’s startled to see him. Burt puts his arm around Miranda and extends his other arm in an odd pose. BURT (CONT’D) Say “presto”! MIRANDA Presto. The camera flashes.  BURT WONDERSTONE   3/17/2010   26.  ---- BURT  Thank you, Jeff.   ",
      "dialogue_count": 1,
      "word_count": 2212
    },
    {
      "scene_number": 4,
      "slugline": "INT. BURT AND ANTON THEATER - NIGHT  As usual, Burt and Anton fly in over the audience  holding hands and alight on the stage.  BURT  Ladies and gentlemen, welcome.   I’m  Burt.  Burt looks out at the audience and his stage smile  falters as he notices blocks of empty seats scattered  around the normally sold out theater.  INT. DINER - DAY  A CROWD watches and the camera crew films Haines as he  dumps a scalding pot of hot coffee over his head.  HAINES  Aaaaaaahhhhhhhhh!  (then)  Give me another one.  A WAITRESS hands him another full pot of coffee which he  also dumps over his head.  HAINES (CONT’D)  Aaaaaaahhhhhhhhhh!  (then)  Give me another one.  INT. AZTEC CASINO - DAY  Burt walks through the casino.   He stops when he notices  a new sticker has been added to the poster for his show  that reads “Two-for-one ticket special with any adult  buffet purchase!   Come for the crab legs, stay for the  magic!”   Burt frowns.  EXT. PUBLIC PARK - DAY  Haines, surrounded by his crew and the usual gaggle of  FANS, is shooting his show.   He sits on a park bench  with his pants around his ankles.   He holds a scalpel.  HAINES  (as unexcited as ever)  Okay, so now, I guess I just need to  cut here and that should finish my  circumcision...  BURT WONDERSTONE   3/17/2010   36.",
      "characters": [],
      "action_text": "As he reaches down to his blurred-out genitals, we ANGLE  ON the spectators wincing.   We hear Haines grunt in  pain.  SPECTATOR  Oh snap!   Boy cut up his dick!  DISSOLVE TO:  INT. BURT AND ANTON THEATER - NIGHT  A few months have gone by.   Burt and Anton are mid-show.  Nicole is at her usual spot on stage.  ANTON  And now, ladies and gentlemen, our most  famous illusion.   One we call... “Man  Head/Lady Body.”  As always, the crowd murmurs at the mention of the  famous trick but when we reverse angle to see the  audience, it’s clear attendance has fallen quite a bit.  BURT  In order to accomplish this impossible  feat of impossibility, I will need a  female volunteer from the audience.  Are there any volunteers?  Once again, dozens of hands go up in the crowd.   Burt  scans the faces: an OLD LADY, an OLDER LADY, a DRUNK  MAN, an OBESE OLD LADY, and so on.  BURT (CONT’D)  (frowning)  Anyone a little less... old?  But the young, hip audience members are nowhere to be  found.   Burt sighs and points to a WRINKLED LADY wearing  a yellow muu muu.  BURT (CONT’D)  Okay.   You.  The Wrinkled Lady slowly gets to her feet and heads for  the stage at a glacial pace.   While they wait, Nicole  turns to Burt.  NICOLE  That is going to be one interesting  Lady Body.  Burt is not amused.  BURT WONDERSTONE   3/17/2010   37.",
      "dialogue_count": 0,
      "word_count": 455
    },
    {
      "scene_number": 5,
      "slugline": "INT. BURT’S PRIVATE ELEVATOR - LATER Burt, looking less than thrilled, sits on the sofa in his elevator beside the Wrinkled Lady as they head up to his suite. INT. DOUG MUNNY’S OFFICE - NEXT DAY Burt and Anton, in street clothes, enter the gigantic office of their boss, the casino owner, DOUG MUNNY, 50’s, a “Vegas classy”, well put-together billionaire. The walls of his office are covered with an insane art collection:   Picasso’s   Guernica , Van Gogh’s   Starry Night,   Monet’s   Water Lillies,   etc. Munny is finishing a phone call.   He gestures for them to come in. MUNNY (on phone) Two.   Two point five.   No?   Not even for two point five?   Well, Mr. Kinney, you must love your wife very much.   If you two change your minds, the offer stands. (hanging up, to Burt and Anton) Sorry about that, fellas.   Have a seat. Anton notices a framed class photo of a young boy, JUDAH MUNNY, on Munny’s desk. ANTON Wow.   Look how big Judah’s gotten. MUNNY He’s gonna be ten soon.   I tell you, that kid is your biggest fan. Unfortunately, I’m starting to think he’s your only fan. BURT What? MUNNY This is why I called you in.   Your ticket sales suck. BURT We know.   It’s like something’s happened to our audience.   They’ve grown old.  BURT WONDERSTONE   3/17/2010   38.  (MORE)  ----",
      "characters": [],
      "action_text": "But in just a few months, rather than  over the course of their lives.  MUNNY  That’s because tastes are changing.   A  lot of people are staying home and  watching magic on TV and the internet  now.   You know about this Steve Haines  kid?  BURT  Oh come on, that guy?   All he does is  mumble and cut himself.   Anyone can do  that.   My niece does that.  MUNNY  Well, he’s getting a national  following.   They’re calling him “the  future of magic.”   Have you heard about  his latest stunt?  ANTON  No.  MUNNY  Look at this.  Doug crosses to his desktop computer, pulls up a clip on  YouTube and spins the monitor around so Burt and Anton  can see:  SFX: HEARTBEAT  ON SCREEN we see various DRAMATIC SHOTS of Haines:  standing with his legs crossed, sitting in a chair and  clutching his groin, writhing around on the floor, etc.  TV ANNOUNCER (V.O.)  (gravelly voice)  For twelve long days he’s held his  urine.   This Friday, be here for the  final hour of Steve Haines’s incredible  stunt, “Holding It In,” live on NBC.  We then see a MALE DOCTOR on screen wearing a  stethoscope.   A CHYRON reads: “Doctor”  MALE DOCTOR  He should be dead.   By now he’s got  more urine than blood.  ANGLE ON a ticking clock, its hands spinning faster and  faster.  BURT WONDERSTONE   3/17/2010   39.  BURT (CONT'D) TV ANNOUNCER (V.O.)  He’s made it this far, but   will ...  (droplet noise)  ... he ...  (droplet noise)  ... last ?  We CUT TO a previously recorded snippet of BRIAN  WILLIAMS sitting across from Steve Haines, who squirms  uncomfortably.  BRIAN WILLIAMS  What’s going through your mind right  now?  Haines takes a second to consider this.  HAINES  I really have to pee, Brian.  BACK ON Burt and Anton.  BURT  What a jackass.   How is that magic?  MUNNY  Doesn’t matter.   It’s what people want.  And trust me, I know what people want.  They don’t call me “Mr. Vegas” for  nothing.  ANTON  I thought Wayne Newton was “Mr. Vegas”?  MUNNY  No, he’s “Mr.   Las   Vegas.”   I’m “Mr.  Vegas” and I’",
      "dialogue_count": 0,
      "word_count": 4175
    },
    {
      "scene_number": 6,
      "slugline": "EXT. DECREPIT HOTEL - NIGHT  Burt stands outside the most depressing casino in town.  He takes a deep breath and is about to approach it when  suddenly there’s an explosion and the whole place  IMPLODES in a controlled demolition.   Burt hurries away.  CUT TO:  EXT. WAL-MART - DAY  A banner has been hung over the entrance reading, “Grand  Opening!   Come See Famous Magician Burt Wonderstone!”  INT. WAL-MART - CONTINUOUS  A small crowd of SHOPPERS stand in an aisle watching as  an utterly miserable Burt makes a flower vanish.   They  applaud as they continue with their shopping.  BURT  Thank you.   I can make a lot of things  disappear, but nothing makes spills  disappear better than Bounty, the  quicker picker-upper.  (he points to the shelf  beside him)  Three rolls for only $3.99.   You’re not  gonna beat that--  A STORE MANAGER approaches.  STORE MANAGER  Hey, Burt.   We need you in the loading  bay.  BURT  To do magic?  CUT TO:  INT. WAL-MART LOADING BAY - MINUTES LATER  Burt helps two WORKERS unload boxes from a truck.   He  looks like he’s about to cry.  EXT. HOT SANDS MOTEL - NIGHT  A depressing neon motel, miles off the Strip.  BURT WONDERSTONE   3/17/2010   61.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 198
    },
    {
      "scene_number": 7,
      "slugline": "INT. BURT’S MOTEL BATHROOM - CONTINUOUS  Strewn on the floor are Burt’s magician clothes, grimy  with sweat and dirt from the loading bay.  Burt stands in the shower under a pathetic trickle of  water.   He looks down for soap and finds one tiny  bottle.   The label reads “Luxury Shampoo/Conditioner/  Bodywash.”   He sighs, opens the bottle and squeezes the  entire contents onto his hair.   The quarter-sized blob  is woefully inadequate to clean his whole body but he  tries anyway.  CUT TO:  INT. BURT’S MOTEL ROOM - LATER  Burt enters from the bathroom wearing a robe with the  “Aztec Casino” logo on it.   He walks past his moving  boxes and the life-size cutout of himself and flops on  his bed, exhausted.   He opens the local newspaper to the  job listings.   His eye is caught by an ad titled  “ENTERTAINER WANTED” for the Desert Oasis.   A photograph  shows what appears to be a pleasant looking hotel  surrounded by lush gardens.  Intrigued, Burt tears out the ad.  CUT TO:  EXT. DESERT OASIS RETIREMENT COMMUNITY - LATER  Burt lowers the photo to reveal a dilapidated rest home  along a lonely, searing highway.   The lush gardens are  long dead.   A neon “No Vacancy” sign buzzes out front.  An ambulance pulls away from the building and the “No”  in “No Vacancy” switches off.  INT. DESERT OASIS COMMON ROOM - CONTINUOUS  Burt is led into the joyless room by HAROLD, a large  African-American orderly.   Ancient RESIDENTS sit on worn  sofas and wheelchairs, playing cards, etc.  HAROLD  This is our common room.   This is where  you’ll be doing the majority of your  shit.  An OLD MAN grabs onto Harold’s shirt.  BURT WONDERSTONE   3/17/2010   62.",
      "characters": [],
      "action_text": "HAROLD (CONT’D) (brushing him away) Get off of me, Eli! (then) Most of these people were performers on the Strip.   Lounge singers, strippers, celebrity impersonators... Burt looks around and notices a table of THREE FRANK SINATRA IMPERSONATORS and a DON RICKLES LOOK-ALIKE. BURT Wow.   That one looks just like Don Rickles. HAROLD That one is Don Rickles. BURT So this is where old entertainers come to die, huh? HAROLD (looking Burt over) And some not so old. (then) Good luck.   Don’t let ‘em steal your soul.   They’ve got a way of doing that. Harold exits, leaving Burt standing amidst a sea of grey hair and wrinkles.   He steels himself and crosses to a kindly looking old lady, GRACE. BURT Hi there.   What’s your name? GRACE Grace. BURT Hi, Grace.   I’m Burt.   Would you like to see a magic trick? GRACE All right. BURT Great.   That’s a lovely bracelet you have.   Do you think I could see it for a minute? Grace slowly removes the bracelet and hands it to Burt.  BURT WONDERSTONE   3/17/2010   63.  -- BURT (CONT’D)  Okay, now watch very carefully.  With a flourish, Burt makes the bracelet seem to  disappear into thin air.  BURT (CONT’D)  Where did it go?  Grace looks shocked.   Then her shock turns to dismay as  she begins to tear up.  GRACE  (quietly weeping)  My granddaughter gave that to me...  What have you done?  BURT  (quickly producing the  bracelet)  No, Grace, wait.   It’s right here.   I’m  sorry.   Don’t cry.  She grabs the bracelet from him and glares at him.  GRACE  Devil.  Burt backs away from her.  INT. COMMON ROOM - SHORT TIME LATER  Burt does a card trick for a withered Dean Martin look-  alike.  BURT  Now watch closely, Mr. DiRiggi as I  sprinkle some invisible magic dust on  the cards and...  A single card rises from the middle of the deck.  BURT (CONT’D)  Is that your card?  MR. DIRIGGI  I... I don’t remember.  Burt’s face falls.  BURT WONDERSTONE   3/17/2010   64. EXT. COMMON ROOM TERRACE - SHORT TIME LATER  Burt performs another card trick for a d",
      "dialogue_count": 0,
      "word_count": 1057
    },
    {
      "scene_number": 8,
      "slugline": "INT. CAFETERIA - CONTINUOUS  The Old Man gets a cup of coffee from an urn and heads  to a table as Burt enters and approaches him.  BURT  You’re Rance Hanson of Hanson and  Munson, aren’t you?  RANCE  (removing his sunglasses)  Who cares?  BURT  I do.   I had your magic kit.   You’re  the reason I became a magician.  RANCE  Sorry to hear that.  BURT  You guys were the greatest.   What are  you doing in this place?  RANCE  Same as the rest of them.   Waiting to  die.  BURT  But what happened to you?   One day you  were at the Aztec and the next you  disappeared.  RANCE  It wasn’t me that disappeared.   It was  Munson.  BURT  What do you mean?  RANCE  We were doing the ten o’clock show...  DISSOLVE TO:  INT. AZTEC THEATER - NIGHT  A considerably younger Rance stands on stage in front of  a full house.   Munson is beside him.  RANCE (V.O.)  We’d always open with the Vanishing  Steamer Trunk effect.  BURT WONDERSTONE   3/17/2010   67.",
      "characters": [
        "RANCE",
        "BURT",
        "HAINES"
      ],
      "action_text": "Rance opens the lid on a large trunk and Munson steps  inside.  RANCE (V.O.) (CONT’D)  It was all going along fine.   Munson  gets in the trunk as usual...  Rance closes the lid.  RANCE (V.O.) (CONT’D)  I stick some swords through it.  Rance dramatically impales the trunk with steel swords,  then removes them.  RANCE (V.O.) (CONT’D)  I turn the thing around and bam!   The  trunk’s empty.   Where’s Munson?  Rance opens the door and Munson is gone.   The audience  applauds.   Rance shuts the door and spins the cabinet.  RANCE (V.O.) (CONT’D)  So, then I give the closet a spin, open  the door and voilá, Munson’s back.  We see Rance open the door.   But there is no sign of his  partner.  RANCE (V.O.) (CONT’D)  Except that Munson’s not back.  Confused, Rance closes the door then opens it again.  Still nothing.  RANCE (V.O.) (CONT’D)  Munson is gone.   And I have no idea  where he went.  INT. AZTEC THEATER - LATER  Two POLICE OFFICERS examine the box in the now empty  theater.   Rance shows them how it’s supposed to work.  RANCE (V.O.)  The Aztec dropped me.   No one wanted to  hire a magician who actually made  people disappear.  INT. CAFETERIA - CONTINUOUS  Rance and Burt are as we left them.  BURT WONDERSTONE   3/17/2010   68. BURT  Did he ever turn up?  RANCE  No.   We never heard from him again.  BURT  So the trunk was actually magical?  RANCE  No, moron.   Munson took off.  BURT  Why would he do that?  RANCE  Some say he owed money to the mob.  Some think he had a sweetheart and  wanted to ditch his wife.   We’ll never  know for sure.   Doesn’t really matter  now, does it, Burt?  BURT  You know who I am?  RANCE  Everyone knows who you are.   The  question is, do you?  BURT  What do you mean?  RANCE  Let me guess.   You did magic as a kid  to be popular, right?  Burt nods.  RANCE (CONT’D)  Then you did it to get laid.  He nods again.  RANCE (CONT’D)  Then you did it to get rich.  BURT  And laid.  RANCE  Can you even remember why you got into  magic in the first place",
      "dialogue_count": 3,
      "word_count": 8811
    },
    {
      "scene_number": 9,
      "slugline": "INT. THEATER - NIGHT  Chyron: “Six Months Later”  ANGLE ON the entrance to the theater.   Over the door in  gold letters reads “THE RANCE HANSON MEMORIAL THEATER.”  We track inside where it’s the end of Burt and Anton’s  all-new show.   The sold-out audience is on its feet,  giving a standing ovation as an energized Burt, Anton  and Burt’s visibly pregnant wife, Nicole, take bows.  BURT  Thank you for coming to the Rance  Hanson Theater.  ANTON  Where you’ll always find...  BURT/ANTON  ... a   real   magical friendship!  EXT. AZTEC RESORT - MINUTES LATER  Members of the audience exit the hotel and head for the  taxi line.   A few pause when they notice a street  magician performing a trick for a small GROUP.   It’s  Steve Haines, but this time without a camera crew.   He  has yet to fully recover from his brain injury.  HAINES  (pointing at a big guy)  You thir.   Punth me in the faith.   Hard  ath you can.  A BIG GUY steps up, shrugs, and CLOCKS Steve in the  face.   The magician goes down hard.   And doesn’t get up.  The small crowd walks away, completely indifferent.  We fly up over the Aztec’s pyramid, over the sparkling  lights and up into the night sky until the brilliant  colors of the Strip are just specks of light.  SMASH TO:  BLACK.  THE END  AS CREDITS ROLL, we see a SERIES OF SHOTS showing the  behind-the-scenes of the “Disappearing Audience” trick:  BURT WONDERSTONE   3/17/2010   113.",
      "characters": [],
      "action_text": "-- The fog clears in the theater and a team of STAGEHANDS  wearing gas masks begin carelessly grabbing unconscious  members of the audience and dragging them up the aisle by  their ankles.   The sleeping people’s heads bang against  the seats and floor.  -- A Japanese MAN wakes up as he’s being loaded into a  truck and looks around, frightened.   Seeing he’s awake,  Burt gestures “Shhhh” and shuts the rear door of the  truck.  -- Burt and Anton ride in the cab of a truck as a driver  drives into the desert.   Anton glances in the side-view  mirror and yells to the driver to stop.   When they get  out, we see that the back door of the truck has opened  and there are unconscious bodies strewn for hundreds of  yards on the road behind them.  -- In the desert, STAGEHANDS follow a seating chart as  they place the audience in their proper seats.   One of  them notices an AUDIENCE MEMBER has a black eye.   Nicole  hands him a makeup kit and he quickly covers the injury.  -- Out in the desert, Anton looks over and reacts as he  notices a COYOTE trying to drag a sleeping INFANT  audience member away from its sleeping MOTHER.   Anton  quickly shoos the animal away and returns the child to  its mother.  -- In the desert, the audience have all been placed in  their proper seats.   A STAGEHAND approaches Burt and  shows him a prosthetic leg.   He shrugs.   No idea who it  belongs to.   Burt hurls it out into the desert.  -- The same Japanese MAN as before looks around,  frightened as he is loaded with the others onto the truck  for the return trip to the theater.   Once again, Burt  gestures “Shhhh” and shuts the door of the truck.  BURT WONDERSTONE   3/17/2010   114.",
      "dialogue_count": 0,
      "word_count": 539
    }
  ]
}