{
  "slug": "the-secret-life-of-walter-mitty-2013",
  "title": "the secret life of walter mitty",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 0,
  "characters": [],
  "total_words": 21740,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LIFE MAGAZINE CAFETERIA - LATER The cafeteria is a large white room, with massive black and white Life photographs serving essentially as wallpaper. Particularly, they are images of physical and human immensity (photographs of the summitting of K2 and the beachheads of Normandy) and make the office workers here (Life magazine’s low-level corporate workers among whom Walter is one) seem tiny in terms of their personal accomplishments but also physically. Walter and a co-worker TIM NAUGHTON sit in front of the Massive K2 mountain summit photograph. WALTER Tim, did you find out anything about Negative Box 2-6? Where it was sent from? TIM NAUGHTON (like he’s a real big deal) That’s the   Sean O’Connell  commission? WALTER Yeah, the guy who took this-- Walter gestures to the K2. It’s taken from above a guy who just summitted. TIM NAUGHTON There’s nothing in shipping. The box just showed up it seems like. There’s no receipt. WALTER ...I’m getting nervous with these new guys around. Lost negative. But I’m not going to freak out. I think my work here the last nine years speaks for itself. I’ve made my mark. Then new superior Ted Hendricks walks past, accompanied by Life’s EXECUTIVE ADMINISTRATORS. TED HENDRICKS Who am I evaluating next? EXECUTIVE (holding an employee file labeled W. Mitty) W. Mitty.  11.",
      "characters": [],
      "action_text": "SECOND EXECUTIVE Who’s that? EXECUTIVE He’s the black guy from Accounts. THIRD EXECUTIVE ...He’s not black. EXECUTIVE Are you sure? THIRD EXECUTIVE Yeah. He’s just a white guy. With a mustache. SECOND EXECUTIVE He doesn’t have a mustache. FIFTH EXECUTIVE Of course he doesn’t have a mustache. He’s a woman. They’ve walked past Walter and out of the cafeteria - but Walter’s heard every word - not promising. EXT. TIME-LIFE BUILDING, 6TH AVE, NY - LATER Walter sits at the cement bench on 6th just out front of the Time-Life building. He’s looking at a photograph he’s taken from his briefcase. It’s a bad print - the kind someone takes before their camera’s set - over exposed, out of focus - it’s impossible to discern the subject. WALTER (wondering) What is this? Cheryl Mellhoff sits down beside Walter. WALTER (CONT’D) What is this? He hands her the foggy print - it’s clear they have an established working friendship. WALTER (CONT’D) I think it’s either a man with one sideburn. Or a candelabra. Or a Happy Days lunch box.  12. CHERYL (can’t make it out clearly either) It’s... is it two badminton racquets? What’s it supposed to be? WALTER It’s the Quintessence of Life. So I don’t think it’s two badminton racquets. Sean O’Connell took this just before he took another one we lost. CHERYL (like that’s significant) You lost a Sean O’Connell? WALTER (looking at the out of focus print) ...I’m trying to figure out what this picture is. I think he focused, set his lens then took the missing picture. It’s just a better picture of this. What is this? CHERYL Maybe Sean has it. WALTER The negative? Yeah, I tried to reach him. He’s always in Bahrain. Or a shanty town or somewhere - I got one email off. Walter shows Cheryl an email exchange from Sean O’Connell - It reads -   in need of info for neg 12 of neg roll three, box 2-6.  Sean’s reply -   Best picture I’ve taken. The total F’ing Quintessence of Life. I hope you’re as happy with it as I am.  Walter’s reply =   Cool, but can’t find i",
      "dialogue_count": 0,
      "word_count": 1279
    },
    {
      "scene_number": 2,
      "slugline": "INT. 104 BUS, MOVING, NYC - LATER A little later, Walter’s got his lap top out, trying to leave a “wink” for Cheryl M. (Cheryl Mellhoff) on eHarmony . It doesn’t work:   unable to perform request.   Walter looks at it - it’s not the smooth next step he was expecting. He tries again. Same result. INT. 104 BUS, MOVING - LATER Walter’s in the midst of a phone call. WALTER I tried to leave a “wink.” For someone. But it didn’t work. EHARMONY COUNSELOR Well, they’re not required to respond to you favorably. We can’t force-- WALTER No, it says “unable to perform request,” Todd. So I don’t think my wink really went through. Do I have like a broken page or something? EHARMONY COUNSELOR Broken page? I’ve never heard of that. WALTER Well, okay, something’s not working. On my page. EHARMONY COUNSELOR Yeah, let me look here (keyboard noise) Okay, we received your application breaking your personality into 29 different dimensions, and, okay, I see the problem. You don’t have any. WALTER Any what? EHARMONY COUNSELOR Dimensions. Further time passes.  17.",
      "characters": [],
      "action_text": "WALTER ...I don’t have any dimensions? EHARMONY COUNSELOR Not that we can determine. Through our models. You’re just lacking distinguishing features as our system sees it. Based on our really extensive evaluation, you seem, to us, a little too indistinguishable from everybody else. A pretty long time passes as Walter wrestles with this consideration. EHARMONY COUNSELOR (CONT’D) You’re not standing out. In a way that would allow anyone to actually notice you. So hey, let’s enhance your profile. Let me ask you, did you always want to be a practical asset manager? WALTER I don’t want to be one now. I just am one. EHARMONY COUNSELOR Why do you do it? WALTER It’s an occupation. When I became an adult I thought that would be possibly a good thing to have. Because I keep getting bills from places. EHARMONY COUNSELOR What are some of your accomplishments? WALTER (after thinking) ...I studied music. EHARMONY COUNSELOR How long? WALTER April. EHARMONY COUNSELOR  April ?   One   April?  18. WALTER Yeah. But I was working at Orange Julius to save money for college. That April. And my hands were always sore from working the Frother. EHARMONY COUNSELOR Can you play any pieces? WALTER Sure. EHARMONY COUNSELOR Which? WALTER A piece of Cheers. The first piece. Part. EHARMONY COUNSELOR I don’t know if we should list that. Walter gets a text from Odessa that says   I’m leaving.  WALTER Hey, Todd. I have to go. I have a piano situation I have to take care of. EHARMONY COUNSELOR Okay, man. WALTER Um hey, can I have my four hundred dollars back? EXT. BATTERY PARK, NYC - LATER Walter walks up to Battery Park to find (really) a grand piano sitting in the park. He stops and stares at it awhile. EXT. BATTERY PARK, NYC - LATER Walter sits at the abandoned piano (in pristine shape). Regular NY foot traffic passes around him. He absentmindedly starts playing the first bars of   Cheers . Then he just keeps doing it because he’s thinking of other things. GUY IN PARK Stop playing Cheers, Dick.  19",
      "dialogue_count": 0,
      "word_count": 1617
    },
    {
      "scene_number": 3,
      "slugline": "EXT. 6TH AVE, NYC - LATER Walter is carried on the group of Frenchmen’s shoulders as they run him up 6th avenue, chanting. FRENCHMEN (European sports chant) Wal-ter Mi-tty. INT. LOBBY, TIME-LIFE BUILDING - LATER The French mob jogs through the lobby with Walter atop their shoulders. FRENCHMEN (European sports chant)  Wal-ter Mi-tty . INT. ELEVATOR, MOVING - MOMENTS LATER Among more serious-looking businessmen and woman, the raucous tour-de-France style congratulations party continues. Walter’s just being mobbed by ecstatic Frenchmen. INT. FORTIETH FLOOR, ELEVATOR LOBBY - LATER No one’s around. We hear the quiet “ding” of the elevator arriving. Then Walter gets out. There are no crowds anywhere - just Walter in his short-sleeve dress shirt, tie and briefcase. He reaches his division floor offices door and enters his pass-key. Then his mom walks up - EDNA MITTY, 76. EDNA Hi, honey. WALTER (noticing her, surprised) Hey, Mom. EDNA Hi, Walter. Is it all right I’m dropping by? WALTER Sure, (meaning the open office area) we’ll just go through here to my office.  25.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 175
    },
    {
      "scene_number": 4,
      "slugline": "INT. DIVISION FLOOR - CONTINUOUS As Walter and Edna enter the division floor, colleague Tim Naughton walks past. TIM NAUGHTON (to Walter) They just called a conference. WALTER (following Tim, with his mom at his side, to her) Hey, your new place is almost ready. We just had a little hiccup due to Odessa just not getting the right one. EDNA Well, she’s the artist... WALTER Why did she get the cool name? She got to turn out cool. EDNA I named her after a wonderful visit your Dad and I had to Odessa, our family’s homeland, one summer, in southern Ukraine. There’s a beautiful river there also named Odessa. WALTER Why did you name me Walter? EDNA I named you after Walter Matthau WALTER (noticing that a conference is starting) Okay. This is starting I think. We should probably just stop here to-- They’ve walked out onto the division floor where a group of forty or so employees has been gathered together to allow Ted Hendricks a speech (which he’s forcing a colleague to make). They stand a short distance away, in the middle of letting them know:  26.",
      "characters": [],
      "action_text": "TED HENDRICKS COLLEAGUE This will only take a moment. I just wanted to inform you all, reluctantly, that this month’s issue will be the last. The employees have been expecting this. Nonetheless, the news saddens and concerns them. TED HENDRICKS COLLEAGUE (CONT’D) You are all valued employees. But as we undergo this transition we wanted to be candid with you that some of you will be-- TED HENDRICKS (correcting him, a little more quietly, just to him)  Most . TED HENDRICKS COLLEAGUE (to Ted, quietly) What’s that? TED HENDRICKS  Most   of them. TED HENDRICKS COLLEAGUE We wanted to be clear that most of you will be determined non-vital to the new partnership. The remaining few employees will carry over into the new organization. We’ll be deciding which category your positions fall into over the course of the next week. Tim Naughton, among the gathered (soon to be former) employees, has begun a quiet, high-pitched, weeping. Walter has had to field this news while his mother stands beside him. TED HENDRICKS COLLEAGUE (CONT’D) Now for some good news. We’re very excited to-- At this point, Ted Hendricks nudges the guy to move over so Ted can assume the speaking part for the good news portion.  27. TED HENDRICKS Okay. So, we’re very excited to play a part in publishing what will be the very last issue of Life Magazine, which has been an American Institution for 75 years and whose renowned covers have touched us all really touching ways. And for the final issue, our cover is going to be something which is... (he forgot the word, looks at the editor for help) What was that word? EDITOR (whispering) Quintessence. TED HENDRICKS Our cover will probably be the most famous ever because it really has the awesome quintessence of Life. And we’re all going to be a part of this historic happening. Even those of you who will, right after the happening, be asked to leave. Thank you. Ted begins to clap (for some reason). So the gathered employees also begin some watered-down clapping. Walt",
      "dialogue_count": 0,
      "word_count": 1072
    },
    {
      "scene_number": 5,
      "slugline": "INT. AIR GREENLAND 747, FLYING - LATER The plane’s midair. Walter’s looking at the photo print the image of which (out of focus) he can’t make out, trying to unlock some idea of what it is. EXT. GREENLAND CAPITAL NUUK - DAY The capital, coastal town of Nuuk looks like it’s made out of Victorian toys. Walter’s plane drops into view and descends over these handsome little buildings. INT. PUB, NUUK, GREENLAND - LATER (EVENING) Walter has somehow gotten involved in a Danish folkdance which involves (exclusively) linking arms with elderly Greenlanders in colorful vests (the only colorful part of the event) and shuffling slowly from side to side while making a large moving (slow) outer circle. Also they chant in Danish. Walter performs this holding his briefcase. EXT. PUB, NUUK - LATER Outside the pub, Walter has been showing Greenlander teens his overexposed photograph. WALTER This looks like a chair. Here. It doesn’t really look like a chair. WALTER (CONT’D) Have you seen this chair? TEEN That’s not a chair. WALTER I think it’s a chair. Or a pipe. A man’s pipe. No one says anything. WALTER (CONT’D) Have you seen this pipe? TEEN That’s not a pipe either. WALTER (showing them another photo) Have you seen this Starbucks?  31.",
      "characters": [],
      "action_text": "SECOND TEEN I don’t know. Possibly. WALTER (another photo) Have you seen this man (or woman’s) thumb? INT. COFFEE SHOP, NUUK - MORNING It’s a fresh morning. Walter’s sitting in a coffee shop, looking out on the capital town street. Then he sees a cab pull up for him. INT. CAB, MOVING - LATER Walter sits in back. The older female cabby cruises the car past some open, pretty fields. CAB DRIVER Greenland is the least densely populated country in the world. There’s only 56,000 people. Lots to do. Most of us work a few different jobs, to cover everything. For example I drive this cab. A moment passes. CAB DRIVER (CONT’D) I’m also the Queen. Walter has been surprised. WALTER ...You’re the Queen of Greenland? CAB DRIVER Yeah. Oh, there goes my meter. Her meter’s gone out. CAB DRIVER (CONT’D) You want to just a call it 93 kroner? Flat rate. WALTER That’s cool... your Majesty. An awkward moment passes. WALTER (CONT’D) Should I call you that?  32. CAB DRIVER Sure. WALTER Is there anything around here that a renowned photographer might be photographing? CAB DRIVER No. WALTER Are you sure? CAB DRIVER Yes. WALTER I think he was here. CAB DRIVER Well, possibly if he was mistaken, he might have thought the Musk Ox migration was worth photographing. WALTER Can we see that? INT. CAB, MOVING, OUTSKIRTS, NUUK, GREENLAND - LATER Walter and the Queen continue their peaceful drive through the outskirts of Nuuk, Greenland. WALTER So are you Queen for life? CAB DRIVER Yeah. WALTER That’s a good gig. They’re making some changes at work. My work. They’re letting most of the divisions go. CAB DRIVER How long have you been there? WALTER Nine years. CAB DRIVER That’s tough.  33. WALTER How’d you get to be Queen? CAB DRIVER My dad was King. WALTER ...My dad sold ice cream. CAB DRIVER Here we are. Walter looks out the window. In a field they’ve parked beside, there are a few indigenous Oxen (they look like huge Jim Henson muppets) walking slowly. WALTER That’s the Musk Ox migration? CAB DRIVER Ye",
      "dialogue_count": 0,
      "word_count": 2111
    },
    {
      "scene_number": 6,
      "slugline": "INT. CAPTAIN’S QUARTERS - LATER Walter has dried off. He’s being tended to by some young Chilean sailors. He’s been sounding them out about where Sean O’Connell is. CHILEAN SAILOR Sean O’Connell? He was picked up. WALTER From your ship? CHILEAN CAPTAIN A pilot boat came. They took him. Four hours ago. WALTER Took him where? CHILEAN CAPTAIN I don’t know. It’s dawned on Walter that he’s missed Sean. Just by a little. WALTER Can we radio them? There’s something I need to discuss with-- CAPTAIN You jumped into the ocean with our radio components. No. We are, as you say, “on our own.” EXT. INTERNATIONAL SHIPPING FREIGHTER THE DOLORES - LATER The freighter’s hauling automobiles. The surface of the ship looks like a mall parking lot. One of the Chilean sailors accompanies Walter on a walk among the car rows. CHILEAN SAILOR You can sleep where Sean did. They stop alongside a Subaru. The Sailor opens the driver’s door. He means this is where Sean slept. In this Subaru. Walter’s confused. WALTER Sean slept here? CHILEAN SAILOR Yes.  42.",
      "characters": [],
      "action_text": "WALTER In this Subaru Outback? CHILEAN SAILOR Yes. That’s where our undocumented laborers sleep. Our Stevedores. He was photographing our workers. WALTER He was photographing Chilean Stevedores? CHILEAN SAILOR Yeah. WALTER (about the Outback) This was his room/car? CHILEAN SAILOR Now it will be your room/car. INT. SUBARU OUTBACK - SAME Walter has gotten in. There are five Chilean Stevedores in the back in different states of rest - sleeping, reading, playing chess. WALTER Hey. Walter. They wave. WALTER (CONT’D) Did you guys, were you living in this car back seat when Sean O’Connell lived in the front seat? Walter starts miming taking photographs. WALTER (CONT’D) Sean? BACK SEAT CHILEAN La Quintasencia.... The guy’s pointing to where Walter is in the front seat. SECOND BACK SEAT CHILEAN La Quintasencia. WALTER Is that-- Are you saying quin--  43. SECOND BACK SEAT CHILEAN La Quintasencia... WALTER Are you saying Quintessence? In the Spanish form? Yeah. Sean says that. A deck   Squall Alarm   sounds. These guys leave the car quickly (to perhaps batten something down). Walter notices the breaktime snack they were enjoying - half’s been left behind. WALTER (CONT’D) Is that Clementine cake? My mom makes-- I didn’t know anyone else made that. Walter’s alone in the Subaru. WALTER (CONT’D) Clementine cake. Wow. He reaches for some cake, it’s been sliced into pieces, wrapped bakery style in some stray paper from the backseat. Walter takes one such slice. While the storm lifts and lowers the ship, Walter enjoys some clementine cake, then he notices something about the paper scrap it’s wrapped in. There’s handwriting on it. Walter examines it. What Walter’s holding is a half-torn page bearing cursive handwriting. There is a date beside the word:  Eyjafjallajökull.   Then   TTL shoemount flash .   Zoom bounce flash. Nikon Camera....  WALTER (CONT’D) This is Sean’s. There is a later destination and date on the paper - and some scrawl beside it. WALTER (CONT’D) (excited) ...this i",
      "dialogue_count": 0,
      "word_count": 2430
    },
    {
      "scene_number": 7,
      "slugline": "EXT. NEW JERSEY TURNPIKE - LATER Walter’s carrying the piano on his back, walking down the middle of the New Jersey Turnpike, slowing down traffic. EXT. SUBWAY STATION, NY - LATER Walter climbs a set of stairs to the subway with the piano on his back. INT. SUBWAY STATION - LATER Walter sits on a bench waiting for the train. The Grand Piano is beside him. INT. SUBWAY, MOVING - LATER Walter has brought the piano onto the subway. Then the subway hits one of those mid-tunnel stops where the train stops, and the lights go on and off. When the lights return we see the piano’s gone. Walter’s still there though. CUT TO: A CHECK BOOK EXPENSE ENTRY  Piano move (third) - $1,100.00  INT. APARTMENT - DAY This is an empty (small) apartment. Walter and his sister ODESSA sit on the carpet. She’s pretty, good spirit, a little flighty (also she’s wearing braces). She’s watching Walter write this piano moving check. But she’s looking at a checkbook entry a few entries above it. ODESSA Does that say eHarmony? Four hundred dollars. WALTER Yes. ODESSA (a little amused) Are you on eHarmony? WALTER No. ODESSA Then why did you give them four hundred dollars?  55.",
      "characters": [],
      "action_text": "WALTER I tried to join, but-- I don’t really even want to be on it. I’m just trying to do this thing with someone at work. ODESSA (meaning do what) What? At this point we see a piano float up into view outside the living room window beyond them, odd because they’re fifteen stories up. WALTER I’m trying to do that Piña Colada thing? (singing pretty well) “If you like Piña Coladas, and getting caught in the rain while wearing a cape--” ODESSA That’s not how it goes. WALTER Well, the guy answers a personal ad and finds out it’s his wife. They have a good laugh, then they make love on the cape while drinking Piña Coladas or something, and wearing capes, I think. Anyway. I’m hoping she’ll click my profile and not realize that she works in my office area. Then we can realize it and have a good laugh. Then-- ODESSA Make love on a cape? While wearing capes? Because that’s not what they do in the song. WALTER No, then we can know that we picked each other out, you know, from the whole planet. Not just the cafeteria. Walter’s quiet for a moment. WALTER (CONT’D) ... We’re friends. I’d like there to be more.  56.  (MORE) I was hoping this web site (that they won’t let me be on) would show her more. Walter is putting his checkbook back in his briefcase. Odessa has noticed the out-of-focus photo Walter carries in it. ODESSA (about the picture) What’s that? WALTER I don’t know. What do you think it is? Odessa looks the photo for a while. ODESSA (trying to make it out) ...Triple A batteries working, as a team, to carry a fish tank up some apartment stairs. Out the window we see that the piano is attached to a crane. Movers have lifted it up to the fifteenth floor. Walter looks out at it from the small, small room they’re in. WALTER We better tell them they need to shift that over to outside the big room. ODESSA What big room? WALTER (sensing there is going to be some problem) The big room where the big piano is going to go. ODESSA  This   is the big room. Walter’s surprised. There’",
      "dialogue_count": 0,
      "word_count": 3174
    },
    {
      "scene_number": 8,
      "slugline": "INT. CHERYL’S STUDIO APT, BROOKLYN - NIGHT Cheryl’s watching the nightly news - specifically a report about escalating violence in Somalia. NEWSCASTER (V.O.) In a city already long ago descended into chaos-- Against the news report, we see news video from Mogadishu - car tire fires mid-city, skinny goon squads, gun-toting 11- year-olds, and in each of them there is a glimpse of Walter Mitty, usually in the far background and generally just hustling (but not running) just hustling across the street in his short-sleeve shirt and briefcase presumably to do some sort of business there. Cheryl has noticed this. EXT. MOGADISHU, CITY PARK   - DAY Walter’s sitting in a shitty park in Mogadishu. Walter once had a dream like this - where he was in a hotspot like this. Now he is. He’s speaking to a Somalian sitting on the bench facing his. *occasionally, people pass by carrying small deers. WALTER Do you know-- are there American journalists working here? What would someone want to photograph here? SOMALIAN The evacuations. WALTER Who’s evacuating? SOMALIAN The peacekeepers. WALTER (like that’s not good) The peacekeepers? SOMALIAN Yeah, they’re evacuating. WALTER Like right now? SOMALIAN All week. The Koreans are leaving from the soccer field.  71.",
      "characters": [],
      "action_text": "The guy has pointed a block east of there. EXT. SOCCER FIELDS - LATER Walter has run up to the Mogadishun soccer field to find a group of Korean soldiers amassed at midfield. Then he makes out a blond white photographer among them. Walter has started running across the soccer field. WALTER ...Sean? EXT. SOCCER FIELD - LATER Across the field, SEAN O’CONNELL (42) is in a squatted, interlocked arm embrace with four Korean soldiers. There’s aircraft noise above them. WALTER Sean? The photographer turns around. WALTER (CONT’D) Sean O’Connell? Sean looks at Walter coming nearer. He doesn’t recognize Walter. WALTER (CONT’D) Hey. Walter Mitty. From the office. SEAN  Walter ? Walter has reached the group. WALTER ...Yeah. Hey. Man, I’ve really been trying to reach you. (to the Koreans) Hey. (to Sean) It’s good to finally meet you. Thanks for the wallet, man, by the way. Sean, do you happen to know where that negative 12 is. 2-6? On the roll three? SEAN ...you have it.  72. WALTER You know what, we don’t. I’ve looked in every neg box and even every camera bag and we have in the warehouse. I even double-checked the Teaneck warehouse. SEANN  You   have it. WALTER I really don’t. SEAN (proud) No, it’s not in the neg box. That one was special. Favorite ever. You have it. Seriously. Loan me five bucks. WALTER Loan you...   what ? SEAN Loan me five bucks. Walter doesn’t know why this became important to Sean just now. But he reaches for his wallet, but when he looks up, he finds that Sean and the Korean guys he’s attached to have been lifted as a group briskly into the air. They’ve been tethered to a hovering rescue helicopter that’s withdrawing quickly. Sean’s yelling something down. It’s unclear. They ascend further as a unit, way up, way out of reach, getting smaller. Walter, though remains down on the soccer field. WALTER (quietly) Fuck... SOCCER FIELD - LATER Moments later, Walter remains there, holding five bucks that’s flapping in the wind. He’s watching the Koreans and Sean ",
      "dialogue_count": 0,
      "word_count": 586
    },
    {
      "scene_number": 9,
      "slugline": "EXT. MOGADISHU - LATER Walter’s back in the city park, talking to the same Somalian who told him where to find the Koreans. WALTER Do you have any sense how I could get back to America if I can’t afford a plane ticket right now? Totally? RODNEY ...Yeah, my brother William. Two dollars. WALTER I give your brother two dollars and then he’ll tell me how to get back to America? RODNEY Two dollars. To go to America. WALTER ...I can go to America for two dollars? CUT TO: EXT. CAR - DAY Walter's behind the wheel of a small car. But as the camera pulls back, we see that he's behind the wheel of a small car parked on another large shipping vessel (Chinese this time). EXT. INDIAN OCEAN - MOMENTS LATER Still sitting in one of the cars, Walter’s made a phone call. EHARMONY COUNSELOR Eharmony. Todd Mahar. WALTER Hey, Todd. It’s Walter. Mitty. EHARMONY COUNSELOR What’s up, Walter? WALTER Hey I wanted to add a couple items? EHARMONY COUNSELOR Okay.  74.",
      "characters": [],
      "action_text": "WALTER To my Been There, Done Thats. If that’s cool. EHARMONY COUNSELOR It’s really cool. What do you got? WALTER Okay. Mogadishu? EHARMONY COUNSELOR Yeah. WALTER Been there. The shot lifts up and we see the full scope of what Walter is willing to do to keep his job, sleep in a Chinese car on a Chinese boat, on a slow trip back home. INT. LOBBY, APARTMENT HIGHRISE, NEW YORK - LATER Walter walks up to the front desk of a residential apartment building. WALTER Cheryl Mellhoff. FRONT DESK LADY Your name? WALTER Walter Mitty. She dials the inner-building phone, then has a brief conversation with Cheryl. Walter waits quietly. FRONT DESK LADY (to Walter) Have a seat. She’ll be right down. WALTER Thanks. Walter’s holding the Arabic skateboard. INT. LOBBY - MOMENTS LATER Cheryl and her son Rich have entered the lobby waiting area to greet Walter. *We’re only on her for the top of the following exchange  75. CHERYL Hey. WALTER (O.S.) Hey. CHERYL Did you find the Quintessence of Life? WALTER (O.S.) Almost... CHERYL Man, I’m sorry. (concerned about him) How are you feeling? WALTER (O.S.) ...I’m okay. Now we see Walter; he’s a short distance away in the seating area, but he’s not seated because he’s a human cubicle. He’s shaped like a cubicle. WALTER AS A CUBICLE (gesturing with the Arabic skateboard) Hey, I picked this up for you, Rich. It’s got some cool Arabic writing on it. I don’t know what it means. But it looked cool. EXT. AVENUE A, NYC - LATER They’ve gone out among the throngs of New Yorkers, walking up the sidewalk of Avenue A. Walter is with Cheryl and Rich but he’s remained a cubicle. EXT. SKATE PARK, WEST SIDE, NYC - LATER Walter (real Walter again) and Cheryl are sitting on the lip. Rich is out using the Arabic skateboard. CHERYL (impressed about the board) ...Walter. You go to Mogadishu, and you think about bringing a gift home to my son?  76. WALTER I got the board in Dubai. Hey, Rich. Here watch. The board’s going to come up. You don’t have to try to lift it. W",
      "dialogue_count": 0,
      "word_count": 2767
    },
    {
      "scene_number": 10,
      "slugline": "INT. VILLAGE TRAVELING LODGE - SAME (NIGHT) Walter speaks with a mountain guide near the lodge fireplace. WALTER I’m trying to locate a photographer. GUIDE How can I help? WALTER The information I have (from my mom) is that he’s working with a guide named Stepit. Any idea... is that enough of a clue where they might be? I know they’re photographing snow leopards, and this is the snow leopard region-- GUIDE They’ll be in the Kosi forest. That’s where Stepit was raised. When he’s booked it’s to go there. It’s dangerous. Only he can take you there safely. WALTER I need to go there. GUIDE I can take you. For a fee. There is a pause. WALTER Didn’t you just say that only that  other guy   can take you through there? Safely? GUIDE (he’s a huckster) ...Did I say that? WALTER Yes. GUIDE I didn’t mean that. I meant that only he and   I   are the guys who can do that. Walter looks skeptical.  88.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 167
    },
    {
      "scene_number": 11,
      "slugline": "EXT. SNOWFIELDS, FOREST, QEEUNG NEPAL - LATER Walter and the guide drive snowmobiles up into the hilly distance of Nepal. EXT. FOREST AND SNOWFIELDS - LATER They’ve gotten off their snowmobiles. Walter has started walking west - all we see that way is snow, mountains and forest. WALTER This way? GUIDE Yeah. WALTER Aren’t you coming? GUIDE I can’t walk in the snow. It’s hard as shit. (pointing) Just go that way. WALTER That’s-- that’s how you’re   guiding  me? By pointing and saying go that way? Walter has pointed to make a point. But his guide adjusts the direction of Walter’s sarcastic point slightly. GUIDE A little-- to the left. (as Walter does it) There. Yeah. After a moment, Walter starts to go that way. EXT. SNOWFIELDS, FOREST - DAY A massive snow scape. You can only see a snow horizon and bare forest, and Walter walking across it (with his briefcase). Total middle of nowhere. He walks for a while, then his phone begins to ring. WALTER ...Hello. EHARMONY COUNSELOR Hey.  89.",
      "characters": [],
      "action_text": "WALTER (they know each others voices by now) Hey, Todd. EHARMONY COUNSELOR What’s up? WALTER Not much. EHARMONY COUNSELOR Good news. I think we’re going to be able to get you on eHarmony. WALTER Okay. Cool. EHARMONY COUNSELOR Your profile has rounded out a little. I put your travels in. There’s enough going on in your profile so now we can submit you. WALTER Great, man. EHARMONY COUNSELOR Where are you now? It sounds cold. WALTER It even   sounds   cold? EHARMONY COUNSELOR Yeah. WALTER Nepal. EHARMONY COUNSELOR Hey, Walter. Why didn’t you submit any pictures? Most people have photos of them with friends, out on the town. WALTER I don’t really do a lot of, you know, swinging. EHARMONY COUNSELOR  Swinging ?  90. WALTER Yeah. EHARMONY COUNSELOR Swinging means fucking married people. When you’re married. WALTER Oh. I don’t mean that. EHARMONY COUNSELOR No. WALTER I meant like partying, I guess. I used to like to be at work at 8. And I have some family demands that keep me pretty busy. EHARMONY COUNSELOR Your mom and sister. WALTER Yeah. EHARMONY COUNSELOR You know. People don’t know they’re leaning on you. Until you move. And they fall. WALTER (not in the mood for advice) Are you Chinese? You’re so wise. EHARMONY COUNSELOR I’m neither. But I know you, Walter. I’ve been studying you here. You seem to carry a lot of weight. WALTER Well, I’m not going to move and let the people who lean on me fall, because the people who lean on me are my mom and my sister. EHARMONY COUNSELOR Are you in a bad mood? WALTER A little.  91. EHARMONY COUNSELOR Well, let’s keep rounding this profile out. What do you do during your downtime? WALTER I don’t get a lot. But I guess if I had to say - mostly I just consider thoughts... for my visions for ideas and scenarios about the world. EHARMONY COUNSELOR (like that sentence doesn’t actually mean anything) You consider thoughts for your visions for ideas and scenarios about the world? WALTER Yeah. EHARMONY COUNSELOR You daydream? Todd has gotten t",
      "dialogue_count": 0,
      "word_count": 5376
    },
    {
      "scene_number": 12,
      "slugline": "EXT. SUBWAY STATION, BROOKLYN - NIGHT Walter has returned to Brooklyn; he’s heading up a set of Subway stairs up to a neighborhood street. INT. TIME-LIFE BUILDING, NYC - DAY Walter crosses the huge lobby, dressed as always for work. INT. ELEVATOR - MOMENTS LATER Walter has entered the elevator. He’s alone. It won’t work without his floor elevator key (which stopped working once he was let go). Walter waits a moment. Then he tries his key. The button illuminates. Walter starts to ascend. INT. WALTER’S DIVISION FLOOR, CORRIDOR - LATER Walter has reached the floor elevator corridor door to his division floor office. He’s just tried his pass key. That functions as well. INT. ACCOUNTING OFFICE - LATER Walter waits in a line at an accounting office window counter (like a DMV) behind recently let-go colleagues Tim Naughton and Gary Mannheim. Tim speaks to the accounting clerk. TIM NAUGHTON Tim Naughton? Severance package? She hands Tim his check. He’s sad, but he takes it and heads off. GARY MANNHEIM Gary Mannheim. Same. After a moment, Gary gets his severance. He’s also blue about it. Then Walter steps up. WALTER Walter Mitty? Is there a... possibly there’s a severance package for me? She starts typing into her keyboard. WALTER (CONT’D) I was fired for cause, but then I think I maybe gave them cause to provide me with a severance package.  117.",
      "characters": [],
      "action_text": "ACCOUNTING CLERK It’s not really a package. It’s just one check. For forty two hundred dollars. That’s what everybody’s getting. WALTER Okay. Possibly there’s that? For me? She’s typed additional stuff. Then she roots around in a check stash. Then she hands Walter an envelope. He takes it. He looks at it for a while. For the first time in a long while, he seems relieved. EXT. CENTRAL PARK, NYC - LATER Walter’s just walking through the park. He looks at peace. There are many others around, all coming and going at a normal pace, but the earth around them transforms from winter to summer smoothly over the course of thirty seconds as they naturally inhabit the park in their regular ways. So when Walter sits at a bench. It’s all midsummer around him. He’s smiling from relief. CUT TO: A FLOATING PIANO This is a grand piano mid-air in Manhattan. EXT. BATTERY PARK - LATER There’s a winch machine, a huge rig, lifting this piano to the 7th floor of the residential building Walter secured for his mom. Walter and Odessa stand in Battery Park, looking up at the piano. The movers are setting it into the removed window space. It looks like it’s going to fit. INT. VILLA, ROOM, RETIREMENT - LATER The piano has fit easily here. Odessa and Edna are straightening up, putting the last few things away. The room’s in good shape. It’s really pretty nice. Edna seems at home. ODESSA (to Walter) Hey, babe, come on. We’ll go grab lunch. Odessa and Edna head out the door.  118. WALTER I’ll be right out. They go. The room is quiet. Walter looks around again. Making it happen took considerable effort no one but Walter will know about. After a moment, he goes and sits at the piano. Some time passes. Then Walter plays the beginning of   Cheers . Then he gets up and follows his sister and mom out. EXT. 5TH AVENUE - LATER Walter’s walking with Odessa and Edna. They’ve come past a newsstand with magazine displays. Walter was going to walk right on by like Edna and Odessa did. But he’s noticed somethin",
      "dialogue_count": 0,
      "word_count": 986
    }
  ]
}