{
  "slug": "the-big-sick-2017",
  "title": "the big sick",
  "genre": "drama",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 18418,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. KUMAIL'S APARTMENT - LATER Kumail and Emily walk in. It’s typical bachelor pad boy house. Milk crates for furniture, mess everywhere, no art on the walls. Chris is sitting on the couch watching TV. KUMAIL  So my roommate Chris is probably on the couch. He's going to try and start a conversation. So no matter what- do not engage. Okay? Let's go. CHRIS Hi! Emily and Kumail walk by Chris avoiding eye contact. Kumail closes the bedroom door behind him. CHRIS (CONT'D) Good for him. INT. KUMAIL'S BEDROOM- CONTINUOUS Kumail’s bed is an inflatable air mattress. There are clothes everywhere. KUMAIL Do you want to watch a movie? EMILY Sure. Should I just, put my stuff down? Or... KUMAIL Yeah, I would say it's safe. You know what, go for that area. I cleaned that earlier this year. Kumail points to a corner of his room covered in dirty clothes. EMILY Should I take my shoes off or is this a shoes on bed? KUMAIL No, it's a shoes off bed. I have strict rules. Emily crawls onto the air mattress.  8",
      "characters": [],
      "action_text": "EMILY Oh wow. That's totally an inflated mattress. KUMAIL Yeah. Did you think it would be a flat inflatable mattress? EMILY I did think it might be an   actual  mattress. KUMAIL Well air mattresses are actual mattresses. You're being bigoted towards air based comfort items. Kumail picks up the remote and turns on the TV.   Night of the Living Dead   is playing. KUMAIL (CONT'D) Night of The Living Dead? EMILY Sure, I haven't ever seen that movie. KUMAIL Okay, so basically the dead start rising. And the good guys, um... They eye each other flirtatiously. Laugh. Lean in and kiss. INT. KUMAIL'S LIVING ROOM Chris hits the Siri button on his iPhone. CHRIS Text Lauren. You up girl? SIRI What do you want to say to Warren? CHRIS Ah, no. Fuck. Chris hits the Siri button again. SIRI What do you want to say to-  9 CHRIS You up? Period. Send. SIRI That may be beyond my abilities at the moment. CHRIS Fuck.  INT. KUMAIL'S BEDROOM - NIGHT Kumail and Emily post-coital.  EMILY What are these scars? KUMAIL O h, they're a small pox vaccination.  EMILY I thought only old people had those. KUMAIL Well I'm from Pakistan. We're still fighting some battles you guys have already won.  EMILY What were you like in high school? Were you like, super funny? Were you really smart? KUMAIL I was very shy. They called me chashmullee .  EMILY What is that? KUMAIL It roughly translates to \"dweeb.\" I'll show you a picture.  Kumail flips through his phone and produces his old high school photo, shows it to her. EMILY Of you in high school? Oh my god!  KUMAIL Boom.  10 EMILY No. KUMAIL And I'm thinking I'm killing it right now.  EMILY  What inspired this hair cut?  KUMAIL Hugh Grant.  EMILY Oh no. And you're so serious. KUMAIL  I read in an interview with Hugh Grant, he said he doesn't smile because it makes his face look fat. So I didn't smile in pictures for many years. What were you like in high school? Were you voted... Most Sexy? EMILY No. I was voted “Most Noticeable.” KUMAIL That's good. EMILY No. ",
      "dialogue_count": 0,
      "word_count": 2629
    },
    {
      "scene_number": 2,
      "slugline": "INT. PLAYGROUND THEATER - STAGE - NIGHT Tiny theater, sparsely attended (Emily, her friend JESSIE, Mary and CJ). On stage is a kid’s room. A NINJA TURTLES POSTER, a PRAYER MAT.  KUMAIL I'm twelve years old.   This...this is home.   Feels like I never left.   Do you smell that?   That's my mom cooking the  Murgh Roghen Joash . CJ ( quietly, in the audience ) Fuck. KUMAIL Do you hear that?   That's my father watching cricket on the telly.   Do you feel that?   That's the weight of Pakistan's history. TIME CUT TO:  A MAP OF PAKISTAN is behind Kumail. KUMAIL (CONT’D) Pakistan was formed when it separated from its biggest rival, India, on August 14th 1947.  TIME CUT TO:  Kumail now wears CRICKET PADS & holds a BAT.  KUMAIL (CONT’D) Six runs!  TIME CUT TO: Kumail pulls up a diagram of a cricket field.  KUMAIL (CONT’D) Silly Mid On, Short Mid Wicket, Midwicket, Deep Mid Wicket, Mid On, Long On, Long Off... CJ stretches in the audience.  JESSIE  (quietly, from the audience) I have to leave as soon as the show's over.   I can't stay.  24",
      "characters": [],
      "action_text": "Emily nods in understanding. KUMAIL So if you get a Silly Mid On fielder, you know you're getting a Yorker soon.  TIME CUT TO: Return to the MAP OF PAKISTAN  KUMAIL (CONT’D) So to review, Pakistan's biggest exports are cotton and... AUDIENCE Concrete. CJ (quietly) Kill me. TIME CUT TO:  Kumail wears a SHALWAR KURTA. KUMAIL Eid Mubarak.   That's our Christmas. Except instead of the traditional Christmas ham, we serve Mitthai, which my khansama Chris will serve to you right now. Khansama is Urdu for servant. Chris hands out WHITE SUGARY CHALKY CUBES from a tray.  KUMAIL (CONT’D) If you'd like to make it at home, the main ingredients are condensed milk, sugar, and love.   At least, that was my mom's recipe. CJ (quietly, to Chris) Hey, you look like a children's toy from Malaysia. KUMAIL Now all rise for the Pakistani national anthem. All stand with their hand over their hearts as Kumail sings.  25",
      "dialogue_count": 0,
      "word_count": 342
    },
    {
      "scene_number": 3,
      "slugline": "INT. BACKSTAGE - LATER Emily meets Kumail backstage.   She wears a SWEATSHIRT with BRAINS on it.  EMILY Hey!  KUMAIL Hey!   So? What did you think? EMILY  Um, I thought it was great. KUMAIL Yeah? EMILY  I never knew that Pakistan had the world's largest irrigation system. KUMAIL Yeah. Something like 14 million hectares are being irrigated. As soon as I read that I was like \"oh, that's going in the show.\"  CJ and Mary appear behind them. CJ Hey, that was... You were in the zone, man.   That was the best one we've seen. MARY Yeah, that was so honest and good. CJ And you know what I realized halfway through?   You're from Pakistan! Good to see you Emily! EMILY Bye guys! CJ Keep up the- They exit.  KUMAIL  They seem to like it. EMILY They're so nice.  26",
      "characters": [],
      "action_text": "KUMAIL So, really what did you think?   You know, it's a work in progress... EMILY I really liked it.   I learned a lot. About Pakistan, and cricket.   All those positions.   But I just wish that I learned more about you.   Does that make any sense? KUMAIL Yeah. INT. KUMAIL'S BEDROOM - LATE NIGHT Kumail is asleep. EMILY is awake. She looks over at Kumail, and very silently, guiltily, crawls out of bed. INT. KUMAIL'S LIVING ROOM - CONTINUOUS Emily sneaks past Chris who is passed out on the couch and goes into the bathroom.  INT. KUMAIL'S BEDROOM - CONTINUOUS Emily looks around Kumail's bedroom for something. She starts putting her clothes on. Kumail wakes up. KUMAIL Hey.  EMILY Oh, hi! KUMAIL  It’s 3 AM. EMILY Is that diner around the corner open? KUMAIL It’s 24 hours.   Why?   You want an old lemon meringue pie?  27 EMILY You're so funny!   Actually, no, I just...I really need to get a cup of coffee. KUMAIL I can make you coffee. EMILY I love diner coffee.   That burnt taste.  KUMAIL All right, I'll come with you.  EMILY No, no! Why would you do that? KUMAIL It's a bad neighborhood. I'm not gonna let you go on your own.  EMILY Why cause I'm a woman?   Seriously, that's the most misogynist thing I've ever heard.  KUMAIL Why are you being so weird? EMILY Fuck you, I'm not being weird.  KUMAIL You're being so weird. EMILY Fuck you. You're being weird!   You're being so weird! KUMAIL How am I weird?   I want to sleep while it's sleep time.  EMILY  This is normal.   Girls go to get coffee in the middle of the night.   Have you never had a girlfriend before?   This is what it's like.  KUMAIL Are you okay?  28 EMILY Everything is not okay. Everything is not okay. KUMAIL You can tell me anything, you know that right?   You can tell me anything. EMILY I have to take a shit ok? I have to take a huge fucking dookie.   I can't take a poo in your bathroom because you don't have any matches and you don't have any air freshener. What kind of person doesn't have any matches or air ",
      "dialogue_count": 0,
      "word_count": 3155
    },
    {
      "scene_number": 4,
      "slugline": "INT. CITY VIEW HOSPITAL - EMERGENCY ROOM - NIGHT Kumail walks up to the reception desk. KUMAIL Hi. I am looking for Emily Gardner. Um, Emily Gardner?   She was checked in... A MAN is rolled in a a stretcher by EMTs.   The nurses run off. INT. HOSPITAL - MOMENTS LATER Kumail walks by curtained beds hearing screams, wailing, moaning. He finally sees Emily in a bed, hooked up to wires and monitors. She looks scared, a bit sedated.  KUMAIL Hey.  EMILY What are you doing here? KUMAIL Jessie called me and wanted me to make sure you were okay.   So how are you doing? EMILY Fine.   Totally fine. Never been better. A thousand percent fine.   Just like fainted a little at work.   I didn't have breakfast this morning.  KUMAIL Breakfast is the most important meal of the day.   You know that.  NURSE BETTE Ms. Gardner. Your room will be ready soon.   Okay? EMILY Oh, no, actually I'd love to go home and sleep in my own bed. NURSE BETTE Sir, can you step outside a moment, please?   If you want to stay you have to go to the security desk to get a pass.  45",
      "characters": [],
      "action_text": "KUMAIL Where is the security desk? NURSE BETTE It's downstairs.   Exactly where you walked in.   At the security desk. KUMAIL The security desk is at the security desk.   Got it.  INT. EMILY'S ICU ROOM   - LATER Emily is propped up. Kumail next to her. He has a badge. KUMAIL Can I get you something? Water. Juice. Coffee? Emily is essentially passed out. Kumail isn’t sure what to do. NURSE JUDY brings in a doctor. DR. WRIGHT, 30s, looks over at Kumail. DR. WRIGHT May I speak with you for a second?  KUMAIL (to Emily) I'll be right back.  INT. ICU ROOM HALLWAY- CONTINUOUS Kumail follows Dr. Wright out to a busy hallway. DR. WRIGHT There is a massive infection in her lungs. All her vitals are elevated. Does she have HIV? KUMAIL What? No. I mean she-- DR. WRIGHT Are you her husband? KUMAIL No--  46 DR. WRIGHT We need to intubate her immediately. I need a family member to sign this. So I’m going to ask you again. Are you her husband? KUMAIL What does “intubate” mean? DR. WRIGHT We have to put her on a respirator and to do that we need to put her in a medically induced coma. KUMAIL Coma. DR. WRIGHT Yes, to stabilize her so we can work on the infection. And it needs to happen right now. So, I'm going to ask you one last time, are you her husband?  Kumail signs the forms.  INT. HOSPITAL HALLWAY - MOMENTS LATER Dr. Wright and Orderlies rush Emily down the hallway on a GURNEY. Kumail runs with them. Trying to keep up. EMILY What’s going on?!   Where are you taking me? Emily disappears into an OR. Kumail watches DOCTORS and NURSES descend on her. Nurse Judy puts her hand on his arm. NURSE JUDY You should call her family. INT. EMILY'S ICU ROOM Kumail, freaked out, stares at Emily, hooked up to various wires on her arms and chest. He sees her purse and digs out her iPhone. It’s locked.   He looks over at Emily. KUMAIL I'm sorry.  47 He puts her finger on the phone. It unlocks. INT. HALLWAY - NIGHT Kumail scrolls down to PARENTS on Emily's phone and dials. A WOMAN’S VOICE picks up",
      "dialogue_count": 0,
      "word_count": 4071
    },
    {
      "scene_number": 5,
      "slugline": "INT. EMILY’S LIVING ROOM- LATER Terry, passed out on the sofa snoring. Kumail & Beth sit. BETH You weren’t supposed to be on the show tonight, were you? KUMAIL Oh? Me on the show tonight? Yeah, yeah I was. I was the headliner.  Beth stares him down.  KUMAIL (CONT'D) Okay. I lied about the show to get out of hanging out with you guys. And then I lied about headlining to impress you guys. BETH Well that didn’t work.  KUMAIL  Also, I think I screwed up with your daughter. BETH Yeah, you did. (then) I don’t know how people do it when their family's sick. My Uncle Lew, he got cancer, then he had a stroke, then a heart attack, then he had recurrence of the cancer. But you know what killed him? KUMAIL Cancer? BETH Car accident. We think maybe it was a heart attack while he was driving. And he did still have cancer too. And you know what? He ate sprouts his whole fucking life. Hadn't had a yolk in 30 years. I don't know how I’m going to sleep tonight. KUMAIL You wanna stress eat?  BETH Fuck yeah.  69",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 194
    },
    {
      "scene_number": 6,
      "slugline": "INT. EMILY’S KITCHEN TABLE- LATER Beth shows Kumail GOTH PHOTOS of EMILY in Emily's high school yearbook and on her laptop, amidst take out containers, desserts, chicken strips, whipped cream. KUMAIL Oh my god. BETH Most noticeable. Oh no, hold on, there's more. Beth scrolls through photos of Emily in GOTH ATTIRE, SWORDS, BLACK ROSES. She comes to photos of Emily in a cemetery. BETH (CONT’D)  The legendary cemetery photo shoot.  KUMAIL  Oh my god. BETH I laughed so hard when I saw these. She got so mad at me.  Kumail laughs. Terry stirs.  KUMAIL You're gonna wake him up. BETH Are you kidding me? He can sleep through anything. Hey Terry! She claps and Terry shifts, but doesn't wake up. KUMAIL  How did you and Terry meet? BETH I was going to East Carolina University and I was waiting tables. We met at this coffee shop, I was waiting on him. I liked his hair. He was a teacher already. Thick New York accent like nobody I’d ever met. Totally wrong for me. So naturally we fell-in-love. My family could not stand him. We're all military people, army pilots. All my brothers played football. Terry couldn’t even change a tire. My father got so mad he broke every dinner plate we had. (MORE)  70",
      "characters": [],
      "action_text": "Now back then, you go to the gas station, you fill up your tank, you get a dinner plate. But just one at a time. Cup, saucer. It took us a year of fill-ups to get the whole set back. And Terry just stuck around. Eventually they just all got over it. KUMAIL They just got over it. How? BETH Lots of fucked up dinners. How’d your parents meet, Kumail? KUMAIL So we have arranged marriage as you know. A big group got together to see a movie, but really it was just a set up so my mom and dad could meet. BETH What movie did they see? KUMAIL I have no idea. I never asked.  They look back at the GOTH PHOTOS of Emily.  BETH She’s great, you know? KUMAIL I know. BETH I feel good about this surgery. KUMAIL Yeah. These doctors know what they’re doing. BETH No they don’t. They’re just winging it like everybody else. INT. KUMAIL’S CAR - NIGHT Kumail gets into his car and checks his phone. Seventeen Missed Calls from his mom and ten voicemails. BETH (CONT'D)  71 KUMAIL Fuck. Then he notices an old voicemail from Emily. He hits play on the message.  EMILY’S VOICE  Hey it's me. So I tried making some Pakistani food to surprise you. And either I'm a bad cook or all Pakistani food is terrible. I don't know yet. Bye!  He hasn’t heard her voice in a while. He listens to another old voicemail.  EMILY'S VOICE Hey it's me. If you just wanna come over and like kiss me for two seconds, I'd really love that tonight. Ok. Bye!  He listens to another.  EMILY'S VOICE (CONT'D) Hey it's me. So did you want to meet at the gallery, or - Oh my god! Oh my god, a bird just hit me in the head. Oh my god I'm not kidding. I'll call you right back. Oh my god, is it okay?  INT. EMILY'S ICU ROOM  Emily lies unconscious in her hospital bed.  INT. BEREAVEMENT ROOM - DAY Dr. Spellman sits with Kumail, Terry and Beth. DR. SPELLMAN The infection around the lungs was removed. We should be able to pull her out soon.  TERRY Oh boy.  BETH How soon?  72 DR. SPELLMAN She should be up by tomorrow morning at the latest. We’",
      "dialogue_count": 0,
      "word_count": 896
    },
    {
      "scene_number": 7,
      "slugline": "EXT. KHADIJA'S HOUSE - LATER  Kumail walks Khadija to her door. KHADIJA I’ve just been through so many of these appointments and I never have anything in common with the guys. You know when girls at work complain about dating, I just want to body slam them. They have no idea. I don't know. My mom says I’m becoming the bruised apple at the bottom of the apple bucket. KUMAIL No, no. You’re not. KHADIJA I am. KUMAIL You're not. KHADIJA So do you want to hangout sometime? Like without our parents? Have you been to the cat cafe? The cats just come up to you and nestle in your lap and you just pet them. KUMAIL I don't think that's a good idea. KHADIJA You don't like cats? KUMAIL I mean I don’t think it’s a good idea for us to hangout again. It’s not you. You’re fantastic. I just can’t do this arranged marriage thing -- with anybody. KHADIJA So why did you meet me? KUMAIL It wasn't my idea. KHADIJA I’m just really tired. Do you ever want to just be in a relationship so you can finally relax?  75",
      "characters": [],
      "action_text": "KUMAIL I'm sorry. You deserve better than me. KHADIJA People always telling me what I deserve. It’s bullshit. And stop being so sorry about everything. I'm gonna go. Khadija starts walking to her front door, then stops and turns back to Kumail. KHADIJA (CONT'D) And you know what? I watched the X-Files, like three whole episodes, and it's a bad show. INT. WAITING ROOM - DAY  Beth, Terry, and Kumail sit. Beth and Terry with their laptops, Kumail with his iPhone. Each diligently typing. We see they’re each looking things up on WebMD.  TERRY Wow, they should call this website, \"Everything is Cancer Dot Com\". Everything you put in, it could be cancer. Hiccups could be cancer. Come on. You take the fun out of hiccups now. BETH Do you know this is the 17th best hospital in Chicago? TERRY Really? Out of how many? BETH I don't know, but Northwestern's number one. TERRY Well how do they rate it? What's their methodology? BETH I don't know, Terry. But 17th is bad. TERRY It's not great, unless the sample size is, you know, that all depends.  76 KUMAIL Here, look at the comments. TERRY This is why I don't want to go online cause it's never good. You go online, they hated Forrest Gump. Frickin' best movie ever. INT. HOSPITAL HALLWAY - LATER Terry talks on his cellphone and paces. Dr. Cunningham tracks him down. DR. CUNNINGHAM Terry - Hi. Can we talk? TERRY Yeah. DR. CUNNINGHAM We got the biopsy results. They are unfortunately inconclusive. We are concerned- Music drowns out the rest of their conversation as Terry looks increasingly distraught.  INT. HOSPITAL - HALLWAY - LATER Terry speaks with Beth and Kumail.  TERRY  They couldn't find out what the disease was, or where the virus came from or the bacteria or whatever. KUMAIL But they took out the infection so it shouldn't matter? TERRY I know, that's what I said but her vitals didn't normalize. And now they say that the infection is continuing to spread, it's in her kidneys. KUMAIL But the kidneys are so far from the lungs.  77 ",
      "dialogue_count": 0,
      "word_count": 904
    },
    {
      "scene_number": 8,
      "slugline": "INT. GIFT SHOP - MOMENTS LATER Kumail looking at gift items.  INT. HOSPITAL HALLWAY - LATER Kumail walks with a giant STUFFED GIRAFFE.  INT. EMILY’S ICU ROOM - MOMENTS LATER Kumail puts the STUFFED GIRAFFE by her bed. Nurse Judy smiles.  NURSE JUDY Oh, you're giraffe-ing it. KUMAIL It was the biggest thing they had. I don't even know if she likes giraffes. We never talked about giraffes.   Hey, do they know what they’re doing? Cause they don't tell us anything. Like, Lyme Disease? You know the girl on The Real World had it? Did you guys look for that? NURSE JUDY Yes, we did. KUMAIL Did you know she gets hurt all the time? She messed up her ankle recently - could that be Lupus? NURSE JUDY Kumail. We're looking into everything. We’re not holding anything back from you. We’re still just eliminating possibilities. KUMAIL Cause Beth wants to move her to Northwestern. NURSE JUDY Oh no. Emily should not be moved. The hospital will approve it because it'll get the liability off their hands, but we put her in a coma for a reason. To stabilize her. (MORE)  80",
      "characters": [],
      "action_text": "Moving her could be very dangerous. The infection could spread. Trust me she is fighting. And so are we. Kumail looks frightened. INT. WAITING ROOM - MOMENTS LATER Terry balls up his coat to use as a pillow, trying to get comfortable. Kumail enters. TERRY sees him and sits up. KUMAIL Hey Terry. I was just talking to the nurse - You okay? TERRY Yeah, of course. Totally fine. Terry's eyes are very puffy and red. TERRY (CONT'D) Beth went to Emily’s, so I’m gonna wait here until they kick me out. Keep an eye on her. Long pause. Terry and Kumail staring at one another. KUMAIL Do you wanna crash at my place?  TERRY You got the golf channel? KUMAIL No. TERRY That wasn't funny, right? KUMAIL I thought that was a serious question. TERRY Let's get the fuck out of here.  INT. KUMAIL’S APARTMENT - CONTINUOUS Kumail and Terry walk in. NURSE JUDY (CONT'D)  81 KUMAIL So this is the place.  TERRY Wow... this place is terrible. INT. KUMAIL'S BEDROOM - LATER Kumail and Terry lay on separate air mattresses. KUMAIL Hey I talked to Nurse Judy, and she was saying that moving Emily could be a bad idea. TERRY Really? KUMAIL Yeah, she said it could be dangerous. Terry listens but doesn’t respond. KUMAIL (CONT’D) Like... TERRY No. Yeah. I hear you.   I’d give anything to trade places with Emily. Being a parent, it's a nightmare. Loving somebody this much sucks. KUMAIL  Yeah.  Kumail not sure what to say. TERRY And I guess you’ve noticed some tension between Beth and me. KUMAIL Not really. That's none of my business. TERRY Yeah well, it's there. Big time. KUMAIL It's getting really late. We should go to sleep. Kumail turns off the light.   A beat of quiet in the dark.  82 TERRY I cheated on her. KUMAIL Fuuuuck. TERRY I did. It was just a one night stand. KUMAIL Okay. TERRY We met at some bar in Cincinnati. They have these teacher conferences. Who goes to a math conference to get laid?  KUMAIL Math teachers? TERRY Yeah. I think I was depressed, that's what it was. KUMAIL Yeah. Let's talk about",
      "dialogue_count": 0,
      "word_count": 6227
    }
  ]
}