{
  "slug": "the-rider-2018",
  "title": "the rider",
  "genre": "comedy",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 16034,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "I/E. FLIP CAM / CELL PHONE FOOTAGE  The Badlands of South Dakota. Young Indian cowboys at the Great Plains rodeos, on the Pine Ridge reservation.   At parties in motel rooms, on the road. Harsh, raw and wild.  BRADY, 21 years old, riding saddle bronc at various rodeos.  A final ride shows the near fatal moment when he is bucked off and trampled beneath the horse, sustaining a devastating head injury.   The crowd gasps as people run to help the young man lying crumpled on the ground...  I/E. HOSPITAL/CORRAL (DREAM SEQUENCE) Blackness. Sounds of a rodeo. Heavy breathing. Blurry flashing light. Brady’s eye, blood clogged, flutters open and closes. The blurry figures of doctors above him. Blood smeared across the white pillow.  Intercutting, linking Brady’s body to that of a horse’s body:  Brady’s scar-covered right hand twitches violently. / Horse hoofs kicking up dirt. Doctor’s hands put breathing tubes into Brady’s mouth and down his throat. / Brady’s hands putting a metal horse bit into a horse’s mouth. Doctor’s hands putting oxygen tubes around Brady’s face and up his nose. / Brady’s hands putting a leather halter around a horse’s face. Nurses’s hands holding Brady down, putting straps over his arms. / Brady puts a heavy saddle on the horse. Brady struggles, trying to pull himself away from the bed. / The horse Brady is breaking struggles not to be rode, bucking, shaking, neighing loudly. Black. EXT. PRAIRIE - DAWN The silence of a peaceful prairie at dusk. The sky shades of purple and orange. Short grass, rolling hills. Faint howls of coyotes in the distance. A small figure breaks the stillness.",
      "characters": [],
      "action_text": "Brady walks across the plains wearing a hospital gown and cowboy boots.   He has a gauze on the right side of his head. Fresh bruises around his eyes. He has run away from the hospital, dazed and tired from the long walk. He splashes through a stream of mud and horse shit. He walks towards the warm orange light of the trailer house in the distance. INT. BRADY’S TRAILER - LIVING ROOM - MORNING Brady walks into the dim living room. The light flickers. He is pale, covered in sweat and out of breath. BRADY Dad? He stands still. No answer. INT. BRADY’S TRAILER - LILLY’S ROOM - MORNING Brady walks in and finds his little sister LILLY asleep. She is 14 year old, bright, spirited and on the brink of womanhood. She has Asperger's Syndrome. BRADY Hey Lillian... Do you know where dad is? Lilly is still half-asleep. LILLY No... BRADY Ok... Go back to sleep. INT. BRADY’S TRAILER - BRADY’S BEDROOM - MORNING Brady wakes up in bed covered in sweat. INT. BRADY’S TRAILER - BATHROOM - MORNING Brady throws up in the toilet bowl. He takes a handful of prescription medication. 2. The bloody gauze is stapled to his head. He feels the staples with his fingers, taking deep breaths and begins to pull them out of his head with a hunting knife. The bloody staples drop onto the counter one by one. The fresh wound, stitched together on the back of his shaven head is shocking. It looks fresh and raw. INT. BRADY’S TRAILER - BATHROOM - MOMENTS LATER Brady wraps his head with plastic wrap and takes a shower awkwardly, taking care that his head doesn’t get wet. INT. BRADY’S TRAILER - LIVING ROOM - MORNING Brady walks through the messy living room towards the fluorescent glow in the kitchen. INT. BRADY’S TRAILER - KITCHEN - MORNING Brady waits as the coffee brews, spacing out. He takes a sip of the hot coffee. Another sip. His right hand twitches suddenly and starts to shake. Surprised, he quickly grabs it with his left hand, but drops the coffee cup. It shatters to the ground, coffee spilling across ",
      "dialogue_count": 0,
      "word_count": 1401
    },
    {
      "scene_number": 2,
      "slugline": "EXT. FAMILY CEMETORY - DAY The Blackburn family grave yard - a cluster of wooden crosses. Some ancient and some new. Rusted horseshoes and weathered cowboy boots are scattered around the long grass. Brady opens the barbwire gate. A bell tied to the metal, chimes gently as he closes it behind him. Brady prays silently in front of his mother’s grave. On the wooden cross it reads: Mari Blackburn. 1963-2013. A few children’s star stickers pasted on the weathered wood. Lilly’s handy work. Brady looks up at the wooden cross. BRADY I was tough, mom. The sound of bell chimes and long grass blowing in the wind. Brady sits there and listens. INT. BRADY’S BEDROOM - DAY Brady is trying to take a nap. The wound on the side of his head looks dried up. He can hear Lilly’s laughter. Lilly walks in. LILLY What’s the matter Brady? She sees his wound. LILLY (CONT’D) Oh boy. Oh poor Brady. BRADY Sit down, Lil. Brady grabs her hand and pulls her to sit down. She touches his shoulders gently while inspecting his wound. LILLY You won’t get hurt yourself... BRADY I didn’t mean to. LILLY It’s ok. Come here. 8.",
      "characters": [],
      "action_text": "Lilly gives him a hug. LILLY (CONT’D) Listen... This time... You don’t... Lilly struggles to find her words. LILLY (CONT’D) You don’t hurt boo boo? BRADY Yah. She points at Brady’s wound. LILLY This is a head. BRADY Yah. LILLY It’s called ‘skull’. BRADY Yah. I hurt my skull. You know what they had to do? They had to do surgery. LILLY Surgery?! Don’t joke me. BRADY You know what they do when they do surgery? LILLY What? BRADY What do they do? LILLY Got broke. BRADY Yah. Broke my skull. LILLY Yah. Broke my skull. 9. BRADY And you have to cut it with a knife. Then they put a plate in there and then they sew it up. LILLY But, but, but you said... BRADY I’m not gonna... not gonna what? LILLY Bucking horse anymore. BRADY Uh... Maybe. Lilly looks upset. BRADY (CONT’D) I’m not gonna die. LILLY Nope! I’m not gonna die either. I’m staying alive! BRADY Toughest cowgirl. LILLY Uh huh. EXT. BRADY’S TRAILER - NIGHT The sound of crickets and horned toads in the darkness. Brady walks down the wooden steps leading to the front door. He sits on the last step, in the dreary porch light, and spits at the dirt. He is tired but he can’t sleep. EXT. BRADY’S TRAILER - CORRAL - DAY Brady walks towards the corral wearing his leather rodeo jacket. His eye is still bruised and he looks tired as hell. Wayne is trying a bay horse, while the horse’s owner, FRANK, is watching. Frank is an old-school rancher cowboy with rough skin and a hook for a hand. FRANK He’s really moving good... 10. BRADY How you doing Frank? FRANK Hey Brady, how you doing? BRADY Shit... I’m healing up. Frank checks out Brady’s head. FRANK Looks pretty wicked there... Wayne rides over. He’s cocky and knows how much Brady hates watching other people ride his horses. WAYNE Frank. This idiot for a horse trainer you have ran away from the hospital four days after the surgery. FRANK Hey... Damn kid... WAYNE Don’t listen to anything he says. He may not be thinking too good. The older cowboys laughs. Brady bites his tongue. FRANK (",
      "dialogue_count": 0,
      "word_count": 1957
    },
    {
      "scene_number": 3,
      "slugline": "INT. BRADY’S TRUCK - DAY Brady is driving. He looks restless and nervous. EXT. REHABILITATION CENTER - DAY Brady walks through glass doors of a physical rehabilitation center and stops at the front desk. BRADY Hello, Ma’am. I’m here to see Lane Scott. EXT. REHABILITATION CENTER - HALLWAY - DAY Brady walks down the hallway looking for Lane’s room. INT. LANE’S ROOM - DAY Brady walks in and sees LANE sitting alone in the middle of the room in his wheelchair. BRADY Hey, brother, how you doing? He walks over to Lane’s chair. The room is sparse, with a small bed in the corner, a white support pole beside it leading into the ceiling.   The walls are covered in old pictures of Lane in his younger years as an up-and-coming bull rider. Lane can not speak. His bull riding accident has left him permanently paralyzed. He’s barely able to lift his left hand, using sign language to communicate. Brady gives Lane a hug, helping him to put his arm around him. BRADY (CONT’D) I missed you, brother. Lane slowly closes his eyes as they embrace. Brady pulls back after a moment. BRADY (CONT’D) You’re looking good. How you feeling? He looks at Lane’s hand for an answer. 18.",
      "characters": [],
      "action_text": "BRADY (CONT’D) Feeling good huh. It’s a pretty good place here. Lane starts to spell out each letter of the words with his shaking left hand. LANE (SIGN LANGUAGE) How’s your head? BRADY How’s my head...? Feeling aright... Lane starts to sign again. LANE (SIGN LANGUAGE) Rub some... BRADY Rub some... BRADY (CONT’D) ...dirt in it. Brady laughs. BRADY (CONT’D) And some Copenhagen too huh? Lane slowly smiles and starts to sign. Brady reads it. BRADY (CONT’D) R, I, D, E... Ride. Can I ride? Am I able to ride? Lane gives him a thumb up. BRADY (CONT’D) Not supposed to for a while. I wish I can ride, but... If I hit that plate in my head, it will cave the whole side of my head in... But... Brady looks down. INT. LANE’S ROOM - A WHILE LATER Brady and Lane watch a video of Lane on YouTube on an iPad. LANE (VIDEO)  My name is Lane Scott. I’m eighteen years old. I’m from Kennebec, South Dakota.  19. FRIEND (VIDEO)  Lane, he is young, but he is really good. Best bull rider coming out of South Dakota for sure.  LANE (VIDEO)  I mean... I mean, not trying to apply anything. But, me and superman have not been seen in the same room together, so...  Brady smiles and looks up at Lane. Lane smiles back. His face is a lot thinner now, than the young, vibrant man in the video. His facial muscle has been damaged by the paralysis, altering his looks. But Lane is smiling. He enjoys revisiting these moments. The video starts to show Lane’s wild bull rides, chasing after buffaloes, being a goofy teenager. Lane stands in front of camera, wearing a cowboy hat and striped shirt. LANE (VIDEO) (CONT’D)  I was about three years old when my dad introduced me to the rodeo world. There is nothing can really beat it. You get on a bull. Makes a good ride. Everybody in the stands stand up for you, yells and cheers. Your adrenaline is goin’. You just can’t stop but smiling.  Lane, in his wheelchair, eyes bright, grinning happily. He has not lost his spirit. LANE (VIDEO) (CONT’D)  There is nothing like strap",
      "dialogue_count": 0,
      "word_count": 1008
    },
    {
      "scene_number": 4,
      "slugline": "EXT. DAKOTA MART - DAY Brady walks across the empty parking lot towards the supermarket. INT. DAKOTA MART - DAY Brady picks up a bag of candy and looks over at the checkout. He sees TERRI DAWN, a young woman with pink hair and dark eyes. She glances back at him. He quickly looks away. Takes a deep breath and walks towards her. He puts on a smile. BRADY Hi Terri Dawn. Terri Dawn greets him but she is not friendly. TERRI DAWN Hi Brady. How are you? BRADY Is the manager here? TERRI No, why? BRADY Never mind... A moment of awkward silence as Terri scans the items. There’s a history between them, and Terri Dawn is playing disinterested. BRADY (CONT’D) I didn’t know you worked here. Terri Dawn rolls her eyes. TERRI DAWN There’s a lot that you don’t know. Brady hides his annoyance. BRADY So how have you been doing? Terri Dawn ignores him. Another moment passes. 23.",
      "characters": [],
      "action_text": "TERRI DAWN I’m dating your friend Tanner, just so you know. Brady looks at her, not sure what to say. TERRI DAWN (CONT’D) $9.50. Brady quickly searches his wallet. EXT. BRADY’S TRUCK - EVENING Brady drives as Lilly is singing, the sun setting behind her. BRADY Lil, I’m thinking about going to the rodeo. Do you wanna go with? Lilly looks up at Brady and shakes her head. LILLY No. Nope. BRADY Take you to the carnival after? Get on some rides? LILLY Carnival? Oh boy. Yes! EXT. EAGLE BUTTE RODEO & FAIR - NIGHT The announcers voice echoes out over the rodeo grounds. Brady walks towards the glow of the flood lights above the stadium, and makes his way behind the chute. Cat and the other RODEO BOYS are surprised but happy to see him. They shake his hand and check out his scar. Brady sits back and restlessly watches everyone getting ready.   He looks over at Tanner, who is getting ready for his bareback ride. Tanner gives Brady the finger. Brady shakes his head and looks away. The Lakota Flag Song is sung over the speakers. Brady and the boys listens with their hats off in respect. Tanner climbs into the chute, onto his horse. The horse starts to buck, rattling the steel bars, showing its power and aggression. 24. Brady and the boys steady it. The whistle blows. The gate opens. The bucking horse charges out and Tanner rides it hard into the arena. Brady and the boys cheer loudly for him as he rides 8 seconds. A perfect ride. The crowd cheers. The other riders soon follow. Brady watches a young rider gallop across the arena on his horse with envy. He wishes he was out there too. EXT. EAGLE BUTTE RODEO & FAIR - NIGHT Brady sits on a plastic horse on a carousel, feeling both nauseous and mortified. It feels like a bad joke. Lilly happily sits beside him, singing on her horse with her hands in the air. The spinning gives Brady a bad headache. Bright lights flash by in a blur of motion, overwhelming him. EXT. HORSESHOE BAR - SAME NIGHT Loud music. Neon lights. Rowdy cowboys. Bra",
      "dialogue_count": 0,
      "word_count": 1348
    },
    {
      "scene_number": 5,
      "slugline": "INT. BRADY’S TRUCK (OUTSIDE HORSESHOE BAR) - NIGHT The pale, bright moon is high in the sky. Coyotes howl from the distant Badlands. Lilly is playing with her recorder in the front seat. Humming softly a melody she made up. Brady and Terri Dawn share a joint in the bed of the truck. Their faces lit dimly by the red neon light of the bar. Both stoned. Brady leans forward to check on Lilly. BRADY Lil, you hear them coyotes howling? LILLY Yes! BRADY Are you cold? LILLY No, I’m not cold. Guess what? BRADY What? LILLY You’re the greatest adventure. Terri Dawn takes a drag of the joint and coughs.   She passes it to Brady. TERRI The problem with you boys... You don’t like to get your pride hurt. BRADY He was making fun of Lilly. TERRI No, he wasn’t. You know, we don’t care how she is. She don’t care how she is. Brady leans his head back, too high to argue. A moment later. TERRI (CONT’D) We all love her. I think you’re embarrassed of her. Not us. 30.",
      "characters": [],
      "action_text": "Brady looks over at her for a moment. He moves clumsily towards her and leans forward. She is a little surprised but doesn’t move away. He kisses her on the cheek and lowers his head into her lap. She maternally strokes his hair as he closes his eyes. INT. BRADY’S BEDROOM - NEXT DAY Gold star stickers are carefully applied onto Brady’s chest. Lilly is putting them on him while he sleeps. LOUD KNOCKS. She giggles and quickly scurries out of the room. Brady struggles to open his eyes. INT. BRADY’S TRAILER - DOOR WAY - DAY Brady opens the door, still half asleep, covered in star stickers. MILES, a middle-aged, rough looking landlord and debt collector, with a red face and steely blue eyes, gives him a stern look as he passes. His young song, at most 12 year old, stands behind him with the same annoyed look on his chubby face, clearly emulating his pops. BRADY Hey Miles. What’s goin’ on guys? They pass Brady and walk into the trailer. INT. BRADY’S TRAILER - KITCHEN - DAY Miles struts around the trailer like he owns it - which he does. He checks the light switches. MILES Looking for your dad. Brady wipes his face. BRADY He went to the horse sale yesterday. I haven’t seen him. MILES He owes me quite a bit of money on this trailer. I need payment. 31. Brady hides his surprise. BRADY Didn’t he pay last month? MILES No. It’s been four month since I seen money from him. I need somethin’. You’re gonna tell him I need some money or I gotta come and get the trailer. I’m tired of lookin’ for his ass. Miles opens the fridge and gets a beer for himself. He gives Brady another look, who is still covered in star stickers. MILES (CONT’D) I like your tattoos. He opens the beers and walks out. His son following behind. Brady looks down and finally sees the star stickers. BRADY Come on Lilly... INT. BRADY’S TRAILER - KITCHEN - SAME DAY Lilly is heating up a thin crust frozen pizza on a rotating pizza oven on the counter. While she waits, she plays with a Sesame Street music box. She cuts",
      "dialogue_count": 0,
      "word_count": 640
    },
    {
      "scene_number": 6,
      "slugline": "INT. DAKOTA MART - DAY Brady looks uncomfortable and out of place in the store uniform as he learns how to use the check out scanner.   His physical presence seems diminished, as if without his cowboy hat, and usual attire, he is somehow smaller. Brady interacts with CUSTOMERS. He is nervous but tries to be polite and do a good job. The line is long and he makes a mistake, running an item twice. One of the customer gets impatient. Brady quickly apologies. (IMPROVISE) When the line is finally cleared, Brady leans against the check out rubbing his brow. EXT. BRADY’S TRAILER - EVENING Bray’s truck pulls up. He climbs out like a wounded animal, tired and exhausted. He walks towards the house. INT. BRADY’S ROOM - EVENING Brady sits in bed reading a rodeo magazine. He hears the sound of a pick-up truck and looks outside. Wayne climbs out of the pickup with TODD, a local rancher. They talk business as they walk towards the barn. Brady quickly gets out of the bed and heads outside. EXT. BRADY’S CORRAL - EVENING Brady walks towards the corral. He sees Wayne and Todd are talking by his horse, Gus, who is tied to a metal poll. TODD ...I just don’t know about you horse traders... BRADY Hey Todd. Todd turns to Brady. He’s a large man, wearing dark sunglasses to cover the heavy scarring across his face. He shakes Brady’s hand. 33.",
      "characters": [],
      "action_text": "TODD How you doin’ Brady? Wayne looks over at Brady nervously. BRADY Pretty good... What’re you doing here? WAYNE Hey Todd, I haven’t talked to Brady about this. Can you just come back tomorrow and pick him up? TODD Aright I can. See you Brady. Todd senses the awkwardness.   He shakes their hands and leaves. BRADY What was that about? Brady stares at Wayne while petting Gus. WAYNE I had to sell him Gus, Brady. It takes Brady a moment to process what Wayne has said. BRADY Sell him Gus? What do you mean you had to ‘sell him Gus’?! Gus is mine. WAYNE Gus is part of the family. I guess it’s his turn for us to make a living. Brady is furious. It’s incomprehensible to him that his father could even consider this. WAYNE (CONT’D) You want Miles to haul the trailer? Me and Lilly have no place to live? BRADY You didn’t make any money at all? WAYNE Costs a lot to live. 34. Wayne is being dismissive, avoiding eye contact and untying Gus’s reins. BRADY Yah. Costs a lot to go to the fucking bars and casinos. He’s overstepped the line. Wayne bites back. WAYNE Fuck you, Brady, I don’t need your shit. It’s not like you can ride anymore, we gotta make a living somehow... Brady grabs Wayne’s shirt and pushes him against the metal gate. Wayne regains his composure calmly, staring Brady down. WAYNE (CONT’D) What’re you gonna do? Fight me? Brady looks away. WAYNE (CONT’D) What’s wrong with you? Wayne walks away leaving Brady alone with Gus. EXT. PRAIRIE - SAME EVENING Brady goes hunting rabbits with his pistol. Partly to let off some steam. He flips the gun in his hand like a pro. The sky is cold. Brady moves through the plains. Stops. Stays still. A moment later, he fires. He picks up the dead rabbit from the tall grass. EXT. CAT’S TRAILER - SAME NIGHT Brady dresses the rabbit on the deck under a dim lamp. Unmoved as he pulls back the fur, revealing the bloodied, raw torso and breaks the thigh bones. INT. CAT’S TRAILER - NIGHT The buzzing of a tattoo gun. GABBY, Cat’s girlfriend, is coo",
      "dialogue_count": 0,
      "word_count": 1870
    },
    {
      "scene_number": 7,
      "slugline": "INT. HORSESHOE BAR - DAY Brady eats a burger, watching Wayne flirting with SUMMER, a blonde bartender, who’s best days are behind her. INT. HORSESHOE BAR - LATER Wayne is gambling at the slot machines with Summer. Brady walks over. BRADY You ready to go dad? WAYNE In a little bit. It’s clear Wayne has had a few drinks too many. BRADY Come on, we need to get to Victor’s. It’s gonna get dark. BRADY (CONT’D) Victor has lights. Knowing it’s useless to argue, Brady sits down to play the slot machine himself. Summer peaks over at him. SUMMER (to Wayne) Is that Brady? WAYNE Yah. She looks at him again over Wayne’s shoulder. SUMMER Aren’t you one hell of a bronc rider? Brady stops playing, but doesn’t answer. WAYNE We don’t talk about that. SUMMER Ok... Brady goes back to playing, but his mind is elsewhere. 42.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 149
    },
    {
      "scene_number": 8,
      "slugline": "EXT. VICTOR’S HOUSE - EVENING Brady leads the buckskin horse they bought at the horsesale out of an old rusty horse trailer. VICTOR, a Lakota man, with a shaven head and smudged with tattoos, stops feeding his herd of chickens and greets them. Brady watches Wayne and Victor checking out the horse for a moment and walks away. He wanders through Victor’s land, littered with junk cars and old home appliances, almost swallowed up by sage bushes. He stops when he passes the corral and sees a beautiful bay horse tied up by the fence. He walks towards the horse carefully, stopping when it starts to get agitated. The horse is clearly wild. He reaches for the horse’s nose, it pulls back violently, eyes wild, nostrils flaring. Gently and patiently, Brady reaches out and pets his nose to keeps him calm. Victor walks up behind him. VICTOR That’s Apollo. BRADY Is he broke? VICTOR Some fucker tried to ride him and got bucked off. He quit and now it’s got all kinds of bad habits. BRADY What are you gonna do with him? VICTOR Probably just keep him wild. Brady keeps his eyes on Apollo for a moment. INT. VICTOR’S HOUSE - NIGHT Victor’s living room is dim, covered with wall art. He is holding up a massive joint. 43.",
      "characters": [],
      "action_text": "VICTOR This right here, is gonna save us. Save us all. WAYNE It may cure the Meth. Wayne sits back on the couch, chimes in. VICTOR There is gas in here. There is oil in here. There’s cloth in here. There is rope in here. It’s the future boys. Brady lights the joint. WAYNE So what do you think about that horse? VICTOR Looks pretty nice to me. WAYNE I want twelve fifty cash. She’s worth way more if you take her to town. VICTOR See you boys checking out them cars out there. Looks like you need some parts. Willing to make a deal? WAYNE ...I need a back windshield for an 82’ Camero. VICTOR What do you say I throw in that back window and I got seven hundred dollars? Brady rubs his forehead, annoyed. WAYNE Seven hundread... VICTOR Seven hundred and this bag of weed. BRADY Dad, I know someone that’ll pay more than that. 44. VICTOR But I have the cash now. WAYNE We can take this money now, buy another horse and make some money. You always smoke my weed up. Might as well just trade with him a little bit of grass. BRADY If that’s what you wanna do... WAYNE Aright, we got a deal. VICTOR Damn right. They shake hands. Brady looks down, it’s pointless to argue. EXT. FRANK’S HOUSE - CORRAL - THE NEXT DAY Brady trains Crystal by riding her and roping at the same time, getting her used to the rope. He rides her around the corral as fast as she can. The midday sun is bright. Brady struggles with the heat and a headache. BRADY Let’s take a break girl. Brady gets off Crystal. Suddenly his hand shakes and grips onto the rein. BRADY (CONT’D) Shit. Brady tries to peel his hand off of the rein. Crystal seems to sense Brady’s panic and begins to pull away, yanking Brady along with her. Brady still can’t get his right hand to let go of the rein. BRADY (CONT’D) Halt Crystal. Halt! Panicking now, Crystal shakes her head, shaking Brady’s arm along with it and backing away faster, until - 45. CRACK! Crystal’s body slams hard onto the wooden fence, breaking the fence in half. The pressure pulls th",
      "dialogue_count": 0,
      "word_count": 1752
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BRADY’S TRAILER - EVENING Brady takes the saddle from the back of the pick-up. Wayne is practicing roping. WAYNE What’re you doing with that saddle? BRADY I was gonna pawn it. WAYNE Pawn it? For what? BRADY That big bay horse at Victor’s. Apollo. I think he’s gonna turn out to be a good one. Brady waits. No response from Wayne. He turns and walks back to the trailer. INT. BRADY’S TRAILER - EVENING Brady walks in. Lilly is reading her book out loud. BRADY How’s school, Lil? LILLY It was fun. BRADY Oh yah? LILLY A sing along. I show you. Lilly starts to sing a lullaby in Spanish. Her voice is beautiful. Brady sits back and listens. INT. BRADY’S TRAILER - EVENING Brady is making frozen burgers. Wayne walks in and takes off his hat. WAYNE I called Victor. He said you can go pick up Apollo tomorrow. BRADY What? 53.",
      "characters": [],
      "action_text": "WAYNE I sold that buckskin to a guy in Minnesota. I told Victor I’ll pay once I get the money. Brady is surprised. He stares at Wayne who is checking out the burger on the stove. WAYNE (CONT’D) Those burgers are bad. He scoops the burger patties up and throws them in the trash, opens the fridge and gets a bear. Brady still stares at him. WAYNE (CONT’D) I’m going to the bar. He taps on the freezer. WAYNE (CONT’D) There’s pizza in here for Lilly. Wayne drinks his beer and leaves. Brady stands alone in the kitchen. A moment later, he smiles. EXT. VICTOR’S HOUSE - DAY Brady leads Apollo into the trailer and shakes Victor’s hand. VICTOR Good luck to both of you. EXT. BRADY’S CORRAL - DAY Brady uses a rope to lasso Apollo’s right hind leg. Apollo is agitated, kicking dirt and resisting by the fence. Once the rope is around Apollo’s heel, Brady ties the other end to a poll. He then grabs the saddle. Apollo starts the struggle. He is tough and powerful, but his halter and the rope holds him in place. The wooden fence shakes violently as he thrusts his body to break free. Brady puts the saddle on him and lets him lose. Apollo starts bucking immediately. Brady isn’t afraid, he welcomes it by running at Apollo, getting him agitated and bucking. Brady makes all kinds of loud and aggressive noises, waving his hat and hands. Apollo bucks and runs. It’s like a violent dance. Finally, Apollo seems to calm down a little. 54. Brady starts to flap the stirrup against Apollo’s body. Apollo starts to buck again. They go at this for a while until Apollo is desensitized. Brady grabs the rein and Apollo’s mane. He turns Apollo while keeping one of his feet in the stirrup.   When he feels comfortable, he swings around and gets on Apollo. Apollo’s body freezes. Brady starts to kick and signals Apollo to move. Suddenly Apollo starts to run real fast and bucking at the same time. Brady hangs on tight. Instead of trying to calm Apollo down, Brady keeps making loud noises, kicking and getting Ap",
      "dialogue_count": 0,
      "word_count": 860
    },
    {
      "scene_number": 10,
      "slugline": "EXT. BILL’S CORRAL - EVENING Music continues - Brady trains Bill’s horse - a brown Arabian colt that’s never been rode before. Bill is the silver-haired cowboy who asked him for help at the bar. The young horse runs around the corral, avoiding Brady and Bill at first, slipping, falling to the ground, getting up, runs again, panting, agitated. Brady is calm. Like a fish to water, Brady seems to understand every movement of the horse, as if they are locked in some kind of telepathic dance routine. Bill is speechless when Brady manages to get on the colt bareback in no time. INT. BRADY’S TRAILER - LIVING ROOM - TIME PASSING Music continues - Brady and Wayne are sitting at the table, sharing a joint and looking through horse papers. BRADY Heard about Superbars. He was a good old horse back in 60s or so. Wish he was buckskin. Wayne takes a galp of his beer. WAYNE Every body gets color blind in the horse world. BRADY You can’t ride the color, you can’t ride the papers. WAYNE No. The father and son continue to share their knowledge and love for horses. EXT. PRAIRIE - NIGHT - TIME PASSING The harvest moon is bright in the sky. The edge of the Badlands is visible in the dark. 57.",
      "characters": [],
      "action_text": "Brady walks around by himself. Music ends. End of time pass montage. EXT. BRADY’S CORRAL - MORNING Brady rides hard, galloping across the prairie. He slows down, puling on the reins as the sun glares down above him. He rubs his brow, suddenly feeling faint.   He lurches forward and vomits.   He loses control, jumping from Apollo and staggering before falling collapses onto the ground. INT. HOSPITAL - ER - DAY Brady wakes up in the dim hospital room. He is lying in bed, wearing a blue gown and oxygen tubes in his nose. He leans forward, pulling them off and ripping off the blood pressure aneroid on his arm. INT. HOSPITAL - DOCTOR’S OFFICE - DAY Brady sits opposite the DOCTOR at her desk, Wayne sitting on a chair in the corner. The doctor shows him the x-rays highlighting the severity of his injury. Wayne sits by Brady, slouched in a chair. DOCTOR What’s going on with your hand is called a partial complex seizure. It’s not uncommon with head injuries like yours. Brady wipes his forehead. Wayne shifts in his seat. DOCTOR (CONT’D) Your brain is sending these impulses so fast to your hand that your hand cant keep up. This could explain your dizziness and it’s probably why you fainted. Brady looks down. DOCTOR (CONT’D) Resting is very important Brady... Your Dad says you haven’t been resting at all? Is that right? 58. WAYNE I told him to rest. He never listens though. It’s lucky he didn’t hurt his head. DOCTOR If you don’t stop your seizures are going to get worse. No more riding, no more rodeos. You cant afford another head injury on top of the one you already have. OK? Brady leans back in his chair. Dejected. I/E. PICK-UP ON HIGHWAY - EVENING Wayne is driving. He looks over at Brady. WAYNE Well, Brady, sometimes we gotta play the cards we’re dealt. Sometimes... I guess... dreams aren’t meant to be. Brady stays quiet. Wayne looks over at him again. WAYNE (CONT’D) You know, I’m your dad. You can talk to me. Brady continues to keep quiet. WAYNE (CONT’D) Too bad your mom ai",
      "dialogue_count": 0,
      "word_count": 2852
    },
    {
      "scene_number": 11,
      "slugline": "EXT. PRAIRIE - DAY Brady walks around. It’s windy. He whistles and calls out for Apollo. He grows impatient. His whistle louder. But there is still no sign of Apollo in the wide open plains. Brady keeps walking. He stops when he notices something - A broken fence. The barbwire is broken and tangled. Brady quickly runs over. Blood and flesh scatter the ground. Brady finds Apollo. The barbed wire has badly cut through his joint like a hacksaw. Apollo is breathing harshly. Brady looks at the deep, bone cutting wound. His heart sinks. He tries to get Apollo to walk, but the injured horse trips and cries out loudly, neighing, panting. Brady knows what needs to be done. He sits down for a moment. Looks at Apollo for a long time. BRADY I’m sorry buddy. Should’ve stayed close to home... Brady takes his pistol out of the gun holder. He stands up, takes a deep breath, toughens up and points it at Apollo. Suddenly Apollo shakes his head, panicked, neighing, whining, as if he understood what Brady is about to do. The last bit of toughness in Brady is gone. He can’t do it. He uncocks the pistol. EXT. PRAIRIE - DUSK The sun has disappeared behind the Badlands. Wayne checks the bullets in the pistol and takes the rein from Brady. WAYNE Whistle for him when you walk away please. Brady walks away from them. 70.",
      "characters": [],
      "action_text": "Wayne points the gun at Apollo, unmoved. He has done this many times. Brady stops. He is facing away from Wayne and Apollo. He waits for a moment. The wind picks up. He whistles. BANG! A loud gun shot immediately follows, echoing out over the hills. Brady steadies his breath, staying tough. He spits and walks away. Behind him, Wayne takes his hat off as he looks down at Apollo’s lifeless body. INT. BRADY’S TRAILER - BATHROOM - NIGHT Slow motion of Brady’s hands, washing away Apollo’s blood. Water dripping down his face. His eyes are blank. INT. BRADY’S BEDROOM - THE NEXT DAY Brady wakes up slowly. He gets dressed methodically for the rodeo. He puts his rodeo hat on - a grey felt hat with an eagle feather. He looks himself in the mirror. Determined. INT. BRADY’S TRAILER - LIVING ROOM - DAY Lilly is reading. Brady sits next to her. BRADY I love you Lilly. LILLY I love you too. Brady watches Lilly for a moment. BRADY Apollo got hurt and we had to put him down. LILLY No. BRADY Yah. 71. LILLY Like skeleton? BRADY Yah. You know I got hurt too, right? Just like Apollo did.... But I got to live... He takes his cowboy hat off and looks at the dent still left from the horse hoof. BRADY (CONT’D) I was only kept alive because... I’m human... If an animal around here... got hurt as bad as I did, we’ll have to put them down. It just not fair to them if they can’t do what they were born to do... LILLY Heaven. BRADY Yah. They go to heaven. EXT. BRADY’S TRAILER - DAY Brady loads the saddle into his pickup. Wayne walks up. WAYNE Where are you going with that? BRADY Where does it look like I’m going? I’m going to the rodeo. Wayne is surprised. WAYNE You fucking crazy? BRADY I’m gonna ride. I figured you’ll come and watch. WAYNE What the fuck do I wanna come for? Watch you kill yourself? BRADY I’m gonna fucking ride, aright, dad? 72. WAYNE Whatever. You never listen to anything anyone says. Brady almost laughs. He turns around to face Wayne. BRADY I don’t listen?! I always fucking list",
      "dialogue_count": 0,
      "word_count": 2197
    }
  ]
}