{
  "slug": "the-theory-of-everything-2015",
  "title": "the theory of everything",
  "genre": "drama",
  "format": "film",
  "scenes_count": 19,
  "characters_count": 3,
  "characters": [
    "STEPHEN",
    "JANE",
    "SCIAMA"
  ],
  "total_words": 18285,
  "total_dialogue": 5,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. STEPHEN'S ROOM/DORM, CAMBRIDGE UNIVERSITY - DAY   (1963)  BRIAN knocks, enters, finds STEPHEN asleep in bed.  BRIAN  Oh come on, get up. How many have  you got?  BRIAN goes to STEPHEN's desk, looking through papers to find  his answers. How many have you done?  STEPHEN  Morning, Brian.  BRIAN  Afternoon, Stephen. Where are they?  Where are you hiding them? Your  answers.  STEPHEN  Brian, I have no idea what you're  talking about.  BRIAN  How many of Sciama's questions have  you done?  STEPHEN  None.  BRIAN  You liar!  STEPHEN  I was going do them later.  BRIAN  Later? You mean you haven't even  started?  Beat.  BRIAN (CONT’D)  Stephen, are you aware you have  voluntarily embarked on a PHD in  physics at one of the most  prestigious colleges in England?  STEPHEN  Yes.  BRIAN  Oh, good. Thought maybe you'd slept  through the induction or something.  BRIAN starts to leave  THE   THEORY   of   EVERYTHING   8  (CONTINUED)",
      "characters": [
        "STEPHEN",
        "JANE"
      ],
      "action_text": "STEPHEN  Sorry.  STEPHEN sets TWO TRAIN TIMETABLES on the table. Others push  the TIME-TABLES down the desk to SCIAMA, who picks them up.  SCIAMA  Train timetables?  Stephen, these are totally  unacceptable--they expired a month  ago.  Laughter.  STEPHEN  Sorry. It's on the back. Had a  little accident.  SCIAMA turns them over and looks at them.  TIGHT ON: the TIMETABLES, then are filled with tiny formulas  and calculations.  SCIAMA registers growing amazement, then looks up at STEPHEN -  STEPHEN (CONT’D)  I could only do nine.  End on SCIAMA and fellow students reaction - startled,  speechless, everyone staring at STEPHEN.  SCIAMA  Well...I see...well thank God. Well  done Stephen.  BRIAN  (silently mouths)  Nine?  EXT. RIVER - DAY  OARS powerfully cut the WATER as a   TWO-BOAT   PRACTICE RACE  unfolds. The TWO CREWS are from the same CLUB.  PAN DOWN one BOAT: EIGHT LARGE POWERFUL ROWERS, culminating  in PETE, DAN, RAFF, BRIAN and finally the thin, boyish,  STEPHEN, in the role of COX, facing the rowers, calling out  the stroke-rate using a coxswain's loud-hailer.  STEPHEN  Full,   give me twenty   - One,   drive ! -  Two,   drive ! - Three,   big legs ! -  Four,   press ! - Five,   boom ! - Hook,  send ! - Catch,   big send ! - Hold at  32! - Big legs, Brian! - Big legs!  THE   THEORY   of   EVERYTHING   10  CONTINUED:  (MORE)  (CONTINUED) - Stay long, Brian! - Stay long  Brian!!!...  BRIAN  (exhausted, speaks one  word on each stroke)  You! - complete! - and! - utter!  bastard!  INT. PUB ON RIVER - DAY  Rowdy tables of graduates and undergraduates and rowers,  males and females. Beer flows.  Playing PINBALL are BRIAN, REES, ELLIS and CARTER. STEPHEN  watches, drinking a beer, distracted.  CARTER  No, no, listen, listen, pay  attention. A man enters a lift,  wanting to go to the fiftieth  floor but only gets as far as the  46th. Why?  BRIAN  (exhausted)  Erm - there was a naked girl in  the lift.  Collective groan. BRIAN is clipped around the ears.  BRIAN (CONT'D)",
      "dialogue_count": 2,
      "word_count": 4352
    },
    {
      "scene_number": 2,
      "slugline": "INT. STEPHEN'S DORM ROOM/CAMBRIDGE UNI   - DAY (EM60'S )  Suddenly, a pounding on his door, and then BRIAN enters  STEPHEN's room.  WAGNER is playing INCREDIBLY LOUDLY on an old TAPE-DECK.  BRIAN shuts it off and looks at -  - STEPHEN, in the corner, in his pyjamas, his MATRESS now on  the floor (rather than on the HIGH BUNK as before) legs drawn  up, reading a book of CHESS.  BRIAN  \"Welcome--to this week's episode  of The Natural World, where we  explain the extraordinary  hibernation patterns of the rare  Cambridge Physicist--seen here in  his wonderful plumage...\"  Silence. BRIAN waits for STEPHEN to speak.  BRIAN (CONT’D)  So? What did they say? Your  wrist. What did they say?  STEPHEN  I have a disease, Bri.  BRIAN  (whispers)  Is it--venereal, Stephen?  STEPHEN  No. Motor neuron disease. Lou  Gehrig's Disease. He was a  baseball player.  BRIAN  Motor what? Sorry, I'm lagging  behind in my pioneering work on  rare automotive and baseball  diseases. Come on, let's go to  the pub.  BRIAN tries to pull STEPHEN to his feet.  STEPHEN  (impassively)  I have two years to live.  (Pause)  Sounds strange, doesn't it, when  you say it out loud.  BRIAN  What? I--I don't understand. It's  not possible! It's ridiculous!  THE   THEORY   of   EVERYTHING   29  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "You were fine a couple of days  ago.   (silence)  Steve? You're fine. What did they  say...?  STEPHEN  Will you leave me Brian?  BRIAN  I'm sorry, look, I was just being a  berk...I'm so...  The BEDDER knocks and enters.  BEDDER  Stephen! Phone for you! It's a  girl.  BRIAN has no choice. He is badly shaken by the news.  BRIAN  Right. OK. So--see you soon, yeah?  STEPHEN does his best to smile. Brian exits.  BEDDER  (to STEPHEN)  She's waiting.  INT. HALLWAY, WILDE FAMILY HOME - DAY  JANE on phone.  JANE  Stephen? Hi. It's me.  (CLICK!)  Stephen?  She holds the DEAD RECEIVER in her hand.  EXT. TRINITY HALL, CAMBRIDGE UNIVERSITY - DAY  Through the swirl of UNIVERSITY life comes - JANE WILDE.  INT. HALLWAY/STEPHEN'S DORM ROOM - DAY  JANE knocks - gets no answer.  JANE  STEPHEN?!  (knocks)  STEPHEN!  THE   THEORY   of   EVERYTHING   30  CONTINUED:  BRIAN (CONT'D)",
      "dialogue_count": 0,
      "word_count": 350
    },
    {
      "scene_number": 3,
      "slugline": "INT. STEPHEN'S ROOM / OXFORD UNIVERSITY - DAY  STEPHEN, huddled against the door, refused to answer   it.  EXT. CROQUET LAWN, CAMBRIDGE - DAY  JANE walks past the empty lawn.  INT. PUB ON THE RIVER, CAMBRIDGE - DAY  Full of undergraduates.  JANE enters, looks around for STEPHEN. Can't see him.  BRIAN, seated with the other YOUNG PHYSICISTS, spots her.  BRIAN  Jane!  JANE comes up the young men.  JANE  Brian--have you seen Stephen?  BRIAN  Jane, have a seat.  JANE sits.  JANE  What is it?  BRIAN  I understand you saw him. You know  he was in hospital...  JANE nods, as the CAMERA pulls back from the scene, leaving  BRIAN (sensitively) to pass the terrible news to JANE.  INT. COMBINATION ROOM/TRINITY HALL/CAMBRIDGE - DAY  JANE walks in, sees STEPHEN, slumped in an armchair  watching TV in the common room.  At a distance, JANE stops, shocked. He looks woebegone,  depressed, physically reduced already. She summons up a  cheerful demeanor, however, and advances.  JANE  Something educational?  STEPHEN  (without looking at her)  Very.  THE   THEORY   of   EVERYTHING   31  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "John is having an affair with  Martha. But Martha is in love  with Alan. And I think Alan is  homosexual by the look of his  shirts. I'm trying to work out  the mathematical probability of  happiness.  JANE  Are you close?  STEPHEN  It's some integer of zero, but  I'm not there yet.  JANE  STEPHEN?  STEPHEN  You just missed him. He was here  earlier.  JANE  Don't do this.  STEPHEN  What?  JANE  Cut me off.  STEPHEN  Go.  JANE  Teach me croquet.  (pause)  Come on. Teach me.  (pause)  What is this?  STEPHEN  I believe you poetry under-  graduate types call it...\"a  slough of despond.\"  JANE  If you don't get up and play a  game with me I won't come back  here again. Ever.  Silence. He finally looks at her. ANGRILY he rises. And  walks off ahead of her. She watches him.  THE   THEORY   of   EVERYTHING   32  CONTINUED:  STEPHEN (CONT'D)",
      "dialogue_count": 0,
      "word_count": 319
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CROQUET LAWN -  JANE AIMS, STRIKES, hits a FEEBLE SHOT.  STEPHEN  My turn.  STEPHEN AIMS, HITS his BALL through the FIRST HOOP, then  walks, as best he can, off toward his BALL, using his MALLET  as a WALKING STICK. With his second shot he hits her BALL. He  then picks up his BALL, places it beside hers so that it  touches, puts his foot on his ball, then smacks his BALL HARD  with his MALLET, blasting her ball down to the next hoop.  He proceeds to play a MASTER GAME that will not allow JANE  another shot, enlisting her ball to advance his own from HOOP  to HOOP, until -  - he knocks his ball and hits the finishing peg.  JANE has been watching all this, her eyes FLOODING WITH  TEARS, until she can bear it no longer, and walks up to him  and picks up his ball, stopping the game. They stare into  each others eyes, until he can bear it no longer and he walks  off (as best he can) back to his room.  She watches him, then follows determinedly.  INT. STEPHEN'S DORM ROOM/CAMBRIDGE UNI - DAY  He enters ANGRILY, SLAMS the door behind him, then tries to  break a CHAIR by throwing it against the wall - just as JANE  enters.  STEPHEN  Go away.  More knocks.  JANE (O.S.)  STEPHEN? Let me in. Please.  Please let me in.  INT. HALLWAY/STEPHEN'S DORM/CAMBRIDGE UNI - DAY  STEPHEN (O.S.)  Go away!  JANE  Are you going to talk about this  or not?  Silence.  THE   THEORY   of   EVERYTHING   33  (CONTINUED)",
      "characters": [],
      "action_text": "STEPHEN  There's nothing to say--  just...(go)  JANE  Is that what you want?  STEPHEN  That's what I want. I haven't got  time for you. So - if you care  about me at all - go.  JANE moves closer and closer to STEPHEN during this whole  interchange - almost trapping STEPHEN, who is gallantly  trying to resist being taken into her life.  JANE  I can't.  STEPHEN  I've got two years. I need to  work.  JANE  I can't.  His eyes widen. He can't believe his ears. He looks at her.  JANE (CONT'D)  I think--I've fallen in love with  you.  He can't speak now. This STUNS him.  JANE (CONT'D)  I know. Strange. Inexplicable.  STEPHEN  You've--you've leapt to--a false  conclusion...  JANE  My chances are probably -  (shrugs )  - well, some \"integer of zero\",  but I think we can make a go of  this. I want us to be together,  for as long as we've got. And if  that's not very long then - well,  that's just how it is. It will  have to do.  STEPHEN  You don't realise what's coming.  It'll affect everything.  THE   THEORY   of   EVERYTHING   34  CONTINUED:  (CONTINUED) She advances, and kisses him on the lips. He is still  speechless. She stares into his eyes, with love --  JANE  Your glasses are always dirty.  She takes them off, cleans them on her dress. His heart is  exploding with joy and hope. She slips his GLASSES gently  back on his nose.  JANE (CONT’D)  There. That's better. Isn't it?  STEPHEN  (powerfully moved)  Yes. It is.  INT. SCIAMA'S OFFICE, DAMTP/CAMBRIDGE - DAY  SCIAMA is giving a TUTORIAL to FOUR UNDERGRADS -  SCIAMA  ...the solutions to the Schrodinger  equation must vanish at the  boundary of the box, so we have...  STEPHEN enters -  STEPHEN  (cutting him off)  Time!  SCIAMA  Time. That's your subject? Any  aspect of it, in particular?  STEPHEN  Time.  STEPHEN exits.  INT. KITCHEN - HAWKING FAMILY HOME - NIGHT  JANE is seated, watching FRANK as he ominously shuts the  door.  FRANK HAWKING  You don't realize what lies ahead.  His life is going to be very short.  So. Be ",
      "dialogue_count": 0,
      "word_count": 860
    },
    {
      "scene_number": 5,
      "slugline": "INT. CAMBRIDGE CLOISTER - DAY  STEPHEN walks with great difficulty up the hallway, using  (for the first time) TWO WALKING STICKS.  INT. HALLWAY, DAMTP - DAY  STEPHEN stops outside SCIAMA's office. Knocks with a stick.  INT. SEMINAR ROOM,TRINITY HALL,CAMBRIDGE - DAY  SCIAMA and ROGER PENROSE and an American, KIP THORNE, face  STEPHEN.  SCIAMA  Come in Stephen.  STEPHEN makes his way slowly, laboriously, to stand in front  of the three examiners.  SCIAMA (CONT’D)  How are you?  STEPHEN  (his speech has worsened)  Fine.  SCIAMA  Would you like to sit down?  STEPHEN  No thankyou.  SCIAMA  So. Chapters One--full of holes and  lacks mathematical support.  (to KIP THORNE)  Professor Thorne?  KIP THORNE  Chapter Two--not really original--  uses a lot of Roger's ideas.  PENROSE  Well at least you run with them.  Chapter Three? Too many unanswered  questions.  SCIAMA  But Four?  Silence. STEPHEN waits, as the PANEL turn the pages of his  thesis. STEPHEN grows WORRIED.  THE   THEORY   of   EVERYTHING   37  (CONTINUED)",
      "characters": [
        "SCIAMA"
      ],
      "action_text": "BRIAN holds forth on a funny story about him and Stephen, as  he uncorks a bottle of wine -  BRIAN  What's astonishing is that for  Stephen and I, \"work\" was   the worst  four-letter word, the worst.  (laughter)  Stephen probably averaged, what was  it?--an hour a day your entire  university career?  (laughter)  Unbelievable levels of sloth!  As the conversation turns into a HUBBUB of chatter, STEPHEN,  smiling, drops his FORK. JANE, in conversation now with one  of the GIRLFRIENDS, picks up the fork without barely looking  at STEPHEN and put it back in front of him.  STEPHEN watches everybody talking, eating, drinking, being  wonderfully, effortlessly dextrous. FRUSTRATED, ENVIOUS, and  saddened, STEPHEN watches closely then, before emotion breaks  through, rises, grabs his TWO WALKING STICKS and starts to  leave.  JANE  (concerned)  Stephen?  STEPHEN  I'm sorry.  Everyone watches him go with concern. It's a painful sight to  see how hard it is for him to walk now.  When he is gone only a few seconds, the guests stop their  chatter when they hear a huge THUMP. Several men are about to  rise to his aid when JANE signals for everyone to remain in  their place. Everyone understands and settles again.  INT. HALL, LITTLE ST MARY'S LANE - EVENING  STEPHEN tries to pull himself up the stairs by the spokes of  the balustrade. It takes him many seconds just to get up the  first stairs but we see his determination.  INT. LOUNGE, LITTLE ST MARY'S LANE - EVENING  The DINNER guests are now eating DESSERT, and talking  quietly.  THE   THEORY   of   EVERYTHING   39  CONTINUED:",
      "dialogue_count": 1,
      "word_count": 573
    },
    {
      "scene_number": 6,
      "slugline": "INT. HALL, LITTLE ST MARY'S LANE - NIGHT  STEPHEN is only halfway up the STAIRS, using his last heroic  energies. Finally, he STOPS, EXHAUSTED. Hearing something, he  looks up -  The TWO YEAR-OLD ROBERT has woken, and stands in his pajamas  at the BABY-GATE at the top of the stairs, looking down at  his father.  STEPHEN  It's okay Robert.  For the first time - with his head resting on the step, and  with his eyes turning back to look through the balusters at  the REFLECTION in a DINING ROOM mirror of the dinner party  (his POV: tilted at 90 degrees) TEARS fall out of his eyes. A  PRIVATE MOMENT of great despair.  FADE TO BLACK.  INT. KITCHEN, LITTLE ST MARY'S LANE - DAY  JANE and STEPHEN sip tea. Holding a cup is extremely  difficult for him. A new tension exists between them. She  watches him.  Finally -   she gets up, goes into the kitchen and then  returns with...  A WHEELCHAIR. She sets it before him. He stares at it. Is  this his future? Is it an aid, or an enemy? She returns to  the kitchen to wash some dishes while he stares at the  chair...eventually rising, turning, poising above it, and  then falling with a CRASH into it.  JANE comes back to his side, realising the momentousness of  this moment.  STEPHEN  This--is--temporary.  JANE  Of course.  INT. DINING ROOM,LITTLE ST MARY'S LANE - NIGHT  JANE comes down the stairs, in her NIGHTIE, dressed for bed,  carrying pillows.  The MASTER BED now is erected in the little DINING ROOM, and  STEPHEN is propped up in it, smiling, waiting...(STEPHEN can  no longer manage the stair-climb.)  THE   THEORY   of   EVERYTHING   40  (CONTINUED)",
      "characters": [
        "SCIAMA"
      ],
      "action_text": "STEPHEN  Well, it's convenient for  breakfast!  She puts an extra pillow behind him, then they look into each  other's faces.  STEPHEN (CONT’D)  Thank you.  JANE  ( playfully)  Excuse me, did you say something?  STEPHEN  I said--thankyou.  They smile at each other. They kiss...  INT. POST-NATAL WARD - DAY  A NEW-BORN BABY is put into STEPHEN's LAP for him to hold.  INT. DINING ROOM,LITTLE ST MARY'S LANE - NIGHT  The NEW BABY'S CRIES carry (from UPSTAIRS) as JANE helps  STEPHEN on with his PYJAMA TOP. She struggles to pull it down  over his head when the BABY's cries grow too urgent.  STEPHEN  Go Jane.  JANE  One second.  JANE runs out to go to the baby, runs up the stairs.  STEPHEN struggles to pull on the PYJAMA himself.  CUT TO:  INSIDE HIS PYJAMA. It’s dark. STEPHEN, helpless. His eyes  are wide open, looking through the grain in the fabric at  the OPEN FIRE, burning in the FIREPLACE.  STEPHEN  JANE?  Silence. He waits...  The pin points of fire-light through the fabric, SLOWLY  MORPH into STARS and a NIGHT SKY. This is what STEPHEN is  visualizing. We see what he sees --  THE   THEORY   of   EVERYTHING   41  CONTINUED:  (CONTINUED) The LIFE OF THE UNIVERSE IN REVERSE...STARS being pulled  back together, toward a single POINT, a SINGULARITY. As the  SINGULARITY takes SHAPE, a DARK CIRCLE FORMS AROUND IT,  rimmed by a GLOWING CIRCULAR HORIZON.  FINALLY - A BLACK HOLE has FORMED. A POINT IN SPACE,  GOBBLING STARS, ILLUMINATED ONLY AT ITS EDGES (EVENT  HORIZON) BY AN AMBIENT GLOW - A RING of LIGHT.  The REVERIE ends as JANE eases the PYJAMA down over his  head, returning STEPHEN back into the real world. He stares  at his wife, AWESTRUCK.  JANE  Are you alright?  STEPHEN  (breathless, stunned)  I've got an idea. I've got an idea  Jane!  INT. DAMTP, STAIRS/TUTORIAL ROOM   - DAY  SCIAMA runs, in great excitement, past KIP THORNE.  SCIAMA  Kip! He's done it, Kip! He's -  KIP THORNE  What is it?  SCIAMA  Stephen! He's changed everything!  SCIAMA runs on, informing a mop",
      "dialogue_count": 1,
      "word_count": 1112
    },
    {
      "scene_number": 7,
      "slugline": "INT. PUB ON RIVER - CAMBRIDGE - NIGHT  BRIAN  Gone!   From nothing--into nothing.  REES  You owe me another beer.  CARTER  Me too.  BRIAN  He's just told us that -  (eating REES's CRISPS)  - Time! Had a beginning! He shown  us how -  ELLIS  (getting it)  - the universe was born   and   how it  will end.  REES  Bang.  BRIAN crushes the precious bag of crisps.  BRIAN  Crunch!  (entraptured)  It's beautiful! It's racy! It's  totally, totally -  SMASHCUT TO:  INT. LECTURE HALL/RUTHERFORD LAB/CAMBRIDGE - DAY  CLOSE ON: The stoney faces of the ACADEMIC AUDIENCE, all  silent and unconvinced.  STEPHEN on stage - looks at these blank faces.  JANE and SCIAMA appear as nervous as JOHN TAYLOR, who rises  then to his feet...  JOHN TAYLOR  I'm afraid--this is complete  nonsense. It's preposterous.  TAYLOR drags a fellow colleague to his feet and WALKS OUT.  STEPHEN  Was it something I said?  SCIAMA rises to his feet, to defend STEPHEN -  THE   THEORY   of   EVERYTHING   45  (CONTINUED)",
      "characters": [],
      "action_text": "SCIAMA  I -  But then a BIG VOICE booms out - and stops TAYLOR and co in  their tracks.  KHALATNIKOV  STOP! Please.  KHALATNIKOV makes his way to the STAGE, stopping beside  STEPHEN. He addresses the audience gravely...  KHALATNIKOV (CONT’D)  My name--is Professor Khalatnikov,  from Soviet Academy of Sciences. My  field is evolution of the hot  universe--the properties of  microwave background radiation, and  theory of the black holes. To be  honest, I came here today   expecting  to hear a lot of nonsense. I go  home disappointed.  (pause, points)  The little one here, has done it.  (he smiles)  He has done it!  Applause finally begins, small, then grows large.  KHALATNIKOV (CONT’D)  HE!- HAS DONE IT! Ha! Ha! Ha! Ya  Ya! He has done it!   (Shakes  Stephen's hand.)   He has done it!  REACTION JANE: Relief.  REACTION STEPHEN: the famous grin appearing, as -  STEPHEN is swamped by WELL-WISHERS. The AUDITORIUM empties on  to the stage, where STEPHEN is SURROUNDED.  ANGLE ON: JANE, alone suddenly in the AUDITORIUM, trying to  see STEPHEN, as he is borne out of the room on a tide of  fame.  EXT. CAMBRIDGE STREETS - NIGHT  STEPHEN is being pushed by BRIAN over the cobbled streets  while REES, CARTER and ELLIS cavort around them. They are in  a PARTY/CELEBRATORY MOOD, singing as they go. GREAT FUN.  CUT TO:  At the base of a large flight of STEPS, the YOUNG PHYSICISTS  all RACE EACH OTHER up the STEPS and disappear. BRIAN is left  alone with STEPHEN and the WHEELCHAIR.  THE   THEORY   of   EVERYTHING   46  CONTINUED:  (CONTINUED) BRIAN  BASTARDS!  BRIAN lifts STEPHEN out of his chair. He's heavy.  BRIAN (CONT’D)  Jeez!--uhhhh!--how the hell does  Jane manage?  He starts to carry STEPHEN up...up...up...  STEPHEN  Big legs! Big legs Brian!  BRIAN  So, tell me, this Motor Neuron  Disease, does it effect, y'know...  STEPHEN  What?  BRIAN  Everything.. ?  BRIAN indicates 'down there'.  STEPHEN  Different system. Automatic.  BRIAN  That's kinda wonderful, actually.  And it expla",
      "dialogue_count": 0,
      "word_count": 585
    },
    {
      "scene_number": 8,
      "slugline": "EXT. WEST ROAD FLAT, CAMBRIDGE - DAY  CLOSE ON: STEPHEN. Waiting in his WHEELCHAIR on the front  LAWN. About 8 YEARS have passed since we last saw him. His  physical deterioration is marked. His body is thinner and  powerless. His legs are bent and his face is slightly  asymmetric.  WIDE: Beside him is STACKED a mountain of FAMILY HOLIDAY  LUGGAGE (umbrellas, beach balls, plastic cricket set, tent  etc.)  In the Background, the NEW WEST ROAD FLAT - a LARGE VICTORIAN  HOUSE. The sign in front reads   \"GONVILLE and CAIUS COLLEGE\" .  On the LAWN the children (ROBERT, now 9 - and LUCY, now 5)  PLAY with BEACH TOYS, until -  - JANE (with a new haircut and fashion befitting the LATE  1970's) yells -  JANE  Get in the car! Get! In! The Car!  Come on! Let's go see Gran and  Grandad!  The CHILDREN obey, and jump into the now OLD MINI parked at  the kerb, as -  - JANE confronts the MOUNTAIN OF STUFF, including STEPHEN,  that must somehow be stowed. No way.  LATER - back and forth JANE goes between LUGGAGE and MINI.  STEPHEN can only watch her load the stuff into the car and  onto the ROOF-RACK. Finally - REVEAL the LOADED MINI - it  looks ridiculously burdened!  JANE takes a deep, exhausted, breath, then turns back for  STEPHEN. He sits there in his wheelchair, looking at her...  ROBERT and JANE together, with GREAT DIFFICULTY, get STEPHEN  into the front seat and shut the door. ROBERT struggles to  COLLAPSE the WHEELCHAIR, until JANE comes and together they  muscle it onto the ROOF-RACK.  EXT. WELSH COTTAGE - WALES - DAY  FRANK & ISOBEL HAWKING's tumble-down WELSH COTTAGE high above  on a STEEP HILLSIDE, only reached by an ENORMOUS FLIGHT of  STEPS.  REACTION JANE: Exasperation!  ISOBEL descends to greet them, followed by FRANK.  THE   THEORY   of   EVERYTHING   48  (CONTINUED)",
      "characters": [],
      "action_text": "ISOBEL  Isn't it marvellous? We can rent it  every year!  JANE  Yes. I see. But what about all the  steps, Frank?  FRANK HAWKING  Oh, it's nothing. The climb is  absolutely worth it. You get the  luggage.  FRANK backs STEPHEN (in his wheelchair) up the STEPS, one at  a time, while ISOBEL runs up ahead with the CHILDREN, leaving  JANE, alone, with ALL THE LUGGAGE.  REACTION, JANE: Speechless in defeat, she sighs deeply.  Finally, she slowly starts to unload the MINI.  EXT. PATIO - WELSH COTTAGE - DAY  TEA and CAKES al fresco. The CHILDREN play CHARADES. FRANK is  feeding STPHEN, but his attention is on...ROBERT, whose turn  it is...ROBERT acts being cold, that it's snowing...  FRANK HAWKING  Oh--Rain?--Falling?--Rain Falling  Down?--Shivering?--Uhhhrrrrr---  ISOBEL  Very cold...  STEPHEN suffers an horrendous CHOKING FIT, which cannot be  staunched. STEPHEN's parents, and little ROBERT watch in  horror, as JANE tries in vain to subdue it, banging his back  roughly, loosening his tie.  JANE  He needs to see a doctor. This  keeps happening!  STEPHEN  No doctors!  FRANK HAWKING  Very well, no doctors.  JANE, stressed, looks ready to break-down, and turns away,  hiding her frailty, a little angry also at the lack of  support.  THE   THEORY   of   EVERYTHING   49  CONTINUED:",
      "dialogue_count": 0,
      "word_count": 512
    },
    {
      "scene_number": 9,
      "slugline": "EXT. COUNTRYSIDE - DAY  JANE walks slowly along path to the WOOD and sits down on a  STONE. Head in hands. She WEEPS.  INT. MINI - TRAVELLING - DAY  JANE is driving them home.  JANE  I need help.  I keep--I keep looking for a way--  to make this work--but I can't find  it.  STEPHEN  (forcefully, but with a  slurred voice)  We're fine--we're just a normal  family.  JANE  (upset)  WE'RE NOT A NORMAL FAMILY!!! We're  not a normal family.  STEPHEN  (turns to ROBERT)  Robert--your mother's very angry at  me.   (smiles)  JANE  (tearful)  Thanks.  INT. MASTER BEDROOM - WEST ROAD FLAT/ CAMBRIDGE - DAY  A worried JANE cradles and sooths STEPHEN to sleep.  INT. KITCHEN/HALLWAY/WEST ROAD FLAT/CAMBRIDGE - DAY  STEPHEN in his old wheelchair is pushed from the KITCHEN by  JANE up to the doors to the LIVING ROOM. She has a surprise  for him.  JANE  Ready?  The doors then burst open and it's ROBERT and LUCY aboard-   AN  ELECTRIC MOTORIZED WHEELCHAIR.  ROBERT  Surprise! Look Daddy Look!  THE   THEORY   of   EVERYTHING   50  (CONTINUED)",
      "characters": [],
      "action_text": "STEPHEN stares as ROBERT makes the CHAIR turn by pulling and  pushing a toggle.  JANE  It's an electric wheelchair.  We can take it back--if you don't  like it.  STEPHEN stares at it, unsure at first...  INT. KITCHEN - WEST ROAD FLAT/CAMBRIDGE - NIGHT  While making dinner, JANE hears happy screams from the other  end of the house. She goes through to discover --  INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - NIGHT  STEPHEN, in his motorized wheelchair, chasing ROBERT and LUCY  from room to room at full speed! He looks extremely thrilled  with the chair as he smashes into furniture.  JANE, at the table, trying to work on her THESIS, tries to  smile. STEPHEN motors away, chasing the squealing children.  JANE WINCES as she hears - the sound (O.S.) of a SMASHING  VASE.  EXT. TRINITY LANE FOOT-BRIDGE - DAY  STEPHEN happily MOTORS at speed over the FOOT-BRIDGE,  grinning.  INT. CORRIDOR, DAMTP, CAMBRIDGE UNI - DAY   (L70-M80'S)  STEPHEN is motoring along with SCIAMA. CAMBRIDGE DONS and  STUDENTS step aside to make way.  SCIAMA  I don't get it. You've spent years  assuming   Black Holes exist--you  believe Cygnus X-1 will turn out to  be the first black hole we can  actually observe==and yet you bet  Kip Thorne that it   isn't   a black  hole?  STEPHEN  (slurring)  Yes, a magazine subscription.  SCIAMA  Why would you bet against yourself?  (Pause)  THE   THEORY   of   EVERYTHING   51  CONTINUED:  (MORE)  (CONTINUED) A subscription to what? Nature  magazine?  STEPHEN  Pent-house. That way even if I'm  wrong, I still win!  SCIAMA laughs heartily as -  - STEPHEN grins, at the same time SPYING - up ahead, TWO  ATTRACTIVE UNDER-GRADUATE GIRLS about to enter the LIFT.  STEPHEN hits the GAS! - and SPEEDS toward the LIFT...  SCIAMA  Penthouse?  STEPHEN SPEEDS toward the LIFT, whose DOORS ARE READY TO  CLOSE.  SCIAMA winces in expectation of a horrible accident.  WIDE: it looks suicidal but the chair just flies through the  GAP in the last split second before the DOORS CLOSE - the  d",
      "dialogue_count": 0,
      "word_count": 921
    },
    {
      "scene_number": 10,
      "slugline": "INT. FRONT AREA, CHURCH - EVENING  At the front of the church she sees that he is already  sitting at the piano. Without sheet music he begins to play  \" Immer leiser wird mein Schlummer \"...  JONATHAN  (over the music)  Jonathan. Jonathan Hellyer Jones.  She gingerly approaches.  JANE  Jane. Jane Hawking.  JONATHAN  In C-sharp minor? The introduction,  so lovely. From the top?  JANE  Now?  JONATHAN  \"Living on the edge.\"  (smiles)  Ready?  (beat)  If you're not in the mood we could  absolutely forget -  JANE  No, no. No, no. Just let me  remember the lyrics. In English.  JONATHAN  Fabulous.  JANE  Okay.  JONATHAN  Okay?  (beat)  Two, three...  JANE  (sings)  My sleep grows ever quieter  only my grief, like a veil,  lies trembling over me.  I often hear you in my dreams  calling outside my door... (etc)  THE   THEORY   of   EVERYTHING   55",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 140
    },
    {
      "scene_number": 11,
      "slugline": "EXT. CHURCH - NIGHT  JANE and JONATHAN emerge from the church - JONATHAN locks the  doors.  JONATHAN  Actually, no, I go for the Gospel  of St. Mark.  JANE  None of that wishy-washy do-gooder  stuff--Matthew, Luke.  JONATHAN  Exactly. With Mark you roll up your  sleeves and get stuck in. No  standing on the sidelines.  They shake hands. JANE stares into his face - realizing she  has found a friend.  JANE  Well I should be going.  JONATHAN  Well met. Oh, and if your daughter  would like those piano lessons.  JANE  Absolutely. My husband loves music  too.  JONATHAN  I could teach him as well.  JANE  Well, that's a long story. 'Night.  EXT. WEST ROAD FLAT, CAMBRIDGE - DAY  STEPHEN motors down the street, fast, and swings up the  ramp in front of the door. He BANGS into the front door.  Then waits. He hears PIANO music - a lesson in progress.  INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  As STEPHEN and JANE watch - JONATHAN gives ROBERT (11) a  piano lesson.  JANE smiles at STEPHEN, who remains cautious.  THE   THEORY   of   EVERYTHING   56",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 181
    },
    {
      "scene_number": 12,
      "slugline": "INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - NIGHT  JONATHAN is eating dinner with JANE and STEPHEN. JANE feeds  STEPHEN a forkful of food. STEPHEN chews slowly.  STEPHEN sneaks glances at JONATHAN.  JONATHAN shoots a SMILE at JANE. She smiles back in return.  STEPHEN catches sight of both these smiles, and sees the  GROWING INTIMACY.  JANE  Water.  She exits. JONATHAN smiles at STEPHEN who is staring back at  him.  JONATHAN  (to STEPHEN)  So - Stephen. Er - Jane tells  me...  JONATHAN picks up STEPHEN's fork, spears a cube of steak.  JONATHAN (CONT’D)  ...you have a beautiful theorem  that proves that...  JONATHAN offers up the steak, but STEPHEN's glare makes him  aware this isn't welcome. He lowers the fork again.  JONATHAN (CONT’D)  ...that--that the universe had a  beginning?  JANE returns with the a JUG OF WATER and GLASSES on a TRAY.  STEPHEN  (testily, his slurring  not easily understood)  That was my - PhD thesis.  JONATHAN looks to JANE for a translation.  JONATHAN  Your...?  JANE  PhD thesis.  STEPHEN  My new project - disproves it.  JONATHAN  Disproves it? Really?  (as JANE nods)  THE   THEORY   of   EVERYTHING   57  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "You no longer believe in the  Creation?  STEPHEN  What one believes -  - is irrelevant--in physics.  JANE  ...is irrelevant   JONATHAN  ...is irrelevant  JANE  ...in physics.  JONATHAN looks to JANE, hoping he has not caused offence.  JONATHAN  Oh, is that so?  JANE  (annoyance showing)  Stephen's done a U-turn. The big  new idea is that the universe has  no boundaries at all. No  boundaries, no beginning. No  beginning -  JONATHAN  - no God?   Really?  (to STEPHEN)  Fascinating. Because I'd  understood you'd proven the need  for a Creator. My mistake.  STEPHEN  No. Mine.  JONATHAN  (understanding this)  Yours. Your mistake?  JONATHAN is surprised by this sharp reply. (He also sees  that this matter is a CAUSE OF DIVISION between JANE and  STEPHEN.)  JANE  Stephen is looking for a single  law that governs all the forces  in the universe. So God must die.  JONATHAN  Why must God die? I don't see.  STEPHEN doesn't react, so JANE spears a PEA on her FORK,  then picks up a SECOND FORK and spears a LARGE BOILED  POTATO with the other.  THE   THEORY   of   EVERYTHING   58  CONTINUED:  JONATHAN (CONT'D)  (CONTINUED) JANE  The two great pillars of physics  are -  ( the PEA )  - Quantum Theory, the laws that  govern the very small--electrons,  particles so on--and General  Relativity...  JONATHAN  Oh, yes - Einstein.  JANE  ...Einstein's theory.  (the POTATO)  Which   governs the very large,  planets and such--but Quantum -  (raises the PEA )  and -  ( raises the POTATO )  Relativity...  JONATHAN  They're--different?  JANE  They don't remotely play by the  same rules. Peas are chaotic, and  don't behave predictably at all -  With her 'pea' fork she stirs some more peas on her plate -  creates 'chaos'.  JONATHAN  Unlike--potatoes -  JANE  Which you can set your watch by.  STEPHEN  (smiling)  Very good.  Even STEPHEN has begun to begrudgingly enjoy this, even as  he starts COUGHING.  JANE gets up and goes to pat STEPHEN's back over the  following:  JANE  If the world were all ",
      "dialogue_count": 0,
      "word_count": 850
    },
    {
      "scene_number": 13,
      "slugline": "INT. HALLWAY, WEST ROAD FLAT, CAMBRIDGE - NIGHT  JONATHAN puts on his JACKET to go - JANE and STEPHEN see him  off.  JANE  Thank you for coming.  JONATHAN  No. Thank you. It was wonderful.  (starts to go, then stops)  And if--if there was anything I can  do. To be of service. To you, your  family. I have no children, no  commitments. If I could help you, I  believe I would find a purpose that  would alleviate my own situation.  It would be a privilege.  STEPHEN looks to JANE for her reaction. JANE senses  EMOTIONAL DANGER and, frightened, merely smiles.  JONATHAN (CONT’D)  Night then.  He exits. JANE shuts the door.  INT. MASTER BED./WEST ROAD FLAT/CAMBRIDGE - NIGHT  JANE puts PILLOWS behind STEPHEN, who now sleeps almost  upright in bed. She then takes off her BATHROBE and gets  into bed herself.  STEPHEN  I understand you need more help.  And if there is - someone - who  is prepared to offer it - I won't  object, as long - as long as you  continue to love me.  JANE  Of course. For infinity.  Beside him in bed, she kisses his cheek and then lays her  head on his frail chest.  MUSIC UP: BACH PRELUDE, as played by JONATHAN on PIANO, over -  MONTAGE:  A)   (MOVED TO: POSITION \"G\" in MONTAGE)  A1)   The CAM RIVER.   A PUNT on a SUNNY DAY drifts under the  BRIDGE OF SIGHS - in the front of the PUNT, JANE cradles  STEPHEN and ROBERT and LUCY. JANE smiles at -  THE   THEORY   of   EVERYTHING   62  (CONTINUED)",
      "characters": [],
      "action_text": "- JONATHAN, who is POLING them. He smiles back at her.  B) HAWKING FRONT ROOM. JONATHAN plays the BACH PRELUDE  divinely on JANE's PIANO, as -   JANE, BESIDE HIM on the piano  stool, turns the pages. STEPHEN watches without jealousy and  with enjoyment.  C) HAWKING BATHROOM. JONATHAN takes STEPHEN to the TOILET.  D) When JONATHAN and JANE pass each other in the KITCHEN,  and JONATHAN quite naturally takes her hand. JANE,  surprised, looks at him. He SMILES at her. Their FIRST  TOUCH!  We can see that the temptation to act further on their  feelings is now HUGE for both of them, but they do nothing.  JANE forces herself to break away, hurries into the next  room to be with STEPHEN, the kids and a train set. JONATHAN  is left to deal with his feelings. He sighs, sublimates  them, then returns to his domestics.  E)   BRANCASTER BEACH.   SUPER-8 FOOTAGE   of their day at the  beach...  STEPHEN's wheelchair sits on the sand at the water's edge,  his trousers rolled up, water lapping his naked feet. STEPHEN  helplessly watches from his wheelchair as JONATHAN engages in  some playful rough and tumble with ROBERT and LUCY, kicking a  FOOTBALL back and forth. JANE watches on.  JONATHAN cradles STEPHEN as they sit there and look out to  sea, both men carefree and happy, STEPHEN accepting of  JONATHAN's care now. They appear as FRIENDS now.  INT. CHURCH - NIGHT  The CHOIR sings a beautiful CAROL. The CAMERA finds JANE -  singing nervously - the only SINGER NOT LOOKING at JONATHAN -  her eyes are glued on her hymn sheet. In DENIAL.  CUT TO:  After the Rehearsal, the CHOIR leaves. JANE and JONATHAN  clear up the hymn sheets. She passes her pile to him. He puts  his hand on hers. She withdraws her hand.  JANE  I have to tell you something.  JONATHAN  Is anything the matter?  She looks at him for the first time that evening -  JANE  I'm um--I'm pregnant.  THE   THEORY   of   EVERYTHING   63  CONTINUED:  (CONTINUED) JONATHAN  Oh.   (wounded)  I see. I presumed--stupid really--  tha",
      "dialogue_count": 0,
      "word_count": 960
    },
    {
      "scene_number": 14,
      "slugline": "EXT. WEST ROAD FLAT - CAMBRIDGE - DAY  JANE chases JONATHAN - stops him.  JONATHAN  I need to go. I can't...  JANE  Please don't go.  JONATHAN  Everyone's talking. It's -  JANE  So. What does it matter?  JONATHAN  Well, there are other things too. I  - I - just -  (beat)  I have feelings for you.  JANE  I have feelings for you, too.  JONATHAN  It's - it's difficult for me!   JANE  I know, I know.  JONATHAN  You have no -   JANE  It's so wonderful, for me,  for the children.  JONATHAN  I have to go. I don't think I  can -  JANE  Please, please -  JONATHAN  Perhaps the right thing is for me  to just--step back.  He walks off.  REACTION JANE: Distressed.  ANGLE ON: STEPHEN, at the WINDOW, watching this - CONCERNED.  INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  JANE does her daily NURSE chores, among these   applying hand  lotion quickly to STEPHEN's hands - she does this  ROUTINELY. (This will contrast, later, with how Elaine  applies the hand lotion.)  STEPHEN  I've just been invited -  THE   THEORY   of   EVERYTHING   66  (CONTINUED)",
      "characters": [],
      "action_text": "JANE  Invited? Where?  STEPHEN  Geneva.  JANE  Geneva?  STEPHEN  Students can accompany me.  JANE  What students?  STEPHEN  I know how much you hate -  JANE  You know how much I hate -  STEPHEN  - to fly.  JANE nods, sensing they are at a crossroads. She looks  away, on the verge of tears.  JANE  To fly. Yes.  STEPHEN  I was thinking - that you and the  children -  JANE  - Me and the children--go on?  STEPHEN  could bring the car -  JANE  - bring the car -  STEPHEN  - meet me in Bayreuth -  JANE  Bayreuth? How can I manage that? On  my own?  STEPHEN  Bring Jonathan.  JANE looks up at him. Her thoughts racing.  THE   THEORY   of   EVERYTHING   67  CONTINUED:  (CONTINUED) BOTH understand the significance of this. She looks into his  eyes to establish if he is sure. The look he gives her  confirms this.  JANE  I doubt he would be willing.  INT. CHURCH - NIGHT  STEPHEN motors up the CHURCH AISLE with TWO BOTTLES OF BEER  in a PAPER BAG at his side going   \"CLINK,CLINK,CLINK\".  JONATHAN clearing up after a CHOIR PRACTICE turns - stares at  STEPHEN.  CUT TO:  FRONT ROW of the PEWS. JONATHAN and STEPHEN, side-by-side,  stare at the ALTAR. JONATHAN spots the BEER BOTTLES in  STEPHEN's LAP.  STEPHEN  Is--this okay?  JONATHAN  Well--I won't tell if you don't.  JONATHAN opens the TWO BEER BOTTLES, tucks his handkerchief  under STEPHEN's chin, and then tips the beer into STEPHEN's  mouth.  JONATHON  Not too much--bearing in mind you  have to drive.  STEPHEN grins.  The two men stare at the ALTAR, aware of the significance of  this moment. STEPHEN sneaks a glance at JONATHAN. And then -  STEPHEN  Jane--needs--help.  JONATHAN sighs deeply.  EXT. WEST ROAD FLAT, CAMBRIDGE - DAY  A YOUNG MALE STUDENT CARER, loads the last of STEPHEN's  LUGGAGE into a TAXI. STEPHEN is already in the back of the  TAXI with SARAH, a carer. JANE supervises, worried.  JANE  And please please remember, 5  milligrams of Riluzole before and  after the flight.  THE   THEORY   of   EVERYTHING   68  CONTINUED",
      "dialogue_count": 0,
      "word_count": 1767
    },
    {
      "scene_number": 15,
      "slugline": "INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  STEPHEN gloomily reads a newspaper with the help of a READING  FRAME, when -  JANE enters.  JANE  She's here. Okay. Promise not to  eat her alive...  Enter: ELAINE MASON. She is attractive.  Exit: JANE, touching ELAINE supportively on the shoulder.  ELAINE  So then - Professor. How are you?  My name is Elaine. I'm going to be  your nurse, would you like that?  No? Well- we'll work it out.  He stares at her, as -  - ELAINE goes and gets a CHAIR, taking an interest in her,  until -  - ELAINE turns and catches him look at her.  Swiftly, STEPHEN turns his eyes back to the NEWSPAPER. ELAINE  looks at him a moment longer, surprises to see that STEPHEN  is not unlike any other man in this regard. A faint smile  appears. She sits in front of him.  ELAINE (CONT’D)  So then...  INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  ELAINE holds the E-TRAN BOARD and writes down a letter, then  looks up at STEPHEN - sees through the clear perspex  immediately what group he is looking at. She doesn't have to  call out the colours - knows them. (See her POV of him  through the board so we establish the eye-line principle.)  She is BRILLIANT at this.  STEPHEN's eyes FLICK from GROUP to GROUP, no BLINKING going  on.  ELAINE  (rapidly )  Red group--Yellow letter.   T . Green  group--Black letter.   E.   Green--  Green.   A . ...T.E.A. Tea.  (smiles)  You're good. You want tea. What  type of tea?  THE   THEORY   of   EVERYTHING   74  (CONTINUED)",
      "characters": [],
      "action_text": "They look at each other. And then she has an IDEA. She PUTS  DOWN THE BOARD. They look at each other...  ELAINE (CONT’D)  You've memorised the board. Of  course you have. What kind of tea?  Blink when I say the group that has  the letter you want. Green, Yellow,  Blue, White, Black, Red...  (beat)  I haven't got all day. Green-  (He BLINKS)  Green group. And the letter in that  group? You know their colours, I  know you do. Green, Yellow -  He BLINKS. She has MEMORISED the BOARD too -  ELAINE (CONT’D)  Yellow? Green,yellow--that's   B .  A breakthrough. They are both EXPERT.  ELAINE (CONT’D)  A tea beginning with B? Builder's  tea! Right?  He GRINS. She SMILES. She goes to get him some TEA.  INT. HALLWAY/WEST ROAD FLAT/CAMBRIDGE - DAY  ELAINE, smiling, enters hall (from the LIVING ROOM) and bumps  into JANE, who has just arrived home with GROCERIES. They  stop in front of each other.  ELAINE  (chuckling)  I think he’s the most brilliant man  I’ve ever met. You’re very lucky.  JANE  Thank you.  ELAINE  You must worship the ground beneath  his -  JANE  - wheels.  JANE can't fail to see how enthralled ELAINE is.  ELAINE  And he’s the perfect patient.  Looking after him is so much easier  than other patients I've had.  THE   THEORY   of   EVERYTHING   75  CONTINUED:  (MORE)  (CONTINUED) And sooo funny, oh my God. When you  read about him people don't tell  you -  JANE  (cutting her off)  You only do two shifts a week,  Elaine.  INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  STEPHEN sits in the armchair, propped up by cushions, while a  TECHNICIAN bolts the NEW COMPUTER SCREEN onto STEPHEN's  WHEELCHAIR. JANE watches.  TECHNICIAN  Almost there!  JANE  How does it work?  TECHNICIAN  A guy called Walt Woltosz invented  the software. Uses a very simple  interface that scans through the  alphabet and allows each letter to  be selected one by one. Using this  technique, the Professor can expect  to write at about   four   words per  minute.  ELAINE enters -  JANE  (After in",
      "dialogue_count": 0,
      "word_count": 888
    },
    {
      "scene_number": 16,
      "slugline": "INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  STEPHEN motors through the house, as we hear   -  STEPHEN  Frankly my dear, I don't give a  damn.  INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  Through the OPEN DOORS into the LIVING ROOM we hear TIMOTHY  squealing with joyous delight, then see him run out -  As TIM passes out of shot we hear then see STEPHEN slowly  motor out of the LIVING ROOM, chasing him, with -  - a LARGE BROWN PAPER GROCERY BAG OVER HIS HEAD (TWO EYE-  HOLES cut in it, a SMILE DRAWN over the mouth) as STEPHEN's  voice-synthesizer loudly proclaims the DALEK war-cry from  DOCTOR WHO   as STEPHEN chases his son around:  STEPHEN  Ex-terminate..! Ex-terminate..!  Ex-terminate..!  INT. LIVING ROOM/WEST ROAD /CAMBRIDGE - NIGHT  JANE approaches as STEPHEN writes, CLICK,CLICK,CLICK. His  eyes turn to her as she hears:  STEPHEN  I will write. A Book.  JANE  At four words a minute? About what?  STEPHEN clicks. She moves to look at his SCREEN.  TIGHT ON SCREEN as he selects:   T   I   M   E.  JANE (CONT’D)  TIME.  STEPHEN  Time...  She smiles at him.  MONTAGE:  A) The HANDS ON A CLOCK turn very quickly, TIME running fast.  B) STEPHEN motors down the cloisters of his college.  THE   THEORY   of   EVERYTHING   78  (CONTINUED)",
      "characters": [
        "STEPHEN"
      ],
      "action_text": "She surprises him by crossing the room and opening the PAGES  of the MAGAZINE for him.  ELAINE (CONT'D)  You don't have to be embarrassed  around me, Professor. I know what  men are like.  SURPRISED, STEPHEN finds himself with the PENTHOUSE open  before him. He looks at the MAGAZINE, then at ELAINE, then at  the MAGAZINE.  Just then - office DOOR OPENS.   Enter, SCIAMA. He stops when  he sees the MAGAZINE.  SCIAMA  Oh. I'm sorry.  He exits, blushing. STEPHEN grins. ELAINE bursts out  laughing.  ELAINE  Next one?  He SMILES at her - falling in love with her. She detects  this, happily.  ELAINE (CONT’D)  What?  INT. WEST ROAD FLAT/ CAMBRIDGE - NIGHT  STEPHEN, alone, continues to write, one painstaking word at  a time.  INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  JANE, exhausted, rubbing her eyes as she PROOF-READS  STEPHEN's text, like the old days. She pauses, looks up, into  the next room, at -  - ELAINE laughing at something the grinning STEPHEN has said.  JANE resumes work on STEPHEN's BOOK.  INT. DAMTP, CAMBRIDGE - DAY  STEPHEN still working - CLICK, CLICK, CLICK...  TIGHT ON SCREEN:   \" A HISTORY OF TIME \"  He ponders this. Then has an idea. CLICK, CLICK, CLICK. He  inserts \" BRIEF \" into the title. He stares at the screen.  THE   THEORY   of   EVERYTHING   80  CONTINUED:",
      "dialogue_count": 1,
      "word_count": 647
    },
    {
      "scene_number": 17,
      "slugline": "INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  TITLE PAGE is spat out of PRINTER: \" A BRIEF HISTORY OF  TIME.\"  While reading the LAST PAGE manuscript for his book, JANE  stops and is stunned by something she reads. She rises, and  rushes - with the LAST PAGE - into the next room where -  INT. MASTER BED./WEST ROAD FLAT/CAMBRIDGE   - DAY  CLOSE ON: A PHOTO of STEPHEN and a MARILYN MONROE LOOK-A-  LIKE, hangs on the wall.  STEPHEN (O.S.)  So I said - I have long been  looking for a model of the  universe. I finally found her.  Beside the PHOTO, ELAINE finishes SHAVING STEPHEN - then  steps away to pick up some HAND LOTION. She inadvertently  show him some LEG. STEPHEN notices.  ELAINE laughs, and starts to massage LOTION, almost  lovingly, into his HAND. JANE announce her presence.  JANE  Elaine? Can we - ?  ELAINE comes over to JANE, still chuckling.  JANE (CONT’D)  Would you mind if I spoke with  Stephen alone for a moment?  ELAINE  We're not quite finished--can you  come back in ten minutes?  REACTION JANE: Slightly ruffled feathers. She exits.  INT. MASTER BED./WEST ROAD FLAT/CAMBRIDGE - DAY  JANE walks in, holding a page from the MANUSCRIPT. STEPHEN  is 'typing' a message.  JANE  (reads)  \" Who are we? Why are we here? If  we ever learn this, it would be  the ultimate triumph of human  reason, for then we would know  the mind of God .\"  (to him)  ' GOD '? Do you really mean this?  THE   THEORY   of   EVERYTHING   81  (CONTINUED)",
      "characters": [],
      "action_text": "STEPHEN types his reply.  STEPHEN  Yes.   (types)  Of course.  JANE  So you're acknowledging him?  But as he continues to CLICK, feverishly, she excitedly  exits, before he can add another word. He tries to generate  the next word before she disappears but he is alone again  by the time his computer belatedly spits out -  STEPHEN  However --  He sags, frustrated that he was not fast enough to set her  straight - but then she comes back in -  JANE  Did you just say something?  STEPHEN decides not to respond.  JANE (CONT’D)  So you're actually going to let me  have this moment.  STEPHEN click-click-clicks, then -  STEPHEN  You - are - welcome.  She smiles. She kisses him on the cheek, and then as she  starts to leave -  - on his SCREEN - STEPHEN selects the message he was  writing earlier...clicks \"PLAY.\" We hear -  STEPHEN (CONT’D)  E-laine has offered to travel  with me to A-merica. She will  look after me.  JANE  (immensely hurt)  Will she?  STEPHEN  Don't worry.  He clicks \"STOP\".  She nods, sadly. He smiles, sweetly. Both accept what is  happening, but sadly.  THE   THEORY   of   EVERYTHING   82  CONTINUED:  (CONTINUED) JANE  America?  (beat)  You always used to tell me when an  invitation came in.  CLICKS 'PLAY.'  STEPHEN  (the old grin)  A-nother a-ward. What can you do?  JANE smiles, warmly. STEPHEN writes.  STEPHEN (CONT'D)  Everything will be okay.  She tries to smile.  STEPHEN (CONT’D)  How many years?  STEPHEN writes. She waits. His eyes flick between his  screen and her.  JANE  They said - two.  We've had so many.  The look in his eyes is his eloquent reply. Emotion overcomes  JANE. Can this really be how it ends?  It's so sad and bizarre and they both realise it in this  moment. She tries to hide her tears by walking away from  him and turning her back, hiding her face.  STEPHEN watches her, as aware of the enormous significance of  this moment as she - then slowly - slowly - motors toward  her. He stops just behind her, then nudges her leg, ever so  gen",
      "dialogue_count": 0,
      "word_count": 1305
    },
    {
      "scene_number": 18,
      "slugline": "INT. HALLWAY/COCKCROFT LECTURE ROOM/CAMBRIDGE UNIVERSITY  - DAY   (LATE 1980'S )  STEPHEN, accompanied by ELAINE, motors down the HALLWAY/LOBBY  toward -  - FANS and PRESS, waiting at the DOORWAY to the AUDITORIUM.  Some FANS, autograph hunters, hold copies of   \"BRIEF HISTORY\"  for STEPHEN to sign. Others just want to take PHOTOS. The  general impression? STEPHEN is now a ROCK STAR.  After a MALE FAN gets his PHOTO taken with STEPHEN - a FEMALE  FAN (at the head of a sudden queue of FANS bearing copies of  \"BRIEF HISTORY\") holds out a PEN to STEPHEN...  FEMALE FAN  Professor? Could you please sign a  copy for me?  ELAINE, gestures for STEPHEN to give his standard reply. He  mouse-clicks once.  STEPHEN  I cannot sign copies of my book--  but if you like--I could drive over  it.  The FANS all laugh and all say \"YES,YES,YES!\"  INT. COCKCROFT LECTURE ROOM/CAMBRIDGE UNIVERSITY - DAY  AUDIENCE APPLAUSE, continues over - a CU on the blackboard  of the word:  “TIME.”  WIDE: A packed lecture hall.  ANGLE ON: ELAINE, watching from the side of the stage.  ANGLE ON: SCIAMA and a COLLEAGUE.  SCIAMA now steps forward, to applause.  SCIAMA  Thankyou. I first met--the  Professor--was it really 1963? Time-  -where   does   it go? Back then, he  was kind of annoying.  (laughter)  He knew things that his woeful work  ethic should not have allowed him  to know.  (laughter)  THE   THEORY   of   EVERYTHING   87  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "But it's been--really--one of the  great joys of my life to watch this  man defy every expectation, both  scientific   and   personal. So it's  with no small pride that I ask him  to return to the stage once more,  to continue to do what he has  always done -   answer your  questions.   My most irritating  student, my esteemed colleague, my  good friend--Professor Hawking.  As STEPHEN motors onto the stage, to applause -  SCIAMA (CONT’D)  The first pre-selected question,  please!  GUEST 1, stands and reads her question from a SLIP OF PAPER.  (All the Questioners will do the same.)  GUEST 1  How have you been able to deal  with all the physical challenges  you face?  STEPHEN stares at the AUDIENCE, who wait awkwardly for a  reply. It's as if STEPHEN wishes to speak with his own  voice, and is struggling to do so. In failure his eyes turn  sadly to his screen, and then clicks the pad in his hand.  We hear:  STEPHEN  Can you hear me?  (audience laughter)  There are some things I cannot  do. But. They are mostly the  things I don't particularly want  to do anyway.  GUEST 2  Now you are recognized  everywhere, how do you deal with  all the attention?  STEPHEN  I was stopped recently by a  tourist in Cambridge who asked if  I was 'the real Stephen Hawking.'  I replied that I was not, and  said the real one was--much  better looking.  Laughter.  STEPHEN (CONT'D)  He believed me.  THE   THEORY   of   EVERYTHING   88  CONTINUED:  SCIAMA (CONT'D)  (CONTINUED) Even bigger LAUGH. APPLAUSE.  GUEST 3  In 1979 you talked about the  possibility of a theory of  everything being discovered  before the end of the century.  STEPHEN  I now predict -- that I was  wrong.  LAUGHTER.  GUEST 4  Is Time Travel possible?  LAUGHTER.  STEPHEN  I have experimental evidence that  Time Travel is not possible. I gave  a party for Time-Travellers but no-  one came.  LAUGHTER. As GUEST 5 rises and starts to speak, the volume  goes down on this question...  GUEST 5  Professor Hawking, you have said  yo",
      "dialogue_count": 0,
      "word_count": 984
    },
    {
      "scene_number": 19,
      "slugline": "INT. LIVING ROOM/WEST ROAD FLAT/CAMBRIDGE - DAY  JANE is studying again, going through her IBERIAN POEMS, when  JONATHAN walks in with the MAIL, and sets one LETTER in front  of her. JANE opens it.  JANE  It's from Stephen.  (reading)  He's--he has invited--the children  and I--to accompany him.  JONATHAN reads her card, and then look at her, surprised.  JONATHAN  Gosh.  EXT. BUCKINGHAM PALACE, LONDON - DAY  The PALACE.  INT. EMPIRE ROOM, BUCKINGHAM PALACE - DAY  We are BACK in the FIRST SCENE OF THE MOVIE.  JANE moves close to STEPHEN. They look at each other in the  eyes for the first time in a long while. They finally SMILE  tenderly, and then -  JANE  Your glasses are always dirty.  STEPHEN'S POV as - his glasses are removed from his nose by  JANE, cleaned, and then replaced on his nose. He is moved by  this old ritual.  The HAWKINGS then sit silently, but happily, surrounded by  exquisite paintings and furniture.  INT. GRAND HALLWAY/BUCKINGHAM PALACE - DAY - LATER  STEPHEN and family - JANE, ROBERT (23), LUCY (19) and TIM  (10) - roll up past pillars toward a SET OF ORNATE DOORS  which open magically to reveal -  QUEEN ELIZABETH II standing by a distant mantelpiece.  EXT. QUEEN'S PRIVATE GARDEN,BUCKINGHAM PALACE - DAY  In the garden, the HAWKING children play as freely as in  their own, while STEPHEN is lifted to the bottom of a set of  steps by two EQUERRIES.  THE   THEORY   of   EVERYTHING   91  (CONTINUED)",
      "characters": [],
      "action_text": "Left unattended, he motors forward a short distance and stops  to watch his children. Fulfillment floods into his  expression. A moment of deep satisfaction. He then looks  around for JANE, finally making his CHAIR turn around.  He sees her - some distance away. She has detained one of the  EQUERRIES.  JANE  (to EQUERRY)  I'll leave a card. There's a  number you can call. They can  install ramps in a day. It really  would be helpful.  JANE hands the EQUERRY a card, and smiles. The EQUERRY nods,  retires.  JANE sees STEPHEN. She walks up to him. Together they watch  their children.  TIGHT ON STEPHEN: His eyes move from the kids, playing in  this paradise, to the screen, where he types something...  JANE sees he is writing something. She crouches beside his  wheel-chair as the LETTERS FORM.  JANE (CONT’D)  Congratulations--my Companion--Of  Honour. Not bad for an old liberal  socialist--  (whispers)  Don't worry, you can decline the  knighthood.  He smiles, stops writing, looks at her with warmth, and she  at him. She KISSES him on the cheek.  JANE (CONT’D)  Thank you. For today. It's been  extraordinary. It's all just been  rather extraordinary though, hasn't  it?  They look into each other's eyes, and then starts writing  again -  JANE (CONT’D)  What are you writing?  ANGLE ON SCREEN: as he chooses letters from the streaming  alphabet. As each word forms it drops onto the line where  he builds this following sentence -  \"L O O K   W H A T   W E   M A D E \"  THE   THEORY   of   EVERYTHING   92  CONTINUED:  (CONTINUED) On his next click -   \"PLAY\"   - we -  SNAP TO:  EXT. GRAPHIC/UNIVERSE  A BIG CRUNCH galactic moment - a supernova in reverse, from  explosion to reconstituted star, then cut to - A CG MODEL  OF THE UNIVERSE contracting - the stars converging, moving  back together, toward the universe's first moment.  TIME'S ARROW has been REVERSED...  MONTAGE   - sweeping us backward through TIME, a series of  scenes from the film in reverse chronology...  A) REWIND F",
      "dialogue_count": 0,
      "word_count": 979
    }
  ]
}