{
  "slug": "the-mummy-2017",
  "title": "the mummy",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 9,
  "characters_count": 1,
  "characters": [
    "LORENZO"
  ],
  "total_words": 26328,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. JORDAN - ARCHAEOLOGICAL SITE - SUNSET  Jenny kneels in a trench with a brush. She’s exhuming an old skull - a corroded bronze spearhead still lodged its eye socket. A PHONE RINGS in her pocket. She answers. FORSTER (V.O.) Dr. Jennifer Halsey? JENNY Yes.  INT. FIELD TENT - SUNSET  A heavy-duty canvas tent filled with shelves and work tables. Jenny hastily packs a bag with tools and supplies. Professor Sheppard looks on, brow furrowed with disapproval. PROFESSOR SHEPPARD Who’s the client now? Some mobster? JENNY The Pentagon, actually. PROFESSOR SHEPPARD What do they want with you? You don’t even know, do you? One of these days your confidence will get you killed. JENNY I know what I’m doing. PROFESSOR SHEPPARD You’re smart. But you lack   reverence . This work is a sacred trust. We trade in swords and crowns. Gods and demons. Powers that raised armies and toppled empires. The stone gods you dig up may not be   your   gods. But the mysteries they stand for are real. Respect them. Jenny studies him, puzzled and amused. She doesn’t get it. JENNY I got a plane to catch.  EXT. RAMSTEIN AIR BASE, GERMANY - DAY  From this base America projects air power to the Middle East. The runways rumble with fighter jets and cargo planes. SUPER: RAMSTEIN AIR FORCE BASE, GERMANY Jenny debarks from an American military transport plane. Forster greets her at the foot of the ramp.  22.",
      "characters": [],
      "action_text": "FORSTER Dr. Halsey. Colonel Gideon Forster. Department of Defense.  RUNWAY  Forster walks with Jenny toward a complex of hangars. JENNY You want me to help you   plunder   a burial site ? FORSTER We’re extracting an artifact of military value. I need you to learn everything you can about it. Age, culture of origin, associated names or entities. JENNY Colonel, I don’t know where you got my name. But this is not what I do. Forster turns on her, his demeanor hardening. FORSTER I know exactly what you do, Dr. Halsey. I have a file documenting your dealings with dozens of gangsters, smugglers and black marketeers who pay you handsomely for God knows what services. Jenny stares at him in astonishment, caught flat-footed. FORSTER (CONT’D) I can pay your usual fee and be one more client you don’t talk about... or I can send my file to Interpol. He lets the threat hang in the air. She studies him. A beat. JENNY Twice my usual fee.  INT. HANGAR - DAY  A huge vacant space. At a folding table, Tyler studies a map of Iraq. He looks up as Forster leads Jenny in. TYLER We need to get in and out fast, or we’ll catch more heat than we can handle.  23. FORSTER Tyler. Jennifer Halsey. Expert on the Ancient Near East. Tyler Colt. Tyler clocks Jenny and dismisses her. A decorative civilian. TYLER What are my assets? Apart from her? Jenny stares at him.   Excuse me?  FORSTER Twelve specialists out of the Army Corps of Engineers. Tyler nods. Good start. He taps the map. TYLER This desert’s held by tribal warlords. Even with a fast turnaround we’ll want security. SEALs. Rangers. Forster nods. Done. But Jenny frowns at the map. JENNY That’s strange. TYLER What? JENNY Iraq’s riddled with ruins, but they’re all in the river valleys. No one built out here in the open desert. Are we sure...? Tyler turns on her in annoyance. TYLER If one more person calls me crazy... Forster holds up a forestalling hand. FORSTER How do we operate inside the tomb? Tyler gets back on task. Stares into space, think",
      "dialogue_count": 0,
      "word_count": 1043
    },
    {
      "scene_number": 2,
      "slugline": "EXT. RUNWAY - DAY  A colossal C-17 GLOBEMASTER CARGO PLANE sits on the tarmac, tailgate down. The Engineers back the cargo truck - loaded with Bobcat digging machines - into the cargo bay. Forster leads Jenny and Tyler up the tailgate into the plane.  EXT. IRAQI DESERT - TOMB ENTRANCE - NIGHT  A digging machine ROARS up out of the tomb, loaded with broken stone. The abandoned trucks of the tomb robbers are still here: windows shattered, tires flat, drifted into the sand. Forster’s convoy now stands beside them: two armored Humvees and the Oshkosh cargo truck. The four Army Rangers man defensive position around the site. WORKLIGHTS illuminate the tomb as the Engineers excavate the entrance. Beside them, Jenny pores over the ancient carvings. She walks back to Tyler and Forster where they stand on a rise overlooking the scene. She’s thrilled by the site. JENNY The tomb is Assyrian. That writing around the door? Curses.   Keep out. Abandon hope, ye who enter here.  A shout from the Engineers at the tomb’s entrance: ENGINEER We’re through! MINUTES LATER The twelve Engineers gather before Tyler, Jenny and Forster. Everyone wears WHITE HAZMAT SUITS with air supplies. Headgear under their arms. They carry scientific instruments. Tyler’s packing an M79 grenade launcher and a bandolier of grenades. Pistol on his hip. Submachine gun on his back. His AMMO CLIPS ARE MARKED WITH RED TAPE: incendiary rounds. TYLER There is some next-level badness down that hole. Keep your gloves on. Check your seals. Watch your air supply. You start hearing voices? Walk out. Follow the cable to the surface. Go straight to the medic. He points at the MEDIC beside his gear.  27.",
      "characters": [],
      "action_text": "TYLER (CONT’D) Watch each other for the signs: The sweats. The shakes. Crazy eye. Sudden aggression. That’s why nobody’s got weapons. ENGINEER #2 You’ve got weapons. TYLER It’s not my first rodeo. I’m here to watch your backs. Suit up! The Engineers pull on ANTISOUND HEADSETS AND HAZMAT HOODS. Tyler hesitates, staring at the tomb. Forster notices. FORSTER We have all your precautions in place. We’re good. TYLER Nothing here is good. He pulls on his headgear: ALL SOUND IS SILENCED. A purr of WHITE NOISE. He leads the team into the tomb, Forster and Jenny right behind him. The Engineers bringing up the rear. The last man carries a spool of yellow cable that unrolls behind them. Like astronauts they follow Tyler into the dark.  INT. TOMB - PASSAGEWAY  Their floodlights bathe the walls in a harsh white glare. We hear as they do: sand crunching underfoot. Their breathing. The purr of ventilators. Forster carries a MAGNETOMETER that detects electric and magnetic flux across all bands. He sweeps the walls with it. Jenny looks around in wonder. Steps aside to photograph the walls. The light fades. The unspooling cable bumps against her feet: she’s lagged behind. She hurries to catch up.  ANTECHAMBER  It’s a heroic act for Tyler to enter this chamber. Here his men fell, and the dead rose. But there are no bodies on the ground. The blood on the walls has faded. Tyler frowns. He spots an age-browned SKULL FRAGMENT on the floor. Beside it, an AK-47 engulfed in rust. He picks it up: the gun falls apart in his hand - as if a thousand years have passed. FLASHES as Jenny enters, taking pictures. Foster’s watching his instruments. He signals: keep moving.  28. LABYRINTH  Tyler leads the team into the maze. One of their floodlights FLARES and BURNS OUT. Moments later, another. An Engineer falters. Drops his gear. Stumbles back the way they came, groping along the yellow cable. At an intersection Tyler pauses - remembering his way. Points down a passage. Forster sweeps with his magnet",
      "dialogue_count": 0,
      "word_count": 1842
    },
    {
      "scene_number": 3,
      "slugline": "INT. C-17 (IN FLIGHT) - CARGO BAY - DAY  The SARCOPHAGUS is tied down in its high-tech kevlar case. Tyler stares glumly at it: stuck on a plane with that   thing . Spooked Engineers sit on benches along the walls. Tyler gives them a hand signal as he passes:   Keep your headgear on.  COCKPIT  A PILOT and COPILOT guide the C-17 into the safe upper air. Behind them, Forster, Tyler, and Jenny drop into jump seats. TYLER Bad op. FORSTER I didn’t expect to lose men. He has the look of a man who’s won an auction with a bid he can’t afford to pay. TYLER You in trouble? FORSTER I’ll handle it. When they see what I’ve found - all will be forgiven. He falls back in his seat and closes his eyes. Tyler looks at Jenny: she’s scribbling furiously in her sketchbook. TYLER You did good back there. Jenny waves him off impatiently without looking up. JENNY First sixty minutes are the golden hour for recall. Don’t talk to me. Her pen flies as she tries to capture all she’s seen.  EXT. STORMY SKIES - DAY  The C-17 soars over the Mediterranean. The skies darken. Ominous clouds gather. Rain begins to fall.  INT. C-17 - COCKPIT  Tyler, Jenny, and Forster are asleep despite the turbulence. Jenny’s notebook lies open in her lap: its pages covered with horrifying drawings from the tomb. Tyler twitches - hounded by nightmares.  34.",
      "characters": [],
      "action_text": "UNDERWORLD - ENDLESS STAIR  A spiral stair descends into darkness. TREE ROOTS have choked the stairwell, twisting through the rock. Terrifying noises from below: rumbles, crashes, muttering voices. The DEAD KING, his skin inked with warding glyphs, struggles down the stair - fighting through the gnarled roots. An EERIE LIGHT approaches from below. In terror the Dead King worms into a crevice in the wall. Hiding among the roots. A DEMON climbs past, ascending the stair: a skeletal monster with a hawklike head. It carries a wicked hooked blade that glows with a blue light. When the demon has passed, the Dead King tries to emerge from hiding - but THE ROOTS HOLD HIM FAST, twined around him. He struggles to free himself. The roots tighten, entangling him in strangling loops - and DRAG HIM SCREAMING INTO THE EARTH.  INT. C-17 GLOBEMASTER - COCKPIT  KA-TOW!!   LIGHTNING STRIKES THE PLANE! The THUNDERCLAP catapults Tyler out of his nightmare. Beside him Forster and Jenny wake, disoriented. They’re flying through an apocalyptic storm. Warning indicators flash and beep in the cockpit. Rain lashes the windows. Static on the displays. The compass spins wildly. TYLER What’s happening? COPILOT Weather came out of nowhere! FORSTER Where are we? PILOT Hard to say. Nav is out. European airspace. JENNY Look at that! A BLACK WALL OF CLOUD towers out of the storm ahead like a tidal wave: it looks dense and dark enough to crush them. PILOT Darkest cloud I’ve ever seen. The COLLISION RADAR starts BEEPING. Tyler squints at the stormcloud. Something’s not right. Horror fills his face.  35. TYLER That’s not a cloud. WE ZOOM THROUGH THE COCKPIT WINDOWS... ...rocketing across the sky to the black stormfront. It’s a FLOCK OF RAVENS. Millions of them, beating through the tempest at an impossible altitude with strange purpose. The C-17 STRIKES THE RAVENS AT 450 KNOTS. At this speed a raven might as well be a cannonball. The bombardment streaks the C-17 with blood. All four engines BURST INTO FL",
      "dialogue_count": 0,
      "word_count": 3036
    },
    {
      "scene_number": 4,
      "slugline": "INT. CELLAR - DAY  Jenny has laid out the major fragments of the sarcophagus. She studies the engravings, poring over the text. In the DRAINAGE TUNNEL BEHIND HER -   movement . The MUMMY peers out of the darkness: a skeletal ghoul with broken pipes jutting from its wrists, neck and chest. It creeps closer... Jenny, oblivious to its presence, begins to READ ALOUD IN ANCIENT AKKADIAN - frightened by what she’s reading. The Mummy freezes in astonishment. Cocks its head and stares at her with slitted eyes. Listening. Tyler CRASHES DOWN into the cellar, making Jenny gasp. He pulls his pistol and flashlight. Sweeps the cellar. JENNY What are you doing?! Tyler shines his light into the tunnel. The Mummy is gone. TYLER You see anything strange? JENNY Yes. The Assyrians wrapped their dead in shrouds - but they didn’t embalm them like the Egyptians. But look: She turns over a large fragment of the sarcophagus lid, which would have covered the head and torso of its occupant. Molded to fit the body, the lid is VEINED WITH TUBES AND RESERVOIRS OF BRONZE. Some of the tubes - broken off - plunge into the space the corpse would have occupied. JENNY (CONT’D) This intricate mechanism. Reservoirs for some sort of fluid. Pipes designed to   penetrate the body!  (reading the reservoirs) “Blood of dreams. Blood of night. Blood of returning.” One of the pipes runs to a CLOCKWORK APPARATUS on the sarcophagus lid: she works it with her hand, and A BARBED NEEDLE juts from a handprint on the lid. JENNY (CONT’D) “Blood of the Chosen.” Tyler looks at the scar on his palm. Closes his fist over it.  46.",
      "characters": [
        "LORENZO"
      ],
      "action_text": "JENNY (CONT’D) This is sorcery to raise the dead. We FLY PAST Tyler and plunge into the dark DRAINAGE TUNNEL.  UNDERGROUND PIPES - CONTINUOUS  We race through ancient drainways. Across a flooded cistern. UP a vertical drain through a splatter of falling water. THE MUMMY is climbing the drain. The jagged pipes in its wrists leaving scratches on the stones.  EXT. ALLEYWAY - DUSK  Night is falling. A pelting rain beats the cobblestones. An IRON GRATE BREAKS FREE from its cemented moorings. THE MUMMY CLIMBS OUT into the twilight. Rises to its full height: a gaunt black figure in the shreds of its burial wrappings. It walks to the mouth of the alley and looks at Rome.  INT. FORSTER’S BASE  Alone in his abandoned shop, Forster paces restlessly - circling his comm terminal like he’s afraid to look at it. AMBASSADOR SLADE (O.S.) Colonel Forster! Forster jumps at the sound. Slade steps inside, shaking rain from his umbrella. Outside, four Marines stand guard. FORSTER Ambassador. He’s forcing his usual confident tone - but there’s a crack in it. Ambassador Slade has blood in his eye. AMBASSADOR SLADE I tracked down your Special Weapons Group - which I’d never heard of, by the way. Got your supervisor. Know what he told me? There IS no go mission to Iraq. Nobody knows you’re here. (with savage triumph) You’re off the reservation! You’re  single-handedly responsible   for that nightmare out there! FORSTER Yes. I am. He sounds like a man before a firing squad.  47. The Ambassador looms in Forster’s face, enjoying his ruin. AMBASSADOR SLADE I don’t know whether we’ll crucify you in the public square or bury you by dark of night, but either way I’ll enjoy it. He turns to summon his Marines. FORSTER Ambassador! (desperately) I can explain! Just look at this. He passes a TABLET COMPUTER to Slade and taps the screen. AMBASSADOR SLADE Nothing you can show me will... He trails off. A SHIFTING DIGITAL PATTERN flickers on the tablet’s screen. Slade stares into the light, HYPNOTIZED. Shie",
      "dialogue_count": 1,
      "word_count": 9764
    },
    {
      "scene_number": 5,
      "slugline": "EXT. ISTANBUL STREET - DAY  The city’s business quarter. Gleaming towers on wide avenues. Tyler and Jenny walk up. He carries the sword wrapped in his coat. She has her bag slung over her shoulder. JENNY This is the fine-arts district. Every major auction house and antiquities broker is here. If the Rebel Temple’s as active as Lorenzo said, someone here will know how to reach them. I say we go door to door until we... Tyler taps her on the shoulder. Points across the street. High up on a gleaming office tower: a CORPORATE LOGO IN THE SHAPE OF A FOUR-BARRED CROSS. The Djed pillar.  EXT. REBEL TEMPLE - ENTRANCE  On a sign beside the door, Tyler and Jenny see the Djed pillar repeated beside a phrase in Turkish calligraphy. JENNY  Isyankar Tapinak.   Rebel Temple! Tyler tries the glass doors: locked. The marble lobby inside is deserted. He presses a button on the door panel. The VIDEO SCREEN on the panel lights up. A bored-looking young man in a suit looks back at them. His name is DAYAN. DAYAN  Isyankar Tapinak.  JENNY (in Turkish, subtitled)  We need your help.  DAYAN (in Turkish, subtitled)  Sorry. Visitors by appointment only.  Tyler leans close and speaks to the camera. TYLER The Dead King has risen. He already has his crown. WE have his sword. He holds the sword up to the camera. Dayan stares like he’s seen a ghost. The screen goes dark. TYLER (CONT’D) Hopefully we’ll get a few words in before they kill us.  85.",
      "characters": [],
      "action_text": "DOORS BURST OPEN at the back of the lobby. A phalanx of grim dark-suited men stride toward the front doors. One of them is the Dark Man from Rome: a bandage across his broken nose. TYLER (CONT’D) Maybe not. The leader, MALIK, 35 - slim, dapper, and handsome - wrenches the door open angrily. Tyler holds up a soothing hand. TYLER (CONT’D) Easy. We’re friends. Malik takes a hissing breath. Seizes Tyler’s wrist, staring at the scar on his palm. He has an Oxford accent: this is the Mysterious Man we saw on the phone at the top of the film. MALIK Blood of the Chosen!  INT. REBEL TEMPLE - GRAND HALL  Malik walks Tyler and Jenny into a stunning marble hall with elegant lighting. Priceless relics on display in glass cases. Two dozen BROTHERS OF THE REBEL TEMPLE surround them. They wear bespoke suits with exquisitely patterned ties. Manicured hands. Immaculate haircuts. It looks more like a boutique investment bank than a mystical order. TYLER (aside to Jenny) Not what I expected. She shakes her head, looking around.   Me neither.  Malik turns to them, righteous and stern. MALIK Your names. TYLER Tyler Colt. This is Jennifer Halsey. MALIK The archaeologist. Your monograph on Scythian magic was very good. JENNY (astonished) Thank you. She looks around in wonder at the antiquities on display.  86. JENNY (CONT’D) You have pieces here I’ve spent years searching for. Nefertiti’s Scepter. The Chalice of Antioch. MALIK Why have you come here? JENNY Because of this. She reaches into her bag. Quick as cats, the Temple Brothers whip WEAPONS from under their coats. Tyler and Jenny find themselves the center of a quivering ring of knives, swords, and pistols. Verrrry slowly she pulls out the cylinder seal. JENNY (CONT’D) The Vatican Archivist gave us this. Your message. We hoped you’d help. MALIK You raised the Dead King. TYLER He raised himself. We’re trying to put him back in the ground. Malik takes their measure with his eyes. He believes them. MALIK I am Malik. Leader of the Temple. ",
      "dialogue_count": 0,
      "word_count": 1657
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ISTANBUL AVENUE - DAY  A black ROLLS ROYCE PHANTOM V glides down the avenue. A fantastically expensive car. The license plates read LORENZO.  INT. ROLLS ROYCE (IN MOTION) - CONTINUOUS  Behind the wheel is Marco, Lorenzo’s pilot - eyes blank white and staring. Enslaved by the Dead King. In back rides Ashurbanipal, crowned and dressed as a king might dress himself from Lorenzo’s closet: black silk pajamas and slippers, a dark dressing gown belted at the waist.  EXT. ISTANBUL AVENUE - (CONTINUOUS)  We rise above the Rolls Royce as it moves down the avenue. Misfortune and mayhem travel with it like an invisible wave. As the car passes - two lovers walking hand in hand begin to fight viciously. A man walking two mastiffs is attacked by his dogs. A policeman hurrying to rescue him fumbles his gun: it goes off when it hits the ground - killing the policeman. The Dead King smiles. The car rolls on. Chaos in its wake.  INT. REBEL TEMPLE - GALLERY  Rabbu and Tyler walk through a gallery overlooking the city. TYLER Sorry about the nose. RABBU It’s nothing. I’m sorry we fought. If we had spoken, we might still have the crown. But we have the sword - and here it’s safe. There’s a holy seal on every brick in the Temple. Every girder, tile and window. He touches the window in front of them: an intricate RUNE ENGRAVED IN THE GLASS. RABBU (CONT’D) This will stop the Devil himself. TYLER Will it stop a brick? RABBU If we come under physical assault, we take refuge in the Stronghold. Beneath the Temple. The fortress of our forefathers. They were frightened men: they dug deep and built strong.  92.",
      "characters": [],
      "action_text": "TYLER Okay. Defense is half the battle; talk to me about fighting back.  TEMPLE ARMORY  A steel-walled hypermodern room. Racks and shelves hold a strange mix of ancient and contemporary weapons. VIALS OF WHITE POWDER beside FRAGMENTATION GRENADES. Sleek KEVLAR VESTS beside MYSTICAL MEDALLIONS. Rabbu pulls out a rolling rack filled with SWORDS. Tyler picks up a broadsword: Damascus steel, carved with Aramaic script and mystic symbols. RABBU Consecrated blades. Demons can’t be hurt by common steel. These will cut - and kill. Tyler swings the sword in a swift figure-eight, testing the balance. Thrusts and returns gracefully to guard. RABBU (CONT’D) You’re a swordsman! TYLER Not really. Trained a little katana, escrima stick, basic knife- fighting. Do you have anything a little more up-to-date? Rabbu pulls open a rolling rack of HIGH-TECH MACHINE GUNS. TYLER (CONT’D) That’s what I’m talking about.  INT. REBEL TEMPLE - COUNCIL ROOM - DAY  The great meeting hall of the Rebel Temple: the penthouse, with panoramic views of Istanbul. Dark clouds are rolling in. Swords and rifles lie on the council table. The Temple brothers, wearing kevlar vests under their suit coats, sit gravely. Tyler and Jenny among them. Malik is on his feet. MALIK Ashurbanipal is trapped in his own dead flesh. He is in constant pain. Full of suffering and vengeance. He will stop at nothing to live again. Jenny nods, shaken. She believes. She takes Tyler’s hand.  93. MALIK (CONT’D) Long ago, priests of our order gave him the power to open the gates of hell. Now it falls to us to stop him. (grimly) It won’t be easy. The King has his crown. It will magnify his power.  EXT. ISTANBUL AVENUE - OFFICE TOWER - DAY  The Rolls Royce pulls up beside an office tower. Ashurbanipal gets out. Walks up to the building - and without breaking stride, WALKS UP THE WALL.  INT. REBEL TEMPLE - COUNCIL ROOM  Malik is warming to his theme. Rousing the men’s spirits. MALIK Many of our brothers are far away. There’s no time to ",
      "dialogue_count": 0,
      "word_count": 4005
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MOSUL ARMY BASE - DAY  An Iraqi Army base on the edge of the city, fortified with blast walls and gun turrets. A TANK in the compound. Dozens of soldiers stand guard or move about the interior. A MOTORCADE pulls up to the base entrance: a LIMOUSINE flying Syrian flags, escorted by armed trucks. Confusion at the gate. No one was expected. The guards shout challenges. There’s no answer: the drivers and soldiers of the motorcade stare straight ahead with blank white eyes. Ashurbanipal steps out of the limousine in a black Arab robe. He walks up to the gate. The guards blanch when they see his dead skin. They raise their guns in confusion. Ashurbanipal smiles. His sword slides from beneath his robe. He moves with blinding speed.   SLASH. SLASH.   Two soldiers fall dead.   CHOP.   The steel gate falls apart. He flings it open. Machine guns start firing as he walks into the compound.  INT. MOSUL ARMY BASE - HEADQUARTERS  BASE COMMANDER SAIF AL-RAHAL - a lion of a man with a thick mustache - spins toward the door at the sound of gunfire. Beside him an American Army Ranger, LIEUTENANT QUINN, comes to alert. They grab weapons and run outside.  EXT. MOSUL ARMY BASE - CONTINUOUS  Saif Al-Rahal and Quinn emerge into the sunlight to see a MILITARY TRUCK tumbling across the compound in flames. Ashurbanipal walks through the smoke. The TANK, a Russian T- 90, rumbles to meet him, lowering its main gun to engage him. Ashurbanipal SLASHES two-foot sections off the descending gunbarrel. What’s left of the gun lowers far enough to aim at him. The Dead King STABS HIS BLADE INTO THE TANK’S HULL. INSIDE THE TANK The DRIVER screams as the sword blade thrusts through the thick armor and stops an inch from his face. ON ASHURBANIPAL As he heaves upward. The entire tank FLIPS END OVER END - the main gun firing, too late, mid-air - and lands upside-down. A VOLLEY OF BULLETS stitches across Ashurbanipal’s body as a gun turret opens fire on him. He clenches his fist.  108.",
      "characters": [],
      "action_text": "Hurls it as if throwing an invisible stone. The gunners scream and cover their eyes, blood seeping between their fingers. Blind. More solders join the fight, aiming an annoying number of guns at the Dead King. Enough games. He thrusts his sword into the earth, muttering in Akkadian. Spreads his fingers and drives his hands outward as if toppling walls. All over the base, soldiers COLLAPSE like marionettes whose strings have been cut. Silence falls. Ashurbanipal beckons. Jenny and Lorenzo get out of the limousine and walk into the base, following Ashurbanipal toward the yawning mouth of an ancient cave.  INT. MERCENARY HELICOPTER (IN FLIGHT)  Tyler stares down at the Mosul Army Base on approach. The overturned truck and tank, spewing smoke and flame. Lifeless bodies strewn everywhere. The entire base is down. TYLER We’re too late. He got here first.  EXT. MOSUL ARMY BASE - DAY  The helicopter sits on the ground, rotor spinning down. Tyler and the Temple Brothers get out carrying assault rifles. The Temple brothers wear swords. Belbasa kneels over the fallen soldiers. They’re in a stupor: eyes rolled back, whispering in tongues. BELBASA Not dead! Enchanted! He opens the kit he carries. Stamps sacred seals on their chests in black ink. Anoints them with oil. Waves burning herbs under their noses. The soldiers revive, disoriented. Rabbu hands out kits like Belbasa’s for reviving soldiers. RABBU Help the others! They hurry to rouse the other soldiers. Tyler spots soldiers in Army Ranger uniforms: Quinn and his men. TYLER American military advisors! Fumbling with the strange paraphernalia, he wakes Quinn. Quinn wakes and goes for his gun. Tyler catches his hand.  109. TYLER (CONT’D) Lieutenant Quinn! Tyler Colt, Navy SEALs. What happened here? Quinn blinks as if waking from a dream. LT. QUINN A man came. A dead man. TYLER Was anyone with him? LT. QUINN Guy in a suit. Girl in a white dress. Tyler closes his eyes in relief. Jenny’s alive. LT. QUINN (CONT’D) They went down t",
      "dialogue_count": 0,
      "word_count": 873
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MOSUL ARMY BASE - DAY  Standing with Tyler, Quinn sees Malik reviving Saif Al-Rahal. LT. QUINN Saif! Base commander. A good man. Tyler shakes Saif’s hand as he rises, speaking urgently. TYLER Commander. The man who did this to you is down in the caves. We’re going after him. SAIF He was no man. He was a   jinn . MALIK Yes. Your weapons will not work against him. Dayan, Rabbu, and Belbasa unload gear from the helicopter. Every CONSECRATED BLADE from the Temple armory. Wooden boxes containing VIALS OF WHITE SALTS. Modern ammo cases. MALIK (CONT’D) These are sacred blades. They will bite even a   jinn . Holy salts: harmless to men, deadly to demons. Incendiary bullets for your guns. Saif lifts a Temple sword, admiring the steel. He smiles. SAIF  Allah hu Akbar.  MALIK Praise God. A SHOUT from the gates. A battered LAND ROVER speeds onto the base in a cloud of dust. Twenty guns come up. PROFESSOR SHEPPARD gets out, hands in the air. His voice trembles: PROFESSOR SHEPPARD I’m looking for Tyler Colt. Tyler steps forward, astonished. TYLER Here. PROFESSOR SHEPPARD I have a message from Jenny Halsey. I, uh...I don’t know what it means.  111.",
      "characters": [],
      "action_text": "TYLER Talk. PROFESSOR SHEPPARD (reciting from memory) There are three spells in the ritual. The first spell raises the city of the dead. The second restores the Dead King to life. The third makes him immortal. Between the second spell and the third - he can be killed. Tyler and Malik exchange fierce looks. There’s a chance.  INT. NECROPOLIS - UNDERWORLD GATE  Jenny - looking every inch the priestess with her white dress and transported eyes - finishes reading the first spell. The runes of the mandala LOCK INTO PATTERN. Ashurbanipal paces a mystical phrase across the interlocking circles. On the pillar, the first spell is completed: luminous runes filling its surface. A RUMBLE. The walls shake. Ashurbanipal laughs in triumph.  EXT. MOSUL ARMY BASE - DAY  Tyler and the Temple Brothers are rigged for battle. Swords on their hips. Rifles on their shoulders. Army Rangers and Iraqi soldiers load incendiary rounds. Malik hands Tyler a TEMPLE SWORD in a scabbard. TYLER The dude chopped down a   bridge . What am I going to do with this? MALIK The power was in his blade, not his arm. I know I failed you. I promise you: the Temple steel will not. Tyler gives in. Straps the sword around his hips. A RUMBLE. The earth shakes! Dark clouds blot out the sun. WALLS AND PILLARS erupt from the ground! RIFTS open in the earth, sand draining into subterranean chasms. The shifting ground topples gun turrets and swallows vehicles. MALIK (CONT’D) The first spell! The Necropolis rises! TYLER Move out! Go! Go!  112. He leads a charge toward the caves, Malik at his side. The Temple brothers behind them, other soldiers following. But THE DEAD CRAWL FROM THE CHURNING EARTH! The restless souls of the Underworld. Some are SKELETAL FIENDS. Others, twisted MUSCULAR GHOULS wrapped in chains. Even some of the pale EYELESS HORRORS from the Valley of the Blind. They attack the living with clawed fingers and fangs, turning the soldiers’ advance into a chaotic melee. The air fills with screams. The horrif",
      "dialogue_count": 0,
      "word_count": 2461
    },
    {
      "scene_number": 9,
      "slugline": "INT. NECROPOLIS - UNDERWORLD GATE - LECTERN  Jenny speaks another line. The wheels turn. Nothing happens. Finally, desperate, she tries a last line of magic, shouting the ancient syllables until the walls echo with it. The wheels pivot and lock. A SHATTERING THUNDERBOLT! Tyler kneels on the mandala, smoke rising from his clothing. JENNY Tyler! She runs to him, dropping to her knees beside him. Throws her arms around him. He pulls her close - and suddenly they’re KISSING. Their shared ordeals translated into passion. A RUMBLE. The floor shakes under them. They both look up. TYLER We’d better go.  EXT. MOSUL ARMY BASE - DAY  The DEAD DISSOLVE INTO POOLS OF DUST. The DEMONS DISINTEGRATE INTO BURNING EMBERS. The defenders lower their swords and guns in disbelief. The NECROPOLIS RECEDES. Walls and pillars sinking back beneath the ground. Fissures in the earth closing up. The Temple Brothers look up: THE FACE OF ASHURBANIPAL FORMS IN THE DARK CLOUDS, full of fury. But even as it forms, the clouds shred and blow away, revealing a golden sun. MALIK The Evil One has fallen! A mighty cheer from all the warriors on the field. Iraqi soldiers, Army Rangers, even Professor Sheppard. A ROAR LIKE THUNDER! A dust cloud billows from the mouth of the caves. The smile dies on Malik’s lips.   His friends!   He runs toward the cave entrance. The Temple brothers and Professor Sheppard follow. Before they get there, Tyler and Jenny walk out of the dust, arm in arm. The Temple brothers race to them, nearly taking them off their feet with their jubilant embrace.  EXT. ATHENS - REBEL TEMPLE SAFE HOUSE - DAY  A palatial house in the center of Athens. In the distance, the Parthenon gleams in the sunset.  120.",
      "characters": [],
      "action_text": "Tyler sits shirtless on a wooden chair as Belbasa puts the finishing touches on a full set of Rebel Temple tattoos: mandalas and warding symbols on his chest and back. Jenny and Malik sit watching, sipping wine. Belbasa finishes. Tyler pulls a shirt on, wincing. Malik embraces him. MALIK Now you are a Temple brother. Our doors will always be open to you. We have safe houses like this one in many cities. You will never be homeless. TYLER Thank you. He sits beside Jenny. Slides an arm around her. JENNY What about you and your brothers? MALIK We must replenish our numbers. Rebuild our temple. The Evil One has fallen. Other evils will rise. The Rebel Temple will keep watch. Never again to let down our guard. They rise, parting ways. Tyler grips Malik’s hand. TYLER Good luck, Malik. Stay strong. MALIK We will. Godspeed.  EXT. ATHENS - STREET  Tyler and Jenny stroll, arms around each other. They wear sunglasses. Tyler in a hat, Jenny a head scarf. Incognito. The sun is setting. The streets full of flowers. A guitarist plays on a street corner. It’s all ridiculously romantic. JENNY So we saved the world and we’re wanted fugitives. What now? TYLER I was thinking Mexico. JENNY Lot of good archaeology. Mayan ruins. TYLER Also a lot of good hiding places.  121. She laughs. And around them - THE MARKETPLACE FALLS SILENT. People talk, motor scooters zip past, the guitarist plays - but all Jenny and Tyler can hear is THE RUSHING OF WIND. TYLER (CONT’D) You hearing this? Jenny nods, wide-eyed with awe. MAJOR KRAKAUER Sorry. That’s me. They turn. A lean man in a suit stands behind them. Chiseled features, graying temples, shrewd eyes. He is DYSON KRAKAUER. He waves his hand to indicate the aura of silence. MAJOR KRAKAUER (CONT’D) Antisound. I’d rather not be overheard. Mr. Colt. Ms. Halsey. The world’s in your debt. I want you to know we appreciate what you’ve done. TYLER Who’s “we?” MAJOR KRAKAUER The Special Weapons Group. Department of Defense. Major Dyson Krakauer. He hands the",
      "dialogue_count": 0,
      "word_count": 1647
    }
  ]
}