{
  "slug": "the-beguiled-2017",
  "title": "the beguiled",
  "genre": "drama",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 12483,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. MANSION - DAY A small group of CONFEDERATE SOLDIERS march past the school’s gate. They are battle-weary, in worn uniforms.   Behind their wagon, Yankee prisoners march slowly along. Miss Martha opens the gate to greet them. MISS MARTHA What’s the news? CONFEDERATE SOLDIER Taking these Yanks to prison to die. A CONFEDERATE CAPTAIN rides up on his horse, bowing his head to Miss Martha as he dismounts. INT. GIRLS’ BEDROOM - DAY CLOSE on Amy, perched at the window; she looks down on the scene. AMY You think Miss Martha’s going to tell them about him? Alicia, Jane, and Marie pass a row of single beds with faded blankets and quilts and lean in around Amy, trying to see. THEIR POV: EXT. MANSION GATES - LATE AFTERNOON The Captain, now standing, talks to Miss Martha at the gate. She stands composed, like a lady, with a subtle tilt of her head, as if she was at the entrance of a ball. CAPTAIN You all alone, ma’am? MISS MARTHA Just a teacher and a few students. (CONTINUED) 17.",
      "characters": [],
      "action_text": "CAPTAIN Well, take care. Ma’am. Lot of these Yanks got separated from their outfits. They’re roaming these woods and they’re desperate. MISS MARTHA Yes, Captain. I wonder if you might have a few cartridges you could spare. CAPTAIN What good would that do you, ma’am? MISS MARTHA My father left his revolver, and I’d feel much safer knowing I might use it if needed. He nods in respect. CUT TO: INT. BEDROOM - LATE AFTERNOON Girls’ POV from the house. They see the Captain handing Miss Martha a small packet. JANE Is she telling him?! Jane looks over Amy’s shoulder. AMY (O.S.) He’s giving her something? CUT TO: EXT. MANSION - LATE AFTERNOON Through moss-covered trees, we see the Captain and his group start off. (CONTINUED) 18. AMY (O.S.) They’re leaving, she didn’t tell them!! WIDE on Miss Martha as she strides toward the mansion. INT. MISS MARTHA’S ROOM- DUSK  Close with Miss Martha as she opens a drawer and takes out a  revolver. She loads a few cartridges into the gun, and puts it back, shutting the drawer. CUT TO: EXT. MANSION BALCONY - EVENING  Surrounded by mossy trees, Marie walks around on look-out as the evening sun sets. We hear the sound of CICADAS and CRICKETS joining in.  INT. HALLWAY - EVENING Edwina passes the music room to see the door open -- INT. MUSIC ROOM - EVENING In the low light, Edwina pauses to look through a space in the slightly open door. She sees Amy inside kneeling at the beside of a sleeping McBurney, whispering to him. Edwina shoots her a look. EDWINA (trying to keep her voice down) What are you doing there! Amy looks over to her in the doorway. AMY I was just telling him something private. (CONTINUED) 19. EDWINA Let him rest. AMY (whispers to McBurney) See you later. (CONTINUED) 19A. Amy bids adieu to sleeping McBurney and heads out, stopping at Edwina in the doorway. AMY (CONT’D) I was just checking on him.   I thought he might want some company. Edwina is stern with her. EDWINA He’s not one of your wounded birds or beetles. Amy gives her ",
      "dialogue_count": 0,
      "word_count": 984
    },
    {
      "scene_number": 2,
      "slugline": "INT. MUSIC ROOM - MORNING The birds continue as Amy opens the door and peeks in. McBurney winks at her as she approaches him.   He is cleaned up and wearing a linen man’s nightshirt. MCBURNEY Good morning.   It is morning, I take? She nods. AMY It’s about six. MCBURNEY I thought as much from the larks I heard singing. AMY Do you like birds? MCBURNEY Love them.   Anything wild I love... wild and free. AMY I think they’re robins.   I can show you some nests I collected? MCBURNEY That would give me great pleasure. She smiles. AMY I better go... Miss Martha’s coming to fix your bandages and bring your breakfast. She slips off. MCBURNEY Okay, then.   Thank you, darlin’ She smiles back at him as she leaves. CUT TO: 23.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 132
    },
    {
      "scene_number": 3,
      "slugline": "INT. KITCHEN - DAY The kitchen is busy with morning activity. Sun pours in through a window that looks out over the kitchen garden. A basket of greens and thick ceramic bowls sit on a side table.   Heavy iron pots hang by the stove, where Emily takes a pot off. The girls eat porridge over the kitchen table. ALICIA How’s the Yank doin’? AMY He’s fine, much better... JANE How long is he going to stay in the music room? EDWINA Until he’s much better. JANE But, how can I practice the harp with a dangerous enemy in the same room? The other girls are used to her complaining. Miss Martha sweeps into the busy kitchen.   She is more put together than usual.  She passes Edwina, who is wearing a special dress.   She wears  a beautiful necklace on her pale floral dress.   Miss Martha admires it. Edwina continues to shell beans. MISS MARTHA  Très jolie . She gives her a loaded look, and then looks over at the other girls.   Emily has earrings on and Alicia has a flower in her hair. (CONTINUED) 24.",
      "characters": [],
      "action_text": "MISS MARTHA (CONT’D) (cool amusement) Seems like the soldier being here is having an effect.... (CONTINUED) 24A. Amy passes with her bowl. MISS MARTHA (CONT’D) Tell me, Miss Amy, did you find any mushrooms when you were out collecting soldiers? AMY I did, but only poisonous ones I think. MISS MARTHA Let’s have a look later, shall we? AMY Yes, ma’am. With her dignified posture and rustling skirts, Miss Martha crosses frame, leaving them. CUT TO:  EXT. OAK TREES  The   sun   beams   thru   fresh   linens   being   hung   on   a   clothes   line   by Edwina and Jane.  INT. MUSIC ROOM - DAY McBurney looks up with a cheerful smile as Miss Martha enters. Some of the girls whisper and giggle as they peek in and try to get a look at him. MISS MARTHA (to girls) Get on about your business, you have work and studies to do. EMILY Shall we not have music here this morning? MISS MARTHA No, we shall not.   Please go to the library. (CONTINUED) 25. She closes the door on them. She goes over to check on her patient. MISS MARTHA (CONT’D) Good morning, Corporal. (CONTINUED) 25A. He looks up at her. MCBURNEY I’m disrupting your place here. MISS MARTHA Indeed you are. She sets to work checking his bandages; she is all business. She takes his hand and examines it. CLOSE SHOT His hand in hers. Miss Martha pauses a moment, looking at his manly hand. She continues to dress his wounds. MCBURNEY You don’t mince words, ma’am. You speak right up, I like that. MISS MARTHA Do you indeed?   And do you think it makes a great difference to me whether you like it or not? He looks at her, enjoying the rally. MCBURNEY I’m sure my opinion means nothing at all to you, ma’am... I’m not looking for your praise. MISS MARTHA Are you not.   What are you looking for then? MCBURNEY Whatever you can spare me.   You have given me plenty and I’m most appreciative. (CONTINUED) 26. MISS MARTHA Aren’t you afraid I’ll turn you over to our soldiers? MCBURNEY No, I don’t think so.   I don’t say you won’t do it, but very",
      "dialogue_count": 0,
      "word_count": 1376
    },
    {
      "scene_number": 4,
      "slugline": "INT. MUSIC ROOM - DAY Edwina stiffly glides over to McBurney’s bedside. She opens a white handkerchief and places a small bar of lavender soap, a razor, and a tortoiseshell comb on a table next to McBurney with a pitcher of water on it. She freezes up, not knowing what to say. MCBURNEY Thank you very much. He reclines, trying to clean his black fingernails. EDWINA They look as if you had been trying to dig a pit with them. MCBURNEY I was.   In the battle, with all that iron flying overhead, my first thought was to bury myself. EDWINA And when you couldn’t, you ran? MCBURNEY I did.   I surely to God did. Edwina looks at him, his eyes smiling. EDWINA It wasn’t very brave of you to run. She makes herself busy with some task, straightening up the table beside him. MCBURNEY Maybe not, but it was smart, I think. EDWINA Because you’re alive? MCBURNEY And now I’ve met you. (CONTINUED) 33.",
      "characters": [],
      "action_text": "EDWINA You don’t even know me. MCBURNEY I know your name... Miss Edwina Morrow. EDWINA And what else have you been told about me? MCBURNEY Nothing besides your name.   It’s a lovely name. She checks his bandages like a kind nurse. EDWINA I hope the girls weren’t telling stories. MCBURNEY What do you care what is said about you? EDWINA I don’t...I just didn’t want you to have the wrong impression. Edwina looks at him. McBurney smiles up at her warmly, his eyes sparkling. She moves again. MCBURNEY Then you do care what I think about you. EDWINA You’re a stranger here, that’s all, and I don’t want you to be misled. MCBURNEY Well, perhaps you can set me off on the right foot and tell me about yourself.   Where are you from, Miss Edwina Morrow? (CONTINUED) 34. EDWINA My father’s home is Richmond, I left Savannah when I was quite young.   We lived in several places for my father’s enterprises. MCBURNEY And, are you waiting for your sweetheart to return when this war is over? EDWINA I have no one in the military. He takes this in, studying her.   She’s uncomfortable with his questioning. MCBURNEY And how did you end up here? EDWINA Why are you so interested in me? MCBURNEY Because something tells me we’re both out of place here. She looks at him. MCBURNEY (CONT’D) I’ll bet you’re the independent sort who the others don’t know how to get close to, and then of course there are your looks. EDWINA That doesn’t matter to me. (CONTINUED) 35. MCBURNEY In all my travels, I’ve never come across a delicate beauty like yours. He stares at her, she turns away. He grabs her arm and pulls her closer to him. MCBURNEY (CONT’D) Tell, me Miss Morrow, what’s your biggest wish, if you could have anything, what would it be? EDWINA Anything? MCBURNEY Anything. She is almost breathless, and gives in for a moment. EDWINA To be taken far away from here. He looks into her eyes. She straightens up and composes herself, standing. She smooths her hair. EDWINA (CONT’D) Good day, Corporal. MCBURNEY John",
      "dialogue_count": 0,
      "word_count": 538
    },
    {
      "scene_number": 5,
      "slugline": "INT. HALLWAY - DAY Edwina braces herself against a wall, and after a heavy exhale, she composes herself and moves on. EXT. GARDEN - DAY  Late afternoon.   Jane and Marie get a pail of water from the  pump.  EXT. BALCONY - LATE AFTERNOON Emily is on lookout as the sun begins to set. She sings to herself. CUT TO: INT. GIRLS’ ROOM - EVENING CLOSE on Amy as she feeds a little piece of lettuce to her pet TURTLE. AMY Here you go, Henry. She arranges an old box of her treasures, a smooth rock, a small bird’s nest. She adds a brass button after showing Henry. AMY (CONT’D) Mr. McBurney gave me one of his buttons. INT. DINING ROOM - EVENING We FOLLOW Amy, the last one to sit at the dinner table. She takes her seat and looks to Miss Martha to see if she’ll be scolded. Miss Martha, an example of perfect posture, smiles at her. She lowers her head. (CONTINUED) 37.",
      "characters": [],
      "action_text": "MISS MARTHA The eyes of all wait upon thee; and thou givest them their meat in due season. Thou openest thine hand, and satisfiest the desire of every living thing. Bless us and these thy gifts which we receive from thy bountiful goodness, through Jesus Christ, our Lord, Amen. (CONTINUED) 37A. GIRLS (IN UNISON) Amen. Miss Martha looks at them pleasantly as they start their meal. MISS MARTHA It has occurred to me that we might all reflect on the unexpected presence of Corporal McBurney in this house -- until his leg heals, of course. And we might discuss how we may practice compassion and what else we may learn from this. What does each of you think of this? Miss Martha looks around the table at the girls. MISS MARTHA (CONT’D) Miss Alicia, can you tell us how we may learn from his presence here? They all look to Alicia. ALICIA Well, maybe the sight of him will remind us there is something else in the world besides lessons. MISS MARTHA It seems to me that is all there should be for any young lady your age.   If we learn our lessons properly when young, we can expect a calm and happy life when we are faced with the distractions of the world.   N’est- ce-pas ? She looks to Edwina like, ‘Isn’t this so?’ Edwina nods. (CONTINUED) 38. JANE With the presence of this hateful enemy, he will be a constant reminder to us that the war is still going on, and the sacrifices and prayers we must make. EDWINA May I say, that any breath of fresh air from the outside world, I think is welcome to us all. EMILY I heard he said he was a mercenary, so maybe he’s not even really the enemy. AMY What’s a mercenary? ALICIA It means he’s just paid by the army to fight, he’s not really fighting their cause. MISS MARTHA Well, we don’t know about that. AMY He seems to be a student of nature, so I expect to learn about foreign wildlife. EDWINA He seems to be a sensitive person. MISS MARTHA Does he? EDWINA I found him understanding. MISS MARTHA Do you, indeed?   You must share more of your findings w",
      "dialogue_count": 0,
      "word_count": 564
    },
    {
      "scene_number": 6,
      "slugline": "INT. MUSIC ROOM - NIGHT The women join McBurney in the candlelit room. He is clean shaven and wearing a crisp shirt and trousers, propped up on pillows on the settee. MISS MARTHA Since our music lessons were suspended today in order to permit the Corporal to rest, why don’t we have a little music now -- if Corporal McBurney will not be too disturbed by a little  divertisement ? MCBURNEY Not at all, ma’am, I’m very fond of music. MISS MARTHA Miss Jane? JANE Yes, ma’am. Jane begins playing the harpsichord. MCBURNEY Why, you play beautifully Miss Jane. She smiles, uncomfortable so close to this enemy. MISS MARTHA Doesn’t she. ALICIA I can also play for you, Corporal. MCBURNEY I’m sure you can. Edwina gives Alicia a sharp look --   do you always have to be such a slut?  Alicia shrugs at Edwina. Jane starts to sing and before long they’re all singing along with McBurney joining in. (CONTINUED) 40.",
      "characters": [],
      "action_text": "Amy gives McBurney a smile. The room is full of smiles and merriment -- Edwina and McBurney share a warm glance. Alicia sneaks a sultry look -- until A LOUD KNOCK at the front door interrupts them. Jane stops her song. JANE Yankees?! MISS MARTHA Possibly not.   It could be some of our own. LOUD KNOCKS hit the door below again. MISS MARTHA (CONT’D) Edwina, wait here with the girls and I’ll go to the door. She looks at Edwina. MISS MARTHA (CONT’D) If it is Yankees or unruly soldiers of our own army, I will rap three times on this door. Then you will take the girls out to the woods behind the garden and stay there until I come for you. She starts to leave. AMY What about Corporal McBurney? McBurney looks as scared as the girls. MISS MARTHA He may remain where he is since he’s in no condition to leave. I’m going to get the gun.   Be quiet in here, all of you. Miss Martha starts to go. (CONTINUED) 41. AMY Can we cover him with something? MISS MARTHA Yes. Shh. She leaves. In silence, the girls lean against the door, trying to hear something. We hear MUFFLED VOICES.   The girls hold their breath. CUT TO: INT. MISS MARTHA’S ROOM - NIGHT CLOSE on Miss Martha’s hands taking the gun from her drawer. We hear banging on the door below O.S. CUT TO: INT. HALLWAY - NIGHT Miss Martha hurries down the stairs. CUT TO: INT. FOYER - NIGHT  LOOKING DOWN THE HALL Miss Martha talks at the open door. The music room door opens just a crack.  The GIRLS’ POV watching Miss Martha, trying to see who she is  talking to. Miss Martha steps aside and opens the door wider as two men enter the house. They quickly close the door and listen to the loud, heavy footsteps as the men walk down the hall. The steps grow closer and closer and then stop outside the music room. (CONTINUED) 42. The girls all stand completely silent and still holding their  breath... The steps continue down the hall toward the kitchen. CUT TO: INT. MUSIC ROOM - NIGHT The door slowly opens and Miss Martha comes in pale, but triumph",
      "dialogue_count": 0,
      "word_count": 1779
    },
    {
      "scene_number": 7,
      "slugline": "EXT. GARDEN - DAY McBurney works in the garden in the hot sun, he looks over at Edwina passing.   He stares at her. CLOSE on Edwina over by the mossy oaks with a basket of  linens-- she feels his stare, and tilts her head, pretending  to not notice him.  CUT TO:  EXT. GARDEN McBurney prunes a hedge. CLOSE on McBurney working up a sweat as he sharpens old garden tools on a block of granite. CLOSE SHOT He works a blade across the stone, as it sharpens.  EXT. GARDEN - DAY  Edwina and Emily pick some vegetables in the kitchen garden.  McBurney stops to watch her. CLOSE on Edwina’s flushed face as she works in the garden, she steals a glance at him.  CUT TO: EXT. GARDEN NEAR WATER BASIN- DAY McBurney continues his work pruning the rose bushes and cutting away dead vines.   He wipes the sweat from his forehead. Amy brings him a glass of water. He thanks her with a wink and a smile. (CONTINUED) 51.",
      "characters": [],
      "action_text": "AMY Miss Martha told me to return to my lessons but I   told her all the things you need me to do. MCBURNEY Yes, I’m counting on you to keep my clumsy feet away from bird’s nests and my spade from decapitating friendly worms. That plus keep me company. Amy smiles. MCBURNEY (CONT’D) Don’t tell anyone else, but I consider you my best friend in this place. AMY You do? MCBURNEY Of course I do, now hand me those shears, will you, my girl. Amy beams. They continue their work. (CONTINUED) 52. McBurney looks up to see Edwina watching him through a lace curtain. McBurney splashes water on his face from a bucket to cool off.   Water drips over him. His eyes meet Edwina’s and she turns away. Alicia and Emily wave to McBurney from nearby. He gives them a nod. CUT TO: EXT. PORCH - DAY As Amy passes to go inside, Emily and Alicia tug her braids. ALICIA You better not be saying unkind things about us to the Corporal. Amy politely smiles. AMY Now, why would I ever do that? She continues on. CUT TO: EXT. GARDEN BY OAK TREES - DAY McBurney rests on a bench by a great oak. Miss Martha comes over to him. (CONTINUED) 53. MISS MARTHA Corporal, I wonder how your leg is? MCBURNEY It twinges a bit now and then. MISS MARTHA I would expect that.   You may recall I was opposed to you walking on it so soon, however I can appreciate your need to be active.   May I check? MCBURNEY Yes, ma’am. He sits on a bench, as Miss Martha checks the wound under his bandages. MISS MARTHA The stitches seem to be holding and the wound is healing nicely. MCBURNEY When do you think I’ll be recovered? MISS MARTHA Some may say you’re recovered now. I’m sure the army surgeons would say you’re ready to return to duty. MCBURNEY So, you’d like me to leave? MISS MARTHA I didn’t say that. MCBURNEY Surely not, you’re too polite a lady to be so blunt about it. (CONTINUED) 54. MISS MARTHA I am as blunt as I need to be, Corporal McBurney.   Since you brought it up, I will tell you that I think your leg is healed enough to le",
      "dialogue_count": 0,
      "word_count": 673
    },
    {
      "scene_number": 8,
      "slugline": "INT. PARLOR - DAY Amy lies on a sofa crying. Alicia, and Emily crowd around her. MARIE When? AMY I don’t know exactly, but she asked him to leave. ALICIA We will have to make things so pleasant for him that he won’t even consider leaving us, until we decide of course, that it’s time for him to go. EMILY We might suggest to Miss Martha that it would be nice if Corporal McBurney could join us at the table for dinner. AMY Yes, he must get lonely eating alone in his room. ALICIA We should show him some real Southern hospitality. CUT TO: EXT. GARDEN - LATE AFTERNOON Jane cuts some wild flowers in a field, making a small bouquet.  CUT TO:  56-57.",
      "characters": [],
      "action_text": "INT. MUSIC ROOM -LATE AFTERNNON Edwina joins McBurney by the window, alone in his room. MCBURNEY I’ve missed being near you. EDWINA Have you? She looks down shyly. MCBURNEY You have no idea how lovely you are. Edwina’s stiff manner crumbles. MCBURNEY (CONT’D) Miss Farnsworth suggested it’s time for me to be on my way. EDWINA I don’t want you to leave. MCBURNEY I don’t want to leave you, Edwina. I love you. EDWINA Please... don’t ever say that to me unless you mean it. MCBURNEY I do. I knew exactly how I felt about you from that first day I talked to you, but was afraid to say anything for fear you’d never let me near you again. I’m only telling you now because this may be my only chance.   I realize I’m not good enough for you, Edwina. EDWINA That’s not true. MCBURNEY I’m tired of this war, I want to see the West... (CONTINUED) 58. EDWINA If you can get to Richmond, my father can help you. MCBURNEY Come with me. He kisses her- it knocks the wind out of her. A KNOCK at the door interrupts them. Edwina, light-headed, stands up, smooths her skirt. Alicia and Jane enter. ALICIA Miss Martha invites you to dine with us, Corporal. MCBURNEY Thank you, that would be my great pleasure. Jane and Alicia curtsey innocently. Edwina rushes out.  CUT TO:  58A.",
      "dialogue_count": 0,
      "word_count": 357
    },
    {
      "scene_number": 9,
      "slugline": "INT. HALLWAY - EVENING There is a flurry of activity of girls rushing to their rooms. Amy passes Edwina. AMY Have you heard -- the Corporal is joining us for dinner tonight!   Evidently Miss Martha was fearful she might have hurt his feelings by asking him to leave so she invited him to dine with us. Edwina watches her go, and rushes off herself. INT. GIRLS’ ROOM - EVENING Emily tightens the laces on Jane’s corset. Close up on ribbons in their hair. JANE Have you got it? EMILY Almost. The SOUND of a dinner BELL ringing. CUT TO: INT. HALLWAY - EVENING Alicia looks at herself in a mirror. She stares for a second and then reaches up and pinches her cheeks. CUT TO: INT. DINING ROOM - NIGHT In the glow of candlelight, McBurney is surrounded by the ladies and girls of the Farnsworth school.   They are all dressed up in their best. (CONTINUED) 59.",
      "characters": [],
      "action_text": "The evening is festive, with chatter and the passing of bowls and platters of sweet potato pie, black-eyed peas and biscuits. They are all enjoying having a man at the table, but Jane is still suspicious of the Northern enemy. A radiant Edwina wears a blue silk dress, that sits off her shoulders. MISS MARTHA That dress is very becoming on you, Miss Edwina. EDWINA Thank you. ALICIA There might be other attractive shoulders here if we were all permitted to wear such dresses. MISS MARTHA It is not entirely suitable dress for a young ladies school, but we know that Miss Edwina is accustomed to town society with different views.   I suggest we change the subject and that Miss Edwina might consider drawing her shawl to prevent any other speculation on the subject. Edwina demurely pulls her shawl over her shoulders as Alicia watches. McBurney gives Edwina a little smile from across the table. She smiles back at him. MCBURNEY This is the finest meal I can remember. MISS MARTHA Merci Beaucoup...Miss Alicia made the pie herself. ALICIA I made apple pie. MCBURNEY You don’t say? (CONTINUED) 60. Alicia smiles, pleased with herself. AMY I picked the apples. MCBURNEY Delicious. EDWINA Is that my recipe, Miss Alicia? Jane looks at Alicia. Alicia is coy to Edwina. ALICIA Why, yes it is. Edwina takes a bite, with a glance to Alicia. MISS MARTHA (to McBurney) We’re fortunate to have had enough water for our garden. MCBURNEY Yes, ma’am. CUT TO: INT. MUSIC ROOM - NIGHT The girls are chatting and Jane finishes playing “Concerto in B Minor” by Oskar Reiding on her violin for McBurney who sits nearby, listening appreciatively. MCBURNEY That’s a beautiful song. Jane smiles, flattered. Alicia leans in to McBurney with baby-doll eyes. ALICIA Isn’t it?   I’ve always thought it was rather romantic... He look at her like a wolf. Jane sits down at the harpsichord and begins to play Stephen Foster’s “Virginia Belle”. (CONTINUED) 61. Edwina enters the room to see Alicia leaning by McBurney, flirtat",
      "dialogue_count": 0,
      "word_count": 1755
    },
    {
      "scene_number": 10,
      "slugline": "INT. DINING ROOM - NIGHT The women gather around, blocking McBurney, who lies on the dining table. A lamp lights the table from the mantle. We SEE their backs as they look at McBurney. Jane turns to us in horror for what she sees.   Amy covers her mouth, as Emily ushers them away. MISS MARTHA We may have to remove it. Close on McBurney’s unconscious face. EDWINA What?!   No! (CONTINUED) 68.",
      "characters": [],
      "action_text": "Alicia calls down as she descends the stairs. ALICIA (O.S.) Is there anything I can do? She enters the dining room.   They ignore her.   Miss Martha focuses on the patient. ALICIA (CONT’D) I was so shocked and shaken, I could hardly bring myself to leave my room. MISS MARTHA Is that so, Miss? ALICIA Yes, I was asleep, when he came upstairs. Amy brings water. MISS MARTHA Were you indeed? ALICIA It was terrible the way he rushed in, I was frightened half to death. MARIE What did he want? ALICIA How should I know? MISS MARTHA Be quiet, all of you. ALICIA Nothing happened, I swear! Alicia starts sobbing. MISS MARTHA (firmly) Go to your room. Alicia sulks off. (CONTINUED) 69. Miss Martha goes back to the table.   The girls gather around, blocking the gruesomeness of his injury. Amy squeezes Emily’s hand. Edwina puts a cold compress on McBurney’s forehead.   He seems to wake up for a moment in a daze. EDWINA What are you going to do? MCBURNEY (mutters) I’ll still be leaving. MISS MARTHA His leg is broken badly this time.   I can’t repair it, I’m not a surgeon. JANE Oh dear lord! MISS MARTHA Quiet! MARIE What will you do?! EMILY Don’t distract her! The girls squabble. MISS MARTHA Go to your rooms! Miss Martha steps aside, as the girls scurry off in tears. McBurney lies unconscious on the table. Miss Martha turns to Edwina at the mantle. MISS MARTHA (CONT'D) We have to amputate. (CONTINUED) 70. Miss Martha is stone-faced. EDWINA What?!   NO! Miss Martha snaps at her. MISS MARTHA Do you want him to die?   A very good doctor might be able to do something... but by the morning that leg with start to mortify... Edwina sobs. MISS MARTHA (CONT’D) It’s the only chance he has. CLOSE on Miss Martha’s intense face in the lamp light. MISS MARTHA (CONT’D) We need more rags and the saw from the smokehouse.   Edwina, find the anatomy book. Edwina wails. CUT TO BLACK. FADE IN: EXT. WOODS - DAWN In the low morning fog, WIDE on the women and girls of the Farnsworth school gathered around a ",
      "dialogue_count": 0,
      "word_count": 552
    },
    {
      "scene_number": 11,
      "slugline": "INT.   MUSIC ROOM - DAY EXTREME CLOSE UP: McBurney opens his eyes in confused horror. CUT TO: INT. HALLWAY - DAY Edwina, in a pale cotton dress, sits by the door to McBurney’s room, waiting in the quiet house.   Her head low and tired, she’s been waiting a long time. SUDDENLY the silence is interrupted by his horrified screams. MCBURNEY(O.S.) What have you done to me?!! Edwina rushes to him. INT. MUSIC ROOM - DAY McBurney tries to sit up in bed. His pale face, covered in stubble, is dark, like a broken monster. Edwina pleads with him in tears. EDWINA I’ve been waiting for days to talk to you... He gives her a hateful look -- like how can you even speak to me? EDWINA (CONT’D) You don’t know how sorry I am! MCBURNEY (nastily) About what, my leg?! You could have stopped her! Edwina cries. MCBURNEY (CONT’D) (disgusted) But, you helped. Miss Martha rushes in, Amy follows behind timidly. (CONTINUED) 72.",
      "characters": [],
      "action_text": "MISS MARTHA What is going on here? MCBURNEY There you are -- the butcher! Miss Martha is stoic. MISS MARTHA We saved your life. Amy watches from the side, holding her turtle, afraid. McBurney looks at Miss Martha with hatred. MISS MARTHA (CONT’D) We had to do it. He blasts at her. MCBURNEY I’ll bet you did! Did you have to do it or did you just want to punish me for not going to your room. EDWINA It was an accident, she saved your life. MCBURNEY You’re worse than she is.   Did you lure me up there and plan this together?! Miss Martha stands tall. MCBURNEY (CONT’D) Did you enjoy it?!   Now you can keep me at your beck and call. EDWINA John-- MCBURNEY Just bring me another bottle. MISS MARTHA You’ve had enough. Edwina tries to get close to him, but he pushes her away. (CONTINUED) 73. MCBURNEY Get away from me. Amy stares as they leave his room. MCBURNEY (CONT’D) You didn’t tell me it was a house of mad women. Vengeful bitches... Miss Martha closes the door behind them. McBurney lets out a horrific wail O.S. CLOSE SHOT The key turning in the lock. CUT TO: EXT. BALCONY - DAY WIDE SHOT Marie is on lookout. Her small figure walks it’s length, looking out past the mossy trees. INT. HALLWAY - DAY Edwina passes by the closed door of McBurney’s room.   She stops and listens to McBurney’s muffled sobbing. Her heart breaks for him. CLOSE on Edwina-   What have we become?  INT. PARLOR - DAY The women are gathered around Miss Martha. We hear POUNDING from across the hall of McBurney’s rage, smashing furniture. Miss Martha stays composed. (CONTINUED) 74. AMY What are we going to do, Miss Martha?! EMILY Miss Marie said she saw Union troops approaching. MISS MARTHA If we let him go, he’ll join up with them.   He would tell them about our garden and our cow. JANE He would lead them back here... They all look to Miss Martha. CLOSE on Miss Martha thinking. MISS MARTHA Exactly... CUT TO: INT. MUSIC ROOM - DAY It’s afternoon.   With the shutters closed, light seeps into the dark room. Al",
      "dialogue_count": 0,
      "word_count": 1715
    },
    {
      "scene_number": 12,
      "slugline": "EXT. MANSION - DAY Miss Martha walks carefully outside, looking around. She sees no one. The girls run into the house. We hear the dry grass under Miss Martha’s shoes. The door of the shed shuts. Miss Martha walks towards it. CUT TO: INT. SHED - DAY Miss Martha opens the door slowly, letting in a stream of light in the dark shed. We stay CLOSE with Miss Martha as she carefully looks around, her back against the wall. Suddenly McBurney appears in her face from around a corner, holding a terrified Amy.   Miss Martha gasps. CUT TO: INT. PARLOR - DAY The girls move together to the parlor window to get a better look. CUT TO: INT. SHED - DAY CLOSE on McBurney and Miss Martha face to face in the dim shed.   McBurney holds the gun up close to her face. MISS MARTHA Please, Corporal McBurney. She looks him in the eye. (CONTINUED) 83.",
      "characters": [],
      "action_text": "MISS MARTHA (CONT’D) Won’t you come inside with me? We have one more bottle of bourbon in the cellar. He looks at her, and slides the gun down her cheek slowly, lowering it. He lets Amy go. CUT TO: EXT. MANSION - AFTERNOON WIDE on the mansion as McBurney makes his way back inside, pointing the gun at Miss Martha and Amy, shooing them inside. MCBURNEY Get back inside. CUT TO: INT. PARLOR - DAY The girls scramble from the window and sit, terrified. Miss Martha enters with Amy, followed by McBurney. Miss Martha stands erect, between McBurney and the girls, trying to guard them in some way. McBurney looks at her from the doorway, fed up. MCBURNEY The next one of you to try something is going to be sorry. Miss Martha keeps her voice down and controlled. MISS MARTHA Miss Marie, please go to the cellar and fetch that last bottle of bourbon. She slips her a key, and Marie moves past, avoiding McBurney in the doorway. (CONTINUED) 84. MCBURNEY Amy, I thought we were friends... I never meant any harm to any of you. Look at me, look what you’ve done to me. I’d rather be dead than a man without a leg, hobbling around. I see how you look at me... your disgust and pity. He starts to cry. MCBURNEY (CONT’D) I’m not a man, I took your kindness and trusted you and you toyed with me and then butchered me. The girls stare. He looks up at them with a fierce look in his eye. MCBURNEY (CONT’D) I’ve had enough with your devilment. I’ve got four shots left, and the next one of you to try something is going to get it from me. The girls sit in terror. He raises his voice. MCBURNEY (CONT’D) Do you hear me?! McBurney pulls the trigger and shoots the chandelier. It comes crashing down. The girls scream, Jane cries. MCBURNEY (CONT’D) The next shot is for one of you. He staggers out. The girls stare, frozen in place.   They sit in silence. We hear Jane’s whimpers. Edwina stands up, and starts to go. Miss Martha grabs her arms to stop her. CONTINUED: (CONTINUED) 85. MISS MARTHA Leave him. Edwina pus",
      "dialogue_count": 0,
      "word_count": 1156
    },
    {
      "scene_number": 13,
      "slugline": "INT. MISS MARTHA’S ROOM - EVENING Alone in her room, Miss Martha kneels and prays. CUT TO: INT. ALICIA’S ROOM - NIGHT CLOSE on Alicia in a mirror as she buttons up a special dress. CUT TO: INT. GIRLS’ ROOM -NIGHT CLOSE on Amy and Jane braiding their hair, in quiet concentration. The room is quiet. The sound of cicadas start outside the window. CUT TO: INT. HALLWAY - NIGHT In the dim candlelight, Miss Martha walks down the hall with a quiet, determined reserve. CUT TO: INT. DINING ROOM - NIGHT A beautiful table is set with candles, wildflowers and platters of food. Miss Martha and the rest of the household sit around the table, dressed up in their finery.   Miss Martha wears taffeta and earrings, the girls in their holiday dresses. Miss Martha and the girls look up as McBurney comes in followed by Edwina.   He is wearing his washed and mended uniform. McBurney smiles at the warm hospitality.   Edwina, at his side, has her hair down and wears a pretty dress.   With her flushed cheeks, for the first time she looks unwound. (CONTINUED) 90.",
      "characters": [],
      "action_text": "She smiles at McBurney as they look at each other like --  Isn’t this nice?  They sit down and join the party. The girls pass the platters around. Edwina is oblivious to their plan. (CONTINUED) 90A. MISS MARTHA Corporal, we’d like to let you know that we harbor no ill feelings, and made this meal in commemoration of your journey ahead. MCBURNEY Thank you for excusing my outburst. MISS MARTHA Think nothing of it. MCBURNEY And thank you for this-- This looks like just about the finest meal I’ve ever seen. Edwina is pleased that harmony is restored. Jane looks across at Emily. Platters are passed around with the ham, corn bread, greens. MISS MARTHA Bon Appetit. Oh, wait-- wait. We haven’t said grace. They put the platters down. Everyone lowers their heads. MISS MARTHA (CONT’D) The Lord is gracious and full of compassion; slow to anger, and of great mercy. Bless us and these thy gifts which we receive from thy bountiful goodness, through Jesus Christ, our Lord, Amen. Miss Martha looks up. GIRLS Amen. The girls pass the platters. (CONTINUED) 91. MISS MARTHA Where are the mushrooms? JANE Here they are. (CONTINUED) 91A. She passes them. Wine is poured for McBurney. MISS MARTHA Miss Amelia picked these mushrooms today.   Who would like some?   Corporal? MCBURNEY Yes, ma’am, I’m fond of them. Edwina looks at him with love. Close on the bowl of mushrooms being passed over to him silently, from girl to girl, no one taking any. The bowl is handed to McBurney. All eyes are on him. MCBURNEY (CONT’D) What about you, Miss Morrow? Jane and Emily look to Edwina who is oblivious and lost in romantic thoughts. She speaks with a gentle smile. EDWINA Thank you. He starts to serve her some. The girls look at each other. AMY But, Miss Edwina, you don’t like mushrooms. Jane and Emily stare. EDWINA It’s true, I don’t really. MCBURNEY All right, then. He helps himself. (CONTINUED) 92. MCBURNEY (CONT’D) They look mighty tasty... and I am hungry! He gives a look to Edwina. She giggles. Amy star",
      "dialogue_count": 0,
      "word_count": 842
    },
    {
      "scene_number": 14,
      "slugline": "EXT. MANSION GATE - DAY WIDE SHOT - THE MANSION The girls carry the body bag down the walkway towards the gate, and drop it there. EXT. MANSION - DAY VIEW THROUGH THE BARS OF THE GATE: The women and girls of the Farnsworth school, in their faded dresses, sit on the grand porch, waiting. CUT TO BLACK. 95.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 60
    }
  ]
}