{
  "slug": "the-good-dinosaur-2015",
  "title": "the good dinosaur",
  "genre": "drama",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 15298,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. SPACE An asteroid belt. CARD: 65 MILLION YEARS AGO An asteroid bumps another asteroid off course. Its new trajectory: Earth. EXT. FIELD - NIGHT A GROUP OF DINOSAURS peacefully eat in a field. INTERCUT ASTEROID/DINOSAURS The asteroid continues descending... The dinosaurs continue chewing, unaware... The asteroid is burning up in Earth’s atmosphere... The dinosaurs are still eating... ZIP! The asteroid misses Earth! A meteor streaks across the night sky. The dinosaurs go back to their business, saved from extinction... FADE TO BLACK. CARD: MILLIONS OF YEARS LATER FADE IN: EXT. WESTERN FRONTIER - DAY Iconic widescreen “frontier” shots: big skies, majestic clouds, jagged peaks. CARD: DISNEY PRESENTS CARD: A PIXAR ANIMATION STUDIOS FILM EXT. FARM - DAY A flowing RIVER, next to it a frontier farm. A pit-house and long neatly plowed fields beneath a MOUNTAIN RANGE WITH THREE DISTINCT PEAKS.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   1.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL",
      "characters": [],
      "action_text": "CARD: THE GOOD DINOSAUR A breeze ripples crops. Hay bales next to a fence surrounding the farmland. The ground shakes. Four gigantic dinosaur feet walk by. The camera reveals a massive shadow, and then... an Apatosaurus, walking across his farm. This is HENRY. BOOM! Henry uses his tail to knock down a tree. He adds it to a large pile. He digs his snout into the ground, plows long furrows into the tough dirt. Alongside Henry is his hardworking Apatosaurus wife, IDA, carrying a yoke of seeds. She scatters them into the fresh furrows. DISSOLVE TO: Small sprouts grow in rows across the field. Henry dips his head into the river, gets a mouthful of water. He turns back toward the crops, sprays the water through his teeth across the rows. IDA (O.S.) Henry! Henry turns toward the cabin. IDA It’s time! Henry’s face lights up. INT. CABIN - DAY (MOMENTS LATER) Henry and Ida stand over a nest with THREE EGGS; two are small, but the third one is huge! HENRY Which one did you say moved? IDA The one on the left. A smaller egg starts to rock back and forth. The egg cracks open and a big, healthy Apatosaurus, LIBBY, pokes her head out of the top. A piece of shell rests on her forehead. IDA/HENRY Aw.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   2.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL IDA You’re a poppa. HENRY You’re a momma. The top of the shell falls to the ground. Libby reaches for it, and her egg tips over, falling on top of her. Poppa reaches down, lifts up the egg shell. But Libby’s gone! NEWBORN LIBBY (O.S.) (squeaky roar) She’s on Momma’s back. She slides down Momma’s neck. Momma quickly grabs her by the tail before she lands on the ground. MOMMA You little sneak. Hello Libby. POPPA Libby. The next small egg moves in the nest. Momma and Poppa wait excitedly. BAM. A leg punches out of the top, stretches around. BAM. BAM. BAM. Three more punch out. The egg darts toward Poppa, crashing into a log post. It crumbles away and another big, healthy Apatosaurus, ",
      "dialogue_count": 0,
      "word_count": 3556
    },
    {
      "scene_number": 2,
      "slugline": "EXT. FARM FENCE - CONTINUOUS They get to the fence, Arlo hesitates looking out at the scary wilderness. It’s starting to rain. ARLO Out there? Poppa turns. POPPA Get over. Poppa uses his tail to help Arlo over the fence. The rain picks up in earnest. Poppa and Arlo move out into the wilderness, toward the mountain pass. EXT. MOUNTAIN PASS - CONTINUOUS Arlo looks back at the farm as it vanishes in the distance. The wind is getting strong. Arlo looks up. Storm clouds swirl above. He stays very close to Poppa, trying to be tough. ARLO But Poppa, what if we get lost? Poppa stays intent on his tracking, still frustrated with Arlo. POPPA As long as you can find the river, you can find your way home. Poppa pushes Arlo further along. POPPA What do you see? Arlo is confused, afraid... ARLO Uh, uh t-t-tracks? POPPA And they’re washin’ out, we gotta move. Poppa is rushing, Arlo tries to keep up.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   19.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL",
      "characters": [],
      "action_text": "POPPA We’re losin’ it! Poppa pushes harder, running to keep the tracks in sight. Arlo tries to keep up, but is falling behind. POPPA Arlo, keep movin’! BOOM. CRASH. A storm cell circles above them. CRASH. Lightning flashes. Arlo flinches and trips over a boulder. He tumbles to the ground, hurting his leg. ARLO Poppa, wait! Poppa keeps pushing forward. POPPA Arlo what did I say about keep -- Poppa turns back, sees Arlo struggling, limping. Poppa realizes he’s gone too far. He stops. Goes to Arlo. POPPA It’s -- it’s okay. It’s okay Arlo. I’m s -- I’m sorry. I just wanted you to... get through your fear. I know you have it in you. ARLO But I’m not like you. POPPA You’re me and more. Arlo looks up to Poppa. CRACK. BOOM. THUNDER rolls over their heads, so close. Arlo flinches. Poppa looks up at the storm, turns to Arlo. POPPA I think we went far enough today. He lifts Arlo out of the mud. POPPA Storm’s gettin’ worse, let’s get you home.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   20.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL They start to head back, Arlo still limping. The GROUND STARTS TO SHAKE. Poppa looks up, alarmed. The RIVER IS RISING. Now Poppa is all urgency. POPPA Arlo, MOVE. He pushes Arlo up the hill, away from the river. Arlo’s feet slip on the wet rocks as Poppa pushes him. CRASH. Poppa looks upriver. Something huge is barreling toward them, trees are falling! POPPA Run Arlo! There is a ROAR. Arlo looks ahead through the trees and sees, like a horrible monster, FLOOD WATER BANKING DOWN THE NARROW CANYON, ROARING TOWARD THEM. Arlo freezes, too terrified to move. Poppa grabs Arlo, throws him up the bank. Arlo lands hard, looks back to his father. ARLO Poppa! Poppa struggles to climb up the ledge. The flood water tumbling toward him. ARLO Poppa! Poppa! POPPA! Poppa looks to Arlo just as the WALL OF WATER HITS. CUT TO BLACK. FADE IN: EXT. FIELD - DAY ON POPPA GRAVE MARKER: Fresh flowers. Pan over to the farm. Crops once lush are going fallow. ",
      "dialogue_count": 0,
      "word_count": 2588
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CLIFF - CONTINUOUS There’s a cliff wall ahead. The boy jumps onto a nearby leaning tree, running across it like a squirrel. He jumps down to a ledge, scampers up the cliff. Arlo follows. ARLO Where are you going? The ground beneath Arlo narrows, each step becoming more precarious as they make their way up the cliff. Arlo presses his body tightly against the wall. Rocks crumble beneath him, tumbling to the ground far below. The boy stops. The ledge ends, with a huge gap to the other side. The boy thinks a moment. ARLO I-I knew it! I’m gonna die out here because of you! The boy turns to Arlo, starts pushing Arlo’s feet out from underneath him. Arlo stumbles, trying to keep his balance. ARLO Hey -- hey -- hey -- hey -- hey, what are you doing? N-N-No, s-stop! The boy gets behind Arlo and starts pushing him toward the gap! ARLO Hey... hey! NO! STOP! The boy bites Arlo’s leg! Arlo yelps, losing his balance and crashing forward... He barely catches himself with his teeth, clinging to the opposing cliff edge. He’s stretched out across the gap, the tip of his tail holding the other side. The boy scampers across him -- he’s made Arlo into a bridge! The boy climbs over Arlo’s face, stepping on his eyes. ARLO Ow! OW!! Why you little... come back here! The boy sniffs ahead. His body shivers, his foot taps. He’s found something! The boy looks back at Arlo, happily panting. Now Arlo sees them too... ARLO Berries!  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   30.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL",
      "characters": [],
      "action_text": "Arlo is suddenly full of energy. He drops his tail and propels himself up the opposing ledge. He runs toward the berry bush. The boy starts to growl. Arlo walks past him, but the boy jumps between Arlo and the berries, growling fiercely. ARLO What’s with you? Th-they’re right here. The boy just gets louder and louder. Arlo pushes him away with his foot. ARLO Crazy critter. Arlo breaks off a branch with berries... and a SERPENT-LIKE CREATURE falls onto his face! Arlo yelps in surprise and falls off the ledge! EXT. ASPEN TREE GROVE - CONTINUOUS Arlo’s fall is broken by a patch of aspen trees below. As he stands up, the snake rises up in front of him. Suddenly the boy jumps between Arlo and the snake. The snake lunges at the boy, but the boy attacks it! The two have a vicious fight, but the boy is tough, breaks free from the snake’s coil and head-butts the beast... it squirms away into the nearby brush. Arlo runs next to the boy for safety. The boy shifts from attack mode to happy canine, looking up at Arlo. Arlo smiles back but then... VOICE (O.S.) Hello. Arlo turns, startled. He looks around. ARLO Hello? VOICE (O.S.) We’ve been watching you. Arlo walks toward the voice, sees a COLLECTION OF CREATURES gathered on a tree. Was it the FURRY CRITTER talking? VOICE (O.S.) We thought you were going to die.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   31.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL Was it the RED BIRD talking? VOICE (O.S.) But then you didn’t. Arlo focuses on the woods. Two eyes appear, staring at Arlo. FORREST WOODBUSH THE PET COLLECTOR -- a Styracosaurus -- steps out of the woods. He’s camouflaged so he blends into the aspen trees, his horns covered in various tiny FOREST ANIMALS. Arlo backs up, intimidated. The red bird on the Pet Collector tweets. He nods, then asks... PET COLLECTOR That creature protected you. Why? He gestures to the boy, who is sniffing around the ground. ARLO I-I don’t know -- I’m going home. Do you know how far Clawto",
      "dialogue_count": 0,
      "word_count": 1483
    },
    {
      "scene_number": 4,
      "slugline": "EXT. FRUIT TREE - DAY Fruit lies on the ground. Arlo eats as much as he can, offers some to Spot. Spot looks up to the fruit in the tree, then at the fruit on the ground. BUGS swarm around the half rotted berries. Spot starts laughing, his eyes becoming slits. Arlo laughs too. Spot’s face starts to grow... what’s happening? Arlo now has FIVE EYES. Their vision warps! What is in this fruit? They can’t stop laughing! They leap into the air in a shared, happy hallucination. FADE TO WHITE. EXT. WOODLAND - DAY Arlo and Spot recover from their fruit hangover. Spot’s head hurts. Arlo’s gotten his head wedged in a tree trunk. EXT. MEADOW/OVERHANG - NIGHT PREHISTORIC CRITTERS get comfortable together, nestling down in their nests for the night. Arlo and Spot walk along the river through a meadow. A light flickers in front of Arlo, it’s a FIREFLY! ARLO Spot, watch this! Arlo brushes his tail through the tall grass. HUNDREDS OF FIREFLIES fly up into the night sky. Spot’s eyes go wide. He chases after the fireflies, jumping in the air trying to catch them in flight. Arlo joins him running through the meadow. They come to a rock overhang at the river’s edge. Spot catches a firefly with his hands, studies it. Arlo gently blows on it, the firefly glows bright. Spot lets it go and they watch it fly up into the night sky. Arlo smiles. But then... his smile fades. ARLO I miss -- I miss my family.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   37.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL",
      "characters": [],
      "action_text": "Spot looks at him, doesn't understand. ARLO Family. Spot doesn’t get it. Arlo uses sticks as effigies, placing one in the ground at his feet. ARLO That’s me. Arlo puts three more effigies down. ARLO There’s Libby, and Buck, and Momma ... Arlo stops. Considers, emotional. Then places the last effigy. ARLO And -- and Poppa. He draws a circle around them in the sand. ARLO Family. Spot approaches, sniffing, studying the group, curious but confused. ARLO You don’t understand... Arlo looks down. ARLO That’s okay. Arlo rests his head on the sand. Spot rushes off, rustling in a nearby bush. He comes back... breaks twigs. He sets down three crude, human effigies, two large and, between them, a smaller one. Spot draws a circle around them. ARLO Yes. That’s your family. Spot looks at the effigies of his family, then lays down the two larger effigies -- his parents. Covers them with sand.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   38.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL He looks at Arlo. Beat. Arlo realizes they have died. He looks at his Poppa’s effigy, considering. Then Arlo lays it down, covers it in sand. He rests his head against the small mound. ARLO I miss him. He feels something -- looks over. Spot is there, nestled against Arlo, patting his leg in comfort. Spot returns to his own effigies, puts his hand on his parents’ mounds and howls. Arlo watches Spot mourn the loss of his parents. Arlo looks down at Poppa’s mound, rests his paw on it, joins Spot’s howls. They howl into the night. DISSOLVE TO: EXT. OVERHANG - DAY ON ARLO: Sleeping under the overhang. Arlo wakes up and finds Spot curled in the nook of his arm, snoring. Spot starts running in his sleep, pouncing onto Arlo’s nose, waking himself up. Arlo smiles. Spot stretches, letting out a big yawn. He walks off, scratching the ground, sniffing. Arlo stands up, greets the beautiful morning. He hears something, looks over at the boy. Spot is behind a rock, his back toward us -- a DRIZZLING NO",
      "dialogue_count": 0,
      "word_count": 2592
    },
    {
      "scene_number": 5,
      "slugline": "EXT. CANYON - DAY (LATER) The search party makes their way through the open range, the giant T. rexes following tiny Spot. Suddenly Spot shivers, his leg taps the ground. Arlo knows what that means... ARLO He’s got something! Spot lunges to the ground, grabbing a BUG. Eats it. RAMSEY Ah, dang. Butch towers over Arlo. BUTCH Hey kid. If you're pullin’ my leg, I'm gonna eat yours. Suddenly Spot races around excitedly, barking. The group moves to where Spot is -- and see DOZENS OF LONGHORN TRACKS going through the reeds. RAMSEY He found the herd! NASH Whooooeee! We got ‘em! Arlo notices a BLUE FEATHER caught in some brush. ARLO Wait. Do longhorns have feathers? Butch leans over, sees the feather. BUTCH Rustlers. Arlo doesn’t like the sound of that... ARLO Rustlers? Butch spots a DEAD LONGHORN in the tumbleweed. BUTCH We gotta move. Hya! NASH/RAMSEY Hya!  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   50.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL",
      "characters": [],
      "action_text": "The T. rexes take off, their legs like galloping horses -- their top halves calm and concentrated on following the tracks of their herd. ON ARLO: Gulp. He scoops up Spot, chases after the T. rexes. EXT. BIG SKY COUNTRY - CONTINUOUS The tracks have disappeared over a rise. The T. rexes stop, get on their bellies. Arlo joins them belly crawling to the edge of the rise. There below them, out in Big Sky Country, is the HERD OF LONGHORNS. No sign of any other dinosaurs. ARLO I don’t see any rustlers. BUTCH They’re out there. The T. rexes move forward down the rise. Arlo follows. ARLO So... how far did you say that watering hole was? BUTCH I got a job for you. ARLO I’m not really good at jobs -- Butch gestures to the right flank of the herd. BUTCH I need you to keep on the dodge and sidle up the lob lolly past them hornheads, just hootin’ and hollerin’ to score off them rustlers. We’ll cut dirt and get the bulge on ‘em. ARLO What? RAMSEY He just wants you to get on that rock and scream.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   51.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL She gestures to a BOULDER, TILTING IN THE CENTER OF THE FIELD. Longhorns all around it. ARLO Uh... but, who’s out there? BUTCH They’ll come right at you. You hold your ground. Don’t move. ARLO Don’t move? What if they have claws and big teeth? BUTCH Don’t over think it. He pushes Arlo out into the field! Arlo, with Spot on his back, goes a few steps, but does not want to do this. He glances back at the T. rexes. Butch nods - - “Go!” Arlo steels himself (does a “get over my fear” face), and moves toward the herd. He creeps through the grass, looking back again. The T. rexes are now gone! Arlo continues. Arlo and Spot make it to the rock. Arlo does his “get over my fear” face again, and climbs on top. He opens his mouth to roar... NOTHING COMES OUT! Just a strangled whisper. Spot watches Arlo try again -- still nothing! Spot BITES Arlo, HE SCREAMS! Suddenly Arlo sees something in the ",
      "dialogue_count": 0,
      "word_count": 2178
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BIG SKY COUNTRY - DAY The T. rexes herd the longhorns onward. RAMSEY Let’s go! NASH Hya! Arlo and Spot pick up the rear. Butch spots the herd splitting off on one side. Calls over to Arlo. BUTCH Hey kid, head ‘em off before those longhorns split! Arlo looks back to Spot: “We can do this.” Arlo and Spot run alongside the longhorns breaking away. Up ahead is a ROCKY RIDGE that’ll cut the loose longhorns from the herd! Arlo roars at them, but the longhorns don’t shift course, keep heading away. Arlo turns into them, WHACK -- HE WHIPS HIS TAIL! It startles the loose longhorns. They curve back into the main herd just in time, missing the ridge! Arlo keeps roaring and whipping the herd onward. Arlo smiles back to Spot, they did it! They pass Butch, he’s impressed. BUTCH Hya! The group comes up over a slope. Through the distant ridge Arlo sees... ARLO There it is... Clawtooth Mountain, there’s home! RAMSEY/NASH Whooeee! NASH We gotta drive this herd down south.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   61.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL",
      "characters": [],
      "action_text": "RAMSEY You hurry on back to your Momma, and don’t stop for nothin’. ARLO Thanks. I sure appreciate you lookin’ out for me. Arlo and Spot take off for the mountain pass. BUTCH You’ll be alright. You’re one tough kid. Arlo smiles. This is a lot coming from Butch. The T. rexes drive the herd. Arlo and Spot continue toward the pass. EXT. RIVER’S EDGE/FIELD - DAY Arlo and Spot, back on the river, Clawtooth Mountain in the distance! They’re headed home... Spot jumps onto Arlo’s back, climbs up to the top of his head, enjoying the ride. They run into a MUSTERING OF WADING BIRDS. Without hesitation, Arlo runs straight toward the flock. He and Spot roar! Birds flying on either side of them, Spot howls. Arlo howls back. Spot loves it. EXT. RIDGE - CONTINUOUS Arlo leaps up the rocky terrain. He tosses Spot up into the clouds. Spot flies so high, he goes above the cloud cover and sees glimpses of the sun, then falls back to Arlo. Spot signals upward, asks Arlo to do it again. Arlo throws him up, catches him again. Spot signals for them to climb the peak, he wants to show Arlo. Arlo peeks his head through the clouds. They watch the sun beginning to set behind the peaks of Clawtooth Mountain. A wondrous sight to share. They look to each other, smile.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   62.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL ARLO Wow. EXT. ROLLING HILLS - DAY (LATER) Spot and Arlo running -- the wind kicks up. Far away, a RUMBLE OF THUNDER... They come up over a hill line and see the base of Clawtooth Mountain, home’s just on the other side! ARLO It’s so close... we’re almost there, Spot. Arlo howls in excitement! Spot gets caught up in the energy, howls too! ANOTHER HOWL RESPONDS. Arlo slows down, Spot goes on alert -- looking all around. Spot howls again. Now he and Arlo see... a FIGURE on a ridge ahead. The figure returns their calls. Spot jumps from Arlo’s back and cautiously makes his way forward. ON A RIDGE: The silhouette of a HUMAN. Arlo i",
      "dialogue_count": 0,
      "word_count": 1410
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MOUNTAIN PASS - CONTINUOUS The storm is raging, the sky dark. A storm cell circles around the mountain peaks. Arlo runs up the mountain, howling as loud as he can. Lightning strikes the ground around him. A bolt hits a tree ahead, Arlo dodges it just in time. Arlo climbs a massive boulder, looks around searching for Spot. He howls again. Waits... Spot returns his call! Arlo runs toward him. EXT. MOUNTAIN PASS/RIVER VALLEY - CONTINUOUS Arlo finds the Pterodactyls at the river, around a DEAD TREE TRUNK. Spot is inside the tree, clearly hurt, trying to protect himself but vulnerable. PTERODCATYLS I’m hungry! He’s mine! I want him! Back off! I got him first! Let me through! Quit hoggin’! No! Don’t be greedy! Let’s eat! Stop your fightin’! The Pterodactyls smash into the tree, over and over again, knocking Spot back and forth. He howls, calling for Arlo. Arlo charges them, running down the steep slope. He head- butts two Pterodactyls into the river! They are swept away by the current. The remaining three Pterodactyls -- Thunderclap, Downpour, and Coldfront -- turn toward Arlo. THUNDERCLAP Well, look who got relevated. Downpour flies at Arlo. Arlo charges right at her, full speed, but just as they are about to collide, Downpour flies to the side. Arlo skids in the mud. Spot cries out.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   68.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL",
      "characters": [],
      "action_text": "THUNDERCLAP (to Downpour and Coldfront) Go get him! Coldfront and Downpour fly at Arlo -- using their beaks and wings to beat at him. They lift him in the air, dragging him away from Spot! But Arlo is not giving up... ARLO Spot! Thunderclap dives for Spot in the trunk, determined. He WILL have this meal. ARLO Spot! Thunderclap snaps at Spot with his beak. The RIVER IS RISING around the tree, fast! Arlo fights against the grips of Downpour and Coldfront, reaches for Spot. Thunderclap claws at Spot, forcing him deeper into the tree, but water is gushing into the trunk! Arlo strains against the Pterodactyls’ grips, they’ve pulled him midair. Arlo turns and sees they’ve flown near a fir tree. He spins around in the Pterodactyls’ grips, uses his tail to whack into the trunk. CRACK! The tree snaps in half. Downpour and Coldfront lose their grip, dropping Arlo. They are smashed by the tree, falling into the river’s rushing waters! They are swept away. Spot cries out. Arlo looks to Spot. The tree trunk is nearly submerged -- Spot is defenseless, forced to the top of the tree by the water. THUNDERCLAP IS ABOUT TO REACH SPOT! THUNDERCLAP The storm provides. Arlo ROARS, his voice deep and demanding! Thunderclap is caught off guard by Arlo’s roar. Spot seizes the moment, bites him in the wing, ripping out a chunk! Thunderclap looks at his wing, sees the giant hole Spot ripped out -- he screams! Thunderclap flies off, furiously defeated. Arlo picks up a broken tree branch, chucks it at Thunderclap, knocking him into the water.  THE GOOD DINOSAUR - Academy Screenplay - 10/26/2015   69.  ©2015 DISNEY•PIXAR - PRIVILEGED AND CONFIDENTIAL The ground begins to shake, Arlo turns upriver: A MASSIVE LANDSLIDE CRUMBLES DOWN INTO THE RIVER VALLEY, WATER CRASHES DOWN THE PASS -- A FLASH FLOOD IS ROARING TOWARD THEM! The river’s raging water pushes a wall of debris, trees are knocked down in its path. Arlo looks to Spot holding on to the tree -- right in the center of the flood’s path! Spot ",
      "dialogue_count": 0,
      "word_count": 1491
    }
  ]
}