{
  "slug": "the-mick-101-pilot-2017",
  "title": "the mick 101 pilot",
  "genre": "drama",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 0,
  "characters": [],
  "total_words": 7095,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SUPERMARKET - DAY CLOSE ON the pale, hungover face of MACKENZIE “MICKEY” MURPHY, 40. She cooks a Menthol down to its filter and nearly hacks up a lung. GO WIDE TO REVEAL she is standing in a grocery store, wearing pajama pants and a Celtics jersey. She stamps the butt out on a canteloupe and goes about her “morning routine”: -Mickey tears open a Twinkie and wolfs it down. She stuffs the crumpled wrapper back on the shelf. -She gargles from a bottle of mouth wash, swallows, moves on. -She lathers her armpits and goes to work with a Bic razor. -She cakes on makeup and perfume in the cosmetics aisle. -Shakes baby powder down the front of her pants then claps a cloud of it into the air, a la LeBron James. -Takes a healthy pull of nitrous from a can of whipped cream then puts it back in the refrigerator. -Rips the cover off a magazine featuring a shirtless Channing Tatum and stuffs it in her back pocket. -Cracks a beer and chugs it down as she walks towards the exit. She chucks the empty and winks at the oblivious cashier as she breezes out the front door. EXT. SUPERMARKET - CONTINUOUS Mickey struts out of the market, looking fresh and ready to seize the day. She lets out a THUNDEROUS BELCH and we FREEZE:  TITLE: “The Mick”  EXT. HIGHWAY/INT. CAR - DAY Mickey sits shotgun, using the butt of one cigarette to light a fresh one. Behind the wheel is her sometimes-boyfriend JIMMY, 40s; a shitty guy driving an even shittier car. JIMMY Would you crack a window? You’re gonna smell like the Marlboro Man. MICKEY So what? JIMMY So I’ve never been to a mansion  before. I want them to like me.",
      "characters": [],
      "action_text": "MICKEY What do you care if my sister and her yuppie friends like you? They’re monsters. JIMMY Hey, come on. That’s your sister. MICKEY You despise your sister. JIMMY Yeah, because she’s a locksmith. I got no reason to be nice. MICKEY It’s not like I hate mine. We were   *  close growing up, but then she   *  married some rich dingus and turned   *  into one of the Real Housewives.   *  (takes a drag)   *  God I hate her.   *  JIMMY Then why are we going?   *  MICKEY Because she’s family and I haven’t seen her in like eight years. (then) And I need to bum a loan. JIMMY Maybe I should ask her to invest in my Sniffer app. MICKEY Don’t. It’s a terrible idea. JIMMY How is that terrible? It’s Shazaam for smells. How many times a day do you ask “what’s that smell?” MICKEY Only when I’m at your place. I’m   *  already doing a thing. Don’t muddy it. I’m gonna pop in there, get my   *  rent money, and get the hell out.   *  JIMMY I keep tellin’ ya to move in with me. MICKEY You live in a studio apartment with a roommate.  2 JIMMY Everyone loves Travis. MICKEY Not even Travis loves Travis. (then) Here’s our exit. They hit an off-ramp marked “Greenwich, CT”. EXT. GREENWICH SUBURBS/INT. CAR - LATER Jimmy pilots the car down one of the wealthiest streets in America and pulls to the curb outside an imposing mansion. JIMMY Holy moly, look at the ass on this place. Mickey takes one last drag then flicks her cigarette. She fishes a soda bottle off the floor, takes a big sip: JIMMY (CONT’D) Careful. That’s gasoline. MICKEY (spits it out) Why do you have gasoline?! JIMMY I’m not paying Greenwich prices. He opens the door to exit-- MICKEY Whoa, whoa, whoa. Where ya going? JIMMY To the barbecue. MICKEY Oooh. No you’re not. JIMMY What? Why not? MICKEY Because you’re an embarrassment. To me. To yourself. To everyone really. JIMMY Then why the hell’d I just drive from Rhode Island?! MICKEY So I can get drunk. Pop on the Sox game, I’ll be back in a jiff.  3 JIMMY Are you kidding me? I’m not ",
      "dialogue_count": 0,
      "word_count": 3762
    },
    {
      "scene_number": 2,
      "slugline": "INT. PEMBERTON ESTATE - ENTRY - SAME SABRINA Anyway, sorry to interrupt your sixteen hour catnap.   *  The kids turn to leave. MICKEY Hang on, I’ll drive you to school.   *  SABRINA   *  That’s okay, we have a town car.   *  MICKEY Don’t be silly. Today’s your big   *  assembly. Besides, I should get out   *  of the house. Yesterday kinda got away from me. CUT TO: EXT. SCHOOL - CARPOOL LINE - DAY A long line of cars honk their horns in frustration. At the front, Mickey aggressively grinds the gears of a classic Ferrari convertible. The kids hide their faces. MICKEY You can’t beat Italian engineering, am I right? Sabrina slips out and blends in with the crowd of students. Mickey calls after her: MICKEY (CONT’D) Head prefect, coming through! Make   *  way for that girl!   *  A BEEFY BOY ambles by the car with two goons at his side. BEEFY BOY Hey, Chippy. How your folks liking the clink? They join Aryan Nation? His goons CACKLE stupidly as they walk off. MICKEY Ugh, who is that creep? CHIP Geno Pinero. He’s been all over me. MICKEY So do something about it.  20",
      "characters": [],
      "action_text": "CHIP Like what? He’s a monster in case you didn’t notice. MICKEY He’s a weasel. Next time he gives you crap, just yank his shorts down   *  and point at his tiny pecker. CHIP Are you insane? He’ll pound me! MICKEY No he won’t. Humor trumps violence.   *  It’ll be freaking hilarious and   *  you’ll be an instant legend. Trust   *  me, that’s how high school works.   *  Chip walks away, contemplating. Mickey turns to Ben, who sits sullenly in the back: MICKEY (CONT’D) If you’re waiting on me to get the   *  door, you’re gonna be there a while.   *  BEN I miss mommy and daddy. Mickey softens, can’t help but feel bad for the little guy.   *  MICKEY Tell ya what, hop up front. You’re playing hooky today. BEN But what if I miss something important? MICKEY Nothing important happens in 1st grade. SMASH TO: INT. BEN’S FIRST GRADE CLASSROOM - DAY A TEACHER addresses the class: TEACHER Okay kids. Today we’re going to learn how to read... ANGLE ON an empty desk with a crude “biN peMbrTn” placard. CUT TO: EXT. PARK - DAY Mickey and Ben stroll through a lovely park.  21 MICKEY Beats the crap outta school, right? BEN My eyes are burning. MICKEY You’re fine. A little sunshine never killed anyone. She looks around and spots a HOT DOG CART. MICKEY (CONT’D) You hungry? How ‘bout a dog? BEN I can’t. Mom says I’m allergic. MICKEY She’s just projecting her eating disorder onto you. (then) So how should we play this? I’m thinking a classic hot-foot oughta do the trick. BEN What’s a hot foot? MICKEY Alright, pay attention because, unlike school, I’m about to teach you something useful. She hands him several sticks of gum. MICKEY (CONT’D) Chew these. Ben stuffs his mouth and gets to work. MICKEY (CONT’D) That’s it. Get ‘em nice and sticky. Mickey takes out a box of matches and lights a cigarette. MICKEY (CONT’D) (puts hand out) Spit. Ben spits the gum into her hand. She wraps a dozen matches around the base of the cigarette using the gum as adhesive. Mickey creeps up behind the HOT DOG VEND",
      "dialogue_count": 0,
      "word_count": 1923
    },
    {
      "scene_number": 3,
      "slugline": "INT. GYMNASEUM - LATER   *  STUDENTS pack the bleachers for an all-school assembly. At   *  center court, a MEEK TEACHER finishes up an announcement:   *  MEEK TEACHER   *  ...Iggy the Iguana is still missing   *  from the bio lab. If you encounter   *  him, please alert a faculty member.   *  He’s probably very tired, very   *  hungry, and very scared. Thank you.   *  He turns the microphone back over to THE PRINCIPAL.   *  PRINCIPAL   *  Thank you, Mr. Grasso...   *  ON MICKEY AND SABRINA watching from the side:   *  MICKEY   *  Wow, helluva turn out. You nervous?   *  SABRINA   *  (sweating)   *  Does he have to be here?   *  GO WIDE to reveal Jimmy pointing a camera at Sabrina. Next to   *  him, Chip unenthusiastically holds a boom mic.   *  MICKEY   *  Someone has to document this   *  monumental achievement for women’s   *  rights. You all set, Jimmy?   *  JIMMY   *  Just about. Got a slight buzz in my   *  left can, but I’ll fix it in post.   *  And Sabrina, don’t be afraid to   *  really explore the space. I got Ben   *  over there picking up the wide angle.   *  ACROSS THE GYMNASEUM: Ben holds a camera and waves.   *  Sabrina swallows hard. She can’t possibly go through with   *  this, right?   *  BACK ON:   *  PRINCIPAL   *  ...that’s all for faculty   *  announcements. Now, without further   *  adieu, I’d like to turn things over to   *  your new prefect, the Class of 2017’s   *  very own Sabrina Pemberton.   *  ON MICKEY AND SABRINA as the CROWD CHEERS:   *  30",
      "characters": [],
      "action_text": "MICKEY   *  That’s your cue, Susan Anthony.   *  Sabrina takes a deep breath and makes her way to center court.   *  MICKEY (CONT’D)   *  (to Jimmy)   *  Hundred bucks she chickens out.   *  SABRINA’S POV: A THOUSAND FACES stare back at her through   *  blinding lights. She steps up to the mic:   *  SABRINA   *  (tentative)   *  Uh, hey everybody. Okay, first   *  thing on the docket is the new   *  dress code. Just a reminder, girls   *  are no longer allowed to wear   *  skirts above the knee, or show any   *  cleavage...   *  She looks over to Mickey who shoots a confident thumbs up.   *  Jimmy is at her side working the camera like Fellini.   *  SABRINA (CONT’D)   *  ...and as your head prefect, I say   *  screw that!   *  The CROWD GOES WILD. Faculty look around nervously.   *  ON MICKEY AND JIMMY:   *  MICKEY   *  Oh God, she’s really gonna do it.   *  Mickey peels off her jacket, hands it to Jimmy.   *  MICKEY (CONT’D)   *  Hold this.   *  JIMMY   *  What are you doing?   *  MICKEY   *  Making a huge mistake so she   *  doesn’t have to.   *  BACK ON SABRINA:   *  SABRINA   *  So here’s what I think of your   *  dress code--   *  Just as she’s about to bust open her top, Mickey storms the   *  stage and snatches the microphone.   *  31 MICKEY   *  Hi everybody! Thanks for having me.   *  The crowd looks confused.   *  SABRINA   *  (sotto)   *  What the hell are you doing?   *  MICKEY   *  (sotto)   *  If it’s so important to you then   *  I’ll do it.   *  (into mic)   *  The name’s Mickey Murphy. You can   *  call me Mick or Murph or-- nevermind.   *  I’m here to talk about an issue   *  that’s very near and dear to me, and   *  that’s gender equality.   *  BACK ON CHIP AND JIMMY:   *  JIMMY   *  Oh man. This is gonna be so   *  freaking hilarious.   *  Chip looks to the massive audience, then to the microphone.   *  We see his   WHEELS TURNING...   *  BACK ON MICKEY AND SABRINA:   *  MICKEY   *  This is about more than a dress code.   *  It’s about taking con",
      "dialogue_count": 0,
      "word_count": 1410
    }
  ]
}