{
  "slug": "the-meddler-2016",
  "title": "the meddler",
  "genre": "drama",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 20328,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. GROVE - MOVIE THEATER LOBBY -- DAY 8   8  Marnie steps up to the ticket counter.  MARNIE  Three for “Fight School”.  INT. MOVIE THEATER -- LATER 9   9  Marnie sits alone, eating popcorn in the back row of a Liam  Neeson movie.   She enjoys the explosive action.  INT. APPLE STORE -- LATER 10   10  Marnie is being helped by FREDDY (20s, GENIUS T-shirt).  FREDDY  And you just put your fingers on  the screen like this...  MARNIE  Oh, look at that, you magnified it.  (squinting)  So if I wanted to look up an  address for a baby shower?  FREDDY  Well, you’d go on Safari and...  MARNIE  Oh you just Google it?  FREDDY  Yeah you just type it in.   And if  you need to find it again, it’s in  your search history.   There.  MARNIE  Oh my god Freddy, you really are a  genius.  FREDDY  (humble)  It’s just a label.  MARNIE  Your mother must be so proud.  FREDDY  I guess so.  7.",
      "characters": [],
      "action_text": "MARNIE  Well, I would be.   My daughter’s a  genius, but she’s too old for you.  How old are you?  FREDDY  I turn twenty-three in October.  MARNIE  Get outta here.   Happy Birthday.  What does that make you?   A Libra?  What does that mean?   It’s the  scales, right?   Justice?   You’re  probably very diplomatic.   You  should be a lawyer.  FREDDY  Maybe.  MARNIE  You should.  Marnie smiles.   Freddy nods, not sure how to respond.  EXT. HUGE BACKYARD -- DAY 11   11  Marnie, wearing black as usual, tries to mingle with various  30-SOMETHING WOMEN at a fancy BABY SHOWER.  -- Marnie stands on the outskirts of one group.  MARNIE  You should get the kind I have.  Transitions.   They go from regular  glasses to sunglasses when you walk  outside.   You can find ‘em  anywhere... Lenscrafters....  (pulling out her iPhone)  You want me to make you an  appointment?  -- Marnie interrupts an ENGAGED WOMAN --  MARNIE (CONT’D)  You’re gonna want to clean that  with Windex.  -- To an INFERTILE WOMAN --  MARNIE (CONT’D)  What you should do is have him tip  you upside-down.   That’s what Joe  and I did when we conceived Lori.  8.",
      "dialogue_count": 0,
      "word_count": 348
    },
    {
      "scene_number": 2,
      "slugline": "EXT. HUGE BACKYARD -- LATER 12   12  EMILY  And this one’s from Mrs. Minervini.  Marnie sits among the much-younger group, feeling under-  dressed, awkwardly squeezed next to a tree.   They watch EMILY  (30s, pregnant) unwrap a white box.  EMILY (CONT’D)  Oh my god... an iPad.  The women “ooh” and “ah” at it, a bit confused.  EMILY (CONT’D)  Wow, Marnie, that’s crazy generous.  MARNIE  Well, I know it wasn’t on your list  but I went to the Apple store the  other day and I saw this little  Filipino boy, practically a baby,  playing on one of these, what do  you call it’s...  EMILY  ... iPads...  MARNIE  ... iPads... And then Freddy told  me they have all these programs you  can download, like Barney’s Circus  and Nemo--  EMILY  Thanks, Marnie.   That’s sooooo  nice.   Lori has the best mom ever.  Emily moves on to other gifts.   Marnie goes back to eating a  scone.   The BRUNETTE (30s) sitting next to her, leans in.  BRUNETTE  Where   is   Lori?  MARNIE  Oh, I think she’s working today.  She’s got that deadline.   I mean...  countdown.  BRUNETTE  She said she’d baby-sit Tehya  tonight.   Dani and I haven’t gotten  out in a year.  9.",
      "characters": [],
      "action_text": "MARNIE  Oh, well I could--  A BLONDE WOMAN (30s) leans in.  BLONDE WOMAN  I thought she was out of town.  A CURLY-HAIRED WOMAN (30s) leans in, holding a TINY DOG.  CURLY-HAIRED WOMAN  She told me she was sick.  MARNIE  Oh.   Well, she   was   sick....  BLONDE WOMAN  I’d be sick too.   With everything  Jacob puts her through.  CURLY-HAIRED WOMAN  She’s so pretty.   Why can’t she  just get over him?  BRUNETTE WOMAN  She’s never gonna get over him if  she keeps giving him what he wants.  They all nod in agreement.   Marnie looks at them.  MARNIE  What does he want?  EMILY (O.S.)  O M G shut it.  Everyone turns back to Emily holding up a tiny onesie.  EMILY (CONT’D)  Does this come in my size?   I’m  kidding.   I know it doesn’t.  The women ooh and ah at it, except Marnie.  MARNIE  What does he want?  EXT. HUGE BACKYARD -- LATER 13   13  Marnie is standing by the buffet table, a pastry in one hand,  her iPhone in the other.   She texts Lori:   Where r u?  10. EMILY (O.S.)  Marnie?  Marnie turns to see the mom-to-be with an OLDER MAN (60s).  EMILY (CONT’D)  Marnie, this is Greg’s dad.   He  came out to help us with the  nursery.  OLDER MAN  Mark, hi.  MARNIE  Oh.   Marnie.  She gestures with her hands full.  EMILY  He’s in town til Thursday.  Emily walks away.   It takes awhile for Marnie to finish her  bite.   Finally:  MARNIE  So you’re out visiting your son?  MARK  Yeah.   Emily said it was important  that I come but... I think I’m just  here to carry gifts.  (laughs, then)  His mother isn’t around.  MARNIE  Oh, my husband died a year ago.  MARK  Oh.   Well, she lives in London,  but, we’re divorced....  Marnie takes a sip of her drink.  MARK (CONT’D)  Emily said that you grew up in  Brooklyn.   Which, um, which part?  MARNIE  Near Sunset Park.  MARK  I lived on the corner of 48th and  7th right by the church.  11. MARNIE  Get outta here.   I was on 43rd and  4th right by the other church.  MARK  We used to go to the public pool  before it became a parking lot.  MARNI",
      "dialogue_count": 0,
      "word_count": 697
    },
    {
      "scene_number": 3,
      "slugline": "INT. MARNIE’S TOYOTA -- DAY 14   14  Marnie drives while leaving Lori a voicemail, on speaker.  MARNIE  Anyway... I just wanted to tell you  that I’m on my way to the hospital  to volunteer.   So give me a call  soon or else I’ll already be in  there and it’ll be too hard to  reach me, okay?   Oh and I’ve been  listening to the best Beyonce song!  She turns up the volume, the same Beyonce song we’ve already  heard in progress.   Marnie holds up the phone for a verse.  Then lowers it:  MARNIE (CONT’D)  Anyway, I’m almost at the hospital  so give me a call.   Soon.  Otherwise I’ll already be in there.  Okay.   Love you.  Marnie hangs up, then turns up the song.   When it comes to an  end, she starts it over again.   It continues:  OMITTED 15   15  OMITTED 16   16  INT. HOSPITAL WAITING AREA -- LATER 17   17  Through the double doors, Marnie is frozen, hesitating to  come inside.   SOMEONE is wheeled outside, opening the doors  automatically.   Marnie finally walks through.  INT. HOSPITAL WAITING AREA -- LATER 18   18  Marnie sits among the sick and injured, filling out a  volunteer form.   She writes in her name and address.   She  puts down Lori as her emergency contact.   She stops at  marital status, unsure what to write.  A HOMELESS WOMAN (40s) coughs loudly across from her.   Marnie  looks up and gives a polite smile.  HOMELESS WOMAN  The demons are chasing me.   With  their dicks.  13.",
      "characters": [],
      "action_text": "MARNIE  Oh.   Well, that must be scary.  HOMELESS WOMAN  It is.   Can you buy me a Sprite?  MARNIE  Sure.  Marnie puts down her volunteer form.   And makes her way  toward the VENDING MACHINES.   She weaves in between patients  and their ailments.   Someone coughs.   Someone cries.  Marnie puts a dollar in the machine, pushes the button, now  hearing the TELEVISION playing the NEWS above her.  FEMALE NEWSCASTER (ON TV)  ... Within ten miles of where the  skeletal remains were found.  Police suspect this could be the  work of a serial killer that’s been  targeting young women in the area  since 2005...  HOMELESS WOMAN (O.S.)  Can I get my Sprite?  Marnie jumps, startled, as the homeless woman takes the soda  and disappears.   Marnie looks around at all the people in  need and starts backing away from them all, panicked.  MARNIE  Excuse me, sorry....  She quickly bursts out of the hospital doors.  INT. LORI’S HOUSE -- MORNING 19   19  Marnie unlocks the door with a key, holding a brown bag.  MARNIE  Lori?  There’s no answer.   Marnie greets the dogs, then rounds the  corner, into the bedroom --  MARNIE (CONT’D)  Don’t you get the mail anymore?  Lori screams from inside the shower.   Then pokes around the  shower curtain.  14. LORI  Jesus, Mom, I was shaving.   You  need to ring the fucking doorbell.  MARNIE  But I have the key.  LORI  Well, what if I had company?  MARNIE  Who?   Jacob?  LORI  No.   Who told you that?  Marnie looks at the TV.   A TEEN SOAP plays, MUTED.   ON TV:   a  HANDSOME ACTOR (30s) charms a PRETTY ACTRESS (20s).  MARNIE  Your friends at the baby shower.  Lori disappears behind the curtain again.  LORI (O.S.)  Please don’t talk to my friends,  okay?   They’re not my friends.   And  you’re not supposed to plus one  when there isn’t a one to plus.  MARNIE  Well, you never told me if you were  going or not.   Did you get my  message about the serial killer?  He’s been all over Southern  California, targeting young women.  LORI (O.S.)  Well, we should",
      "dialogue_count": 0,
      "word_count": 2507
    },
    {
      "scene_number": 4,
      "slugline": "INT. GIFT SHOP -- MOMENTS LATER 26   26  Marnie strolls though the gift shop, scanning the different  stuffed animals.   She decides on a STUFFED BUNNY.   Its goofy  face makes her smile.  INT. HOSPITAL -- LATER 27   27  Marnie strolls the halls with the stuffed bunny, trying to  walk tall.   There’s a LOUD BEEPING.   Nurses rush through with  an emergency.   Marnie starts to look uneasy.  Up ahead, a MAN IN A GOWN (60s) dragging his IV.   He’s coming  toward her.   As he gets closer and closer to her, she turns  away, pushing through a door --  INT. HOSPITAL ROOM -- CONTINUOUS 28   28  Marnie ducks into the room and shuts the door behind her, the  noise of the hospital hallway is muffled.   She looks up to  see an OLD WOMAN (80s), lying in bed, mouth agape, no  visitors.   Something next to her is beeping.  Marnie takes a few small steps up to the hospital bed.  MARNIE  Hi.   Hello.  She leans over to see some wires twisted under the woman’s  twisted arm.   Marnie reaches down and fixes the wires, moving  her arm into a more comfortable position.   The beeping stops.  MARNIE (CONT’D)  Is anyone here with you?  The old woman slowly raises her arm.   Her finger extends,  pointing.   Marnie lowers her arm, placing the stuffed bunny  in her hand.  MARNIE (CONT’D)  Here.   I’ll get someone.  Marnie slowly backs away and out of the room.  INT. HOSPITAL HALLWAY -- CONTINUOUS 29   29  Marnie quickly finds a NURSE (40s).  25.",
      "characters": [],
      "action_text": "MARNIE  Excuse me, the woman in 142, I  don’t know if she’s in pain.   Could  you just?  The nurse walks off toward the woman’s room.   Marnie watches,  feeling proud of herself, a smile curling on her face, as she  continues down the hall.  PRE-LAP:   A doorbell.  EXT. LAUREL CANYON HOME -- DAY 30   30  The brunette from the baby shower, JILLIAN, opens the door to  see Marnie.  BRUNETTE/JILLIAN  Marnie?   What are you doing here?  MARNIE  You said you needed a baby-sitter.  Marnie holds up a brown bag.  MARNIE (CONT’D)  I brought bagels.  INT. LAUREL CANYON HOME -- LATER 31   31  Jillian cuts up a salt bagel for her daughter, TEHYA (4 years  old).  JILLIAN  I swear, I’m like the only one of  my friends without full-time help.  And in this town, it literally cost  more than my salary to hire a  decent nanny.   So I quit.   And now  I’m home all day.   All day, every  day.   Isn’t that right, Tehya?  Tehya screams.  MARNIE  You could go into the nanny  business.  Jillian looks at Marnie and cracks up, laughing.  JILLIAN  Oh my god.   That’s like the  funniest thing ever said, ever.  26.  (MORE) No wonder Lori’s so funny.   Well,  not anymore, but....  Marnie reaches out to Tehya, but she runs off to the other  side of the room to eat her bagel.  JILLIAN (CONT’D)  It’s just nobody ever tells you how  lonely it is.   Like some days, I  don’t think I talk to another grown  person the entire day.   Like by the  time Dani gets home, I can’t even  turn off the baby talk.  MARNIE  Well, that’s normal.  JILLIAN  Really?  MARNIE  But just think, someday you and  Tehya will be having like real  conversations... You could talk  about everything.   Like me and  Lori.  JILLIAN  Yeah.   You’re right.   I don’t know  why I worry so much like I’m not  doing it right.   Like at any moment  I’m gonna do the thing that gives  her a body complex or a foot  fetish.... I don’t know.   I lost my  mom when I was young so... I’m  kinda flying blind.  Jillian lets out a laugh.   Marnie stops.",
      "dialogue_count": 0,
      "word_count": 1033
    },
    {
      "scene_number": 5,
      "slugline": "INT. APPLE STORE -- DAY 32   32  Freddy helps Marnie look up things on an iPad.  FREDDY  I don’t see any submarines for  rent.   But there are a bunch of  boats at the yacht club in Marina  Del Rey.  MARNIE  And you can rent ‘em out for a  party?  FREDDY  Looks like it.  Marnie magnifies the screen, squinting at the boat image.  MARNIE  Oh Freddy, you really are a genius.  Freddy smiles.   Marnie squints at the boat price.  MARNIE (CONT’D)  Jeez, ten thousand dollars for just  the venue?  Marnie clicks a few buttons.  MARNIE (CONT’D)  God, I really should get one of  these for my daughter.   Could you  ring me up another iPad?  FREDDY  Sure.  Freddy smiles at her generosity.   Then:  FREDDY (CONT’D)  So I decided to take your advice.  She looks up.  MARNIE  You’re gonna be a lawyer?  FREDDY  Well, no, but... I’m gonna go back  to school.   Well, night school.  Maybe engineering or programming,  see how far I get.   And work’ll pay  for my classes, so...  30.",
      "characters": [],
      "action_text": "MARNIE  Oh, Freddy.   You took my advice.  Marnie looks at him, smiling, proud, marveling.   Then:  FREDDY  Yeah.   Now I just have to figure  out my work schedule.   And the bus  schedule.  MARNIE  You don’t have a car?  FREDDY  Well, my mom uses it for work.  It’s okay, I like taking the bus.  You get to meet a lot of freaky  people....  Marnie doesn’t like the sound of that.  MARNIE  I could take you.   When is it?  FREDDY  What do you mean?  MARNIE  I’m in the neighborhood.   Plus,  you’re always helping me out here.  It’d be my way of paying you back.  She hands him her credit card.   He swipes it.   She slides it  back in her rubber-banded stack of cards.   We see her  husband’s driver’s license on top of the pile.  MARNIE (CONT’D)  We wouldn’t have to take the  freeway, would we?  FREDDY  We can avoid it.  (then)  But are you sure?   It’s pretty  late.  MARNIE  It’s okay.  She stares at the image of the boat.  31. MARNIE (CONT’D)  I don’t sleep much.  DISSOLVE TO:  EXT. MARINA DEL REY HARBOR -- DAY 33   33  The boat from the picture stares back at Marnie.  INT. BOAT -- LATER 34   34  Marnie snaps pictures with her iPhone of every crevice of the  boat’s insides, trying to get just the right angles.   She  texts Jillian way too many pictures.  INT. FLORIST -- LATER 35   35  Marnie browses the different flowers, thinking of the  centerpiece possibilities.   She takes pictures of various  flowers with her iPhone.   She pays for an assorted bunch.  EXT. MARINA DEL REY STREET -- LATER 36   36  Marnie walks with the bouquet of flowers.   A HOMELESS MAN  (40s) is begging for change against a brick wall.   Marnie  stops in front of him, digging in her pocket for loose  change.   She pulls out a twenty and hands it to him.  VOICE (O.S.)  Cut!  A GUY WEARING A HEAD-SET (20s) comes up to Marnie.  GUY IN HEAD-SET  Are you supposed to be here?  MARNIE  What?  GUY IN HEAD-SET  Here.  He backs her away from the homeless man.  GUY IN HEAD-SET (CONT’D)  On “background” you cro",
      "dialogue_count": 0,
      "word_count": 5119
    },
    {
      "scene_number": 6,
      "slugline": "EXT. LOS ANGELES STREETS -- LATER 72   72  Not slowly, the motorcycle tails a COP CAR.   Marnie is  strapped to Zipper’s back, helmet on, terror in her eyes.  ZIPPER  So tell me about your kids.  MARNIE  LATER!  She grips his waist and closes her eyes, starting to pray.  EXT. SANTA MONICA STREET -- LATER 73   73  Marnie and Zipper are parked behind the cop car.   Zipper  looks through binoculars at something.  ZIPPER  After I retired, I used to drive  around listening to the CB just to  see where the action was.   And then  I started following them around, so  the guys said I should just come  along.   Sort of like unofficial  back-up.   In case anything goes  wrong.  MARNIE  That’s cool.   So you make your own  hours.  He swallows, letting her think it’s cool.  MARNIE (CONT’D)  Were you on the Red Ripper case?  ZIPPER  No.   No, but I knew of the guy  following him.   Hadn’t seen his  family in eight years.   That’s what  chasing a rabbit will do to you.  This hits her.   She nods, letting go of irrational fears.  ZIPPER (CONT’D)  Took thirty years on the force to  realize you can’t save everybody.  He looks through the binoculars.  ZIPPER (CONT’D)  But you try.  57.",
      "characters": [],
      "action_text": "Marnie smiles at him.  EXT. ANOTHER SANTA MONICA STREET -- LATER 74   74  With a view of the pier, Marnie and Zipper sit on a bench,  the motorcycle nearby.   She looks through the binoculars now,  like they’re in the last row of an action movie.  MARNIE  So why do they call you Zipper?  ZIPPER  It’s my last name.  MARNIE  Oh, well, that makes sense.   What’s  your first name?  ZIPPER  Randy.   Randall.  MARNIE  Are you from out here?   Am I asking  too many questions?  He smiles and shakes his head.  ZIPPER  I’m from Oxnard originally.   I  moved to Ventura when I got married  and then I moved to Topanga when I  got divorced.  MARNIE  Oh, I’m sorry.  ZIPPER  Oh, don’t be sorry.   She’s not.  He laughs.   She joins him.  ZIPPER (CONT’D)  She never smiled with her teeth.  You know?   I should’ve known.  Marnie doesn’t know whether or not to smile.  MARNIE  Topanga?   Is that by the beach?  ZIPPER  It’s   by   the beach.   Not   on   the  beach.  58.  (MORE) I wouldn’t mind living on the  beach.   But I wouldn’t know where  to keep the chickens.  MARNIE  Chickens?  ZIPPER  Some people have dogs.   I am a man  with chickens.  MARNIE  How many?  ZIPPER  You know what they say about  counting chickens.  She laughs.  ZIPPER (CONT’D)  We have a very symbiotic  relationship.   I give them a coop  and some grass and sometimes a  little Parmesan cheese and they  keep me in eggs.  He reaches into his pocket and pulls out a blue egg.  ZIPPER (CONT’D)  This is from the Ameraucana.   I  only have one Easter Egger.  He hands her the blue egg.   She looks at it up close.  MARNIE  I can’t believe it didn’t break.  ZIPPER  Yeah, she’s a toughie.  (then)  You want to meet her?  She looks up at him, thinking.  MARNIE  You mean at your house?  ZIPPER  (looks at his watch)  Well, she’s been out at the bar all  night but she should be home by  now.  59.  ZIPPER (CONT'D) She deliberates, fighting the voices in her head.  EXT. ZIPPER’S TOPANGA HOME -- EARLY DAWN 75   75  Marnie and Zipper w",
      "dialogue_count": 0,
      "word_count": 799
    },
    {
      "scene_number": 7,
      "slugline": "INT. ZIPPER’S HOUSE -- MORNING 76   76  The sun is just coming up, bathing the room in a pink glow.  Zipper makes Marnie a cup of coffee in his small kitchen.  MARNIE  Well, Joe didn’t want to know how  much time he had left.   But Lori  and I knew.   So he asked her if she  could throw us our wedding  anniversary in August.   But she  knew he wouldn’t make it til then  so she said, “Why don’t I throw you  a party forty years from the day  you met?”   So Lori decorated her  house like it was 1969 and all the  music was from 1969 and all her  friends came dressed in 60s clothes  and Joe’s brothers flew out and she  served fondue.   And it was just the  most spectacular day.   Like the day  we got married.  Marnie smiles.   Zipper sits across from her.  MARNIE (CONT’D)  We came out here for his treatments  and then took care of him for  another two months and....  (smiling)  Lori said we were in the delivery  business.  (hands to Heaven)  Shipping and handling.  She forces a smile.   Zipper can see this is still an open  wound.   He moves on.  ZIPPER  And then you stayed in LA?   That’s  a pretty big sea change, literally.  I mean, that’s really, very brave.  MARNIE  Yeah?   Well, who wouldn’t love it  here?   The sun is always shining.  It’s like living on Main Street in  Disneyland.  He looks at her.   For a second too long.   And smiles.  MARNIE (CONT’D)  What about you?   You got kids?  61.",
      "characters": [],
      "action_text": "ZIPPER  Two beautiful girls.  She smiles.  ZIPPER (CONT’D)  The one who likes me lives far  away.   And the one that doesn’t is  in Palm Springs.  Her smile drops.   He explains.  ZIPPER (CONT’D)  Lizzy was still in high school when  her mom and I fell apart, which was  mostly my fault.   70/30.   60/40,  maybe.   I was working all the time.  I brought it home with me.   And as  soon as she started to slip away, I  started gripping and I guess I held  on too tightly.   And I lost her.  Lizzy, I mean.   The younger one.  (then)  She’s in a rehab--  (correcting himself)  Program.   She’s in a program.   I  was hoping one of those steps would  lead her back here, but....  (then)  I don’t know.   I was a hot head  then.   I let my temper get the best  of me.   I was too strict.   Had too  many rules.   Curfews.   Made them  scared to tell me things.  MARNIE  Well, sure.   Look at everything you  were seeing all day.   Serial  killers and stuff?   I just   watch  the news.   Never-mind being a part  of it.   It’s like an action movie.  ZIPPER  (slight scoff)  Well, not anymore.  MARNIE  Still.   It’s not your fault the  world is a scary place.  She takes a sip of coffee.   He looks at her.   She has no idea  how beautiful she looks.  62. MARNIE (CONT’D)  Thank God you’re retired.  He clears his throat, almost laughing, but not.  ZIPPER  Yeah, it has its moments.   I’ve  learned to calm down.   I meditate,  if you can believe that.   The  chickens keep me in line.  Sometimes I hit the bag in the  garage.   Mostly I just exercise  patience.   With everything.   My ex.  My girls. If Lizzy doesn’t want me  to call her anymore, I have to  respect that.  MARNIE  (bursting)  No.   I mean... you can’t not call.  ZIPPER  I left her messages until it was  full.  MARNIE  So?   I’m sorry.   I should mind my  own business.   But you should call  her.  ZIPPER  I really wouldn’t know what to say.  MARNIE  Just tell her you love her.   No  matter what she’s up to.  (then, matter-of-fact",
      "dialogue_count": 0,
      "word_count": 1788
    },
    {
      "scene_number": 8,
      "slugline": "INT. HOTEL BAR -- LATER 86   86  At a round booth, Lori sits in between Marnie and the camera  guy from Lori’s set, BEN (30s).   He’s in the middle of a  long, animated story.  BEN  Indy races through the jungle, all  the way back to Jock and the  seaplane.   Indy screams, “Come on,  Jock!   Get going!” but the natives  are chasing him to the edge of the  water.   So Indy grabs onto a vine  and goes swinging through the  air...  Ben sings some theme music.   Marnie laughs, enchanted.   Lori  takes a big sip of her drink.  BEN (CONT’D)  Indy hits the water.   Splewsh.  Poison arrows are firing all around  him.   Pew pew pew pew pew.... Then  Indy climbs into the seat of the  plane just as it lifts out of the  water and takes to the sky.   And  that’s when Indy looks down and  sees....   are you ready?... a giant  snake in his lap.  Marnie gasps.  BEN (CONT’D)  Indy screams, “Jock, why is there a  snake on this plane?”.   And Jock  says, “Oh that’s just Reggie!”   And  Indy says, “But Jock, I hate  snakes!”   And the plane flies off  into the sunset.   And   that’s   the  first twenty minutes of “Indiana  Jones and the Raiders of the Lost  Ark”.  Marnie claps, entertained.   Lori forces a laugh.   Ben laughs  the hardest, wiping his brow, and exhales.  MARNIE  I’ve never seen it.  BEN  Well, we’ll have to watch it before  you leave town.  69.",
      "characters": [],
      "action_text": "He gives Lori a too-hard squeeze.   The WAITER brings more  drinks.   Lori can’t get to hers fast enough.  MARNIE  So you guys met on set?  LORI  (pointed)  That’s right, just two weeks ago.  Like I was telling you right before  you invited him to dinner.  MARNIE  Well, I think it’s romantic.  Meeting on a movie set.  LORI  People meet on sets all the time  and it’s usually scandalous and  home-wrecking.  MARNIE  I knew my husband for two weeks  before he proposed.  BEN  Two weeks?  MARNIE  I think when you know, you know,  you know?  BEN  I totally agree.  He pulls Lori towards him.  LORI  I’m gonna run to the bathroom.  BEN  Hurry back.  Lori slides under the booth and away.   Ben looks around, then  looks back at Marnie, with a secret.  BEN (CONT’D)  Hey...  He gestures for Marnie to lean in.   As she does, he leans  forward and presents an ENGAGEMENT RING in a light-up box.  MARNIE  Oh my God...  70. BEN  I got it the day after we met.  (then)  I don’t do things half-assed.   When  I know I want something, I go for  it.   That’s how I got this far in  my career.   Russell Boyd, Rodney  Charters, Don McAlpine... when the  top cinematographers need a B-  camera operator, do you know who  they call?  MARNIE  You?  He shuts the ring box and leans back.  BEN  When you know, you know.  MARNIE  Wow, it’s all so fast.   But if  it’ll make Lori happy...  He leans in, too intense.  BEN  So I was thinking that we get  everyone she knows, all her friends  and family and people she works  with and the entire crew and we put  together one of those Youtube  videos, and maybe it starts with  you putting Lori on the back of my  truck and then the radio starts  playing our song...  Marnie beams.   Her eyes couldn’t get any wider.  BEN (CONT’D)  And everyone she knows comes out  one at a time and does this  choreographed dance number until it  ends with me appearing with the  ring and getting down on one knee,  all in one tracking shot....  INT. HOTEL ROOM -- LATER 87   87  Lori r",
      "dialogue_count": 0,
      "word_count": 5331
    },
    {
      "scene_number": 9,
      "slugline": "INT. DOCTOR’S OFFICE -- LATER 112   112  Marnie watches Lori bounce her legs while a NURSE (50s) takes  her blood.  NURSE  My daughter was a surprise.  Lori smiles, then winces from the needle.  INT. LORI’S CAR -- LATER 113   113  Lori drives with Marnie in the passenger seat.  LORI  I should sell my house.   Get  something bigger with carpets...  How am I gonna tell Jacob?  Lori starts crying.  LORI (CONT’D)  I can’t believe Dad’s not around.  MARNIE  I’m around.  Lori turns to her mother and smiles.  LORI  Yeah, I know.  Lori’s cell phone rings.   She answers on speaker.  LORI (CONT’D)  Hello?  NURSE (O.S.)  Hey, hon, it’s Anna in Dr. Segal’s  office.   It’s negative.  LORI  Really?  NURSE (O.S.)  I know, I’m sorry.  LORI  What about all the tests I took?  95.",
      "characters": [],
      "action_text": "NURSE (O.S.)  I don’t know, but we tested your  blood and urine and you’re not  pregnant.   I’m sorry, hon.  Marnie takes out her phone, looking online.  LORI  Okay, thanks for calling.  Lori hangs up.  LORI (CONT’D)  I don’t understand.  MARNIE  It says here that a false positive  could be certain types of stomach  tumors.   Do you feel sick?  Lori looks ahead.  LORI  Yes.   I feel very sick.  INT. LORI’S HOUSE -- LATER 114   114  Lori storms into the house, heading straight for the  bathroom.   Marnie follows.  MARNIE  Maybe you could ask the doctor to  test the blood for other stuff?  Like AIDS.  LORI  I don’t have AIDS.  MARNIE  I said like AIDS.  Lori picks up the bag of sticks and looks.  LORI  I don’t get it, it says if you have  two lines, that means you’re  ovu...lating....  (then)  What the fuck??  She holds the bag out to Marnie.  96. LORI (CONT’D)  Are you kidding me?   I’ve been  peeing on ovulation sticks?  Marnie looks at the bag.  LORI (CONT’D)  You bought ovulation sticks?  Marnie suddenly cracks up laughing.  LORI (CONT’D)  This isn’t funny, Mom.  MARNIE  Oh, come on...  LORI  Do you understand the roller-  coaster you put me on?   I went from  pregnant to stomach tumors to...  ovulating in three hours....  Lori suddenly bursts into laughter.   Marnie cracks up more.  The two of them roll around on the bathroom floor together,  hysterically laughing.   Until, Lori stops.   And she’s crying.  MARNIE  Oh, Lor, I wasn’t laughing at you.  Lori can’t stop crying.   Marnie wraps her arms around her.  MARNIE (CONT’D)  But this is a good thing.   You  didn’t plan it.  LORI  I know.  (then)  I was just relieved to have that  decision made for me.  Lori sobs in her mother’s arms.  LORI (CONT’D)  Oh God, I’m so sorry.  MARNIE  For what?  LORI  For the way I am.  97. MARNIE  I love you the way you are.  LORI  I just miss him so much.  MARNIE  Well, maybe he’s not the one for  you...  LORI  Not Jacob.   Dad.   I miss Dad.   I  miss my dad.  MARNIE  Me too.  LOR",
      "dialogue_count": 0,
      "word_count": 577
    },
    {
      "scene_number": 10,
      "slugline": "INT. LORI’S BEDROOM -- NIGHT 115   115  Marnie lies awake, staring up at the ceiling fan, Lori asleep  next to her.   The fan cools the room with a mechanical  breeze.   Marnie stares at the blades spinning around and  around and around and around and --  She gasps, sitting straight up.  INT. MARNIE’S APARTMENT -- LATER 116   116  Marnie searches her closet.   Then pulls out a TUPPERWARE box  and sets it on the bed.   She opens the lid.   It’s full of  photos, memories, Joe’s old shirts.   She slides things aside.  Looking for something.   Until... her eyes light up.  INT. HOSPITAL -- DAY 117   117  Marnie walks down the hall carrying something in a plastic  bag.   She makes her way straight toward the old woman’s room.  INT. HOSPITAL ROOM -- CONTINUOUS 118   118  And up to the old woman’s bed.   The woman turns her eyes to  Marnie, mouth agape, breathing.  MARNIE  It’s me.  The woman’s hand raises into the air and points.   Marnie  reaches into her plastic bag and pulls out a ROTARY PHONE.  She pulls the plug out of the hospital phone and inserts it  into the rotary phone.   She holds it up, then lifts the  receiver to her ear.   The old woman’s finger guides through  the air and lands in a slot - 7.   The old woman turns her  finger and begins to dial.   Marnie’s eyes widen - 5.  The woman moves her hand in the same circular motion - 4.  MARNIE (CONT’D)  Oh, shoot, I think you need to dial  a nine first, let me, darn it...  Marnie hangs up, tsks at herself and quickly dials a 9.   Then  holds it out again.   The woman uses all of her energy to dial  again - 7 - 5 - 4 - 4 - 1 - 7 - 7 - and stops.  Marnie waits, phone to her ear.   And it rings.  Now Marnie’s breathing fills the room.   It rings again and --  99.",
      "characters": [],
      "action_text": "MAN’S VOICE (O.S.)  Hello?  Marnie stops, can’t speak.  MAN’S VOICE (O.S.) (CONT’D)  Hello?  MARNIE  Hello?  CUT TO:  INT. HOSPITAL ROOM -- LATER 119   119  The old lady is surrounded in stuffed animals.   Marnie sits  next to her, holding her hand, when a MAN (40s) enters the  room.   Marnie stands to greet him.  He hugs Marnie, grateful, then quickly moves to the hospital  bed.   He leans over the old woman.  MAN  Mom?  The old woman looks up at him.   Her eyes fill with happy  tears.   His do the same.  MAN (CONT’D)  Yeah, it’s me, Mom.   I’m here.  He brushes the hair off her face, kissing her hands.   Marnie  watches, overwhelmed.   The same tears fill her eyes.  EXT. TOYOTA BODY SHOP -- DAY 120   120  Marnie watches as her fixed Toyota is lowered to the ground.  INT. MARNIE’S TOYOTA -- LATER 121   121  Marnie drives up the Pacific Coast Highway, windows down,  perfect weather, the sun glistening on the ocean.  INT. MARNIE’S TOYOTA -- LATER 122   122  Marnie parks near the sand and opens the glove compartment.  Inside, a SEALED URN.   Marnie takes it out.  100.",
      "dialogue_count": 0,
      "word_count": 507
    },
    {
      "scene_number": 11,
      "slugline": "EXT. BEACH -- LATER 123   123  Marnie walks across the sand, holding the urn.   As she gets  closer to the water, she kicks off her shoes.  She steps out into the ocean, her pants getting wet up to her  knees.   It’s colder than the Atlantic.  She unseals the urn.   And talks to the horizon.  MARNIE  Joey, I don’t know if this is what  you want.   But it’s all I can do.  She takes the ashes and begins to sprinkle them.   The waves  move around her, sending his spirit out to sea.   It’s over  too quickly.  VOICE (O.S.)  Hold it right there.  A VOICE echoes across the beach.   Marnie turns back to see a  POLICE CAR in the sand.   A MALIBU COP (40s) is making his way  to her.   It’s nobody she knows.  MALIBU COP  What is that you’re doing?  MARNIE  Uh... none of your business.  MALIBU COP  Ma’am, this is a private beach.  It’s illegal to be doing what  you’re doing.  MARNIE  You’ve gotta be kidding me.  MALIBU COP  Can you step out of the water  please?  MARNIE  I am a resident of greater Los  Angeles.   And if you want me to get  out of this ocean, you’re just  gonna have to come in here and drag  me the hell out of it.  INT. HOLDING AREA -- LATER 124   124  Marnie is pushed into a seat, soaking wet.  101.",
      "characters": [],
      "action_text": "MALIBU COP  Think about who your one phone call  is.  He walks out, soaking wet, and shuts the doors on her.   She  sits and thinks about who her phone call will be.  EXT. JAIL -- LATER 125   125  Marnie comes down the jail steps, looks up, and stops to see  Zipper standing by his motorcycle, smiling.   She looks  exhausted, but can’t help but smile when she sees him.  EXT. PACIFIC COAST HIGHWAY -- LATER 126   126  Marnie rides on the back of Zipper’s bike, her arms wrapped  around his waist.   The sun is setting and simply beautiful.  EXT. BEACH -- SUNSET 127   127  Zipper pulls his motorcycle up to Marnie’s Toyota, still  parked in the lot.   She steps off the bike.   He cuts the  engine.   They look at each other.   The ocean sounds nearby.  MARNIE  Do you ever listen to Beyonce?  ZIPPER  Of course.  MARNIE  She has this song called “I Was  Here”, have you heard it?  ZIPPER  I don’t think so.  MARNIE  It goes... “I wanna leave my  footprints on the sands of time,  know there was something that I  left behind. When I leave this  world, I’ll leave no regrets, to  leave something to remember, so  they won’t forget”.  ZIPPER  That sounds like a good one.  102. MARNIE  Did you bail me out because you had  to as an officer of the law?  ZIPPER  No, that’s actually the opposite of  what I usually do.  (then)  I bailed you out as a friend.  She smiles.   Then reaches out and takes hold of his hand.  His thumb gently rubs hers.   She interlocks fingers.   Then:  MARNIE  Do you want to go to an action  movie sometime?  He looks up at her.   A smile spreads across his tan face.  ZIPPER  Definitely.  They look at each other.   And suddenly, slowly, they lean in.  He kisses her on the mouth, gently, but with fire behind it.  They slowly pull away.   Their hands slide apart.   Marnie  turns away, walking back to her car, smiling the whole way.  He watches her go, then “kick-starts” his bike and rides off.  INT. MARNIE’S TOYOTA -- MOMENTS LATER 128   128  Marnie climbs into the ",
      "dialogue_count": 0,
      "word_count": 1622
    }
  ]
}