{
  "slug": "the-interview-2014",
  "title": "the interview",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 0,
  "characters": [],
  "total_words": 22461,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SETH’S KITCHEN - MORNING A pretty sweet kitchen in a pretty nice house in the Hollywood hills.   As SETH RAPOPORT makes himself breakfast. THREE KITCHEN TV’S blare cable news, all covering the same story:  CNN ANCHOR North Korean President Kim Il-Hwan responded to the international community’s assertion that he is letting his people starve in the nation’s worst famine in 100 years. KIM IL-HWAN  (subtitles)  This so-called famine is a fiction invented by the United States and its lapdog, South Korea.   They are just angry because we have succeeded in developing our own nuclear arsenal.  (pulls a HEAD OF LETTUCE out of a bag)  This lettuce was grown right here in North Korea.   I have tasted it and it is delicious.   How can we be hungry if there are vegetables?  SETH Touché. Seth’s PHONE RINGS.   He picks up: SETH (CONT’D) Yo. MALE VOICE (V.O.) We’re ready to talk. SETH Do I have the exclusive on this? INT. OFFICE BULLPEN - DAY The bustle of a STAFF scrambling to put a nightly news program together.   Seth directs traffic: SETH What do you mean we’re waiting on VT?   We’re an hour from air.  THE INTERVIEW   2.  3/15/12",
      "characters": [],
      "action_text": "STAFFER I’ll run that down right now. SETH (to another staffer) Check and see if Dave’s landed. STAFFER #2 On it! MAN’S VOICE (O.S.) Something strange is happening to me. That’s DAVE SKYLARK who just entered.   30’s, dashingly handsome, magnetic charm. SETH Dave-- DAVE So last night I’m having sex with this   insanely   hot girl.   And being inside her feels just   ridiculously  good. (then) But it gets odd.   I think I’m becoming, I don’t know, more  reflective   or something?   Because in the middle of everything, I suddenly start thinking about my childhood. SETH Dave, can we first-- DAVE Even as a little kid, I was just so  horny .   When I was ten, I swore to myself that when I did finally get laid, I would   never   take it for granted, I would always   appreciate  it.   So there I am last night, inside this woman, about to completely   explode,   and the thought in my mind is,   I wish 10 year old me could see me now .   It was just... it was such a hell of a place to be   mentally . A beat.  THE INTERVIEW   3.  3/15/12 SETH So the point of the story is that you enjoy sex. DAVE No, it’s more nuanced than that, it’s... (then) Well... yeah.   I guess that is the point. SETH Awesome, I’ll chew on that later. Remember that angle I was working? DAVE Yes?? SETH The source is ready to come forward with the story. DAVE You mean... SETH Yes.   Teri Hatcher’s coming out of the closet.   To you.   On live TV. DAVE SONOFABITCH! Dave leaps on to Seth and BEAR HUGS him.   We now see the POSTER for their show in the background: Dave’s smiling mug above the title: “SKYLARK TONIGHT!” DAVE (CONT’D) You big beautiful bastard!   Your talent freaks me the fuck out. SETH Yeah.   My Pulitzer prize is just around the corner. DAVE Who cares about a Pulitzer when you’ve got a Maserati and pussy up the yin ying?   You can’t get a blowjob from a   Pulitzer   while a second   Pulitzer   masturbates as it watches you.  THE INTERVIEW   4.  3/15/12 SETH Thanks, Dave.   That’s inspiring. Get",
      "dialogue_count": 0,
      "word_count": 3275
    },
    {
      "scene_number": 2,
      "slugline": "EXT. MOUNTAINS - MORNING Seth wakes up looking horrible.   He runs his fingers through his hair and pulls out CLUMPS OF LICE.   At last, he breaks down and WEEPS.   The driver nudges his SON to check out the Yankee crying like a little pussy.   They both giggle. INT. DAVE’S BEDROOM - DAY Dave’s in bed with two beautiful women, KAYTEE and LOLA, post coitus.   They’re all PLAYING BATTLEFIELD 3 ON XBOX. EXT. MOUNTAINS - DAY The oxcart continues.   Seth is drenched in sweat, PUKING over the side of the cart. EXT. DESERT - DAY The oxcart stops in the middle of a BARREN HIGH DESERT.   Seth checks the coordinates on his handheld GPS.   He’s where he’s supposed to be.   He checks his watch.   It’s almost 1600 UTC. Seth pays the driver, and the oxcart takes off. Seth is now alone in the wilderness near the North Korean border.   There is nothing as far as the eye can see.   It’s quiet as shit.   Seth LIES DOWN IN THE DIRT and waits... EXT. DESERT - LATER Seth wakes to the sound of a HELICOPTER.   His face is pelted by dirt from the ROTOR WASH. THREE NORTH KOREAN MEN jump out before the chopper hits the ground.   They train their AUTOMATIC WEAPONS on Seth. SETH (believes he’s a dead man) Fucking Dave.   Stupid, stupid  asshole . The chopper skids touch ground.   A HOT KOREAN WOMAN, LATE 20’S, holding a briefcase, steps out and approaches Seth. This is SOOK YONG-RIM, Assistant to Kim Il-Hwan and Director of Communications for The Office of The President. One guard SEARCHES Seth for weapons and microphones.  THE INTERVIEW   20.  3/15/12",
      "characters": [],
      "action_text": "From her briefcase, Sook takes out a DOSSIER on Seth, and compares the PHOTOS of him to the man himself.   Satisfied, she signals to the guards to stand down. SOOK The Beloved Leader will grant an interview to Mr. Skylark.   It will be conducted at an undisclosed location.   It will have a duration of one hour.   All questions will be supplied by   us .   Mr. Skylark may not ask follow-up questions.   The interview will be broadcast live to eliminate editorial corruption of the Leader’s message.   There will be no interruptions for advertisements in promotion of the capitalist agenda. A beat. SETH Is that all, or do I have-- SOOK If you deviate from the parameters, the interview will be terminated. These parameters are secret.   If they are revealed, the interview will be cancelled.   Do you understand and accept the terms? SETH I... it’s not exactly what I... SOOK The terms are not negotiable. SETH Yeah, I sensed that... (then, helpless) I... Okay.   Yeah.   I accept. SOOK The meeting will take place one month from today.   We will send the coordinates for a pickup site. Sook turns to leave, but Seth calls after her: SETH Wait - that’s   it?  THE INTERVIEW   21.  3/15/12 SOOK Yes. SETH You couldn’t have just told me this on the phone? SOOK This engagement poses considerable risk.   The Beloved Leader says that sufficient trust cannot be established in a telephone call. SETH Why is he agreeing to do this? SOOK He has an important message for the west.   He is familiar with Dave Skylark’s work, and believes Mr. Skylark is the only journalist who might treat him fairly. As Sook walks away, Seth, sees through the heat shimmers what he could swear is a CRAZY HOT BODY on this no-nonsense woman. She boards the chopper and it is gone as quickly as it came. Seth is once again, alone in the desert.   He looks at his watch.   He has long wait.   With nothing else to do, he sits down in the sand, pulls out this week’s Economist, and reads. INT. SKYLARK TONIGHT CONFERENCE ROOM ",
      "dialogue_count": 0,
      "word_count": 1974
    },
    {
      "scene_number": 3,
      "slugline": "INT. HALLWAY - MINUTES LATER Seth exits the bathroom.   We TRACK with him as he walks down the hall and into the bedroom.   He finds Dave SMOKING A CIGARETTE, post masturbation, chilling out. SETH Still wanna do it? DAVE Nah.   I’m good.  BEGIN PUBLIC REACTION MONTAGE: THE DAILY SHOW - NIGHT 1  JON STEWART At the center of tonight’s story are two figures.   The first, a man named Dave Skylark, who began as just a simple packaging material... OTS IMAGE: A BAG OF STYROFOAM PEANUTS AS DAVE’S HEAD, WITH HIS HAIR AND SMILE PHOTOSHOPPED IN. JON STEWART (CONT’D) ... and by force of unrivaled blandness became host of the wildly popular “Skylark Tonight.”   The second figure is the most mysterious and feared man on the planet, Kim Il-Hwan. OTS IMAGE of KIM.  JON STEWART (CONT'D)  Now when it comes to being interviewed, Kim has his choice of journalists.   He could go Brian Williams or Diane Sawyer, he could go old school and give it to Koppel.   But he goes with Skylark. Evidently because Mario Lopez wasn’t available?  REVEAL that Dave and Seth are watching this in Dave’s office. DAVE Why is he shitting all over me?  THE INTERVIEW   30.  3/15/12",
      "characters": [],
      "action_text": "SETH Well... the election’s over.   He’s probably just desperate for fresh targets.  THE RACHEL MADDOW SHOW - ANOTHER NIGHT  RACHEL MADDOW ... And for those who might be less familiar with Dave Skylark’s style, here’s what it looks like when he interviews bad people: CUE FOOTAGE:   Dave with MICHAEL VICK. DAVE Do you ever wish people would stop saying “That’s the guy who tortured and killed dogs”, and instead say, “That’s the guy who loves French cuisine and mystery novels”?  Reveal Seth and Dave watching in Dave’s office. SETH (winces) Oof.   Yeah.   That was really bad.  RACHEL MADDOW Maybe Dave Skylark will reveal an intellectual depth he’s been hiding all these years.   But for now, the interview promises to be a match-up with the world’s most evil man, and the world’s shallowest.  Dave and Seth are BUMMED.  THE CLUB SCENE - ANOTHER NIGHT  Dave approaches a HOT WOMAN and makes an opening gambit.   She regards him with disgust, turns and walks away, and is quickly snapped up by MARIO LOPEZ.   Dave’s in shock.  SETH’S DRY CLEANER - ANOTHER DAY  Before the KOREAN SHOP OWNER hands Seth his shirts, he stops and addresses Seth, sternly:  THE INTERVIEW   31.  3/15/12 SHOP OWNER When I was five years old, Kim Il- Hwan’s secret police arrested my parents because they had let dust gather on the portrait of Kim that hung in our living room. (choking up) I never saw them again. (starts to SOB) Will you ask him where my mother is?   Will you ask him why I grew up without parents?? At this point, Seth looks DEAD INSIDE.  FOX NEWS - ANOTHER DAY  ANN COULTER It’s a shameless ploy for ratings. Skylark and Rapoport are morally bankrupt. SEAN PENN Ann, for the first time in my life, I can honestly say I agree with you.  Reveal we’re in DAVE’S LIVING ROOM.   Seth clicks off the TV. They’re both SUICIDAL. DAVE How long has this been going on? SETH Thirteen days. (sighs) I think the best we can hope for is an earthquake or an oil spill to knock us out of the news cycle. DAVE (shoves ",
      "dialogue_count": 0,
      "word_count": 1751
    },
    {
      "scene_number": 4,
      "slugline": "INT. CIA OFFICE - DAY Agents Lacey and Gregory are with the DEPUTY DIRECTOR. AGENT LACEY Skylark’s a showman, and he wants it to be a show. DEPUTY DIRECTOR What’s his buddy Rapoport say? AGENT GREGORY He says Skylark’s been completely irrational ever since he found some grey hairs on his head.   It’s all some kind of mid-life crisis thing. The director SIGHS.   Then: DEPUTY DIRECTOR Let’s say we had the funding, is there a plan that achieves the objective and gets them out alive? AGENT LACEY Theoretically.   But their chance of survival drops to about 50 percent. The director rubs his temples in exasperation. DEPUTY DIRECTOR Does Skylark get that this makes him the world’s single biggest living asshole? AGENT GREGORY We imparted that information to him. DEPUTY DIRECTOR What was his response? AGENT GREGORY To paraphrase, “No,   you’re   the asshole.” INT. DAVE’S HOUSE - NIGHT Seth and Dave argue. SETH What does SEAl Team 6 have to do with   us ?!  THE INTERVIEW   39.  3/15/12",
      "characters": [],
      "action_text": "DAVE They   prove   that our military knows how to do this shit now.   That pirate takedown, the Bin Laden raid, Saddam, Ghaddfi - we got them all without the loss of a single American life, and not with some pussy-assed poison strip. SETH We’re not Navy SEALs!   Do you get that? DAVE Yes.   I’m saying we would work   with  guys like that on the mission. SETH There is no mission.   The CIA told us to go fuck ourselves. DAVE They’ll come back to us.   They’re just testing our commitment. (off Seth’s look) Oh, you think the   C.I.A.   doesn’t play mind games? SETH I think they’re genuinely not into wasting taxpayer money and getting you killed.   I think the CIA has actually learned from experience not to take massive risks that could backfire and lead to unspeakable tragedy. We see the HEADLIGHTS of a PHALANX OF VEHICLES pulling up the driveway.   We hear a HELICOPTER. SETH (CONT’D) What the...? POUNDING on the door.   Seth answers.   It’s Agents Lacey and Gregory. DAVE Hey! AGENT LACEY We’ve revised the operation plan to accommodate Mr. Skylark’s request.  THE INTERVIEW   40.  3/15/12 DAVE Are you serious?! AGENT LACEY The new plan requires intensive training and education.   To achieve adequate preparation by D-Day, we’ll need to leave for the training facility in Hertsford, North Carolina.   Tonight. SETH Hold on.   You’re saying you have a plan that allows Dave to   shoot the dictator of North Korea in his own house , and he and I both get out alive? AGENT LACEY Yes.   We have a plan. SETH What’s our estimated chance of survival? AGENT LACEY Ninety-six percent. SETH Oh, come on.   Ninety-six?  AGENT LACEY Ninety.   Six. SETH That’s   nine, six?  DAVE Seth, come on.   She said-- SETH Jesus, Dave!   Hold on!   It’s our  lives   they’re fucking with.   Before I decide on anything, I have the right to get all the facts, and make an informed decision. DAVE You’re right.   That’s fair. SETH Thank you. (then, to Lacey)  Ninety-six ??  THE INTERVIEW   41.  3/15/12 AGENT ",
      "dialogue_count": 0,
      "word_count": 1941
    },
    {
      "scene_number": 5,
      "slugline": "EXT. THE WOODS - LATER Seth and Dave are naked, squatting on a FALLEN LOG, their asses hanging over the back.   They’re drenched in sweat and in AGONY.   Their conversation is interrupted by as much EXPLOSIVE DIARRHEA as can be managed without hurting comedy. DAVE UHHUHUH!   Why couldn’t they have let us do this in a bathroom? SETH No, it’s better without the toilet. UHUHUH!   The propulsive force is too powerful; there would’ve been a splashback situation.   UHUHUHUH! FLIES buzz. DAVE UHHH!   I don’t even understand what could be coming out of me.   It’s gotta be organs.   I gotta look. SETH Do NOT look back there!   You can’t handle it.   Just let it go. DAVE UHHUH! SETH UHUHUH! DAVE UHHH-ARRRGHHHH! Dave and Seth catch their breath for a moment. DAVE (CONT’D) We’re having diarrhea in North Korea. SETH I’m just glad they didn’t shove my throat up my ass. Desperately in need of cheer, they start to GIGGLE DELIRIOUSLY, under the disapproving stares of the guards.  THE INTERVIEW   49.  3/15/12",
      "characters": [],
      "action_text": "INT. VAN - LATE AFTERNOON Seth and Dave are both GHOST WHITE and barely alive from dehydration and poisoning. The van pulls up to a what appears to be an OVERGROWN HEDGEROW.   The driver punches buttons on his dash, and suddenly the hedgerow RETRACTS, revealing a secret driveway. EXT. KIM COMPOUND - LATE AFTERNOON A sprawling complex in the mountains.   With a soft gaze, it is beautiful and peaceful.   With sharper focus, there are camouflaged cameras, watchful guards, hidden sniper emplacements and anti-aircraft batteries. The van pulls up to the MAIN HOUSE.   The guys, who can barley walk or even stand up, are helped out of the van. ORDERLY ROWS of DIGNITARIES, SERVANTS, SOLDIERS and GUARDS line the grand steps.   There appears to be an imminent ceremony... to herald the arrival of Dave and Seth? MILITARY OFFICER (to his troops)  Men, take aim!  Dave and Seth look to each other - what the fuck is going on? DAVE (points) Oh shit! Seth looks: THREE LARGE CANNONS point at them! MILITARY OFFICER  Fire!  DAVE  Ahhhgh!!   SETH  NOOO!!  BOOM!! CONFETTI EXPLODES from the cannons, creating a shower of colorful fluttering paper.   A MARCHING BAND starts up as more confetti explodes. A TROUPE OF ACROBATIC DANCING GIRLS cartwheels onto the landing, executing stunning feats of synchronization and weightlessness to the rhythm of the drums and horns. DAVE This is for us?  THE INTERVIEW   50.  3/15/12 They see A SPECTACULAR MOTORCADE on its way: first, a CONVOY of MOTORCYCLES.   Then, HORSES IN ANCIENT WARRIOR REGALIA. Then, FERRARIS with ROOF-MOUNTED MACHINE GUN TURRETS.   Then the longest SUV STRETCH LIMO you’ve ever seen. Guards open the limo doors and PRESIDENT KIM STEPS OUT.   He majestically waves to his weeping, applauding subjects. DAVE (CONT’D) (sotto to Seth) This is the welcome he gets for showing up at his country house? SETH He’s the   boss .   It’s the welcome he gives   himself . A magnificent TRUMPET FANFARE plays as Kim parades right past Seth and Dave - no ackno",
      "dialogue_count": 0,
      "word_count": 800
    },
    {
      "scene_number": 6,
      "slugline": "INT. SETH’S GUEST ROOM - NIGHT Seth changes into ALL-BLACK CLOTHING in preparation for NIGHT STALKING.   Meanwhile, Dave scans the outside with low- profile, futuristic NIGHT VISION DEVICES. SETH How’s the weather for me out there? DAVE I’m counting seventeen sharpshooters. SETH What?   That is   so   way   more than the estimates.   What the fuck?! DAVE Christ, can you imagine if they all fired on you at once?   Your body would look like clam chowder. Seth looks at Dave in outrage. DAVE (CONT’D) Shit.   Sorry.   Not helpful. (then) Look, this is silly.   It was   my  idea.   It should be me out there risking my ass.   I’ll retrieve the bullet. SETH No.   If something goes wrong and you get hurt or killed, this thing is over.   And if it’s over, Kim lives, the world’s fucked and my entire life amounts to a pile of beaver shit. A BEEP.   Seth looks at his MISSION WATCH.   An ordinary looking watch until Seth flips the LID up to reveal a HIGH- TECH COMMUNICATIONS SCREEN.   It reads “135.1025.” SETH (CONT’D) (growing anxiety) JSOC confirm code.   They’re clear to launch the bullet.   They’re waiting on coordinates from us. DAVE Don’t spiral.   Just fall back on the training.  THE INTERVIEW   53.  3/15/12",
      "characters": [],
      "action_text": "While Seth collects himself, Dave pulls out a CAMERA BATTERY- LIKE DEVICE secreted in a FLASHLIGHT. DAVE (CONT’D) I’ll get the locator beacon deep into the field.   Remember: threats don’t emanate from the middle of a meadow 100 yards inside a walled compound.   There’s no moon, (re: night vision device) and the snipers don’t have   these . So as long as you stay low, move slow, and keep quiet, you should be good.   Cool? Seth gives a semi-convincing thumbs up. Dave goes to the window and HURLS THE BEACON.   It’s an awesome, athletic throw.   It lands somewhere in the DARKNESS. SETH Nice toss. DAVE Move out.   I got you covered. Dave pulls the NIGHT VISION GLASSES back over his eyes. Seth, looking BUMMED AS SHIT, gingerly steps outside, DROPS TO HIS BELLY, CRAWLS THROUGH GRASS in short bursts, sniper- style, and disappears into the moonless void. From hereon, Dave and Seth communicate via their WRISTWATCHES AND EARPIECES. From the safety of the room Dave alternates his scan via night vision: he observes the guards, then observes Seth’s movements, back and forth, making sure Seth heads in the right direction, and that guards do not detect Seth. DAVE (CONT’D) You’re clear, move. Seth crawls a few feet into the field.   Dave scans the guard activity again - they are not observing. DAVE (CONT’D) Clear.   Move. Seth moves a few feet forward. SETH I can’t see a fucking thing out here.   This sucks.  THE INTERVIEW   54.  3/15/12 DAVE I’m your eyes.   Just go straight ahead.   Clear.   Move. Seth crawls a few feet more. DAVE (CONT’D) Okay, hold your position.   You’re 20 yards from the landing site. You don’t wanna get hit. SETH How much longer? Dave checks his watch.   It reads 00:00:55. DAVE Less than a minute.   Stand by. Dave notices a CREATURE enter his field of vision.   The creature is MOVING TOWARD SETH. DAVE (CONT’D) Shit. (to Seth) Buddy, you’re not alone. SETH I’m not??   Who’s there?? Dave gets a better look: it’s a SIBERIAN TIGER.   (They are rare but indigenou",
      "dialogue_count": 0,
      "word_count": 2244
    },
    {
      "scene_number": 7,
      "slugline": "INT. TANK FIGHTING COMPARTMENT - SAME The MUSIC is blasting.   Dave is driving and having a ball. KIM Fire in the hole! EXT. FIELD - SAME KA-BOOM!! A GLOWING TRACER ROUND shoots out of the tank and EXPLODES on the distant mountain face. The tank barrels across the acres as the guys HOOT and HOLLER.   Security runs alongside trying to keep up.   The tank FIRES another round.   KA-BOOM!! EXT. FIELD - DAY Kim and Dave struggle to climb out of the tank.   They are now BLASTED, swigging from fifth of Johnny Walker and LAUGHING their ass off. Suddenly Dave REACHES for KIM’S HEAD.   The nearby Guards become alarmed and move in. Dave PLUCKS A GRAY HAIR off Kim’s head. BODYGUARD Stop!! Dave spins around to see TWO RIFLES pointed at him. DAVE Oh my god, I’m sorry!   It’s... it’s just a reflex lately. Dave shows the gray hair to Kim.   Kim begins to LAUGH. KIM All morning, I have wanted to do this: Kim reaches out and PLUCKS ONE OF DAVE’S GRAY HAIRS.   He shows it to Dave.   The two of them LAUGH. KIM (CONT'D) Mine started a year ago. DAVE Two months ago for me.   I’m so bummed.  THE INTERVIEW   65.  3/15/12  (MORE)",
      "characters": [],
      "action_text": "It’s like - this shit has to start  now ?   Just when I’m feeling   vital ? KIM It’s a peculiar precondition of existence: at the moment we master life, we fail to enjoy it because death reveals to us its intention. DAVE Yes!   Exactly!   That’s so genius. They both take another swig of Johnny Walker.   Kim leans in, and confides to Dave, quietly so the guards don’t hear: KIM (sotto) But I still get   so much pussy . DAVE I cannot even imagine. KIM I bet you do well, too. DAVE Oh, I do.   But it’s gotta be  nothing   compared to you.   I mean - you’re the fucking   man!  KIM You know Sook - my communications director? DAVE She is ri-DICULOUS.   You hit   that??  KIM She is like a wild animal. Dave drops to his knees and starts mock worshipping. Kim turns to his guards and motions them to beat it.   They look displeased, but Kim motions them, this time visibly losing patience.   They exit.   Kim BECKONS Dave somewhere... INT. UNDERGROUND DEPOT - DAY A hangar warehousing INTERCONTINENTAL BALLISTIC MISSILES. Dave stares at them in drunken awe.  THE INTERVIEW   66.  3/15/12  DAVE (CONT'D) DAVE Holy... Are those the nukes? (off Kim’s nod) Why are you showing me these? Kim considers, then: KIM Because they are awesome and I’m drunk off my fucking asshole! Dave LAUGHS.   Kim suddenly becomes serious: KIM (CONT’D) I never intended to use them on the west.   I acquired them only to make  my   nation safer and stronger. DAVE I hear you.   I do. KIM Many of my closest colleagues criticized me for it.   They said the nukes only make us a bigger  target   for the west.   They say I’m  endangering   North Korea.   They call me stupid and   incompetent . DAVE God, that’s   just   like when I told everybody we got an interview with you.   One minute America loves me, the next they’re all calling me an idiot!   And why?   Because I’m trying to do something cool?   To take my game up a notch? KIM That’s how it is for men like us. With great power comes loneliness. (laughs) Is it any ",
      "dialogue_count": 0,
      "word_count": 1157
    },
    {
      "scene_number": 8,
      "slugline": "EXT. FIELD - SAME Seth, naked (or in underwear) roams the field under the watchful eyes of the guards - who are loving this - trying not to appear as if he’s searching for a recoil spring.   He SEES IT IN THE GRASS. He nonchalantly sits down.   Under the still watchful eyes of the guards, he furtively grabs the spring, and starts shoving it in the only hiding place he’s got. SETH (muttering through agony) Motherfucking... INT. SETH’S GUEST ROOM - LATER Dave enters, looking spent but blissful.   Seth’s assembling THE GUN - it’s close to done. DAVE Hey, man.   How’s your day been? SETH Oh, it’s been wonderful.   Travel really changes your perspective. For example, I’ve learned that North Koreans completely fucking hate us. Dave HICCUPS.   Seth looks at him. SETH (CONT’D) Have you been drinking? DAVE Not-- you know, not especially. SETH (whatever) On a happier note, I planted the SSBM’s and teargas pellets, so we’re good for tomorrow.   Which I’m really looking forward to. DAVE Yeah. (then) It’s weird, though.   I do kinda wonder if this is the right thing. A beat.  THE INTERVIEW   71.  3/15/12",
      "characters": [],
      "action_text": "SETH You do? DAVE Well, if you think about it, overthrowing foreign governments hasn’t always worked out so well for America.   President Kim told me this great quote from Marx: “History repeats itself, first as tragedy, second as farce.” Seth stops what he’s doing and looks at Dave. SETH You’re quoting Marx now?   Somewhere between breakfast and lunch you became a Communist? DAVE No.   I’m just saying, it’s a good-- SETH Do you understand that this guy is a   master   at manipulating the media? DAVE Maybe the media’s manipulated him. SETH Huh? DAVE I’m just saying, no one in the media has ever spent   time   with the guy.   I   have .   It’s possible that they’ve portrayed him unfairly. SETH Let me get this straight: after 38 years on earth, you get a moral conscience, and it tells you to spare the life of   this   asshole? DAVE I’m just thinking, okay?   I’m sympathetic to people who get trashed by the media.   Look at what we just went through.   It sucked. SETH Not as much as what happened to the people of Yonghung.   Ask them how they feel about your buddy, Kim.  THE INTERVIEW   72.  3/15/12 DAVE Younghung?   What’s Yonghung? SNAP.   Seth has locked the two assembled components of the gun together.   The GUN IS NOW COMPLETE. SETH Here it is, Dave.   The billion dollar gun you requested. Dave suddenly looks HAUNTED. A KNOCK on the door scares the shit out of them. GUARD #1 (O.S.) Your attendance is required in the screening room. Seth scrambles to hide incriminating evidence. DAVE Uh, screening?   What’s this about? GUARD #1 (O.S.) You are required to view a film about cultural and educational achievements of The Worker’s Party of North Korea. Seth WINCES... INT. SCREENING ROOM - DAY Seth and Dave are the only audience members in a large screening room, watching an obnoxious propaganda film: a montage of Kim being triumphant and glorious in a variety of activities.  NARRATOR (V.O.) Our Beloved Leader is one of the world’s most accomplished artists. Moreover, he ",
      "dialogue_count": 0,
      "word_count": 1752
    },
    {
      "scene_number": 9,
      "slugline": "INT. PYONGYANG RESTAURANT - DAY Seth and Sook drink beer and talk. SETH I’m not asking for state secrets, just a taste of humanity.   Just tell me how you got the job.   Do that, and I’ll tell you   everything  about Dave Skylark.   I’ll sell him out like his worst enemy. Seth’s charm has penetrated. SOOK My family is in the lowest social ranking in North Korea. SETH They call it “The Hostile Class”, right? SOOK Yes.   This means that there is no possibility of advancement.   I knew from the time I could speak that my life would be spent in a factory. SETH What kind of factory? SOOK The factory in my village made uniforms. SETH Uniforms for what kind of work? A beat. SOOK Factory work. SETH So... you would have worn a uniform in a factory where you manufactured uniforms for people to wear in factories? SOOK Yes.  THE INTERVIEW   80.  3/15/12",
      "characters": [],
      "action_text": "SETH I guess after the first few weeks you would’ve stopped appreciating the irony. SOOK One day, officials from the Workers Party came to my classroom on a search for young women to serve on the personal staff of Kim Il-Hwan. They selected me.   It was a great honor.   Over the years, I became close with the president.   He is a charming man.   He changed my life, he changed my destiny. SETH Yeah.   I’ve sorta got a guy like that in my life. SOOK You’ve been with Mr. Skylark a long time. SETH He’s a hard man to leave. SOOK But you did try.   In 2005 you took a job with the Washington Post. You lasted five months. SETH You really do your homework.   Yeah. I saw myself as a more serious journalist.   Just like you’d guessed about me.   God, you’re smart. Sook blushes, and bashfully looks away.   She’s adorable when she’s vulnerable. SETH (CONT’D) The problem is, serious journalists get treated like serious shit. SOOK Or perhaps you just have difficulty with authority? SETH I... I don’t think that’s true. Dave and I get along great.  THE INTERVIEW   81.  3/15/12 SOOK And who in that relationship is really the boss? SETH Well... SOOK Perhaps at the Washington Post, you were truly an   employee.   You were required to   prove   yourself, whereas at “Skylark Tonight” you are the master. Seth shakes his head.   She’s totally got his number. SETH Come to the States.   You can charge by the hour for this kind of stuff. INT. DAVE’S GUEST ROOM - DAY Dave lies in bed, looking haunted.   Finally he sits up.   He flips the lid on his mission watch, and presses a button. DAVE This is Triple Axle, does anyone copy? INT. JSOC COMMAND HEADQUARTERS - SAME Looks like the NASA mission control center.   Banks of monitors, UNIFORMED MEN with headsets. AGENT LACEY This is Loading Bay.   You’re coming in five by five. DAVE Listen, I’m sorry to do this but... I just wanted to let you know this is a code 13. AGENT LACEY (alarmed) Please repeat. DAVE Code 13. By now, JSOC operators of varying",
      "dialogue_count": 0,
      "word_count": 1121
    },
    {
      "scene_number": 10,
      "slugline": "INT. PRIVATE DINING ROOM - NIGHT Kim, Dave, and just a few of Kim’s TOP GENERALS dine at a small table.   Kim is DRINKING HEAVILY.   Dave, seated next to Kim, gets MURDEROUS STARES from the other men. DAVE (sotto to Kim) I’m just doublechecking: are you  sure   it makes sense for me to be here at the table?   Maybe it’s not the most approp-- KIM I am in great pain, Dave.   Your presence is of comfort to me. DAVE That’s so flattering.   But I think maybe the other guys don’t feel-- Kim begins to WEEP. KIM (to everyone) I loved them like sons!   To watch them die so painfully, so needlessly... (SOBBING) My heart will never heal! As Kim WEEPS, everyone else STARES DAGGERS at Dave. DAVE (to all) Again, I’d like to say that I’m just   incredibly   sorry about the role I might have played in the... the injuries that transpired.   It was very much an accident - I tripped.   I mean if you don’t believe me, just look at the scrape on my knee.   It actually hurts quite a bit, and-- A SERVANT subtly taps Dave, a suggestion to drop it. KIM They possessed the finest trait men can have: loyalty.   Without loyalty, a great man achieves nothing.   Without loyalty, a country is just a lawless jungle.  THE INTERVIEW   86.  3/15/12",
      "characters": [],
      "action_text": "The generals all TOAST.   Kim grows dark and angry. KIM (CONT'D) It is a cosmic farce, that two such noble men must die, when so many traitors live.   The defectors, the South Korean capitalists, the people in this country who doubt my benevolence!   These people - if horrible fates befall them, it is no tragedy, (pounding his fist) because they deserve no humanity!! Dave begins to look freaked. KIM (CONT’D) Those treasonous jackals in Yonghung!   I regret only that I showed them too much mercy! Dave has a flash of recognition at this word, “Yonghung.” KIM (CONT'D) Damn the weakness of my courage! To those who seek to undermine me, at home and abroad, I must never respond with less than the totality of my strength and power! GENERAL JONG  Mr. President, I remind you the American is in our presence.  Kim nods, and collects himself. KIM Mr. Skylark, I apologize for my indecorousness.   I hope you understand what a difficult day it has been. DAVE Of course, Mr. President. (getting up) Would you excuse me for nature’s sake? INT. BATHROOM, PRIVATE RESIDENCE - NIGHT Kim’s private bathroom.   Dave sits on the toilet and collects himself.   He notices a TOUCH SCREEN MONITOR on the wall.  THE INTERVIEW   87.  3/15/12 It’s an internet browser, though currently set to the Korean alphabet.   He taps a GOOGLE icon in the corner.   Mostly Korean characters, but there is one hyperlink for “English.” Dave navigates to WIKIPEDIA.   Then to YONGHUNG.   The entry reads:   “Former Village in North Korea.   In 1983, its entire population was exterminated by a sarin gas attack on the orders of President Kim Il-Hwan, in response to a public demonstration of anger over the price of rice.”  DAVE (spiraling into despair) I’m such an idiot... INT. DAVE’S GUEST ROOM - NIGHT Dave sits in a chair, clutching the PISTOL, and looking freaked.   He hears A DOOR SLAM - Seth must finally be back. INT. HALLWAY - MOMENTS LATER Dave tries Seth’s door - it’s locked.   He knocks softly.   No no answer.   H",
      "dialogue_count": 0,
      "word_count": 1486
    },
    {
      "scene_number": 11,
      "slugline": "INT. DAVE’S GUEST ROOM - DAY Dave goes over his list of questions one last time. SETH Remember, you’re doing what you always do.   What you do better than  anyone .   Find the weak spot, and push on it ‘til he cracks. DAVE I’m all set, man.   I feel good. I’m gonna get this sonofabitch. SETH Hell yeah, you are. DAVE You think we’ll die? SETH If we do, we will have had more fun, and done more good than most people do in a lifetime. DAVE I’m glad you were dumb enough to hitch your wagon to my star. SETH Me too. KNOCK KNOCK. PRODUCER (O.S.) Mr. Skylark, five minute warning. DAVE I just have one question. SETH Anything, buddy. DAVE You and Sook were gone for 45 minutes last night.   You hit that? SETH Yeah.   I did. DAVE And how did it feel?  THE INTERVIEW   94.  3/15/12",
      "characters": [],
      "action_text": "SETH Really, really good.   Especially right at the end. DAVE Right?   God, how insanely good does sex feel? SETH Yeah. (then) But something about it with her feels different than anyone I’ve been with before. DAVE You mean because she’s... SETH Don’t make me ashamed to be an American right now, okay? INT. INTERVIEW SET - DAY Dave sits in his chair, nervous.   He checks his questions once more.   It’s quiet... BOOM.   The stage door flings open.   President Kim enters grandly. KIM Mr. Skylark!   Are you ready to share with the world that beaming white smile of yours? DAVE I am, Mr. President. As STAGE HANDS descend upon them, affixing lav mics, makeup, Kim hands Dave a PRESENT. KIM For you. DAVE What?...   What is this? He opens the present...   It’s a DIAMOND ENCRUSTED PEARL- INLAID FRAMED PHOTO of Dave and Kim, their heads popping out of the tank, ecstatic with laughter.  THE INTERVIEW   95.  3/15/12 DAVE (CONT’D) (blown away) Whoa...   Mr. President, I-- He sees that Kim’s EYES ARE MOIST with emotion. KIM My life is lonely, Dave.   So much of it is devoted to struggle.   It warms my heart to know that somewhere in the world is a friend with whom I can enjoy life’s pleasures. DAVE (re: gift) I... this is just so   beautiful . INT. CONTROL ROOM - SAME Seth and Sook (and the control room staff) watch this emotional exchange between Dave and Kim on the monitor. SETH (disgusted, sotto) Crap, there might not be enough time for the two of them to   fuck  before we go live. INT. NBC NEWS BROADCAST CONTROL ROOM - DAY BROADCAST CONTROLLER #2 Ten seconds out!   Countdown!   Ten, nine, eight, seven, six... INT. COMPOUND CONTROL ROOM - SAME CONTROLLER  Five, four, three, two...  DAVE IS LIVE, ACROSS PLANET EARTH. DAVE Good evening and good morning to our viewers across the world. INT. NORTH KOREAN PEASANT HOME - SAME A poor North Korean family is gathered around the TV set, which sits just below their FRAMED PORTRAIT OF KIM.  THE INTERVIEW   96.  3/15/12 DAVE (CLOSE CAPTIONED",
      "dialogue_count": 0,
      "word_count": 1045
    },
    {
      "scene_number": 12,
      "slugline": "INT. COMPOUND HALLWAY - SAME TEAR GAS quickly fills the air.   GUARDS DOUBLE OVER. INT. ANOTHER HALLWAY - SAME The General, Lieutenant and other personnel charge into the hall, only to choke on CLOUDS OF GAS.   The Lieutenant manages to punch a PANIC BUTTON on the wall... INT. COMPOUND CONTROL ROOM - SAME Seth’s got the gun trained on everyone, unsure of his next move.  DAVE So you believe cardio to be of greater importance than strength training and flexibility?  SOOK Seth, we need to get Dave to-- SETH Yeah, I know.   Uh... Okay... Seth hands Sook the pistol. SETH (CONT’D) I’ll be right back. Sook keeps the pistol trained on the others.   Seth DONS HIS GAS MASK, then charges out into the hall. INT. HALLWAY - CONTINUOUS Seth charges through the GAS CLOUDS and leaps over INCAPACITATED PERSONNEL, and makes his way to the studio doors.   He pulls off his gas mask and tucks it away, then enters the studio. INT. INTERVIEW SET - CONTINUOUS Seth charges onto the set, coughing from the brief gas exposure, and INTERRUPTS THE LIVE INTERVIEW. DAVE Dude!   What the hell??  THE INTERVIEW   100.  3/15/12",
      "characters": [],
      "action_text": "SETH Sorry, guys.   We’re having an issue with Dave’s mic, it’ll just be a moment. Dave steps off camera with Seth.   Seth flips the switch on Dave’s mic pack to OFF, then whispers: SETH (CONT’D) What the   fuck   are you doing?! DAVE What am   I   doing?! SETH You’ve got your tongue so far up his ass you can taste his breakfast!   And why?   Cause he gave you a widdle pwesent? DAVE No.   Fuck that mass-murdering asshole!   I’m just softening him up.   Then out of nowhere I’m gonna sucker punch him.   It’s gonna be rad. SETH So this is all just...   theatrics ? DAVE Yes.   It’s the biggest moment of my career.   It’s gotta be   EPIC!  SETH You’ve gotta be fucking kidding me. DAVE Really?   God, Seth, the fact that this shocks you - at this point in our relationship?   It shocks   me.  SETH Dave.   We’re dead.   They know everything.   I detonated the tear gas, but it’s not gonna keep them out for long. DAVE Fuck.  THE INTERVIEW   101.  3/15/12 SETH Yeah.   So can you skip the dramatic prelude and get to the one thing that might redeem us in the eyes of god before we meet him? As Seth runs out, he PRESSES THE LOCK BUTTON on the studio door securing it behind him.   Dave resumes his seat with Kim. INT. COMPOUND CONTROL ROOM - SAME Seth runs back in and removes his gas mask.   Sook still has the gun trained on the staff.  DAVE Mr. President... in your remarks to the world-wide media, you have denied that there is currently a state of famine in North Korea. With all North Korean citizens watching us now, do you still deny that your people are hungry?  Kim is completely thrown. KIM This... this is a strange question. DAVE I’m simply asking for a definitive statement: does a condition of famine exist in your country? INT. MSNBC CONTROL ROOM - SAME RACHEL MADDOW Whoa! INT. COMPOUND CONTROL ROOM - SAME Seth, Sook (and the others) wait with baited breath for Kim’s answer...  KIM No. DAVE (thrown) Um... No?   Just... no?  THE INTERVIEW   102.  3/15/12 KIM Famine is a state of",
      "dialogue_count": 0,
      "word_count": 756
    },
    {
      "scene_number": 13,
      "slugline": "INT. COMPOUND CONTROL ROOM - SAME BOOM!   BOOM!   Someone is trying to RAM down the door.   Seth and Sook look to each other - what the fuck do they do now? INT. HALLWAY - SAME Two GUARDS enabled by GAS MASKS are RAMMING at the door. INT. INTERVIEW SET - SAME DAVE Mr. President, what we “agreed” is that I would ask you a list of questions that you wrote yourself. KIM Be that as it may, that plan has evidently been abandoned.   But I am not afraid of the truth.   So go ahead.   Ask me anything. INT. COMPOUND CONTROL ROOM - SAME The guards keep ramming.   Seth gets an idea: right after a “ram”, he gingerly unbolts the door.   The guards who have already set in motion their next ram come TUMBLING INTO THE ROOM AND FALL FLAT ON THEIR FACES.   Before they can get up, Sook GRABS A LARGE, HEAVY KIM PORTRAIT FROM THE WALL and SMASHES IT OVER A GUARD’S HEAD.   Seth pounces and GRABS a GUN from one of them.   He and Sook are now both armed.  DAVE Very well, Mr. President.   My next question to pertains to remarks you recently made in private. KIM In... private?  SOOK  Roll tape!  CONTROLLER  Tape?   No one said anything about videotape.  SETH (aiming the gun) Press.   Play.  THE INTERVIEW   104.  3/15/12",
      "characters": [],
      "action_text": "The controller reluctantly hits play: VIDEO:   It’s grainy footage from the personal presidential archive of KIM IN A MEETING WITH HIS AIDES. KIM Do not speak to me of hunger in the villages!   These people mean nothing!   They are not human!   I will not weaken our national defense to save a few hundred thousand decrepit old chicken farmers, when they no longer even have chickens!   Let them die! Prune the weak branches!  INT. NORTH KOREAN PEASANT HOME - SAME The peasants are in COMPLETE SHOCK.   This can’t be happening. BACK TO STUDIO Kim is now perspiring and trembling. KIM Someone within my government has betrayed me.   No doubt the result of coercion by someone in   yours . Kim looks up to the control room for guidance from Sook. Sook quickly LOWERS HER WEAPON, gives another smile and thumbs up, and gestures to “Keep going!” One of the prone guards takes the opportunity with Sook’s lowered weapon to KICK IT OUT OF HER HANDS.   A massive struggle between Seth, Sook and the guards.   BANG!   A gun accidentally DISCHARGES.   Bullets RICOCHET off the wall getting one guard in the KNEE.   BLOOD SPATTERS onto the control room window (visible from the stage).   Dave sees the blood spatter but does his best to ignore it. DAVE Mr. President, in January, the United Nations shipped your country a billion dollars in emergency food rations.   A British intelligence report shows that the rations were sold and the proceeds diverted to North Korea's nuclear weapons program.   Are nuclear weapons a higher priority for you than your people’s nourishment?  THE INTERVIEW   105.  3/15/12 KIM You are exploiting my people’s ignorance for your own glory! DAVE Your people’s “ignorance”? KIM I... You... The North Korean people do not understand how governments work!   They are not ready to comprehend the complexities of maintaining a strong state! DAVE You’re saying the North Korean people are like children? INT. ANOTHER NORTH KOREAN PEASANT HOME - SAME MORE PEASANTS are outraged, and b",
      "dialogue_count": 0,
      "word_count": 848
    },
    {
      "scene_number": 14,
      "slugline": "INT. HALLWAY - DAY Spotting each other as the only masked ones in a haze of tear gas, Seth, Dave and Sook, rendezvous.   Sook leads them bounding over the strewn, suffering compound personnel. EXT. COMPOUND - DAY Sook, Seth and Dave make it outside and whip off their masks. They start to charge for the mountains when-- SETH (points) Shit! A MASSIVE CONVOY OF NORTH KOREAN MILITARY VEHICLES heading their way.   There must be thousands of men. SETH (CONT’D) We’re too late!   We’ll never blow past that! DAVE I know what we can do. EXT. HANGAR - MOMENTS LATER They stand before the TANK. SETH Are you serious? DAVE I know how to drive it. INT. TANK FIGHTING COMPARMENT - MOMENTS LATER Sook, Dave and Seth are squeezed in.   Dave POWERS UP the tank.   John Mellencamp’s “AUTHORITY SONG” starts blasting. SETH What the hell is with that? EXT. HANGAR - CONTINUOUS The tank ROARS OUT OF THE HANGAR, and across the property. Kim’s forces are taken by surprise.   They run for cover as the tank BARRELS ACROSS THE PROPERTY.  THE INTERVIEW   108.  3/15/12",
      "characters": [],
      "action_text": "SETH (O.C.) Dude!   Can we kill the Mellencamp? DAVE (O.C.) I gotta focus on the road!   You deal! SETH (O.S.) Is it this red button?! DAVE (O.S.) NO! That’s the-- BOOM!   The tank FIRES A ROUND AS IT CRASHES THROUGH THE PERIMETER WALLS and roars down the road. INT. MOUNTAIN FOREST - LATER Seth, Sook and Dave, are deep in the wilderness, seemingly safe for the moment.   The tank is ditched. SETH (checks his mission watch) Still no response.   I don’t know how far the extraction team is. Dave CRINGES. SETH (CONT’D) What’s up? DAVE Uh, listen.   Don’t get mad or anything, but I might’ve made a little goof. Seth and Sook look at Dave with dread. DAVE (CONT’D) After the incident with the guards, I got all tweaked and... I told JSOC we were aborting the mission. SOOK You can’t be serious.   SETH Oh my god. DAVE (CONT’D) I was just trying to be considerate and not waste their time! (then) Anyway, they were upset.  THE INTERVIEW   109.  3/15/12 SETH “Upset”?   We wasted a month of their lives and a billion dollars. Why would you inform them of that  before   they sent our rescue team? DAVE My head was all foofy.   I’d been through a very emotionally wrenching experience. SOOK So there’s no rescue team to get us out of the country? SETH You stupid, fuck-brained, asswipe-- DAVE Hey!   Did I not just kick serious ass in there?   I’ve gone through a  shitload   of personal growth in the past two days.   So I think I can be forgiven for forgetting some stuff. Now let’s just-- The sounds of MULTIPLE ENEMY HELICOPTERS DAVE (CONT’D) (shouts over the noise) -- SO LET’S JUST TAKE INTO ACCOUNT THE TOTALITY OF MY CONTRIBUTIONS, AND NOT GIVE INTO KNEE-JERK ANGER ABOUT MY... INT. COMPOUND HOLDING CELL - NIGHT Sook, Dave and Seth are detained in a grim cell with a window overlooking the compound.   Seth hands Sook a SUICIDE PILL. SETH And here’s one for you. SOOK Thank you. SETH If   Kim   had died by poison as in the original plan, it would have prevented   us   from having to.  THE INT",
      "dialogue_count": 0,
      "word_count": 2151
    },
    {
      "scene_number": 15,
      "slugline": "INT. SETH’S OFFICE - LATER DAVE How am I gonna survive without you? SETH There’s 1,000 guys who can do my job.   Most with a better attitude. DAVE I mean the rest of life.   Who am I gonna party with?   I’m gonna miss you so much, I can’t even take it. SETH I’m gonna miss you too, man. DAVE Can I just tell you how awesome your new girlfriend is?   You gotta see the present she brought me... EXT. SKYLARK STUDIOS - SUNSET In the parking lot sits... KIM’S WORLD WAR II TANK. SETH Is that...? DAVE Fuck yeah. EXT. 101 FREEWAY - SUNSET The tank ROLLS UP THE FREEWAY, flanked by a MOTORCYCLE POLICE ESCORT.   It’s a rolling party.   PARTIERS hang out on the decks and turret.   Mellencamp’s “Authority Song” blasts. Dave, Seth, Sook, and Agent Lacey protrude from the hatch, all holding bottles of champagne, having a ball. FADE OUT. THE END   *  THE INTERVIEW   119.  3/15/12",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 160
    }
  ]
}