{
  "slug": "the-outsider-101-fish-in-a-barrel-2020",
  "title": "the outsider 101 fish in a barrel",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 10884,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. THE “BOX”, DETECTIVE SQUAD ROOM, FLINT CITY PD - CONTINUOUS RALPH Don’t be. You did the smart thing. [beat] Did you get a look at him? [off Ritz’s downcast head shake] How about the vehicle.. RITZ I’m pretty sure it was that same van from the lot. [beat, then...] Could I ask you a question? RALPH Of course. RITZ How did the police get there so fast? RALPH [gently] Mister Ritz, you called us. RITZ [dazed, traumatised] I did? INT. DINING ROOM, MAITLAND FAMILY HOME, FLINT CITY - SATURDAY MORNING, JULY 14TH [FOUR DAYS AFTER THE MURDER]  MERCY MAITLAND , 36, [attractive, lively, part-time realtor] pours juice for her two daughters,   SARAH,   8, and   GRACE,   6. The girls are wearing matching baseball jerseys,   GOLDEN DRAGONS   scripted across the front.  TERRY MAITLAND,   38, [steady hand, cool head, energetic in a low key way] wearing his own Dragons jersey, enters from the kitchen bearing a large platter of   red and green   pancakes. TERRY Game day breakfast special. Get ‘em while they’re weird. As Terry passes the platter around.. SARAH [ excited, but..] Dad, you said you were going to make purple today! 7.",
      "characters": [],
      "action_text": "TERRY [pouring syrup] Ran out of blue food coloring. [beat] Red and blue make purple. GRACE Yellow and red make orange. MERCY What I’ll never understand is how blue and yellow make green. It just doesn’t make any sense. TERRY [ as they eat, casually] So who’s going to win today? GRACE Dragons. TERRY Think so? GRACE Yah. SARAH If two teams both pray before a game, who does God pick? MERCY He doesn’t. TERRY Unless it’s Oklahoma Nebraska. In that case.. [off Marcy’s warning look] SARAH Then why do they pray? MERCY [to her husband] Your turn. TERRY Because it helps them want to play at their very best no matter the outcome. [beat] Pass the syrup? 8.",
      "dialogue_count": 0,
      "word_count": 312
    },
    {
      "scene_number": 2,
      "slugline": "INT. BEDROOM, ANDERSON HOME, FLINT CITY - SAME JULY 14TH Ralph sits on the edge of the bed. His wife,   JEANNIE,   40, stands in the doorway, her face drawn. Despite its adolescent clutter, the room feels terribly empty. It’s just how their 16 year old son   DEREK   had left it on the day he went into the hospital for the last time two years earlier. RALPH’S POV - A framed photo of   DEREK   AT 12 ,   sliding into home during a little league game, Ralph in the b.g; with his arms in the air. RALPH That monster had Derek under his wing for two years. And how many times did we let that kid get in a car with him? Half the time we even waved goodbye. JEANNIE Ralph. Derek had cancer. This man had nothing to do with it. You go arrest him for what he’s done. Ignoring that, Ralph rises, adjusts the Glock-19 on his hip. As he reaches for his sport jacket.. RALPH [seething] All I can say is I hope to God he resists. EXT. BALLFIELD, FLINT CITY STADIUM - MID-MORNING Capacity 1500 seats although the stands are empty. Banner stretched on top of the scoreboard:   Flint County Little League Tournament of Champions. Go Dragons!  On the field, the   FLINT CITY DRAGONS , [ages 10 to 12] are going through a pre-game drill,   BOBBY GAVIN   42, their Assistant Coach spraying sharp grounders around the infield. GAVIN [ shouting to the shortstop] What did I say about dropping a knee on those Eric? ANGLE - THE DUGOUT - Head coach Terry Maitland working on his line up card. 9.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 273
    },
    {
      "scene_number": 3,
      "slugline": "INT. FLINT COUNTY DISTRICT ATTORNEYS OFFICE, - SAME [MORNING] COUNTY D.A.   BILL SAMUELS,   35, [young looking for the job, an aggressive, politically minded prosecutor] hands Ralph an arrest warrant. SAMUELS Go get ‘em, cowboy. ON RALPH - Doesn’t care for the DA’s flip cheerfulness.. INT/EXT. UNMARKED POLICE CAR, MUNICIPAL BLDG LOT- CONTINUOUS Two uniformed cops,   TROY RAMAGE, [ 37, seasoned vet ]   and   TOM YATES, [ 28, three years on the job] sitting in the front, waiting for... RALPH [sliding in back] Let’s do it. ANGLE - THE CAR - Rolling through the streets of the city. FLASHBACK TO - EXT. PETERSON HOME, BILLINGS STREET, FLINT CITY - JULY 10TH, EVENING OF THE MURDER Ralph and Tomika Collins at the door taking a beat to brace themselves before delivering the catastrophic news to the family. Frank’s older brother   OLLIE,   15, [ a moody stoner/ skateboarder/ landlocked surf bum ] answers the bell. He looks so much like his dead brother -   that same bright shock of red hair   - that the detectives reflexively take a step back. OLLIE [blaring into the house,]  Ma!   It’s the cops! As   ARLENE PETERSON,   44, [good-natured, obese] comes to the door, Ollie drifts away. ARLENE [wryly] I sure hope this isn’t about those overdue library books... ON TOMIKA and RALPH - bracing to tell her. ANGLE - BILLINGS STREET, sleepy residential, the hooting of quails in the redbud trees the only sounds to be heard. 10.",
      "characters": [],
      "action_text": "Hold for a silent beat, then Arlene Peterson’s [OS]   wail of grief   launches the roosting birds into the stratosphere. FLASHBACK TO: INT. HOME OF MRS. LIBBY STANHOPE, FLINT CITY, JULY 11 - [DAY AFTER THE MURDER] - AFTERNOON Ralph sits across from Libby Stanhope [64, J.H.S. teacher] at her dining table, a tape recorder between them. STANHOPE What would make someone do such a thing? RALPH Right now I don’t know any better than you do, Libby. Just tell me what you saw on the afternoon of July 10th. STANHOPE I was coming out of Gerald’s with my groceries..He’s more expensive than Kroger’s but he’s close to me and after my last accident I gave up my driver’s license.. RALPH This was about three o’clock you said? STANHOPE Exactly three. I heard the clock tower chimes just as I was leaving. And, I saw the Peterson boy. You know, I had his older brother Ollie in my class three years ago... Frankie would’ve been my student too next year, if... FLASH TO: EXT. GERALD’S GROCERY STORE, FLINT CITY - 3:00 PM, JULY 10TH. MRS STANHOPE’S POV - Frank Peterson, day of his murder, his floridly red hair peeking out from under his ball cap as he walks his gear-chain-dragging bike towards the store.. RALPH [V.O] What was he wearing? 11. STANHOPE [V.O] You know, just boy clothes. Blue jeans, tee shirt, ball cap.. FLASH TO: INT. STATE POLICE EVIDENCE LAB   - SAME CLOSE ON - THOSE SAME CLOTHES, now torn, stained and bloody carefully bagged then placed in separate evidence bins. RALPH [V.O] What did you see next? EXT. GERALD’S GROCERY STORE, - CONTINUOUS MRS. STANHOPE POV - Frank Peterson walking his bike across the small parking lot in front of Gerald’s. Terry Maitland hops out of a parked white commercial van. TERRY Hey there, Frankie... FRANK Hey, Mister Maitland. TERRY [ hunkering down to inspect the damage, punning] Well that’s a drag. FRANK Ollie’ll fix it for me when I get home. Mrs. Stanhope absently watching as Terry opens the van’s back doors and slides the bike inside. He then hop",
      "dialogue_count": 0,
      "word_count": 963
    },
    {
      "scene_number": 4,
      "slugline": "EXT. MAITLAND HOME, BARNUM STREET, FLINT CITY - CONTINUOUS Modest house on a leafy residential street. Local cops and Oklahoma State Troopers mill on the lawn. TOMIKA [on cell] Just waiting on the Statie with the paper [warrant.] As she speaks,   LT. YUNIS SABLO,   steps out of his State Police SUV. TOMIKA (CONT’D) Hang on, he just pulled up. RALPH Is it Sablo? TOMIKA It is. RALPH Tell him I’ll call as soon as I see Maitland in cuffs. EXT. BALLFIELD FLINT CITY - CONTINUOUS Scoreboard reads bottom of the 9th, Braves 5, Dragons 4. Dragons are batting, two out with runners on second and third. Batter hits a Texas League blooper behind third. The Braves outfielder, rushing in as the ball drops, opts to hold the tying runner,   RIAZ CHOUDURY, 11, on third. Now it’s bases loaded, the crowd clapping and stamping. The Braves pitcher is pulled and here comes the team’s  CLOSER,   12 years old but looking 15. His first few warm up pitches nearly detonate into the catchers mitt. INT. DETECTIVE SQUAD ROOM   - MORNING, JULY 12 [TWO DAYS AFTER THE MURDER] Ralph sits at his desk facing   JUNE MOORE,   7, and her anxious mother   DEE DEE,   34. RALPH So you were walking from your house to your friend Amelia’s... JUNE Uh huh. Can I have another soda? 15.",
      "characters": [],
      "action_text": "DEE DEE Juney, one’s enough. RALPH Your mom’s the boss. JUNE She says they’ll rot my teeth but they’re baby teeth, they’re falling out anyhow. RALPH So you walked past the parking lot by Figgis Park. Do you know what time it was? [off her shrug] Mom? Can you help us out? DEE DEE She left at five, right after  ‘Ellen’   so it couldn’t have been more than ten minutes after that. RALPH Let’s say, between 5:10 and 5:20? DEE DEE [ defensively apologetic] I was trying to give her a little independence. How could I know that.. RALPH There was no way you could know, Dee Dee.. JUNE [picking up the photo of Derek on Ralph’s desk] Who’s this? DEE DEE [knew Derek, blushing] Honey, put it down. RALPH That’s my son, Derek. JUNE How old is he? DEE DEE [mortified] Juney, please.. 16. RALPH So Juney, you were walking near the park. Tell me what you saw. EXT. FIGGIS PARK CAR LOT - 5:20 PM, JUNE 10TH, DAY OF THE MURDER June Moore, walking past the lot as Terry Maitland emerges from the abutting park, his hands, face and clothes drizzled with blood. TERRY Hey there, kiddo! JUNE You’re all bloody. TERRY Yeah, I know. There was this big tree branch in my way so I pushed it ... [ forward sweeping gesture] but then it pushed me right back [mimes getting nose whacked.] JUNE Does it hurt? TERRY [patting her head] Nah. But you’re a sweetie to ask. JUNE [V.O.] He said he got hit by a branch. but I think he was making it up. INT. SQUADROOM - CONTINUOUS RALPH Why is that, hon? JUNE [delayed reaction to bloody Terry] Am I in trouble? RALPH Of course not. Right mom? ON DEE DEE - Horrified. He could’ve killed June next. RALPH (CONT’D) Why did you think.. 17. JUNE Because when I had a nose bleed once? It was only under my nose but Coach Terry had blood all over. DEE DEE Jesus... JUNE I think he was fighting with a bad person in the park and he got beat up. DEE DEE Are we done? RALPH Just about. So, what happened then? DEE DEE [pleading] I’m the one who has to put her to sleep tonight. EXT. FIGGIS PA",
      "dialogue_count": 0,
      "word_count": 5683
    },
    {
      "scene_number": 5,
      "slugline": "EXT. SPENCER HOUSE, BARNUM STREET, FLINT CITY - CONTINUOUS Pelly rings the bell.   ROY SPENCER,   45, peers out at him through the gap between the security chain and the door. Alec slips his State Investigator’s license through the gap. Roy takes it, closes the door on him for a beat, then opens the door wide, returning his ID. INT. LIVING ROOM, SPENCER HOUSE - CONTINUOUS PELLEY’S POV - Sarah and Grace sitting together watching cartoons, Mrs. Spencer   keeping an eye on them from the sofa. When the girls turn to see Pelley - yet another strange man today - they both recoil. PELLEY ( hunkering down, kindly) Anybody here want to go see their mom? INT. SQUADROOM - SAME Terry, in cuffs, stands before   two State Troopers   and   two Flint County Corrections Officers.  GOLD You’re really going through with this. SAMUELS What did you expect? Ralph unlocks Terry’s Flint City PD handcuffs, after which one of the C.O’s claps on a pair from County Corrections. GOLD [muttering] Fucking ridiculous... [ touching Terry’s arm] I promise you.. C.O  Sir.   Do   not   touch the prisoner. GOLD [to Samuels and Ralph] One lousy sitdown. After that you could have had him watched. ON RALPH - Troubled. 45.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 205
    },
    {
      "scene_number": 6,
      "slugline": "INT. RECEPTION DESK, MUNICIPAL BUILDING - CONTINUOUS With her surviving son Ollie standing mutely behind her, Arlene Peterson is arguing/yelling with the DUTY SERGEANT. ARLENE [re: Frank] You’ve had him for four days! I want him back! DUTY SERGEANT [gently] Mrs Peterson, I understand but that’s the coroner’s decision. He needs to make sure... As Terry and the arresting party makes its way down the stairs.. ARLENE  Let me bury my son!  [then seeing Ralph] Ralph! They wont give him back to me! RALPH Arlene.. ARLENE’S POV - The cuffs on Terry, the uniformed phalanx... ARLENE [ with snatched breath] Who’s this? RALPH Arlene, not now, just... ARLENE Is this him? Is he the one? ON OLLIE - Saucer-eyed as he takes in Terry. As the phalanx heads towards the door, Arlene races parallel. ARLENE (CONT’D) Did he kill my son? Did you kill my son!   Look at me!  ON TERRY - Arlene’s blazing presence, her accusing eyes and voice; it’s far more terrible to him than anything he’s endured since his arrest. As the desk sergeant and another cop move to restrain her, the phalanx exits the building. 46.",
      "characters": [],
      "action_text": "ON OLLIE... INT/EXT. PELLEY’S CAR - AFTERNOON Approaching the Maitland house and the media crowd on the sidewalk. PELLEY Shit.. ANGLE - Peering out, Mercy sees the car pull up. She impulsively opens the front door, her arms outstretched, which propels the reporters and shooters towards her, their backs to the car. Seizing his opportunity, Pelly hustles the girls right through the unseeing scrum. Pushing Mercy backwards into the house before him, he gets everyone safely inside. INT. INTAKE AREA, FLINT COUNTY CORRECTIONAL CENTER - SAME Terry, naked now, submitting to a body search as the other freshly arrived intakes await their turn. The C.O points to two foot-shaped stencils painted on the floor. C.O. A foot on each and squat. (As Terry does..) Deeper. I want your ass eighteen inches from the floor no more no less. INMATE [ re: Terry] That’s the dude that..Oh, shit! ON TERRY as the news starts to spread. INT. PETERSON HOUSE, BILLINGS STREET - 5:00 PM Arlene Peterson and her husband   FRED , 44, sit numbly on the living room couch as various neighbors mill about among the casseroles, cheese platters and other silver-foiled dishes that they brought with them for this informal memorial visit. In contrast to his parents, Frank’s older brother Ollie seems utterly transformed; no longer the sullen skateboarder but hyper-focused and energetic as he busses dirty dishes, cleans up the occasional mishap and refills guest’s glasses. 47. INT/EXT. PELLEY’S CAR, OKLAHOMA STATE HIGHWAY - 5:00 PM Pelley driving to Cap City, on his cell phone. OPERATOR [V.O.] Sheraton, how may I direct your call? PELLEY Ed Macy in Security. [connect, then...] ED MACY Security. PELLEY Eddie. Alec Pelley. ED MACY Hey! How the hell are you, buddy? PELLEY Good. Listen, I’m about an hour out from you and I was hoping you could help me with something... INT. INTAKE CENTER, COUNTY CORRECTIONAL CENTER - 5:00 PM Terry is being steered towards a large bullpen where the new inmates are parked until their proce",
      "dialogue_count": 0,
      "word_count": 612
    },
    {
      "scene_number": 7,
      "slugline": "INT. SAMUEL’S OFFICE - CONTINUOUS Ralph and Samuels. SAMUELS We need to interview the two teachers who he said went with him to Cap City. RALPH Tomika has one in the Box as we speak. SAMUELS And? RALPH And so far he backs up everything Maitland told us. The other one’s been calling all morning, pissed off no one’s reached out to him. SAMUELS Shit. We need to send someone to the Sheraton. If we don’t, Gold’s investigator’s probably going to beat us to the security tapes. RALPH He probably already has. So what. It’s not like he can tuck it under his arm and toss it in his trunk. SAMUELS Right. And even if he sees a guy on there who looks like Maitland it’s inconclusive. Going up against what we’ve got? RALPH [worried] Right. INT. SECURITY CENTER, DOWNTOWN SHERATON, CAP CITY - SAME Alec Pelley, holding a photo of Terry, is watching four day old footage with   EDDIE MACY,   46 ,   head of security. CLOSE ON - FOOTAGE - Grainy shot of people pouring into the hotel lobby from the concluded afternoon panel event. 49.",
      "characters": [],
      "action_text": "PELLEY [OS] [possibly spotting him] Whoa. Freeze it? [ on frame] Zoom out? MACY That’s your guy? PELLEY It could be. The tape continues, ‘Could Be’ Terry momentarily turning more fully to the camera. PELLEY (CONT’D) Freeze it? [then showing Macy Terry’s photo] What do you think? MACY Maybe. The tape continues to roll, tracking ’Could Be’ Terry as he crosses the lobby and enters the hotel’s gift shop. PELLEY Got anything from inside the shop? MACY We don’t surveil in there. PELLEY Any other footage from the conference? MACY That’s it. PELLEY The restaurant, the bar, the hallway outside the room.. MACY You saw it all. PELLEY [rising, frustrated] Alright, brother... 50. MACY I mean that’s all   we   have. There was a Public Access TV crew covering the conference that day. Maybe... ON PELLEY... INT. PETERSON HOUSE, BILLINGS STREET - EVENING Last of the neighbors leaving. Arlene and Fred still on the couch, their eyes vacant with grief as Ollie, still moving like a tornado, carries dirty glasses/ dishes into the kitchen then starts in on vacuuming the living room rug. ON OLLIE- His back to the kitchen, barely hearing his mother who’s suddenly standing by the sink, over the vacuum. ARLENE [OS] [ to no one] What are we going to do with all this food? OLLIE [his back to her] Mom, don’t worry about, OK? ARLENE [OS] We’re just four people, not an army. Ollie and Fred exchange an anxious glance - They’re three now, Arlene’s still counting in Frankie. FRED [from the couch] Honey, come sit with me.. ARLENE And all these dirty plates and platters... OLLIE Mom, I’ll clean up everything...Go sit with.. ARLENE You should get Frankie to help you because... 51. And then she catches herself, her face turning shock-red as her son’s death truly sinks in. At first, none of them can even draw a breath, until... Arlene explodes -   Shrieking like a banshee as she starts flinging dirty dishes against the walls, smears fistfuls of food in her hair... Ollie and Fred rush in to restrain her, bu",
      "dialogue_count": 0,
      "word_count": 840
    },
    {
      "scene_number": 8,
      "slugline": "INT. DA SAMUELS OFFICE - 10:00 AM CLOSE ON - COMPUTER MONITOR Cap City Public Access Channel 35 footage of the censorship conference. A hand reaches out to the keyboard fast forwarding the tape to... MODERATOR Anyone else? Camera pans to the audience, as ‘Could-Be’ Terry stands up. TERRY [ that horse head buckle shining ] I don’t understand. Slaughter House Five is banned in part because of it’s unsparing take on war. But the  Iliad,   which is infinitely more bloody and graphic, remains required reading. Could any of you respond to that? GO WIDE - TO SEE, Gold, Samuels, Ralph. GOLD [gloating] Comments? Thoughts? Suggestions? SAMUELS It’s just an image, not.. GOLD Ralph? Is that, or is that not, Terry Maitland, on the same day and roughly the same time as Frank Peterson was murdered seventy miles away? Ralph’s troubled silence says it all. GOLD (CONT’D) [to Samuels, re: the case] Poof. INT. VISITOR’S LOUNGE, SAME HOSPITAL - SAME TIME Ollie and his father Fred. They’ve been here since last night and they’re so exhausted that it takes them a moment to realize that Arlene’s surgeon is standing in the doorway. They shoot to their feet but the sorrowful look on the man’s haggard face knocks them right back down into their chairs. 54.",
      "characters": [],
      "action_text": "Fred starts bawling into his hands. Ollie, on the other hand, turns to stone. INT. DA SAMUEL’S OFFICE - MID-MORNING Samuels, Ralph and Yunis. SAMUELS The painful fact is, juries rarely convict on fingerprint evidence alone. SABLO What about your witnesses? SAMUELS A small child, a senior citizen who lost her drivers license because of poor eyesight, a strip club bouncer with a rap sheet longer than his leg. Once Gold gets a shot at them on cross... RALPH But they   saw   him. Every interview every I.D. rang true. SAMUELS [sighing] The hell of it is, we’re in too deep to back down. SABLO I guess it’ll all come down to the DNA, won’t it. SAMUELS And I’m starting to have my doubts about that. Ralph gets up heads for the door. SAMUELS (CONT’D) We’re still talking. RALPH Talk to Yunis. I’m going to Cap City, take a look at those hotel tapes. 55.",
      "dialogue_count": 0,
      "word_count": 370
    },
    {
      "scene_number": 9,
      "slugline": "INT. INTERVIEW BOOTH, FLINT COUNTY CORRECTIONAL CENTER - SAME Through a scuffed Plexiglas barrier, Mercy and Gold watch Terry trembling with relief. TERRY So it’s over? The charge is withdrawn? GOLD Not quite. The problem is, once they arrest you, you get put on the justice train, and that train has no brain.   All it knows is to stop at every station. So. At nine o’clock tomorrow morning you have your arraignment with Judge Landy... But I promise you this. By the time you get to that courthouse, I will make damn sure that every reporter and every TV station in the state has a copy of that video so there’s no way Landy’s denying you bail. Now, the DA’s going to quack like a duck about it because he’s got a heap of forensic evidence that he’s very proud of... but I can tell you right now that what we’ve got trumps what they’ve got and once you post bail you’re out of here. MERCY Then what. GOLD Then I tell Samuels that it would be a bad idea to convene a grand jury. He’ll agree because he knows his case is a dog and he won’t want to wind up with even more egg on his face if they fail to indict. And at   that   point, you will truly be free. Finally feeling like the nightmare will soon come to an end Terry allows himself to let go, his body wracked with sobs.. Seeing her husband fall apart, MERCY follows suit. GOLD (CONT’D) As I said, they love their forensic evidence although the DNA’s still pending. 56.",
      "characters": [],
      "action_text": "TERRY That can’t come back a match. It’s not possible. GOLD I would’ve said that about the fingerprints. MERCY Maybe someone set him up. Maybe someone.. GOLD But why? Who would go to such insane lengths to do that to you? Can you think of anyone? [off his silence] So, OK. We have a video and we have witnesses. But I want more. MERCY More what? GOLD I want physical evidence to match theirs. MERCY From the Sheraton? He was there five days ago. GOLD A boy can dream, can’t he? TERRY Hold on. There might be something. INT. SECURITY CENTER, DOWNTOWN SHERATON, CAP CITY - SAME Ralph reviewing the same tapes that Alec Pelley had the day before. CLOSE ON - MONITOR ‘Could Be’ Terry once again exiting the afternoon panel event along with the others, briefly turning in the direction of the security camera before entering the gift shop. ON RALPH - Perplexed, unsure. 57.",
      "dialogue_count": 0,
      "word_count": 427
    },
    {
      "scene_number": 10,
      "slugline": "INT. HOTEL RESTAURANT - CONTINUOUS Ralph showing Terry’s photo to the manager and waiters. No one can remember him. ANGLE - HOTEL BAR - CONTINUOUS Ralph drawing the same nonplussed reaction. Then from across the lobby seeing that gift shop. INT. GIFT SHOP - CONTINUOUS Ralph approaching the proprietor/sole worker,   SHIRLEY JACKSON,   44, feisty, droll. RALPH How are you today, Ma’am? SHIRLEY Holdin’ my own, some of theirs. RALPH Well, that’s good to hear. [showing his police I.D.] Were you working here last Tuesday? That was the day of the teachers conference. SHIRLEY I’m here everyday. It’s my shop. RALPH [showing her a printed out blow up from the security tape] Would you happen to remember if you saw this man coming into your store that day? SHIRLEY That guy?   Maybe.   Well I don’t know. It’s kind of grainy so... [then bringing it closer] No, no, yeah, he was in here. RALPH So, five days past, a ton of customers since then.. SHIRLEY I wish. RALPH But you definitely remember him. 58.",
      "characters": [],
      "action_text": "SHIRLEY [gesturing to a high shelf] See those books? You know why they’re up there? Because nobody buys them. They’re too expensive. This guy was the first one to get up on my step ladder and take one down in months. Didn’t buy it, but I remember him doing that. RALPH Which? SHIRLEY  “Tribes of Oklahoma”   up there with the red spine. RALPH Anyone look at it since? SHIRLEY Are you kidding? ANGLE - RALPH on the step ladder taking the book down, but gingerly, holding it with his palms pressed into the top and bottom of the cover in order to not compromise any fingerprints that might be present on the shrink wrap. RALPH How much? INT. LOBBY - CONTINUOUS Ralph exiting the gift shop, the book in a shopping bag. PELLEY[OS] God damn it, Ralph. RALPH Hey Alec, long time no see. PELLEY [re: book] How the hell did you know? RALPH I didn’t. Just followed a hunch. PELLEY Well, I’ll tell you...You find Maitland’s prints on that book you’ll be doing us a service. 59. RALPH I’m hoping I don’t. PELLEY You can’t convict on absence of evidence. RALPH [holding up the grainy blow up] The owner in there I.D’ed   this   guy as the last customer handling the book. But if the prints are someone else’s then that discredits the whole tape. PELLEY So fine. Get the tape tossed. I wasn’t even sure it was him myself. But that TV footage, brother...How are you gonna negate that? RALPH You never know. PELLEY [re: the book] So how much did it set you back? RALPH About a dinner for two with drinks? I’m banking on getting reimbursed. INT. FINGERPRINT STATION, FLINT CITY PD - NIGHT Ralph lifting the prints from the book cover via clear tape, then pressing the tape onto a contrasting surface and photographing the image, which he then uploads into a fingerprint match scanner alongside prints taken from the crime scene and from Terry’s booking. ON THE SCREEN - A rolling build up of ridges and whorls from the book... ON RALPH - As the process comes to it’s conclusion. INT. LIVING ROOM, DA SAMUELS HOME, FL",
      "dialogue_count": 0,
      "word_count": 1199
    }
  ]
}