{
  "slug": "the-magicians-101-unauthorized-magic-2015",
  "title": "the magicians 101 unauthorized magic",
  "genre": "drama",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 10426,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. TURTLE BAY STREET - NIGHT On a bench, Quentin flips through the notebook, trying to control his excitement as he READS:  “...death of Rupert Chatwin...”   “...at last, every question answered...”  EXT. ENGLAND, A CORNWALL ESTATE - DAY - 1942 A CRASHING sea, chalky cliffs, a rolling green lawn and a great sprawl of a manor house-- --as above,   three World War II Spitfire fighter planes   BANK in tight formation as we hear a sonorous BRITISH NARRATOR-- NARRATOR (V.O.) The story is well-known.   But not the story we have all been told. It is a darker tale.   And a truer one.   Though it began in the way we all remember... INT. CORNWALL ESTATE - BACK HALLWAY - CONTINUOUS  MARTIN CHATWIN , serious, 12, dressed in suit coat and shorts in the manner of the day, leads   TWO BROTHERS and TWO SISTERS -- NARRATOR (V.O.) From a young age, Martin Chatwin had a gloomy nature.   And to combat his melancholy, he’d lose himself in stories of wonder. --to that   looming grandfather clock from the book’s cover  with its   CARVING OF TWIN RAMS   above the face. NARRATOR (V.O.) So he knew he’d have trouble convincing his brothers and sisters that this was no fantasy. Especially the oldest, Rupert--  RUPERT CHATWIN , almost 19, wears a dashing ROYAL AIR FORCE uniform and white turtleneck, sporting a cane and a limp. NARRATOR (V.O.) --recently wounded in the war, recuperating at home, the first Chatwin to put away childish things.   And Jane, the family skeptic.  \"Magicians\" / 05-10-14   13.",
      "characters": [],
      "action_text": "10-year-old JANE CHATWIN   watches, clear-eyed in tight pigtails, dubious, as Martin opens the clock door. NARRATOR (V.O.) He would have to show them. Martin pushes the pendulum aside and sticks his hand in.   And in.   And in.   And in!   Till it’s gone to the elbow into the endless blackness inside.   The other Chatwins gape,   wow -- And he reaches back for the youngest’s hand... PULLING HIM THROUGH into the clock with him.   Gone . Jane, now surprised and curious, herds the others through. EXT. A GREAT TREE - DAY Ancient, massive; in its belly, an open, black maw, from which, as depicted on the cover,   the five Chatwins emerge . They stand.   They look.   Wow.   As we SEE WE ARE NOW IN: NARRATOR (V.O.) This was... EXT. A LAND UNLIKE ANY OTHER - CONTINUOUS NARRATOR (V.O.) ...Fillory.  A forest.   Above it, a sun more brilliant, the sky a deeper blue, the clouds a purer white. NARRATOR (V.O.) A land of Magic. The Chatwins take it all in as they fan out and their individual glances take them each to what interests them. NARRATOR (V.O.) But-- as they would discover, all was not well here.   Martin thought they needed Fillory-- a place of enchantment.   When in fact, Fillory needed them. Jane is drawn to a gnarled tree.   Her eyes widen-- seeing   A LARGE CLOCK in its TRUNK . JANE CHATWIN Rupert, Martin, have a look at this...  \"Magicians\" / 05-10-14   14. NARRATOR (V.O.) It is here that the true evil at the heart of the Fillory story in reality begins to rear its fearsome head.   Not the story we know and love.   Rather, a story we dread... EXT. TURTLE BAY STREET - NIGHT Quentin, on the bench, reading, enthralled, suddenly jolted from his reverie by--  A loose leaf of paper FLYING OUT and SAILING across the street.  INT. COLUMBIA LIBRARY - ENTRANCE/ELEVATOR - SAME TIME Julia enters in a hurry, crosses to an open elevator, gets in, hits a button for the third floor. EXT. TURTLE BAY STREET - SAME TIME Quentin DASHES into TRAFFIC and chases the paper into the dark thr",
      "dialogue_count": 0,
      "word_count": 765
    },
    {
      "scene_number": 2,
      "slugline": "EXT. A VAST, PERFECT GREEN LAWN - DAY  Rolling countryside in high late summer.  The paper is gone.   Quentin stops.   Looks around, confused. Pollen floats.   He takes a breath.   And SNEEZES as-- INT. COLUMBIA LIBRARY - ELEVATOR - NIGHT The elevator doors part.   Finally.   Julia again hits the third floor button.   But: the doors stay open.   And she’s not in any Columbia Library sub-basement.   She can see she’s in-- INT. ARCHITECTURALLY MODERN BUILDING - HALLWAY - DAY Fine floors, clean lines, huge windows.   Not   the library.  Julia is   completely confused .   She gets off to see what the what.   Turns back to the elevator.  But there is no elevator .   The fuck?   Rather, there is a handwritten sign on a brass stand.  TO EXAMINATION --->  Julia considers.   In the absence of a better option-- she decides to   follow the sign .   And she passes a WINDOW without glancing out--  But framed in that window, WE SEE Quentin.   In the distance. EXT. OUT ON THAT VAST LAWN - CONTINUOUS Quentin heads toward this building, still generally baffled-- He passes a young man leaning against a tree: 20s, skinny, preppy in that sloppy way that also looks hip, an air of effortless self-possession.   He’s smoking.   ELIOT.  QUENTIN Hey.   Um, hi?   Where am I? ELIOT (snaps cigarette away; bored) Upstate New York.   Allow me to be your chaperone, since I clearly have nothing better to do. EXT. A CONCRETE PATH - MOMENTS LATER Quentin scrambles to catch up with Eliot’s quick stride.  \"Magicians\" / 05-10-14   16.",
      "characters": [],
      "action_text": "QUENTIN So, what is this place?   Do you live here? ELIOT If you can call it living. They arrive at an etched-metal sign identifying the imposing building before them as:   BRAKEBILLS HALL.  ELIOT Little friendly advice: don’t ask too many questions.   Just go with it.   It’ll all make sense eventually.   And try to look like you belong. Eliot leaves Quentin, looking totally fucking baffled. EXT. BRAKEBILLS HALL - LATER Quentin sits on a bench, overcoat off.   He still has the Fillory notebook.   He’s distractedly   TWIRLING a coin over his fingers , sleight-of-hand-style, as he takes in:  What looks like a well-funded university campus, buildings a melange of the stately and old married to the freshly-built modern.   And no bikes, cars, buses .   Silent ,   empty . Quentin pulls out his cell phone:   NO SERVICE.  He notices something cut into the bench.   A school crest:   a shield and within, a bee and a key.   He peers at it, curious. When a man comes toward him:   DEAN FOGG , 50s; correct, traditional, mild... behind his eyes, always sizing you up. DEAN FOGG Quentin Coldwater, Henry Fogg, you may address me as Dean. (in motion) Welcome to Brakebills University. You’ve been offered a Preliminary Examination for entry into our Graduate Program. QUENTIN Am I hallucinating? DEAN FOGG If you were, how would asking me help?   So: want to take the test?  \"Magicians\" / 05-10-14   17. QUENTIN ...I haven’t prepped for any-- DEAN FOGG There’s no way to study for this, though you could say you’ve been preparing for twenty-three years. Quentin takes that in.   Still lost.   But now intrigued. INT. LECTURE HALL - DAY Quentin is led in by Dean Fogg, who promptly abandons him, heading to the front of the room.   Quentin eyes the room-- row upon row of TEST TAKERS, each with a BLUE TEST BOOKLET and PENCIL in front of them: all his age or a bit older, male, female, all walks of life, curious and confused, whispering to each other.   What is this place?   Why are they here? Quenti",
      "dialogue_count": 0,
      "word_count": 4972
    },
    {
      "scene_number": 3,
      "slugline": "EXT. BRAKEBILLS - QUAD - MAGIC HOUR Quentin and Josh sit with Eliot and Margo, passing a flask between them.   Blowing off steam, relaxing for a moment.  Alice walks by , toting books.   Margo NOTES the look passed between Josh and Quentin. MARGO Ah.   One of those every year. QUENTIN One of what? MARGO Overachiever, usually female, shy yet knows they’re the shit, universally reviled. Alice has become aware of eyes on her, squares her shoulders. MARGO (calling to Alice) Hey-- sweetie-- don’t take it personally! Alice looks over, confused... then sees on their faces that she’s the butt of things again.   She moves past quickly. Quentin watches her go, feeling a little bad. INT. QUENTIN & PENNY’S ROOM - LATER Penny and Kady kiss roughly, half naked. Then Kady holds up her hand, palm out.   And-- a   PINK GLOW  starts inside, illuminating sinews and veins.   Penny lifts a brow, impressed. KADY Hold on, that’s not the good part. She touches him with the glowing hand.   He sucks in air-- FUCK, that feels amazing.   And then his skin GLOWS PINK.  Kady runs her hand down his body to below frame.   She strokes, leans in to kiss him again. KADY So, what can you do?  \"Magicians\" / 05-10-14   39.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 209
    },
    {
      "scene_number": 4,
      "slugline": "INT. QUENTIN & PENNY’S ROOM - LATER The bed is rumpled but empty.   A faint GLOW falls on the sheets from above.   We follow it up-- it gets stronger-- Till WE FIND Penny and Kady HOVERING near the ceiling, entwined, fucking.   Threads of pink snake under their skin like an illuminated circulatory system, beautiful, eerie. INT. QUENTIN & PENNY’S ROOM - LATER Penny catches his breath.   Kady stares at her hand, watching the last of the glow flicker out.   She smiles dreamily. KADY I’m gonna sleep so good. She sees-- a shadow cross Penny’s face.   Good-naturedly-- KADY What, I can’t sleep here?   Fuck you. PENNY No, ‘course you can.   Just-- I don’t sleep so well lately. Kady can tell that he’s turned serious.   More gently-- KADY Why not? PENNY Because I’ve been self-medicating hard and now my sleep is fucked. KADY Why, like ADD or something? PENNY No.   I hear voices. (fake casual laugh) Now you can’t wait to escape. Not exactly, not quite yet... but she’s cautious. KADY Voices. PENNY But-- I swear I’m not actually crazy.   I mean, I thought I was too, believe me, but I’m not.  \"Magicians\" / 05-10-14   40.",
      "characters": [],
      "action_text": "KADY How do you know? PENNY When I came here it’s all they wanted to talk about.   Fogg, everyone.   Not even weirded out. Just, “Oh, telepath, interesting, tell us all about it.” KADY Okay, tell me all about it. PENNY Well... so this one, the main voice I guess?   Says it’s a Magician. Half my life, I been hearing this whisper, “Move your hand, say these words,” and they were all spells. Set my bed on fire when I was ten. KADY Shit. PENNY So... thought I’d come here, actually learn all the magic, and they’d, I dunno, shut up.   But it’s kind of... getting worse. KADY Worse, how? PENNY Saying, “Help us.”   They’re in this place, another world... KADY Other world? PENNY Yeah, that’s another thing. There’s other worlds.   Other planes or something.   There’s entire books in the library about it.   Tons. Like it’s no big deal. KADY Okay.   I don’t know where to start. PENNY So clearly, I’m made of cushiony, five hundred thread count boyfriend material.  \"Magicians\" / 05-10-14   41. KADY Eh.   But you’re a quality bang. (smiles, kissing him) We’ll see about the rest. INT. LIBRARY - STACKS - NIGHT Alice scans shelves, holding a page of jotted titles. Quentin approaches.   He CLOCKS the paper, which features a  DISTINCTIVE CIRCULAR SIGIL   drawn among the words. QUENTIN Hey.   Alice. Alice turns-- sees that it’s Quentin-- goes cold and hard. QUENTIN Look, my friends, the other day, they were just-- ALICE Cruel?   Unoriginal? QUENTIN I’m sorry. Alice turns back to the books.   Quentin can see that despite her protestation, she’s plenty hurt.   More softly-- QUENTIN Look... honestly?   It’s my fault they said that to you. (off her surprise) They just see how jealous I am. You’re the best, it’s easy for you-- ALICE No, I study. QUENTIN And you get it, I barely-- He realizes what he’s about to say.   Stops.   Then decides to say it anyway. QUENTIN I’m terrified I’m gonna get kicked out.   I need this place.   I... look, I never had friends who understood, or parents who--  \"M",
      "dialogue_count": 0,
      "word_count": 2543
    },
    {
      "scene_number": 5,
      "slugline": "INT. BRAKEBILLS - LIBRARY - NIGHT Quentin JERKS AWAKE at his table, gasping-- Then-- winces.   Realizing something’s still wrong.   He looks down at his hand in his lap.   Opens the palm....  Revealing the SIGIL.   BURNED in his palm.  Quentin stares at it, bewildered and uneasy. EXT. BRAKEBILLS - QUAD - DAY Alice walks to class alone.   Quentin catches up to her, falls into step. QUENTIN You were looking for something in the library the other day-- ALICE I’m late. QUENTIN You had a page, with a symbol-- ALICE Go away. Quentin grabs her arm, to stop her walking, holds up his palm.   Showing her the sigil.   She freezes.   Eyes wide. QUENTIN What does it mean? ALICE How did you get that? He gives her a look:   I’ll tell you if you tell me.   Alice considers.   Then, resolute, all business. ALICE Okay.   Tonight.   Midnight.   Meet me at the admin building.   And find an Estonian-English dictionary. QUENTIN (the sigil on his hand) What’s this mean? ALICE “Contact the other side.”  \"Magicians\" / 05-10-14   53.",
      "characters": [],
      "action_text": "QUENTIN The other side like... seance shit? ALICE Which we’ll be doing.   Once we get the book I was looking for, which apparently got pulled off the shelves two years ago. QUENTIN Pulled?   Which means, locked up in the Dean’s private collection. Which means, needs to be stolen. Right? (her look says:   so? ) Right, and I don’t want to get kicked out, and I really don’t wanna be that guy who dies in the first ten minutes of the movie because he said, “Sure, get out the Ouija board, what could possibly happen...” ALICE You wanna cheat off my labs?   You want a tutor, you want straight A’s?   I can do that for you.   But you have to help me with this.   For some reason you’re involved.   So be involved. INT. ADMIN BUILDING - NIGHT Quentin and Alice face Dean Fogg’s locked door.   Alice tries a WHISPERED SPELL.   The lock doesn’t budge.   Shit. Quentin pulls out a baggie of faintly blue powder.   He pours some into his hand, then BLOWS it into the keyhole. BEAT... then a CLICK as the lock opens.   Alice throws him a look-- surprised, impressed. QUENTIN I hang with a bad crowd. He gestures for her to lead the way. INT. DEAN FOGG’S OFFICE - NIGHT Quick cuts of Quentin and Alice scouring shelves... until finally they find a small book   EMBLAZONED WITH THE SIGIL .  \"Magicians\" / 05-10-14   54.",
      "dialogue_count": 0,
      "word_count": 408
    },
    {
      "scene_number": 6,
      "slugline": "INT. QUENTIN & PENNY’S ROOM - SAME TIME Kady, half-dressed, in bed, lazily flips through flashcards as Penny paces, polishing off a beer, distracted. KADY (reading off card) Do you start etude five with your left hand or right? (no answer) Trick question, it’s a two-fister. (looks up) Hello? Penny pops a pill, troubled.   He apparently didn’t hear her. KADY Penny?   PENNY! He finally hears her, looks to her-- KADY The fuck is wrong with you? (realizing) You can barely hear me. He stares, frustrated, distracted by voices only he hears. PENNY They’re getting louder.   Saying I have to help, now. KADY How? He meets her eyes. INT. LAB - NIGHT Alice and Quentin, the English-Estonian dictionary open, as she stops, mid-transcription. ALICE Shit. QUENTIN What?   It’s going good, this all makes sense-- ALICE It does, we can do it, but we can’t do it.   We need...  \"Magicians\" / 05-10-14   55.",
      "characters": [],
      "action_text": "Just then, the door opens.   Looking bewildered, Penny enters, followed by Kady.   Surprised to see anyone here-- PENNY Oh.   Hi.   So... He seems to hear something, then focuses on the others. PENNY You guys need... immediate help with something? ALICE Four people.   It says we need four people.  Whoa.   Quentin and Alice share a moment. INT. LAB - LATER Jars of murky substances and a small pile of animal bones litter the countertop.   A large rectangular mirror is propped by the table.   The four Magicians stand over a glass bowl of bubbling, fatty liquid. KADY So, what’s the deal, what do we--? ALICE We finish this, do the spell, and we’ll apparently see a visage through the mirror. PENNY Whose “visage”? Alice finishes scrawling something on a slip of paper, then tosses it into the opaque bubbling liquid. ALICE Just someone I knew from years ago, okay?   His name is Gabe, he died horribly, it’d be nice to say hi. Quentin considers her, wondering at the rest of the story. QUENTIN It’s 11:59. ALICE The book says it’ll happen at twelve.  \"Magicians\" / 05-10-14   56. She cuts her thumb with a knife, letting blood drip into the bowl.   She passes the knife; everyone’s donating blood. The liquid in the bowl goes perfectly black and still.   They hold their breath.   Look in the mirror.   Nothing. PENNY Well? Alice looks over her notes, frustrated. ALICE It should have... I mean, everything here... JUMP CUT - A HALF HOUR LATER All four realize it’s a no, but only Kady heads for the door. KADY I’m hungry.   Sorry, I am. Penny’s right behind her. PENNY Let us know if shit gets exciting. With that, Penny and Kady go.   Alice sits heavily, staring into the mirror.   Quentin watches her awkwardly.   Finally-- QUENTIN I’ll help clean up. INT. LAB - NIGHT INTO MORNING The lab is spotless again.   Alice is still here.   Alone.   The light changes, morning coming, and she sits staring at the mirror.   Nothing.   She’s near tears. Finally, pulls herself together.   Leans the mirr",
      "dialogue_count": 0,
      "word_count": 908
    },
    {
      "scene_number": 7,
      "slugline": "INT. BRAKEBILLS - LAB - DAY Desks in a U; students watch   Professor Van Der Weghe   at a DEMONSTRATION TABLE .   He drones on about the minute differences between two excruciatingly similar GOLD KNIVES.  Alice   takes notes, studiously focused, trying to let go of last night.   Penny , sitting in back, isn’t paying attention; he’s love-kicking   Kady   under the table.  Quentin   settles into boredom, looks to the clock.   11:59 am.  Yawn.   The professor turns on the Bunsen burner. The clock clicks over to 12 pm on the dot.   And-- The professor STOPS.   Hand mid-air. Quentin stares, confused.   Then tries to turn--   discovers he can’t move .  Everyone in the room is FROZEN .   Eyes darting.   What’s happening?!   And...   A LOW RUMBLE   shudders through the room. Exactly like in Quentin’s dreams.   His eyes widen.   Oh no.  Something catches Quentin’s eye: the abandoned mirror propped against the wall.   For a second, the glass seems to RIPPLE... Then a BLACK MOTH FLIES OUT OF THE MIRROR.   And ANOTHER MOTH.  Quentin   sees, emerging from the mirror--  A FIGURE : Masculine, tall.   Human.   More or less.   In a timeless grey suit.   We’ll soon realize:   this is THE BEAST .  Leaves HOVER around the Figure.   They OBSCURE Its face .  MOTHS   buzz around It-- appearing from nowhere, DRAWN to It. The effect is creepy, ominous--   just like in Quentin’s dream.  It   moves casually , face hidden, intention impossible to read.  Quentin   is wide-eyed with horror.   He looks across the room--  Alice   is   staring   in fear and worry,   as frozen as he is .  The Beast   strolls over to the professor, assessing.   Makes an impossibly intricate   motion   with Its six-fingered hands. Abruptly,   the professor’s neck twists , SNAPPING.   He crumples.   The Beast   steps over the body with Its fine shoes.  Alice’s eyes MEET Quentin’s .   Desperate.   Quentin hears  MUFFLED SOUND   pushing through the thick air... The Beast   turns to it :  \"Magicians\" / 05-10-14   61.",
      "characters": [],
      "action_text": "Kady.   Somehow broken free.   On her feet   and spitting   an Incantation , harsh, fricative--   offensive battle magic.   Her hand motions made suddenly visible midair-- ABLAZE-- And The Beast is   RATCHETED BACK BODILY into the table . Kady moves her hands, Incanting fast, angry--  Penny , also frozen, is a billion emotions at once-- fear, anger... and now, pride at his brave, fierce girl and--  The Beast   starts to stand-- we see   an AIR-RIPPLE from Kady’s swift fingers   that lands on the Beast,   shoving It back -- But now   the Beast makes a QUICK MOTION   and--  Kady’s hands are YANKED   out straight in front of her--   CRACK! EVERY FINGER BREAKS -- she SHRIEKS-- Penny’s emotions all collapse into sheer, arctic horror-- And then the Beast is RIGHT THERE, in front of Kady-- she’s still trying desperately to move her broken fingers-- As   the   Beast   slowly, lusciously   RIPS Kady’s right EYE OUT -- -- POPS Kady’s eye in Its mouth , chews,   Kady   SCREAMS, clutching her eye socket, stumbling back.   Then,   the Beast  pulls her up, hands on her face, as though about to KISS her--  --OPENS ITS MOUTH... wide-- WIDER -- a WET SOUND as Its   jaws detach, snakelike , TOO WIDE-- and It SWOOPS ON HER to   RIP HER FACE OFF WITH ITS TEETH .  Quentin   concentrates all his effort on his hands -- FINALLY--  ONE FINGER twitches FREE -- he   keeps pulling -- The Beast DROPS Kady’s half-eaten corpse to the ground.   Then It turns to   look DIRECTLY AT QUENTIN .   We SEE ITS EYES   behind the swirl of leaves and insects.   Human, but NOT.   Darker.  They   light up in recognition.  Quentin panics , desperate to move, hyperventilating-- frozen--  as the Beast walks toward him . Its bloody mouth twitching into a smile. BLACKOUT.  END OF PILOT  \"Magicians\" / 05-10-14   62.",
      "dialogue_count": 0,
      "word_count": 621
    }
  ]
}