{
  "slug": "this-is-us-101-pilot-2016",
  "title": "this is us 101 pilot",
  "genre": "comedy",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 2,
  "characters": [
    "VOICE",
    "DOCTOR K"
  ],
  "total_words": 9563,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HOUSE - EVENING  A quaint, 70’s style house in suburban Pittsburgh.  A sign indicates that the house has recently been “sold.”  INT. BEDROOM - EVENING (PITTSBURGH)  We take in the bedroom first.   It doesn’t take long.  Four white walls.   New carpet.   A few MOVING BOXES.  A bare mattress rests on the floor, dead center.  WOMAN (O.S.)  You promise you like your gift?  MAN (O.S.)  The towel?   It’s absolutely terrible.  The man’s skinny, bare legs enter frame.   He sits on the  edge of the mattress.  WOMAN (O.S.)  Suit’s on?  MAN (O.S.)  Yes, Ma’am.  WOMAN (O.S.)  (confirming)  Your birthday suit?  MAN (O.S.)  Only one I’ve got.  REVEAL a buck naked man named JACK (36), sitting on the  mattress.   His man-parts are covered by a small TOWEL.  It’s a vintage, dish-towel sized, PITTSBURGH STEELERS  TERRIBLE TOWEL, an iconic piece of football memorabilia.  In steps his lovely wife, REBECCA (30’s).   She’s  outrageously pregnant.  She wears a BRA on the outside of her outdated maternity  gear, and carries a CUPCAKE with LIT CANDLE.  REBECCA  I had to put the lingerie on top of my  clothes.  JACK  I see that.  2.",
      "characters": [
        "VOICE"
      ],
      "action_text": "REBECCA  It wasn’t a great moment for me.  JACK  Tradition is tradition.  She nods.  REBECCA  I’m gonna spare us both the seductive  birthday dance this year.  JACK  Sorry, Baby, but it’s my birthday and I’d  very much like to see the dance.  She SHRUGS.  REBECCA  Your funeral.  She starts walking to him seductively, but she can barely  move, so it’s just kind of slow and sad.   Jack starts to  laugh...  REBECCA (CONT’D)  I will gag you dead with that towel.  He stifles the laugh.   She arrives at the bed.  REBECCA (CONT’D)  Your suit still fits, I see.  JACK  Getting a little tight in the middle.  REBECCA  I’ll have it taken in.  Jack smiles.   She hands him the cupcake and falls onto  the bed, exhausted.   From lying position she musters a  sad:  REBECCA (CONT’D)  Happy 36th Birthday to you/Happy 36th  Birthday to you/I have triplets inside of  me/I am Shamu.  Jack blows out the candle and lies back, face to face.  JACK  (adoring)  Do you know how much I love you?  3. REBECCA  (smile)  You’ve made it pretty clear.  Jack leans to her stomach, talks to his unborn children:  JACK  Hey, Fearsome Threesome!   Do you three  know how much I love your mother!?   Do  you even have any idea!?  Rebecca responds with bad ventriloquy as “the babies.”  REBECCA  (baby voice)  We know, now shut up and let your fatass  wife go to sleep.  JACK  Oh no.   Birthday tradition is birthday  tradition.  (still to babies)  Close your eyes in there, Kids.   Daddy is  about to do some terrible things to Mommy.  REBECCA  Oh, there is no way in hell.  Jack, determined, tries kissing her neck.  REBECCA (CONT’D)  (amused)  How the hell can you possibly want me  right now?  JACK  In any state, my wife, you arouse me.  He kisses her neck more.  REBECCA  I bet I can make that go away.  JACK  Nothing you can say can--  REBECCA  My water just broke.  Jack freezes.   A beat, then...  JACK  Yep.  4. He jumps and starts scrambling about like a crazy person.  CUT TO:  EXT. DUPLEX - MEANWHILE (LOS ANGELES",
      "dialogue_count": 1,
      "word_count": 5007
    },
    {
      "scene_number": 2,
      "slugline": "EXT. PHILADELPHIA - LATER  A city where driving just a few city blocks can land you  in a completely different economic stratosphere:  - Rittenhouse Square is where the money is.  - Then there are all the upscale universities, which for  some reason border...  - West Philadelphia.   One of the grittiest and grimiest  inner cities in America.  And it is on the GRITTIEST BLOCK OF ALL, that Randall  (using his GPS) parks his car, takes in the unkempt  apartment, and heads to the front door.  EXT. FRONT DOOR - MOMENTS LATER  KNOCK, KNOCK.   Randall bangs on the door.  VOICE (O.S.)  Comin’.  ON RANDALL  Breathing hard, he’s not composed.   Not himself.   He  KNOCKS again, louder.  VOICE (O.S.) (CONT’D)  I said I was coming.  The door opens.  Before Randall stands his biological father, WILLIAM HILL  (72).   The same man from the picture.  But in person, William is even older.   More beaten up.  He’s seen better days.  WILLIAM  Can I help yo--  Randall launches in.  RANDALL  My name is Randall Peasing.   I am your  biological son.   Thirty-six years ago you  left me -- no, hold on, let me say this -  thirty-six years ago you left me at the  front door of a fire station.   Don’t  worry, I am not here because I want  anything from you.   Don’t need a hug,  don’t need any money.  30.  (MORE)",
      "characters": [],
      "action_text": "I was raised by two incredible parents, I  have a lights out family of my own, and  that car you see parked out front of your  house cost 104,000 dollars and I bought  it for cash.   I bought it for cash  because I felt like it, and because I can  do shit like that.   Yeah, you see, I  turned out pretty alright, which might  surprise a lot of folks considering the  fact that thirty-six years ago my life  started with you leaving me on a fire  station doorstep with nothing but a ratty  blanket and a crap-filled diaper.   I came  here today so I could look you in the  eye, say that to you, and then get back  in my fancy-ass car and finally prove to  myself, and to you, and to my family who  loves me, that I didn’t need a fucking  thing from you, even after I knew who you  were.  A beat, then:  WILLIAM  Would you like to come in?  RANDALL  Okay.  They head inside.  INT. WILLIAM’S APARTMENT - MOMENTS LATER  We take in the apartment. There’s a beaten armchair,  which sits in front of an outdated television.  There’s a noticeable lack of life and photographs in this  place.  IN THE SMALL KITCHEN  William places a cup of instant coffee in front of  Randall.  WILLIAM  Take milk?  RANDALL  No.  WILLIAM  Good.   Don’t have any.  31.  RANDALL (CONT'D) They sit there in silence.  WILLIAM (CONT’D)  You look like me, I think.   Like I used  to look.   You think?  Randall SHRUGS, indifferent and forcing his “pissed.”  RANDALL  So is there something you want to say to  me, cause otherwise I really need to get  going?  William looks confused.  WILLIAM  You want me to say something?  RANDALL  I told you I don’t want anything from  you.  WILLIAM  But you’re here.  RANDALL  Just to tell you that.  WILLIAM  Well, I’ve been told.  A longer beat.  RANDALL  You know what, if you’re just going to  sit here making excuses--  WILLIAM  Didn’t make any excuses.  RANDALL  Because there’s nothing you can say--  WILLIAM  Didn’t say anything for just that reason.  Another long beat.  WILLIAM (CONT’",
      "dialogue_count": 0,
      "word_count": 781
    },
    {
      "scene_number": 3,
      "slugline": "INT. SOUNDSTAGE - EVENING  We can hear a BUZZING CROWD out beyond the curtain, but  we’re backstage now.  ON KEVIN:  He sits in a chair backstage, rehearsing quietly.   He  looks very serious.  VOICE (O.S.)  Hey Kid.  Kevin looks up.   TED DANSON (Ted Danson!) stands behind  him.  KEVIN  Oh, hi Ted.   Thanks again for doing this.  TED DANSON  Oh, no need for thanks, trust me: they’re  paying me an absolute fortune.  (then)  Great scene for you by the way.  KEVIN  Right?   I’ve been asking for a dramatic  monologue for a year now, and he finally  gave me one.  (then)  When the prick tries, he can really  write.  Ted smiles.  TED DANSON  Well, I’ll see you out on the field.  Break a leg, Kid.  Ted Danson EXITS.   We hear the crowd GO NUTS.  Kevin takes a deep breath, steadies himself, and heads  out...  ON STAGE  Kevin ENTERS to applause, sits down on the set’s couch.  WARM-UP GUY  (to crowd)  Now remember where we left off everyone:  the Manny’s dad has shown up for an  unexpected visit.   But now Daddy is  leaving and the Manny is P to the O’d.  34.  (MORE)",
      "characters": [
        "DOCTOR K"
      ],
      "action_text": "Things are about to get realz up in  here... Handsome John, you handsome  bastard, take it away!  DIRECTOR JOHN  Okay, everyone settle, quiet please.  And... ACTION.  Ted Danson steps into the room, PULLING A SUITCASE.  TED DANSON  Guess I’ll get going.  Kevin sits there, sulking in silence.  TED DANSON (CONT’D)  Okay, well, lovely seeing you as always.  Let me know if you get that big promotion  to babysitter.   Or is babysitter actually  a demotion from nanny?  KEVIN  Good one.  TED DANSON  Oh for God’s sake, I’m trying to make  light of the situation.  KEVIN  That’s what you do.   My lightweight Dad.  TED DANSON  I’m sorry?  KEVIN  That’d be a first.   You being sorry.  TED DANSON  Son--  KEVIN  No, don’t son me.   Just go.  (intense)  Get the hell out of here.  Suddenly, you can hear a pin drop.   Casey (showrunner)  stands up behind the monitors, intrigued.  Kevin laughs to himself.  KEVIN (CONT’D)  “Son,” you called me?   What a joke.   I  see that pretty clearly now.   You know  why?  35.  WARM-UP GUY (CONT'D)  (MORE) Because this stupid job - my babysitting  job you get such pleasure mocking?   I  look at that little girl and I’d do  anything for her - trains, bullets, I’d  jump in front of any of them for her.  And she’s not even mine.   And for you to  just walk in and out of my life like you  have the past thirty years.  (then)  I’ll never understand it.   I’ll never  understand you.  (then)  I’m too old to be hurt by you anymore.  I’m too tired.   Just get the hell out of  here.  They stand there in silence until... Ted SIGHS, and EXITS.  A long beat of silence as the camera PUSHES IN tight on  Kevin until...  DIRECTOR JOHN  And CUT!  And slowly... the crowd goes ape-shit, recognizing  they’ve just seen something special.  Kevin takes a sheepish bow.   Casey approaches.  CASEY  Good stuff, Kevin.   Really, really great,  man.   Now let’s just take a quick whack  at the alt pass--  KEVIN  What?   Really?  CASEY  Kevin, we talked about this.   I liked it  ",
      "dialogue_count": 1,
      "word_count": 2702
    },
    {
      "scene_number": 4,
      "slugline": "INT. RANDALL’S HOME OFFICE - LATER  It’s late.   William stands in Randall’s elegant study,  looking at FRAMED FAMILY PHOTOS.  Randall ENTERS.  RANDALL  Sorry, just had to put the girls down.  William picks up a picture.  WILLIAM  These people, they’re--  RANDALL  My parents.   My adopted... my parents.   My  father passed away few years back.   My mom  still lives in the house I grew up in.  WILLIAM  You were with them your whole life?  RANDALL  From the start.  (then)  A fireman found me.   He took me to the  hospital and they were there.   They said  it felt meant to be.   Just one of those  lucky breaks, I guess.  William shakes his head, sadly.  WILLIAM  A fire station.   What a thing to have  done.  William puts down the photo.   Silence.  WILLIAM (CONT’D)  I should get going.   It was kind of  you... to be kind to me.  RANDALL  The girls enjoyed meeting you.   Maybe we  can have you by once in a--  WILLIAM  Oh, I don’t think that’s necessary.  RANDALL  No pressure, I just--  49.",
      "characters": [],
      "action_text": "WILLIAM  It’s just that I’m dying is all.  Probably best for everyone if this is a  one-time thing.  Randall looks up, surprised.  RANDALL  You’re sick?  WILLIAM  Dying, not sick.   Sick was months ago.  I’m toward the end, fortunately.  Silence.  RANDALL  I don’t know what to say.  WILLIAM  Nothing to be said.   I only tell you now  so you know where I’ve gone, when I’m  gone.   (then)  It was a kindness you’ve shown me,  letting me see them.   Your dad must have  been very proud of you.  And with that, William starts putting on his tattered  coat.  To his complete surprise, Randall’s heart breaks.  INT. KATE’S APARTMENT - CONTINUOUS  Kate, Toby, and Kevin sit on the couch.   They are  drinking wine (Kevin is chugging from the bottle).  KATE  I cannot believe I am drinking these  calories.  KEVIN  I just torpedoed my career, Sis.   You can  spare a hundred calories for me.  KATE  Hundred fifty.   TOBY  Hundred fifty.  Kate and Toby share a smile.  50. TOBY  (then, confused)  So you two are twins?  KATE  Schwarzenegger and DeVito, in the flesh.  KEVIN  Oh my God, what have I done!?   I’m an  unemployable thirty-five year old actor.  KATE  We turned thirty-six, Kev.  KEVIN  Oh God, that’s right!   Late thirties!  How did I get here!?  (then, to Toby)  Do you remember--  KATE  Do not tell him about Christa McAuliffe,  Kevin.  KEVIN  She was gonna be the first teacher in--  KATE  Kevin!  Kevin chugs more wine.  KEVIN  What am I going to do, Sis?  KATE  Broadway?  KEVIN  Can’t sing.  KATE  Porn?  KEVIN  Yeah, maybe.  Kate shares a concerned look with Toby.   She puts down  her drink.  51. KATE  Kevin: do you remember what Dad would  always say when something crappy happened  to us?  CUT TO:  INT. HOSPITAL - CONTINUOUS  We are in the room with all the newborn babies who need  extra monitoring.  TIGHT ON JACK  On the other side of the windowed glass, looking in.  He focuses on TWO LITTLE ONES, a BOY and a GIRL.  KATE (V.O.)  Whenever we’d get down, whenever we felt  like ",
      "dialogue_count": 0,
      "word_count": 1073
    }
  ]
}