{
  "slug": "three-billboards-outside-ebbing-missouri-2017",
  "title": "three billboards outside ebbing missouri",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 17955,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BILLBOARD ROAD - DAY 1   1 MILDRED HAYES, a woman in her early 50’s, driving along a country road, passes an old billboard, roadside. Whatever advert was on it is long since faded and torn. MILDRED drives on, to a second billboard a few hundred feet along the road. She notices this one a little more, though its old adverts are equally ramshackle. She slows to a stop. After looking up at the billboard a while, she slowly reverses and stops at the first, then at all three, stretching away to the quiet horizon. Makes a mental note of “EBBING BILLBOARD ADVERTISING”, then drives on again, leaving the three old billboards alone like tombstones on the dusty road.  INT. WELBY’S OFFICE - EBBING ADVERTISING - DAY 2   2 RED WELBY’s office, window looking onto MAIN STREET and the town’s POLICE STATION. RED, a cool-looking young guy, pretends to read a Penguin Classic as he observes the office hottie, PAMELA, pass in a cute dress. MILDRED strides on in.  MILDRED  You Red Welby?  RED  Yes, ma’am. How may I...?  MILDRED  They said those three billboards out on Drinkwater Road, you’re in charge of renting them out, that right?  RED  I didn’t know we had any billboards out on... Where is Drinkwater Road?  MILDRED  Road out past the Sizemore turn-off no- one uses since the highway got put in. RED checks a file. MILDRED observes a beetle on its back on the windowsill, trying to right itself.  RED  You’re right. Got three billboards out there. Nobody’s put nothing up out there since... 1986. That was ‘Huggies’.  MILDRED  How much to rent out all three of ‘em the year?",
      "characters": [],
      "action_text": "Which fades in favour of the doll   Talky Crissy   again: V/O But there’s someone new in town. EXT. FOREST HILLS TENNIS COURT. US OPEN. DAY. 1A   1A  BILLIE JEAN KING’s 29 year-old face, big on the screen, concentrating hard. We hear a grunt and the noise of a serve. A flash and Billie Jean has reached the ball, returned it. The ball comes back, but she is across the court with lightning speed and putting every ounce of energy into the shot, returns it again. We are inside her head: only the sound of her furious breathing, the ball and the squeak of tennis shoes can be heard. Back comes the ball, again and again, each time, Billie Jean punches it back until.... ...The world crashes in: a sudden surge of applause and cheering. The focus on Billie Jean’s face finally relaxes into a huge smile of triumph. UMPIRE V/O Game, set and match to Miss King. She throws the racket high into the air and we see she is surrounded by thousands of fans applauding wildly. LARRY KING, Billie Jean’s husband, jumps onto the court and embraces her. Title:   Battle of the Sexes  EXT. HIGH RISE OFFICE. NEW YORK. DAY. 1B   1B  A faceless, glass office building. Distant traffic and honking horns. Moving in on one of the many windows, we find... TV (V.O.) ...and Billie Jean King’s triumph in the US Open adds another Grand Slam to a list of titles that makes her the most successful woman player of all time and brings a phone call from a very special fan.... OMITTED 2   2  BATTLE OF THE SEXES - Simon Work File - 4/7/16   2 RED  The year? You wanna pay for three billboards on a road no-one goes down unless they got lost or they’re retards, for a year?  MILDRED  Quick, ain’t ya, Welby?  RED  Well... since what I say goes these days down at the Ebbing Advertising Desk, I’m gonna strike you a real good deal on those billboards, now, what was it you said your name was, Mrs...?  MILDRED  What’s the law on what ya can and can’t say on a billboard? I assume it’s ya can’t say nothing defamatory, and ya c",
      "dialogue_count": 0,
      "word_count": 1352
    },
    {
      "scene_number": 2,
      "slugline": "EXT. BILLBOARD ROAD - DAY 7   7 MILDRED drives ROBBIE, her 17-year-old son, past the billboards - checking his reaction. He sees them but gives nothing away.  EXT. SCHOOL - DAY 7B   7B She drops him at school. He heads off without a goodbye.  EXT. MAIN STREET - DAY 7C   7C She drives up MAIN STREET. Sees activity outside the police station; WILLOUGHY with his DESK SERGEANT, forcibly telling DIXON to stay behind, then crossing street to RED’s place.  EXT. GIFT SHOP - DAY 7D   7D She continues to the other end of town, a GIFT SHOP she works at. MILDRED’s co-worker, DENISE, black, 28, smokes outside.  MILDRED  Sorry I’m late, Denise.  DENISE  Did you put up those billboards to fuck with the cops yet?  MILDRED  They’re up.  DENISE  You go, girl! You go fuck those cops up! She pats MILDRED on the back, tosses her cigarette away, and they go inside.  INT. WELBY’S OFFICE - DAY 8   8 Quick-fire dialogue, RED at desk, DESK SERGEANT and WILLOUGHBY standing.  DESK SERGEANT  What the fuck do you think you’re doing, Welby, buncha billboards like that, you didn’t think there’d be some kinda ramifications? Legally?  RED  What’s the legal ramifications, Cedric? 6.",
      "characters": [],
      "action_text": "DESK SERGEANT  You want me to explain the legal ramifications, a little punk like you? And don’t call me Cedric.  RED  Ain’t contravening no laws on propriety, ain’t contravening no laws on any fucking thing. I checked all this up.  DESK SERGEANT  Oh yeah, where’d you check all this up?  RED  In a... book.  DESK SERGEANT  Which book, genius?  RED  Book called ‘Suck my ass, it’s none o’ your business’. WILLOUGHBY gives him a long cold stare.  WILLOUGHBY  How long has this person, or persons, rented these billboards out for?  RED  Oh, the year.  WILLOUGHBY  And how long she actually paid for?  RED  The year.  WILLOUGHBY  So it’s a she, huh?  RED  (pause) Ain’t at liberty to divulge that kinda information, Chief.  WILLOUGHBY  Mildred Hayes, perhaps?  RED  Ain’t at liberty to divulge that kinda information, Chief.  WILLOUGHBY  Do you really wanna fuck with the Ebbing Police Department, Red? Do ya? 7. RED  I guess.  INT. POLICE STATION, WILLOUGHBY’S OFFICE - DAY 9   9 WILLOUGHBY, DESK SERGEANT and DIXON.  DIXON  He said what?! To your face?!  DESK SERGEANT  No crime has been committed here.  DIXON  Defamation of character ain’t a crime?  DESK SERGEANT  It isn’t defamation if she’s simply asking a question.  DIXON  What are you, an idiot?  DESK SERGEANT  Don’t call me an idiot, Dixon.  DIXON  I didn’t call you an idiot. I asked if you was an idiot. It was a question.  WILLOUGHBY  (smiling) He got ya, Cedric!  DIXON  Well I’m gonna do something about it if yous two ain’t.  WILLOUGHBY  Where you going? Don’t fly off the handle! But Dixon has already stormed out.  DESK SERGEANT  Why in hell you keep that man on, Bill?  WILLOUGHBY  He’s a good man. At heart.  DESK SERGEANT  He tortured a guy in custody, Bill.  WILLOUGHBY  There was no... real evidence to support that. 8.",
      "dialogue_count": 0,
      "word_count": 504
    },
    {
      "scene_number": 3,
      "slugline": "EXT. MAIN STREET - DAY 10   10 As WELBY is coming out of his building, DIXON crosses the road towards him.  DIXON  Take ‘em down.  RED  Hah?  DIXON  Take ‘em down.  RED  Take what down?  DIXON  You think I wouldn’t take you out, right here on Main Street, Red?  RED  Thought you only take out black dudes, Dixon... DIXON goes to punch him, but WILLOUGHBY is suddenly there, grabs his punching arm and shoves him towards the station. People on the street are staring, especially the blacks.  DIXON  (to WELBY) Ain’t nobody never goes down that road, anyways. Unless they got lost, or they’re retards.  EXT. BILLBOARD ROAD - DAY 13   13 MILDRED interviewed by GABRIELLA, CAMERAMAN filming, all three billboards in the background.  GABRIELLA  This your first time on tv?  MILDRED  Uh-huh.  GABRIELLA  Well, don’t be nervous, is the main thing, and it’ll be fine. Just don’t look into the camera, obviously. MILDRED just stares at her.  GABRIELLA (CONT’D)  In three, two, one. So, Mildred Hayes, why did you put up these billboards? 9.",
      "characters": [],
      "action_text": "MILDRED  Well, my daughter, Angela, she got abducted, and she got raped and murdered seven months ago, on this self-same stretch o’ road here, unfortunately, and, to me... I mean, to me, it seems like the local police department is too busy goin’ round torturing black folks to be bothered doing anything about solving actual crime, so I kinda thought these here billboards might, y’know, concentrate their minds some.  INT. DIXON’S HOUSE - NIGHT 14   14 DIXON sits beside his MOMMA on the couch and is just to bite into a sandwich...  DIXON  Whatcha watching, Momma? The stupid news? ...when he’s stopped by MILDRED’s appearance on TV...  MILDRED (TV)  Seems like the local police department is too busy goin’ round torturing black folks to be bothered doing anything about solving actual crime... DIXON’S MOMMA looks at him.  DIXON  (mouthing) Fuck.  INT. WILLOUGHBY HOUSE - NIGHT 15   15 WILLOUGHBY and ANNE watching the end of the interview.  MILDRED (TV)  I don’t know what these policemen are doing, to be honest with you. I just know my daughter’s burnt body’s lying six feet under the ground while they’re eating Krispy Kremes and busting eight year-olds for skateboarding in parking lots.  GABRIELLA (TV)  And what has Chief Willoughby to do with all this, why single him out? 10. MILDRED (TV)  Well, he’s the head of ‘em, ain’t he? The buck’s gotta stop at somebody, don’t it?  GABRIELLA (TV)  And the buck stops at Willoughby?  MILDRED (TV)  Yeah, the buck stops at Willoughby. Dead right it does. He clicks it off, gets up, goes out of the house without a word.  EXT. WILLOUGHBY’S STABLE - NIGHT 16   16 WILLOUGHBY moodily tending the horses in the stable just outside the house. ANNE comes up.  ANNE  You alright there, fella?  WILLOUGHBY  Looks like we got a war on our hands.  EXT. MILDRED’S HOUSE - DAWN 17   17 WILLOUGHBY pulls up outside MILDRED’s poor, clapboard house. From here we can see that the BILLBOARDS puncturing the dusty horizon are only A MILE AWAY. MILDRED sees WILLOU",
      "dialogue_count": 0,
      "word_count": 6771
    },
    {
      "scene_number": 4,
      "slugline": "INT. WILLOUGHBY LIVING ROOM - CONTINUOUS 53   53 ANNE is lying on the couch, a small wet towel over her eyes. WILLOUGHBY sits in beside her and kisses her.  WILLOUGHBY  You don’t smell of puke. Which is good.  ANNE  Aquafresh. Trick I learned.  WILLOUGHBY  Women, huh?  ANNE  Oh yeah. Resourceful.  WILLOUGHBY  It’s still your turn to clean the horseshit outta the stable, y’know?  ANNE  Oh those fucking horses! They’re your fucking horses! I’m gonna have those fucking horses shot!  WILLOUGHBY  I’ll do it, you lazy bitch.  ANNE  Thank you, poppa. (pause) That was a real nice day. And that was a real nice fuck. You got a real nice cock, Mr Willoughby.  WILLOUGHBY  Is that from a play, “You got a real nice cock, Mr Willoughby?” I think I heard it in a Shakespeare one time.  ANNE  You dummy. It’s Oscar Wilde. She puts the towel back over her eyes as he laughs.  INT. WILLOUGHBY’S STABLE - NIGHT 54   54 The horses watch as he finishes shovelling the shit, lays out fresh hay, gives them a pat, thinks about the day, smiles.  WILLOUGHBY  “Oscar Wilde.” He smiles again, then picks up a black hood, on the outside of which he has pinned a note that reads “Don’t open the bag. Just telephone the boys”. 43.",
      "characters": [],
      "action_text": "He places the black hood snugly over his head so the note is visible, cocks a large handgun, raises the gun to his temple, and shoots himself through the head. His dead body falls heavily to the ground, the hood concealing all the mess.  INT. WILLOUGHBY HOUSE - CONTINUOUS 55   55 ANNE pulls the towel off her eyes, having heard something. She gets up and we go with her, camera on her face, as she moves all the way thru the house to the kitchen, where she stops suddenly, and her face falls...  ANNE  No. No. No...! We see what she sees - a plain white envelope propped on the bare kitchen table, the single word ‘ANNE’ dead center of it.  ANNE (CONT’D)  No! No! No! No! She breaks down crying on the cold kitchen floor.  WE HEAR WILLOUGHBY’S NOTE OVER THE FOLLOWING SILENT IMAGES; INT. WILLOUGHBY HOUSE - NIGHT 56A   56A POLLY and JANE framed in their dark doorway, as their mother cries on the floor;  EXT. WILLOUGHBY’S STABLE - NIGHT 56E   56E The horses bemused in WILLOUGHBY’s garden, as ANNE stands drained in the doorway of the stable, the crescent moon above it. She slowly trudges back to the house;  INT. WILLOUGHBY HOUSE - NIGHT 56G   56G ANNE lying on JANE’s bed, hugging POLLY and JANE to her, all eyes open, numb, as a UNIFORMED COP stands guard outside the room and other COPS move thru the house;  EXT. BEAUTIFUL MEADOW BESIDE LAKE - NIGHT 56H   56H The beautiful lakeside in the moonlight, and the one teddy- bear laying there that they missed, its grumpy little face;  EXT. WILLOUGHBY’S STABLE - NIGHT 56I   56I Flashing lights the COPS and AMBULANCE PEOPLE at the stable; 44. Blood seeping along the “Just telephone the boys” part of the note (so only the words ‘The Just’ aren’t blood-covered). The DESK SERGEANT winces as he opens the hood.  INT. WILLOUGHBY HOUSE - NIGHT 56J   56J WILLOUGHBY quietly finishing the note at the kitchen table, ANNE’s drunken feet, in fun socks, visible on the distant couch. He puts it in an envelope marked ‘ANNE’, gets up, and quietly leaves t",
      "dialogue_count": 0,
      "word_count": 1155
    },
    {
      "scene_number": 5,
      "slugline": "INT. POLICE STATION, MAIN ROOM - DAY 59   59 DIXON pulls on his jacket and looks out his window as the DESK SERGEANT speaks... POV OUT WINDOW: in his second storey window, WELBY sits at his desk, chatting with PAMELA, who laughs at a joke he’s made. END POV.  DESK SERGEANT  ...that the best thing, the only thing, to honor that man’s memory right now, is to go to work. Is to be a good cop. Is to walk in his shoes. Is to do what he did, every day of his life. Help people. DIXON straps on his belt, picks up his night-stick and walks out of the station.   WE TRACK HIM   IN ONE CONTINUOUS SHOT ...  EXT. POLICE STATION - CONTINUOUS 60   60 ...as he walks across the street, cars screeching to a halt, to WELBY’s building. He smashes its glass door with his night- stick and carries on thru it, and we continue tracking him...  INT. WELBY’S BUILDING - CONTINUOUS 61   61 ...as he walks up the stairs to the second floor, to WELBY in the office, startled at the glass smashing. He backs away from him...  RED  What the hell’s going on, Dixon? DIXON clubs WELBY in the face and WELBY goes down, PAMELA screaming. DIXON continues calmly to the window, smashes it with the night-stick, picks WELBY up and shoves him out of it. WELBY disappears out the window, his screams remaining for a second till they’re ended with a sickening thud.  PAMELA  You fucking pig! What the fuck are you doing?! DIXON clubs PAMELA across the face, breaking her nose. She collapses, and he walks all the way back down-stairs and into the street, and we continue to track him, as... 47.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 289
    },
    {
      "scene_number": 6,
      "slugline": "EXT. MAIN STREET - DAY 62   62 ...he comes out, sees WELBY, broken ankle/arm/hand, trying to get up and crawl away. DIXON comes up behind, clubs him back down...  DIXON  See, Red? I got issues with white folks too... DIXON calmly walks back into the police station, passing a well-dressed black man, ABERCROMBIE, on his way.  DIXON (CONT’D)  The fuck are you looking at? DIXON enters the station. ABERCROMBIE lowers his coffee, and we see his cop’s badge as he takes in the carnage on the street.   END OF TRACKING SHOT INT. MILDRED’S HOUSE, KITCHEN - DAY 63   63 MILDRED and ROBBIE, fixing cornflakes and coffee, TV on in b.g. The local news flashes back on, an image of WILLOUGHBY, the ANCHOR announcing...  ANCHOR (TV)  Reports, sadly, have come in overnight, that Chief William Willoughby of Ebbing, Missouri, took his own life early this morning... MILDRED reacts like she’s been punched...  ANCHOR (TV) (CONT’D)  ...in the grounds of his home. This report just in from Gabriella Forrester. TV cuts to GABRIELLA (who interviewed MILDRED weeks back) outside the WILLOUGHBY home, yellow cordon tape up, etc.  GABRIELLA (TV)  Tragedy came calling today upon this quiet family home outside of Ebbing, Missouri; a home belonging to Chief William Willoughby, his wife, Anne, his two young daughters, Polly and Jane. What appears to be a self-inflicted gunshot wound brought life to an end for Chief Willoughby, a man highly- respected in Ebbing for his diligence and his service to the community, a service that lasted more than 25 years. What led him to take his life in the early hours of this morning it is too early to speculate;  (MORE)  48.",
      "characters": [],
      "action_text": "there were rumors of illness; could it simply have been the pressure of the job; or could it have something to do with a story we ran here just two weeks ago, of these billboards, and the woman who put them there, Mildred Hayes... MILDRED flips the TV off with the remote.  EXT. SCHOOL - DAY 65   65 ROBBIE gets out of the car as a GROUP of TWO BOYS and ONE GIRL stare over at MILDRED. Suddenly a can of Coke hits the windscreen, from their direction. MILDRED looks at the fizz.  ROBBIE  Don’t. MILDRED gets out of the car, walks over to one of the BOYS.  MILDRED  Say, do you know who threw that can?  BOY  What can? MILDRED kicks him hard in the crotch. He goes down. She turns to the GIRL next to him.  MILDRED  How about you, honey? Do you know who threw that can?  GIRL  Uh, no, I didn’t really see... MILDRED kicks her hard in the crotch. She goes down. She stares at the other BOY, who kinda shudders. She goes back to the car, gets in, speeds off.  ROBBIE  (under breath) Thanks Mom.  INT. POLICE STATION, MAIN ROOM - DAY 67   67 DIXON’s FELLOW COPS slap him on the back in praise, as ABERCROMBIE quietly enters and walks up to the DESK SERGEANT.  DESK SERGEANT  And what can I do for you today, Sir?  ABERCROMBIE  What’s your name?  GABRIELLA (TV) (CONT'D)  49. DESK SERGEANT  Name’s on my tag, man. You hard of reading?  ABERCROMBIE  Hard of reading, no, no. That’s good, “hard of reading”. It’s kind of like “hard of hearing”, but it’s actually it’s “hard of reading’, it’s like a play on words or something.  DESK SERGEANT  What do you want?  ABERCROMBIE  Uh, I've been sent down to uh, take over from Chief Willoughby, in light of last night’s unfortunate event.  DIXON  (from back of room) You have got to be fucking kidding me!  DESK SERGEANT  Do you have any documentation to prove that, Sir?  ABERCROMBIE  You really wanna see my documentation, fucker? ABERCROMBIE stares at him, cold as ice.  DIXON  Yeah, see his documentation! DESK SERGEANT backs down. ABERCROMBIE strolls up to D",
      "dialogue_count": 0,
      "word_count": 1549
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BILLBOARD ROAD - DUSK 69   69 The billboards and surrounding landscape from various angles at sunset; including details like the half-eaten flowers and the insects thereon; the burnt patch of dirt; and the billboards themselves.  WILLOUGHBY (V.O.)  ...where you never catch a break, then five years down the line some guy hears some other guy bragging about it in a bar-room or a jail-cell and the whole thing is wrapped up thru sheer stupidity. I hope that might be true for Angela, I really do. Second, I gotta admit, Mildred, the billboards were a great fucking idea. They were like a chess move. And although they had absolutely nothing to do with my dying, I’m sure that everyone in town will assume that they did, which is why, for Willoughby’s counter-move, I decided to pay the next month’s rent on ‘em. I thought it’d be funny, you having to defend ‘em a whole nuther month after they’ve stuck me in the ground. The joke is on you, Mildred, ha ha, and I hope they do not kill you. So good luck with all that, and good luck with everything else too. I hope and I pray that you get him.  EXT. DIXON’S HOUSE - DUSK 70   70 DIXON and MOMMA sitting on their porch at sunset, with beers.  MOMMA  Well, do you want me to go down and talk to them?  DIXON  No I don’t want you to go down and talk to them. Jesus! Somebody sending their goddam mother down to talk to the goddam police, for Christ’s sakes. (pause) And say what?  MOMMA  And say to give you your job back. And to get rid of the black guy.  DIXON  They ain’t gonna listen to some guy’s mother, asking them to get rid of some black guy. Things have moved on in The South! 55.",
      "characters": [],
      "action_text": "MOMMA  Well it shouldn’t’ve! (pause) Will they give you any money for being laid off an’ all?  DIXON  I don’t know what the compensation scheme is for when you throw a guy out of a window, Mom. I guess I shoulda looked into that beforehand. Let me Google that!  MOMMA  A couple grand, maybe? You’ve been there three years. Not counting the five years at the Academy. Six if you count the year you were held back. DIXON pulls on his jacket.  MOMMA (CONT’D)  Where ya going?  DIXON  None of your business.  MOMMA  Off to see your fancy woman?  DIXON  I don’t got a fancy woman.  MOMMA  Yeah. I know! He gives her a dirty look.  DIXON  You wanna watch yourself.  MOMMA  Or you’ll do what?  DIXON  Blow your goddam head off. MOMMA laughs loudly. Dixon gets in his car and drives off.  EXT. ROAD APPROACHING BILLBOARDS - CONTINUOUS 71A   71A MILDRED and ROBBIE, driving a road adjacent to the billboard road, the billboards not yet in sight.  ROBBIE  Oh, did you hear the news? 56. MILDRED  What news?  ROBBIE  That Dixon guy threw that Welby guy out his window this morning.  MILDRED  You’re shitting me. Is Welby okay? ROBBIE shrugs. MILDRED is sick to her stomach, and just when it seems like things can’t get any worse, she turns onto the Billboard Road and suddenly sees...  MILDRED (CONT’D)  You’re shitting me! ...ALL THREE OF THE BILLBOARDS ARE ON FIRE. MILDRED speeds towards them...  EXT. BILLBOARD ROAD - NIGHT 72   72 We speed towards the fiery billboards; the third totally ablaze, the second half-ablaze, words still legible, the first just getting going. MILDRED grabs the car’s extinguisher...  MILDRED  Go get the one from the house!  ROBBIE  Shouldn’t I call the fire department?  MILDRED  Fuck the fire department! They probably started it!  ROBBIE  Well don’t do anything stupid! But MILDRED’s already racing towards the first billboard, spraying it all over from close up. ROBBIE speeds off. MILDRED keeps spraying like a madwoman...  MILDRED  (quietly) Scumbags, scumbags, scumbags. ",
      "dialogue_count": 0,
      "word_count": 1231
    },
    {
      "scene_number": 8,
      "slugline": "EXT. BILLBOARD ROAD, SECOND BILLBOARD - CONTINUOUS 78   78 GABRIELLA continuing, doing a little walk past the billboard for the camera, which pans with her...  GABRIELLA  ...and as sad as the spectacle of these burned out billboards might be, in light of the death of Chief Willoughby, this reporter for one can’t help but wonder whether this finally puts an end to the strange saga of the three billboards outside of Eb... MILDRED calling from the car...  MILDRED  This don’t put an end to shit, you fucking retard, this is just the fucking start, so why don’t you put that on your “Good Morning Missouri fucking Wake-Up Broadcast”, bitch! MILDRED drives off at speed from the open-mouthed GABRIELLA, who finally gives the CAMERAMAN the sign to cut.  EXT. DIXON’S HOUSE - DAY 79   79 DIXON reading a comic book on the porch, beer in hand. MOMMA comes out, worried.  MOMMA  I see on the TV there was a buncha fires lit outside o’ town last night.  DIXON  Buncha fires, huh?  MOMMA  Out at those billboards.  DIXON  Yeah, well, back when I was a cop I woulda been interested in who set those fires cos, technically, that’s arson, but as I am no longer employed by those people I don’t really give a good god damn, now do I? Telephone rings, they look at each other. DIXON goes into the house and gets it.  DIXON (CONT’D)  The Dixon residence. Oh, hey Sarge! How you doing? You got any news? 60.",
      "characters": [],
      "action_text": "DESK SERGEANT (O.S.)  News about what?  DIXON  I dunno, about my job and stuff?  INT. POLICE STATION, MAIN ROOM - CONTINUOUS 80   80 DESK SERGEANT at desk, squad room busy, ABERCROMBIE talking to other COPS in b.g.  DESK SERGEANT  No, no. What? No. Anne Willoughby just dropped in a letter that Bill wrote you before he died.  INT. DIXON’S HOUSE - CONTINUOUS 81   81  DIXON  Oh my God! What’s it say?  DESK SERGEANT (O.S.)  I haven’t read it, Dixon, it’s not my letter.  DIXON  Oh. Well, I’ll come right down...  INT. POLICE STATION, MAIN ROOM - CONTINUOUS 82   82 DESK SERGEANT looks at the distant ABERCROMBIE and the COPS listening to him...  DESK SERGEANT  Well, uh... I don’t think that’d be such a great idea, as things stand, Jason. Uh, you’ve still got your keys to the station-house though, right?  DIXON (O.S.)  Yeah.  DESK SERGEANT  Well, why don’t you just come pick it up when everyone’s gone home. I can leave it on your desk for ya.  INT. DIXON’S HOUSE - CONTINUOUS 83   83  DIXON  Oh. Okay. 61. DESK SERGEANT (O.S.)  Actually, yeah, then when you’re done you can just leave your keys, save us picking ‘em up later. DIXON nods, so he won’t have to cry.  EXT. POLICE STATION - NIGHT 85   85 The dark street at night. Inside the lowered blinds of the police station there’s the faint glow of a flashlight.  INT. POLICE STATION - NIGHT 85A   85A DIXON in the dark, empty station with a flashlight, eating Doritos, headphones on, looks at the “OFFICER JASON DIXON” envelope on his desk, beside Angela’s file. He opens it.  WILLOUGHBY (V.O.)  Jason, Willoughby here. I’m dead now, sorry about that, but there’s something I wanted to say to you that I never really said when I was alive. I think you’ve got the makings of being a really good cop, Jason, and you know why? Because, deep down, you’re a decent man. I know you don’t think I think that, but I do, Dipshit. You play hopscotch when you think no-one’s looking, for Christ’s sakes...  EXT. MAIN STREET - NIGHT 86   86 Street deserte",
      "dialogue_count": 0,
      "word_count": 699
    },
    {
      "scene_number": 9,
      "slugline": "INT. POLICE STATION, MAIN ROOM - CONTINUOUS 88   88 Telephone on DESK SERGEANT’s desk starts ringing, red light flashing, but as DIXON still has his headphones on he can’t hear it. Phone stops ringing after a while.  WILLOUGHBY (V.O.)  ...But as long as you hold onto so much hate then I don’t think you’re ever going to become...  INT. WELBY’S OFFICE - CONTINUOUS 89   89 MILDRED gets up and exits frame with her backpack, leaving just the table, window and the police station in shot. SOUND ONLY of four clinking bottles taken out of backpack. MILDRED moves back into shot, looks at the phone again.  WILLOUGHBY (V.O.)  ...What I know you wanna become...  INT. POLICE STATION, MAIN ROOM - CONTINUOUS 90   90 DIXON walking around the station, reading tearfully. Passes DESK SERGEANT’s desk, as phone starts ringing again. He still can’t hear it. After five or six rings it stops.  WILLOUGHBY (V.O.)  ...A Detective.  INT. WELBY’S OFFICE - CONTINUOUS 91   91 MILDRED looks at the phone she’s just put down, thinking, rolling a cigarette lighter around in her hand, thumbing the flint but not lighting it, until...  MILDRED  Fuck ‘em! She lights the lighter, and we pan with her and finally see the FOUR MOLOTOV COCKTAILS she’s placed on the table. She quickly picks up and lights the first, moves to the window and launches it high out across the street. It explodes BELOW DIXON’S WINDOW, setting it and the whole wall alight.  WILLOUGHBY (V.O.)  Cos you know what you need to become a detective? And I know you’re gonna wince when I say this... 63.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 267
    },
    {
      "scene_number": 10,
      "slugline": "INT. POLICE STATION - CONTINUOUS 92   92 DIXON hasn’t noticed the sound or the flames. He turns the letter to the 2nd page.  WILLOUGHBY (V.O.)  ...But what you need to become a detective... is Love. DIXON winces.  WILLOUGHBY (V.O.)  Because thru Love comes Calm, and thru Calm comes Thought. And you need Thought to detect stuff sometimes, Jason. It’s kinda all you need.  INT. WELBY’S OFFICE - CONTINUOUS 93   93 MILDRED tosses the second Molotov out...  WILLOUGHBY (V.O.)  You don’t even need a gun. And you definitely don’t need Hate.  EXT. POLICE STATION - CONTINUOUS 94   94 It hits the SECOND STOREY WINDOWS, setting them alight.  WILLOUGHBY (V.O.)  Hate never solved nothing...  INT. POLICE STATION - CONTINUOUS 95   95 DIXON is wrapped up in the letter, chewing his fingernails, flames leaping behind him...  WILLOUGHBY (V.O.)  But Calm did. And Thought did. Try it. Try it just for a change. No-one’ll think you’re gay.  INT. WELBY’S OFFICE - CONTINUOUS 96   96 MILDRED tosses the third Molotov out...  INT. POLICE STATION - CONTINUOUS 97   97 Third Molotov hits THE POLICE STATION DOOR, setting it alight. 64.",
      "characters": [],
      "action_text": "WILLOUGHBY (V.O.)  And if they do, arrest ‘em for homophobia! Won’t they be surprised!  INT. POLICE STATION - CONTINUOUS 98   98 Flames still leap outside DIXON’s window as DIXON, his back to it, keeps reading.  WILLOUGHBY (V.O.)  Good luck to you, Jason. You’re a decent man, and yeah you’ve had a run of bad luck...  INT. WELBY’S OFFICE - CONTINUOUS 99   99 IN SLOWMO, MILDRED tosses out the final Molotov...  WILLOUGHBY (V.O.)  ...But things are gonna change for you...  EXT. MAIN STREET - CONTINUOUS 100   100 IN SLOWMO, the Molotov arcs up across the street...  WILLOUGHBY (V.O.)  I can feel it. ...and IN NORMAL SPEED, SMASHES IN THRU DIXON’S WINDOW...  INT. POLICE STATION - CONTINUOUS 101   101 DIXON finally notices this one, as it explodes behind him and knocks him off his feet, his desk and that whole side of the room set ablaze. He sees that the station door is on fire also, blocking his exit, and the ANGELA HAYES file on his desk on fire too. He grabs and pats it against himself, getting the flames out but getting petrol all over himself in the process. DIXON looks around, checks a locked back door, and realises there is no way out of the building other than thru his own the fiery broken window.  DIXON  Calm. Calm. Standing in front of the window, he looks down at the file, places it safely up inside his shirt, hugs it tightly to his chest, takes a few steps back, then makes a running leap, headfirst thru the flames and out the window. 65.",
      "dialogue_count": 0,
      "word_count": 447
    },
    {
      "scene_number": 11,
      "slugline": "EXT. MAIN STREET - CONTINUOUS 102   102 DIXON lands on the sidewalk in a heap, his clothes all alight. He quickly pulls the case file out from under his shirt and tosses it as far away from the flames as he can. It lands in a clean spot, no flames touching it, which can’t be said for DIXON. He rolls around, trying to put himself out, but it’s just making it worse, he’s like a fireball... Across the street, MILDRED comes out of the WELBY building and sees him, horrified, just as JAMES turns a far corner and sees DIXON on fire and MILDRED in the doorway. He sprints over and beats out the flames with his hands and clothes but DIXON’s head, hands and body are badly charred. MILDRED turns away from him, horrified, and sees the case file lying there, and realises what DIXON has done, as the sirens and blue lights of the AMBULANCE and FIREMEN arrive.  EXT. MAIN STREET - DAWN 103   103 LATER. Fire almost out, building ravaged. MILDRED sits exhausted on the sidewalk outside WELBY’s, JAMES beside her, looking at her suspiciously. She looks away. ABERCROMBIE comes over.  ABERCROMBIE  (to MILDRED) So what did you see?  JAMES  Well when we turned the corner from Spring, the fire was already raging, so, and then two seconds later the cop guy just jumps out the window...  ABERCROMBIE  Wait, the two of you turned the corner from Spring? Where were you before this?  JAMES  Round at my place.  ABERCROMBIE  You two are boyfriend and girlfriend?  JAMES  Well, it’s early stages, y’know.  ABERCROMBIE  (to MILDRED) That right?  MILDRED  We’ve had a couple dates. 66.",
      "characters": [],
      "action_text": "ABERCROMBIE moves off, suspicious.  JAMES  So you wanna go out to dinner next week?  MILDRED  I’ll go out to dinner with ya. But I ain’t gonna fuck ya. She heads off.  JAMES  Well, I ain’t gonna fuck you neither. (quietly) I guess.  INT. HOSPITAL ROOM - DAY 104   104 WELBY reading. A man, face and body bandaged (it’s DIXON, though WELBY can’t see this) is wheeled in by a NURSE.  NURSE  (to WELBY) Burn victim. He’s pretty heavily sedated. NURSE leaves. WELBY hobbles over to take a look. Half DIXON’s hair is gone and only his eyes are visible thru the bandages.  RED  Hey man? You doing okay? Jeez, you got burned up pretty bad. You’ll be okay though, don’t worry. You want a glass of orange juice? I got a straw somewheres... The eyes behind the bandages start to cry.  RED (CONT’D)  Hey man, don’t cry. You’ll be okay.  DIXON  I’m sorry, Welby.  RED  (pause) You know me?  DIXON  I’m sorry.  RED  Sorry for what, man?  DIXON  For throwing you out the window. 67. WELBY realises finally, starts backing away.  RED  Save it.  DIXON  I’m sorry.  RED  I don’t care. And stop crying. The salt’ll just fuck up your wounds.  DIXON  I thought salt was supposed to be good for wounds.  RED  Well what am I, a fucking doctor?! WELBY goes back to his bed. Sound of DIXON still crying. DIXON’S POV: Thru bandages, of the ceiling, him crying still. Then the SOUND of liquid pouring. Then the SOUND of shuffling steps. Then the POV catches WELBY, limping over. Carrying a glass of orange juice. He places it beside DIXON’s bed and puts a straw in it. POV follows WELBY a little way back to his bed then drifts to the ceiling and remains there. As his crying continues.  INT. MILDRED’S HOUSE - CONTINUOUS 106   106 A knock on the front door. MILDRED looks out thru the spyhole, doesn’t recognise JEROME, who knocks again.  MILDRED  Who is it?  JEROME (O.S.)  Oh you don’t know me really.  MILDRED  Well what you want?  JEROME (O.S.)  I come about the billboards.  MILDRED  What about ‘em?  JEROME (O.S.)  They",
      "dialogue_count": 0,
      "word_count": 2595
    },
    {
      "scene_number": 12,
      "slugline": "EXT. MILDRED’S GARDEN - DAY 121   121 MILDRED sitting on swing-set, DIXON with beanie in hand, a repeat of Willoughby and his hat from long ago.  DIXON  I don’t wanna get your hopes up, alright, but there’s a guy, and I think he might be the guy. I got his DNA. I got a lot of it, actually. They’re making the checks as we speak.  MILDRED  He’s in jail?  DIXON  No, but he ain’t gonna be hard to find.  MILDRED  Why do you think he’s the guy?  DIXON  I heard him talking about something that he did to a girl in the middle of last year. I couldn’t hear all of it, but it sounded a lot like what happened to Angela. Then he beat the crap outta me. But cos of that I got a bunch of his DNA. So I wanted to let you know sooner rather than later. I didn’t want you to give up hope, y’know?  MILDRED  I’ve been trying not to.  DIXON  Well, all you can do is try, as my Momma says. Not so much about hope as about... well, I didn’t used to be very good at English at school, so it was more “All you can do is try... to not be so crap at English.” Cos you need English, really, if you wanna be a cop. If you wanna be anything, really. (pause) Unless you live in Mexico or something. But who wants that? He gets up to go.  MILDRED  Hey Dixon? (pause) Thanks. He smiles, and she watches him drive away, out past the billboards. She sits there a while, thinking. 78.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 273
    },
    {
      "scene_number": 13,
      "slugline": "INT. POLICE STATION, WILLOUGHBY’S OFFICE - DAY 126   126 In the burnt-out office, DIXON is sitting down. ABERCROMBIE closes the office door and sits across from him.  ABERCROMBIE  You did good, Jason. You did real good. But he wasn’t the guy.  DIXON  (stunned) What?  ABERCROMBIE  There was no match to the DNA, no matches to any other crimes of this nature, to any crimes at all, in fact. And his record is clean. Maybe he was just bragging.  DIXON  He wasn’t just bragging.  ABERCROMBIE  Well, that’s as may be. But at the time of Angela’s death he wasn’t even in the country.  DIXON  Where was he?  ABERCROMBIE  But I’ve seen his records of entry and exit to the States, and I’ve spoken to his Commanding Officer. He wasn’t in the country, Dixon. He ain’t our guy.  DIXON  He might not be our guy, but he still done something shitty.  ABERCROMBIE  Not in Missouri he didn’t.  DIXON  Where was he?  ABERCROMBIE  That’s classified information.   *  DIXON  Come on, man. 79.",
      "characters": [],
      "action_text": "ABERCROMBIE  If the guy’s got a Commanding Officer, and if the guy got back to the country nine months ago, and if the country where he was is classified, which country do you think he was in? (pause) I’ll give you a clue. It was sandy.  DIXON  That doesn’t really narrow it down.  ABERCROMBIE  All you need to know is, he didn’t do nothing to Angela Hayes. So we’re gonna keep looking. Alright? Pause. DIXON takes out his badge, shows it to ABERCROMBIE.  DIXON  I found my badge after all. DIXON looks at it a few seconds, then slides it across the table to ABERCROMBIE, and leaves.  INT. DIXON’S HOUSE - NIGHT 127   127 MOMMA asleep, open-mouthed, on couch, TV on. DIXON watches her a while, then dials a number on the phone, which he then carries into his MOM’s bedroom, sitting on her bed. We now see that he has a shotgun in his hand.  EXT. BILLBOARD ROAD - NIGHT 129   129 MILDRED trudging the dirt at the billboards, replacing the dead pot plants. At the third billboard, her cellphone rings.  MILDRED  Hello?  DIXON (O.S.)  It’s Dixon.  MILDRED  (pause) Tell me.  DIXON (O.S.)  (pause) He wasn’t the guy. MILDRED crumples down beside the burnt patch of ground. She cries a quiet while, lets out a long, cold breath, then picks the phone back up. 80. MILDRED  I guess you’re sure, right?  DIXON (O.S.)  He, um, he wasn’t even in the country when it happened. So, whatever he did, he didn’t do it round here. (pause) I’m sorry I got your hopes up.  MILDRED  It’s alright. At least I had a day of hoping. Which is more than I’ve had for a while. I’d better go.  INT. DIXON’S HOUSE, BEDROOM - CONTINUOUS 129A   129A DIXON idly taps the shotgun against his lips.  DIXON  Um, there was one thing I was thinking.  MILDRED (O.S.)  What’s that?  DIXON  Well,... I know he isn’t your rapist. He is a rapist, though. I’m sure of that.  INT. BILLBOARD ROAD - CONTINUOUS 129B   129B  MILDRED  What are you saying?  DIXON (O.S.)  I got his license plate. I know where he lives.  MILDRED  Where’s he live?  ",
      "dialogue_count": 0,
      "word_count": 554
    },
    {
      "scene_number": 14,
      "slugline": "INT. DIXON’S HOUSE, BEDROOM - CONTINUOUS 130   130 DIXON puts the phone back in its cradle. Looks at the gun in his arms. Leaves it on his bed. He looks in on his sleeping MOMMA.  EXT. BILLBOARD ROAD - DAWN 131   131 The billboards as the sun begins to rise on the horizon.  EXT. MILDRED’S HOUSE - DAWN 131A   131A Sunrise behind the empty swing-set.  INT. MILDRED’S HOUSE - DAWN 132   132 MILDRED looks in on ROBBIE, sleeping quietly, a drawing of Angela he’s done pinned on the wall above his pillow.  EXT. MILDRED’S HOUSE - DAWN 133   133 MILDRED puts a thermos, sandwiches and Doritos in the car. DIXON places a shotgun wrapped in a blanket inside too. MILDRED looks at it lying there. They exchange a look, get in the car and drive.  EXT. BILLBOARD ROAD - CONTINUOUS  The burned backs of the billboards framed along the roadside, as the car heads away towards the horizon.  INT. CAR DRIVING BILLBOARD ROAD - DAWN 134   134 As the car rolls along the road, they’re both quiet, nervous. They drive in silence a while.  MILDRED  Hey Dixon?  DIXON  Yeah?  MILDRED  I need to tell you something. (pause) It was me who burned down the police station.  DIXON  Well, who the Hell else would it have been? 82.",
      "characters": [],
      "action_text": "She smiles. They drive on in silence.  MILDRED  Dixon?  DIXON  Yep?  MILDRED  You sure about this?  DIXON  About killing this guy? (pause) Not really. You?  MILDRED  (pause) Not really. They continue on.  MILDRED (CONT’D)  I guess we can decide along the way. DIXON nods. She smiles. They drive on.  END  83.",
      "dialogue_count": 0,
      "word_count": 269
    }
  ]
}