{
  "slug": "to-all-the-boys-ive-loved-before-2018",
  "title": "to all the boys ive loved before",
  "genre": "romance",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 2,
  "characters": [
    "EMILY",
    "LARA JEAN"
  ],
  "total_words": 22907,
  "total_dialogue": 2,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. COVEY HOUSE - LIVING ROOM - EVENING   *  LARA JEAN COVEY, 16, Korean-American lies sideways on an   *  oversized arm chair reading a 1970’s HARLEQUIN ROMANCE NOVEL.   *  A DAMSEL IN DISTRESS is on the cover, a STRAPPING MAN looms   *  either menacingly or sensually behind her.   *  Lara Jean is ENRAPTURED with the book in a way that makes us   *  think she’s alone in the room.   *  LARA JEAN (V.O.)   *  My family says I live too much in   *  head.   *  Something she reads in the book makes Lara Jean GASP. Then, a   *  THROW PILLOW hits her in the side of the head.   *  LARA JEAN   *  (looking up)   *  Hey!   *  On the other side of the room the pillow thrower aka Lara   *  Jean’s little sister KITTY, precocious, funny, doesn’t   *  realize she’s only nine, sets up a game of SORRY!   *  KITTY   *  Are you playing or what?   *  LARA JEAN   *  I just wanna finish this chapter.   *  Another sister, MARGOT, 18, very put together, an adult in a   *  teenager’s body, sits on the couch next to her boyfriend,   *  JOSH, 17 - cute in a dorky way, typical guy-next-door.   *  MARGOT   *  It’s okay, Kitty. We can play with   *  three people.   *  From OC we hear a LOUD CRASH as a PAN DROPS in the kitchen.   *  LARA JEAN   *  Do you think we should go in there   *  and help him?   *  MARGOT   *  You know he wants to do it himself.   *  KITTY   *  I hate when Dad tries to make   *  Korean food. It always tastes like   *  a butt.   *",
      "characters": [],
      "action_text": "MARGOT   *  I don’t where you got a taste for   *  butt - but regardless - no matter   *  what dad puts in front of you I   *  want you to take a bite and say,   *  “Mmmm. Just like Mom’s.” Okay?   *  KITTY   *  I was still eating smushed peas and   *  bananas when Mom died. I have no   *  idea what her Bo-Ssam tasted like.   *  LARA JEAN   *  Come on, Kitty. Do it for dad.   *  KITTY   *  Maybe if we didn’t all pretend we   *  loved his attempts at Korean food   *  so much we wouldn’t have to eat it   *  on every special occasion. What’s a   *  girl gotta do to get a   *  cheeseburger?   *  MARGOT   *  He doesn’t want us to lose touch   *  with our roots. It’s sweet.   *  JOSH   *  I love your dad’s cooking.   *  LARA JEAN   *  Your opinion doesn’t count. I once   *  saw you eat a hot dog out of a   *  trash can.   *  MARGOT   *  Is that true?   *  JOSH   *  It was from the tray on top of a   *  trash can and it was Lara Jean’s   *  leftovers. Not some stranger’s.   *  LARA JEAN   *  Still. It’d crossed into the   *  threshold of trash.   *  MARGOT   *  Gross.   *  JOSH   *  (to Lara Jean)   *  Way to sell me out, by the way.   *  Blue (mm/dd/yyyy)   2. Lara Jean smiles, shrugs and goes back to her book.   *  DR. COVEY (O.C.)   *  We’re ready!   *  The sisters give each other “here we go” looks.   *  INT. COVEY HOUSE - DINING ROOM - SAME   *  Everyone sits around the table. DR. COVEY, 50’s, white, an OB-   *  GYN, trying his best to raise three daughters on his own,   *  serves a VERY BURNT (and not in the right way) PORK SHOULDER.   *  He struggles to cut it.   *  LARA JEAN   *  (whispers to Margot)   *  It’s suppose to fall off the bone.   *  That’s like a rubber chicken.   *  MARGOT   *  Shh.   *  DR. COVEY   *  I ran out of time to make the kim-   *  chi so that’s store bought, sorry   *  girls.   *  The girls secretly smile. Dr. Covey passes a plate to Margot.   *  DR. COVEY (CONT’D)   *  I can’t believe this is your last   *  night at home, kiddo. We’re just ",
      "dialogue_count": 0,
      "word_count": 1199
    },
    {
      "scene_number": 2,
      "slugline": "EXT. NEIGHBORHOOD - DAY Middle school versions of Lara Jean and Josh ride bikes around the neighborhood. Lara Jean has braces. LARA JEAN (V.O.) Space between the words. Boy who was a friend. We used to ride our bikes everywhere. They jump over puddles and race down the street. INT. MOVIE THEATER - EVENING LARA JEAN (V.O.) We liked all the same gory horror movies. Josh and Lara Jean both scream and their popcorn goes flying into the air. EXT. SCHOOL BLEACHERS - DAY   *  LARA JEAN   (V.O.) And we’d talk about everything. Even weird stuff. They eat their lunch on the empty bleachers at school -   *  LARA JEAN Would you rather only drink water for the rest of your life? Or, be allowed to drink anything you want but it all has a drop of pee in it? JOSH Is it clean pee? LARA JEAN Yes. It’s just one drop of clean, disease free pee. JOSH (seriously considering) Clear or Yellow? LARA JEAN Gotta be at least a little yellow. JOSH Pee. Definitely pee. (explaining)  Blue (mm/dd/yyyy)   6.  (MORE)",
      "characters": [],
      "action_text": "I don’t think I can give up Mountain Dew. Plus side, it’s yellow anyway so you wouldn’t even notice. LARA JEAN Haha, Sicko. JOSH Come on you know you choose pee too. LARA JEAN Oh yeah, definitely. Pee’s the only way to go. They both laugh. LARA JEAN (V.O.) It’s not that we stopped being friends when Josh and Margot got together. It was just different. INT. MARGOT’S CAR Margot drives. Josh is in front and Lara Jean is in the back. LARA JEAN (V.O.) Margot had her license so we didn’t need to ride our bikes anymore. EXT. BLEACHERS -   *  Margot, Josh and Lara Jean eat their lunch on the bleachers.   *  LARA JEAN (V.O.) And Josh was different too... MARGOT (grossed out) Water. Definitely water. JOSH Yeah, me too. Definitely. INT. MOVIE THEATER - LARA JEAN (V.O.) They didn’t want me to feel left out so they invited me everywhere, even on dates.  Blue (mm/dd/yyyy)   7.  JOSH (CONT'D) Lara Jean looks around the movie theater, all the other teenage couples are sucking face hard. LARA JEAN (V.O.) They tried to make it as normal as possible... She looks over at Josh and Margot who, in contrast to the others, are very politely watching the screen. LARA JEAN (V.O.) But I still felt like a third wheel. She looks down and sees they are HOLDING HANDS.   *  INT. LARA JEAN’S BEDROOM - LAST SUMMER   *  We see Lara Jean spying on Margot and Josh out her bedroom   *  window. They are MAKING OUT.   *  LARA JEAN (V.O.)   *  It’s not that I wasn’t happy for   *  them or wanted them to break-up or   *  anything. But I missed my friend.   *  And so...I did this thing I do,   *  where when I’m trying to figure out   *  what my feelings for someone, I   *  write them a letter.   *  (small beat)   *  I guess you could call it a love   *  letter.   *  She goes over to her desk and we see her writing,   “DEAR   *  JOSH...”   *  LARA JEAN (V.O.)   *  It wasn’t a letter to send. It was   *  just for me. To understand why I   *  felt the way I did. How could you   *  miss someone you saw all the ti",
      "dialogue_count": 0,
      "word_count": 1390
    },
    {
      "scene_number": 3,
      "slugline": "INT. AIRPORT - SAME   *  Dr. Covey and Kitty both hug Margot. Lara Jean hugs her last.   *  Dr. Covey senses they need a moment.   *  DR. COVEY   *  Come on, Kitty. Let’s go buy Margot   *  a magazine for the plane.   *  They walk off.   *  MARGOT   *  Are you gonna be okay? School?   *  Taking care of things around the   *  house? Driving?   *  LARA JEAN   *  Don’t worry about me. I got this.   *  Lara Jean smiles a BIG FAKE SMILE.   *  MARGOT   *  Do you really have this or are you   *  doing that thing you do where you   *  pretend you’re okay when you’re   *  not.   *  LARA JEAN   *  You know about that?   *  MARGOT   *  You can lie to your father and you   *  can lie to your friends. But you   *  can’t -   *  LARA JEAN   *  - lie to you sister. I know. It’s   *  super annoying.   *  Margot looks at Lara Jean. She hasn’t answered her question.   *  LARA JEAN (CONT’D)   *  I will be okay.   *  MARGOT   *  Do me a favor. Try and hang out   *  with more than just Christine this   *  year. Okay?   *  LARA JEAN   *  What are you talking about?   *  Blue (mm/dd/yyyy)   12.",
      "characters": [],
      "action_text": "MARGOT   *  (not sure how to say it)   *  Sometimes I worry you don’t have   *  enough people in your life.   *  LARA JEAN   *  That’s crazy. I have tons of   *  people.   *  MARGOT   *  Me, Daddy, Kitty, Christine. That’s   *  it.   *  LARA JEAN   *  And Josh.   *  MARGOT   *  Do you really think you’ll still be   *  hanging out with my ex-boyfriend   *  after I leave for college?   *  LARA JEAN   *  I ate lunch with the two of you   *  everyday last year. What am I   *  supposed to do? Eat lunch alone.   *  MARGOT   *  That’s what I’m talking about. Even   *  if we add Josh that’s still only   *  what - six people? And I won’t even   *  be here.   *  LARA JEAN   *  (losing it a little)   *  Exactly. You know what happens when   *  you let people into your life. They   *  either leave or they die.   *  (small beat then softer)   *  So excuse me for not wanting to put   *  myself through more of that.   *  MARGOT   *  (quietly, an apology)   *  I have to go to college, Lara Jean.   *  LARA JEAN   *  (what’s really wrong)   *  I know. It’s just. It’s gonna be so   *  weird not having you around this   *  year. Did you have to pick the   *  farthest college you could possibly   *  think of?   *  Blue (mm/dd/yyyy)   13. MARGOT   *  Hey. If you need me, I’m only a   *  skype away.   *  LARA JEAN   *  Til you start going to pubs and   *  eating haggis with your new   *  Scottish friends and forget about   *  us.   *  MARGOT   *  I can promise you...I will never   *  eat haggis.   *  They both smile. They really love one another. Dr. Covey and   *  Kitty come back holding a HUGE STACK OF MAGAZINE.   *  KITTY   *  We couldn’t decide so we got you   *  all of them.   *  INT. AIRPORT - LATER Dr. Covey puts his arms around Lara Jean and Kitty as they watch Margot walk up the stairs to go through security,   *  holding the huge pile of magazines.   *  KITTY Think she’ll turn back around?? LARA JEAN No. They keep watching as she confidently shows her passport and ticket. She do",
      "dialogue_count": 0,
      "word_count": 1288
    },
    {
      "scene_number": 4,
      "slugline": "INT. LIBRARY - A FEW MINUTES LATER   *  Lara Jean walks into the library. She sees a group of   *  students sitting at a long table silently eating their   *  lunches and studying. She sits down, takes out her   ROMANCE   *  NOVEL   and starts reading. A boy doing calculus eyes her book -   *  CALCULUS BOY   *  Is that for a class?   *  LARA JEAN   *  No.   *  CALCULUS BOY   *  (judgemental)   *  Yeah. I didn’t think so.   *  Lara Jean sighs. Maybe she doesn’t belong here either. She   *  bites into a carrot. It crunches. All the studying students   *  glare at her. Someone points to a sign that says:   SOFT FOODS   *  ONLY.   She picks up her things and leaves.   *  EXT. BLEACHERS - SAME   *  Lara Jean sees Josh eating alone, reading a   SCI-FI NOVEL   on   *  the empty bleachers. She timidly walks up to him.   *  LARA JEAN   *  This seat taken?   *  JOSH   *  Yep. By you.   *  She sits down. Neither is really sure what they are supposed   *  to talk about.   *  LARA JEAN   *  It’s kind of weird without Margot,   *  huh?   *  JOSH   *  Yeah. A little.   *  LARA JEAN   *  Should we maybe just...   *  (she eyes his book)   *  ...read?   *  JOSH   *  Okay.   *  Josh and Lara Jean both pick up their books and read next to   *  one-another. She silently passes him a carrot stick.   *  Blue (mm/dd/yyyy)   18.",
      "characters": [],
      "action_text": "He takes it. It crunches. He passes her a chip, she takes it.   *  It crunches. Whatever this is - it’s working for now.   *  INT. LARA JEAN’S CAR - AFTERNOON   *  Lara Jean drives Kitty home from swim practice. Kitty sits in the front seat in her bathing suit and helmet. Lara Jean is   *  very focused on the road. She grips the wheel like an eighty-   *  year-old woman.   *  LARA JEAN   *  First day was good?   *  KITTY   *  Great. Alison wanted to sit next to   *  me at lunch but so did Brianna and   *  so did Katy and Megan so I ended up   *  rotating so everyone had time to   *  sit next to me. You know?   *  LARA JEAN   *  Yeah. Totally know what’s that’s   *  like. And how was swim practice?   *  KITTY   *  That was amazing too. Did you see   *  how fast I was going?   *  LARA JEAN   *  Uh-huh.   *  KITTY   *  That was like Michael Phelps fast,   *  right?   *  LARA JEAN   *  Um. Maybe not quite Phelps fast...   *  KITTY   *  No. You didn’t see the first match.   *  I was totally Phelpsing it.   *  Lara Jean smiles at her little sister.   *  LARA JEAN   *  Sorry I missed that.   *  KITTY   *  And I was definitely swimming   *  faster than you’re driving right   *  now. You know it’s illegal to go   *  too slow right?   *  Blue (mm/dd/yyyy)   19. LARA JEAN   *  I’m not going too slow. I’m going   *  like 5 miles below the speed limit.   *  And can you take off that helmet?   *  You’re making me nervous.   *  KITTY   *  I’ll take off the helmet if you   *  speed up.   *  Lara Jean speeds up but, distracted, she misses a stop sign.   *  Before she knows what’s happening she HITS A CAR in the   *  intersection.   *  EXT. SUBURBAN INTERSECTION - SAME An OLD MAN gets out of his BUICK.   *  LARA JEAN (to Kitty, freaking out) Oh my god. Are you okay? Kitty is fine. She’s laughing. KITTY Good thing I’m wearing the helmet!   *  Lara Jean runs up to the old man whose Buick she hit. LARA JEAN Sir. I am SO SORRY. OLD MAN What the hell were you doing, catching pok-e-mon?? D",
      "dialogue_count": 0,
      "word_count": 3603
    },
    {
      "scene_number": 5,
      "slugline": "EXT. COVEY HOUSE - BACKYARD - MOMENTS LATER   *  We see Lara Jean climb down the side of the house. Once on   *  the ground she grabs KITTY’S BIKE and takes off down the   *  street. When she’s safely out of sight, she takes out her   *  phone and texts her dad -  TEXT: STUDY GROUP AT THE DINER. BE HOME LATER.  INT. COVEY HOUSE - SAME Mr. Covey looks at his phone and then at Josh. DR. COVEY Huh. Guess you just missed her.   *  EXT. DINER - ESTABLISHING - EVENING   *  We are outside the MOONSTAR DINER - a local teen hang out.   *  Lara Jean used to come here with Margot and Josh. Now - she’s   *  here alone. We see Kitty’s bike locked up outside.   *  INT. DINER - SAME   *  Lara Jean sits in a booth. She’s picking up straw-fulls of   *  soda and letting them pour back into her cup. An ALGEBRA TEXTBOOK is sitting next to her, unopened. A waitress, JOAN,   *  60’s, walks up to her. JOAN You okay, honey? You seem a little out of it. LARA JEAN I’m great, thanks. Just doing my homework. Joan looks at the closed text book skeptically, walks away.   *  We hear the little bell on the door jingle. Lara Jean looks up. It’s Peter. Holy shit. She came here to avoid Josh and now she runs into Peter. This day couldn’t get worse. She tries to look away but he’s already sliding into her booth.   *  PETER Lara Jean. Before she can speak -  Blue (mm/dd/yyyy)   36.",
      "characters": [],
      "action_text": "PETER (CONT’D) (to Joan) Can I get a chocolate shake?   *  LARA JEAN What are you doing here? PETER Your dad said you’d be here.   *  LARA JEAN   *  You talked to my dad?? Why?   *  PETER   *  Nice “study group” turn out by the   *  way.   *  LARA JEAN I am studying. If you’ll excuse me -   *  She opens the book. PETER Whoa, whoa, whoa. You think you can kiss me like that then play hard to get? I don’t think so, Covey. LARA JEAN Oh god. She puts her head on the table. PETER (misunderstanding her humiliation) Hey, don’t be embarrassed. I told you I’m flattered. You’re cute, in a quirky kind of way and the kiss was surprisingly hot. But Gen and I just broke up so I’m not really in the place to - LARA JEAN (looking up) Hold up. Are you trying to reject me right now? PETER Well, yeah cuz it didn’t seem like it really took the first time. LARA JEAN I am not trying to date you, Peter   *  Kavinsky.   *  Blue (mm/dd/yyyy)   37. PETER Your mouth is saying one thing but your mouth said another. LARA JEAN What? PETER Like, you’re talking but then the kiss. I guess they’re both your mouth. Yeah, that’s confusing. Joan comes back and puts Peter’s shake on the table.   *  PETER (CONT’D)   *  Thanks, Joan.   *  He winks at Joan. She blushes.   *  LARA JEAN   *  Do you have to flirt with everyone?   *  She’s like sixty.   *  PETER   *  Aw, don’t be jealous of Joan. She   *  doesn’t have what we have.   *  He laughs, unwraps a straws and sticks them in the shake.   *  PETER (CONT’D)   *  Want some?   *  LARA JEAN   *  No. And to be clear about what   *  happened today, you should know   *  that I don’t actually like you. I   *  just needed to make it look like I   *  liked you so someone else wouldn’t think I like them. Get it?   *  PETER   *  Sounds pretty convoluted. I think you love me and this whole “other guy” story’s just to throw me off the scent. LARA JEAN You’re so full of yourself. PETER That may be, but until you tell me mystery stud’s name, I’ll remain convinced you hav",
      "dialogue_count": 0,
      "word_count": 3290
    },
    {
      "scene_number": 6,
      "slugline": "INT. THE CAFETERIA - SAME   *  Lots of popular kids lounge on the tables eating muffins, drinking coffee, laughing. Lara Jean is nervous to be here,   *  she looks over and sees Gen glaring at her and Peter.   *  LARA JEAN (V.O.)   *  It was way too intense.   *  PETER   *  (leading her in)   *  Come on. There’s nothing to be   *  afraid of. LARA JEAN   *  Actually I’ve got some homework   *  stuff I need to catch up on before   *  class. I’ll see you later, okay?   *  PETER   *  Wait.   *  Peter HANDS HER A NOTE that says LARA JEAN CIRCLED IN A HEART   *  on the front. Lara Jean takes the note and puts it in her   *  backpack without reading it. Peter slips his hand into her   *  back jean pocket.   *  Gen sees this, loudly pushes her chair out from the table and   *  exits the cafeteria in a huff. Peter whispers in Lara Jean’s   *  ear -   *  PETER (CONT’D) (whispered, happy) Nice job. LARA JEAN (V.O.) It’s weird and somewhat off-putting to be congratulated on doing nothing more than accepting a note   *  and having an ass pocket for   *  someone to stick their palm into. But I guess that’s where my life had taken me.   *  EXT. ATHLETIC FIELDS - GYM CLASS - AFTERNOON   *  Christine and Lara Jean run around the track.   *  CHRISTINE   *  This Kavinsky thing is insane! Who   *  knew you had a secret boner for the   *  king of the cafeteria crowd.   *  Blue (mm/dd/yyyy)   53.",
      "characters": [
        "EMILY"
      ],
      "action_text": "LARA JEAN   *  Trust me. I’m as surprised as you   *  are.   *  CHRISTINE   *  Did Margot freak?   *  LARA JEAN   *  Actually, I haven’t told her yet.   *  I’ve kind of been...avoiding her   *  calls.   *  CHRISTINE   *  Well, you know what they say.   *  LARA JEAN   *  What?   *  CHRISTINE   *  If you’re keeping secrets it’s   *  probably because your sister is a   *  judgemental priss.   *  LARA JEAN   *  Definitely not an expression.   *  Chris shrugs.   *  CHRISTINE   *  Maybe it should be? Race ya to the   *  goal post.   *  INT. LARA JEAN’S BEDROOM - FRIDAY NIGHT Lara Jean stares at the skype icon on her computer. She   *  practices what to say to Margot.   *  LARA JEAN   *  Hi Margot. How’s college? Cool.   *  Cool. By the way, did I mention I   *  have a fake boyfriend? I didn’t.   *  How odd. Yeah, it’s Peter Kavinsky.   *  Yeah, that jock-ish, douche-ish   *  Peter. How did it start?   *  Well...let’s see. It definitely   *  wasn’t because I don’t want your ex-   *  boyfriend to think I’m in love with   *  him. That’s for sure.   *  (small beat)   *  Shit.   *  Lara Jean is about to close out of Skype and give up when the   *  ICON starts RINGING on the SCREEN.   *  Blue (mm/dd/yyyy)   54. CU:   MARGOTCOVEY5 WANTS TO SKYPE . Lara Jean presses ACCEPT.   *  MARGOT   *  There you are!   *  LARA JEAN   *  Hey...   *  MARGOT   *  What’s going on? Tell me   *  everything!   *  LARA JEAN   *  Well...   *  (chickening out)   *  I’m making cupcakes for Kitty’s   *  class bake sale tonight.   *  MARGOT   *  (making a face)   *  Cupcakes?   *  LARA JEAN What? MARGOT It’s so much easier to do brownies.   *  LARA JEAN (getting defensive)   *  Well, I already bought all the   *  ingredients for cupcakes. And   *  you’re not even here. So.   *  MARGOT   *  Whoa. Okay. Sorry. Do cupcakes. I’m   *  sure they’ll be great.   *  (small beat)   *  Anyway, how is everything? I feel   *  like we haven’t talked in forever.   *  LARA JEAN   *  Everything’s fine. Nothing to   *  re",
      "dialogue_count": 1,
      "word_count": 4400
    },
    {
      "scene_number": 7,
      "slugline": "EXT. UNDERNEATH THE BLEACHERS - DAY Christine and Lara Jean eat subs and drink fountain sodas in   *  SUBWAY cups.   *  LARA JEAN   *  Why do we have to eat under the   *  bleachers again?   *  CHRISTINE   *  Dude. We can’t have these   *  contraband Subway cups out in the   *  open! Don’t want the powers that be   *  catching onto my lunchtime truancy   *  vibes. I need my B.M.T’s! PS - that   *  sub is tight, right?   *  LARA JEAN   *  It tastes like a sub.   *  CHRISTINE   *  So how are things going with my   *  cousin’s leftovers?   *  LARA JEAN   *  They’re good.   *  CHRISTINE   *  I don’t understand what you see in   *  that guy.   *  LARA JEAN   *  He’s actually a lot sweeter than he   *  seems from the outside. Like, you   *  should see him with Kitty.   *  CHRISTINE Well, even if it’s with such a basic bro, I’m glad you’re getting your rocks off with somebody. It was depressing when you used to just like, read romance novels on   *  the weekends.   *  LARA JEAN I like romance novels.   *  CHRISTINE Shh. Christine puts her hand over Lara Jean’s mouth. LARA JEAN It’s not that embarrassing.  Blue (mm/dd/yyyy)   75.",
      "characters": [
        "LARA JEAN"
      ],
      "action_text": "CHRISTINE (whispering) No, listen. There’s someone up there. Lara Jean and Christine are quiet, we pan up and see - EXT. BLEACHERS - SAME Peter and Gen walk onto the bleachers - they are in the middle of an intense conversation. GEN It’s like you don’t have any time for me anymore. All you do is hang out with her. Intercut under the bleachers - LARA JEAN Let’s get out of here. This sounds private. CHRISTINE Are you insane, that’s your boyfriend! And they’re talking about you! We have to listen. Back on the bleachers - PETER What am I supposed to do? Wait around like an idiot while you’re off screwing some college creep. GEN I can’t talk to him like I can talk to you. He’s not a good listener. Underneath the bleachers, Lara Jean winces. That’s the same thing she said to Peter last night. She’s feeling stupid for thinking she was special. PETER Pssh. That just means he’s not at your beck and call like I am. WTF,   *  Gen. You can’t just do this to me whenever you feel like it! GEN She’s not coming on the ski-trip is she?  Blue (mm/dd/yyyy)   76. PETER Why do you care? GEN Because that’s our thing. We always go together. PETER YOU. HAVE. A. BOYFRIEND! GEN But...maybe by then...I won’t. Underneath the bleachers - CHRISTINE Dude. Bitch is after your man.   *  INT. ADLER HIGHSCHOOL - CLASS ROOM   *  Lara Jean stares at the window as her teacher drones on. She   *  can’t get Gen and Peter’s conversation out of her head.   *  The bell rings. Lara gets up and exits the classroom.   *  INT. ADLER HIGHSCHOOL - HALLWAYS - CONTINUOUS   *  Lara Jean sees Peter at the other end of the hall and walks   *  in the opposite direction before he sees her. She keeps   *  walking until she’s in the -   *  EXT. ADLER HIGH SCHOOL - PARKING LOT - AFTERNOON Lara Jean sees Josh getting into his car. Still steaming from   *  overhearing Peter with Gen, she walks up to Josh. LARA JEAN Hey. JOSH (surprised) Hi. LARA JEAN Can you give me a ride? INT. JOSH’S CAR - PARKING LOT - A FEW MINUTES LATER ",
      "dialogue_count": 1,
      "word_count": 1630
    },
    {
      "scene_number": 8,
      "slugline": "INT. THE BUS - SAME   *  Kids are   rowdy on the bus to the ski-trip. Peter sits down, Lara keeps walking. PETER Hey. Where are you going? LARA JEAN I’m gonna sit with Chris. She looks lonely back there. Christine is in the back seat, snoring. PETER She’s totally passed out. I saw on snap she was at some EDM show last night with a guy who had spacers the size of fist. LARA JEAN Even more reason to sit with her. Gotta make sure she doesn’t swallow her tongue.   *  Lara Jean keeps walking. Peter looks up and Gen is standing   *  right in front of him. GEN Is this seat taken? From the back Lara Jean watches Gen sit down next to Peter.   *  Lara Jean turns to Chris. LARA JEAN This was a mistake. CHRISTINE (coming to) Tell me about it. I can’t believe I   *  let you convince me to go on a trip   *  that requires getting up before   *  seven.   *  Chris nuzzles into Lara Jean’s shoulders and is quickly   *  asleep. Lara Jean looks up at Gen and Peter. Jealous. What   *  has she done?   *  EXT. SKI LODGE - LATER   *  All the kids stand in front of the bus. The lodge is on one   *  side of them and the ski-rental / lift ticket station is on   *  the other. Greg holds court with room assignments and keys.   *  Blue (mm/dd/yyyy)   83.",
      "characters": [],
      "action_text": "GREG School sanctioned room assignments? I don’t think so. Have at it sluts! He throws the keys to the group who grab at them like wild animals. LARA JEAN (to Christine) Where are the chaperones?? CHRISTINE Probs at the bar already. Only the   *  ones who’ve been eye-banging all semester in the faculty lounge ever sign up for this thing. Don’t you remember how Broderick and Hayes both got divorced after ski-trip last year? LARA JEAN What? No! CHRISTINE Oh my god. Totes. They’re like the Brangelina of the science department. PS - RIP Brangelina. From the other side of the crowd, Gen is decked in expensive   *  ski gear. She calls out to Peter who waits in line for a lift   *  ticket -   *  GEN See you on black diamonds Peter? Last one down the slope owes the other a hot toddy? CHRISTINE (to Lara Jean) Dude. Go get your man. LARA JEAN Are you kidding? I can’t handle a black diamond! I’d Natasha Richardson myself on the bunny slopes.   *  CHRISTINE   *  No one gets that reference. And if   *  you’re not gonna ski, what are you   *  planning on doing all weekend?   *  Blue (mm/dd/yyyy)   84. She opens her bag and we see a dozen HARLEQUIN ROMANCE   *  NOVELS.   *  LARA JEAN   *  I bought the set on e-bay.   *  CHRISTINE   *  This is a major backslide for you.   *  Lucas walks past Christine and Lara Jean.   *  CHRISTINE (CONT’D)   *  Lucas, can you help me convince   *  Lara Jean to ski with us?   *  LUCAS Yeah, right. You think I’m risking   *  breaking a leg before the musical!   *  I’m Albert Peterson for god’s sake!   *  CHRISTINE   *  What?   *  LARA JEAN   *  Bye Bye Birdie. Duh.   *  Chris is flabbergasted like, what is wrong with my friends?   *  CHRISTINE   *  You two. Enjoy one another.   *  She walks away toward the ski-rental station.   *  LARA JEAN   *  I brought face masks.   *  LUCAS   *  Girl. Yes.   *  INT. LARA JEAN AND CHRISTINE’S HOTEL ROOM -   *  Lucas has changed into a smoking jacket. Lara Jean is in her   *  nightgown. They are eating room service",
      "dialogue_count": 0,
      "word_count": 6107
    }
  ]
}