{
  "slug": "to-catch-a-killer-2023",
  "title": "to catch a killer",
  "genre": "action",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 22091,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SHOOTER’S BUILDING – STAIRWELL – NIGHT The group force their way up past fleeing residents. Eleanor, the only one unmasked, scans every face looking for suspects. SWAT COMMANDER (hollering to the firemen) Keep tight behind the man in front of you. Don’t stop til we reach 17. ON THE 16TH FLOOR Smoke clings eerily to the ceiling, coiling from air vents. The heat more intense, Eleanor’s eyes are streaming but she presses on as -- ON THE 17TH FLOOR SMASH! The fire crew break down the door then step back, fitting their hoses to the water supply. The SWAT team, guns raised, rush through to Apartment C. SWAT COMMANDER Hold! We stay with Eleanor, peering through the smoke. She can hardly breathe, starts to panic. The SWAT commander tries the handle. Locked. An ax and a crowbar, then -- BLAM! They break the door down, flood into the condo. SWAT OFFICERS (O.S.) Clear! Clear! Clear! The firemen rush in and put out the fire. Eleanor is entranced by the shimmering laser beams intersecting from the victims’ apartments. A surreal sight through the haze, almost beautiful. INSIDE THE CONDO Smoke. Debris. Paint melted off the walls, the wooden floor warped and charred. Close to fainting, Eleanor crosses to --  13.",
      "characters": [],
      "action_text": "THE BALCONY Fresh cold air at last. She breathes deeply, hands tight on the rail. All the laser beams now converging on her. He must have stood right here. POLICE CHATTER (ON RADIOS)  17th secure -- Clear the news choppers out of my airspace -- Northside’s full, get those ambos to Grady.  Eleanor takes in the chaos he’s caused. Sirens. Helicopters. Distant screams of agony. She senses his power. It’s intoxicating. And she’s inhaled too much smoke. Her vision --   our vision   -- blurs, we lose balance, and we tumble with her into the void. Except -- MALE VOICE  Breathe.  INT. SHOOTER’S CONDO – NIGHT A rush of air and we’re back. Eleanor realizes she’s breathing into a mask. MALE VOICE And again. (then) You okay? JACK MCKENZIE swims into focus. Not model-handsome but nice- looking. Clean-cut, late-thirties, a boy scout in an FBI jacket. Eleanor nods yes. A spark of connection. MCKENZIE Jack McKenzie. Our kids won’t believe how we met. His smile is sincere. Still, that was a weird thing to say. Eleanor can’t tell if this guy is charming or just cocky. LAMMARK Dude. We didn’t lay this on for your amusement. MCKENZIE Yes, sir.  14. Our attention shifts to GEOFFREY LAMMARK, 60, head of the FBI’s Atlanta field office. A beard, glasses, a burning intelligence that draws you in but warns you off. Eleanor straightens. She knows who he is. POLICE CHATTER (ON RADIO)  Fifteen-block radius sealed off.  LAMMARK Get me blues at every MARTA station. McKenzie beckons to the arriving PARAMEDICS. MCKENZIE She was out for three minutes. Heart rate’s normal. ELEANOR (standing up) It’s OK, I’m fine. PARAMEDIC #1 No. Sit down. Keep breathing. (swapping the mask for their oxygen gear) You’re not walking seventeen flights like this. Eleanor obeys. Through her POV, we watch the FBI -- AGENTS, FORENSICS, PHOTOGRAPHERS -- investigate the crime scene. Her breathing always in the background. A sci-fi vibe. McKenzie’s phone buzzes with a text. MCKENZIE (to Lammark) Owner’s Norwegian, Ragnar Wirko",
      "dialogue_count": 0,
      "word_count": 984
    },
    {
      "scene_number": 2,
      "slugline": "INT. POLICE HEADQUARTERS - ASSEMBLY HALL - NIGHT Lammark addresses 200 officers and agents, all different ranks. A man in his element. LAMMARK Thanks to all these self-proclaimed authorities in the media, you’ll keep hearing ISIS day and night. But at this point no-one’s claimed responsibility for the attack. A group of low-ranking officers hand out copies of an FBI dossier. Eleanor is one of them. Older than the men at her level, she’s no longer at the heart of the action. LAMMARK Within the next few hours, your desks will be flooded with data, much of it inevitably false. So it’s important to keep certain preconceptions in mind while you classify evidence. Eleanor finishes handing out the dossiers -- the front page reads   “Updated Profile of American Mass Murderers”   -- then takes a place at the very back of the hall. LAMMARK One: “Mass murderers are white, male, 20 to 30.” Except for Seung- Hui Cho, Korean. Stephen Craig Paddock, 64. Brenda Spencer, 16, our first school shooter. And the list goes on. Eleanor looks up, taking interest. LAMMARK Two: “Mass murderers suffer from personality disorders.” I’d say yes but the range is so wide it includes all of us. Depression. Anxiety. Schizophrenia. PPD. NPD. PTSD. Also, look out for physiological pathologies that limit inhibition: malformations, tumors in the pre-frontal cortex, head trauma. They’re often victims of aggression during childhood or development, especially from the people who are supposed to love and protect them.  18.",
      "characters": [],
      "action_text": "We move in close to Eleanor. These words seem to affect her in a particular way. LAMMARK Their understanding of the world gets skewed and they repress large amounts of anger for long periods of time. Later in life, anything can unlock Pandora’s box. (turns the page) Three: “Mass murderers want to get caught.” Well, this one sure doesn’t. 29 casings, 29 victims. Every shot found its mark. Not a single stray hair or fingerprint. This guy is thorough. He didn’t come here to die. He doesn’t want to be found. (beat) But, we are going to disappoint him. And that starts now. The officers cheer, applaud. Eleanor looks around, taking in their excitement. Their hatred. LAMMARK Four. CUT TO: INT. POLICE HEADQUARTERS - KITCHEN AND HALLWAYS - NIGHT Officer GARFIELD (25) and Eleanor make coffee for the top- ranking agents. On TV, the PRESIDENT offers condolences to the families. US PRESIDENT (ON TV)  On this, our saddest birthday, we will mourn. But tomorrow we will rise, and this cowardly act of terrorism will not go unpunished.  Eleanor takes the tray into the teeming hallway, where Lammark is surrounded by a dozen people. Amongst them, Deputy Attorney General RUSS ADOVICH (50s) and Georgia’s Lieutenant Governor JESSE CAPLETON (40s). JESSE CAPLETON -- because shutting down freeways will cause mass panic.  19. LAMMARK Jesse, the shooter’s causing mass panic. Closing freeways will cause headaches. JESSE CAPLETON Headaches my Governor doesn’t need. LAMMARK These are federal roads, I’m a federal agent, and I’m shutting them down. Lammark takes a coffee from Eleanor’s tray. She smiles at him but he doesn’t notice her. Chief Jackson, however, does and glowers at her for trying to stand out. RUSS ADOVICH (reading a text) They’re sending Frank Gerber down. DC’s convinced this is ISIS. LAMMARK (tensing) ISIS drives trucks into crowds. This man was trained. Whoever the hell is behind this, FBI Counterterrorism isn’t gonna find ‘em. A man on the ground who knows this city, that’s the man ",
      "dialogue_count": 0,
      "word_count": 1613
    },
    {
      "scene_number": 3,
      "slugline": "EXT. RAILWAY BRIDGE - DAWN Eleanor pounds across the metal sidewalk, bag flying. INT. LINDEMBLAT’S DELI – EARLY MORNING Eleanor hurries in. The chairs are still upturned on the tables. In a booth, his back to her, Lammark is arguing on the phone. His morning already a mess. LAMMARK Jesse, you never saw   Jaws ? You’re the asshole trying to keep the damn beaches open. 29 bodies. JESSE CAPLETON (ON SPEAKER)  In Vegas they had 58. Next day Celine Dion was onstage at Caesar’s Palace.  LAMMARK That guy was dead! I have an Olympic class marksman running wild. We need to stop the world until we find him. JESSE CAPLETON (ON SPEAKER)  The Governor’s not closing schools, hospitals --  LAMMARK Those we can deal with. But theme parks? Malls? The stadiums? The fewer people out there, the more chance of catching this guy. Simple math. JESSE CAPLETON (ON SPEAKER)  If you can’t deliver what you’ve promised without shutting down the whole damn city --  LAMMARK Jesse, calm down. (breathes deeply) I can get this guy. I guarantee it. Sorry if I over-reacted. Let’s reconnect later. The moment Lammark snaps off the call --  26.",
      "characters": [],
      "action_text": "LAMMARK (pounding the table) Fuck!   Fuck ! Fuuuuuck! ELEANOR Is this a good time, sir? Lammark turns, remembers, gestures for her to sit. LAMMARK Jesus Christ. These people. It’s like they’ve developed a system to drain my energy away. Lammark pulls out a tray of pills and knocks the day’s dose back with his coffee. Seeing her look -- LAMMARK Blood thinners. I’m fine, just need to stay calm. But if they think I’m less than a hundred percent -- ELEANOR Don’t worry, sir. I won’t tell a soul. But I don’t get it. Do they not want you to catch him? LAMMARK (tucks his pills back into his bag) Yes. As quickly as possible. The problem is, they think they know how. These MBA fuckers. They won’t let you shit without signing it off. But let’s talk about you. Coffee? Eleanor tenses. He notices, pours her a cup, continues. LAMMARK I can think of two reasons you might be reading this guy. One: you’re potentially a great detective. Two: you’re as fucked up as he is. Either way, I’m doing everyone a favor by keeping you off the streets. McKenzie enters, fresh as a daisy, salutes LINDEMBLAT JR. (40, obese) on his way. MCKENZIE Look at you, buddy! What got you so slim?  27. LINDEMBLAT (happy to see him) Cut out gluten. Magic bullet. MCKENZIE No gluten, huh? Steak and eggs got gluten? Lindemblat winks. He’s on it. LAMMARK Eleanor, I believe you’ve met Jack McKenzie. As an investigator, frankly, he’s average at best. But once we get close to our killer, trust me, we all want Mac around. MCKENZIE Flattering. Really. (sliding into the booth) Is she sticking around? LAMMARK (to Eleanor) If you’re interested, I’ll need to request your transfer. Eleanor looks suddenly concerned. ELEANOR Would I be working for the Bureau? LAMMARK Not directly. But you’d be a liaison between APD and the Bureau, passing on any information you think I need to know. (to McKenzie) We’re surrounded by jackals and clowns, not many people I can trust. Krupp and Marquand are capable but they feed everything back to ",
      "dialogue_count": 0,
      "word_count": 1713
    },
    {
      "scene_number": 4,
      "slugline": "EXT. CITY MORGUE - MAIN ENTRANCE - DAY Lammark, Eleanor and McKenzie push their way through a horde of REPORTERS, Eleanor recoiling from the noise and crush. REPORTERS Do you have any suspect, Mr. Lammark? -- Can you confirm this was terrorism? Lammark ignores them, keeps walking. LAMMARK (to Eleanor) Silence can’t be misquoted. CUT TO: INT. CITY MORGUE - HALLWAY - DAY Lammark walks ahead, on his phone. LAMMARK It’s your call, Nathan. But I need collaboration, not competition. I can always use more help but there needs to be a chain of command -- Eleanor and McKenzie follow a few steps behind. ELEANOR Can I ask a personal question? MCKENZIE Sure. ELEANOR We all share the same goal. Don’t you think Lammark’s being a bit paranoid about everybody else involved? MCKENZIE Paranoid? Two years ago he was convinced that aliens were controlling him from inside his knees. (off Eleanor’s look) True story. The problem isn’t who has the information, but what they do with it. I’ve seen too many cases derailed by power struggles.  35.",
      "characters": [],
      "action_text": "At the end of the corridor Lammark flashes his ID, the COPS on duty open the doors. INT. CITY MORGUE - COLD CHAMBER - DAY Everything suddenly quiet. Bright light, the hum of fluorescents as a box of latex gloves is passed around. Everyone’s breath frosting in front of them. Eleanor wedges her phone and notepad under her arm as she awkwardly pulls on the gloves. Then she takes in the room. MCKENZIE My God. 29 blood-stained, naked bodies, laid out on metal gurneys. The sheer number is unsettling. FORENSICS CHIEF A lot of bodies but almost no evidence. Small entrance, large exit on all. (pointing to each) Head, thorax, thorax, thorax, head, neck, head, head, thorax, thorax, head, stomach, neck, head, head, thorax, thorax, neck, neck, stomach, head, head, thorax, stomach, head, head, thorax, thorax, head. One shot per victim. LAMMARK Anything about the shooter? Height? Weight? FORENSICS CHIEF At that distance? I can’t even start to speculate. LAMMARK (to McKenzie) You ever seen anything like this? MCKENZIE Not outside the service. Or inside it. This is high-precision shit. You’ve got wind, fireworks distracting you. Closest target was 300 feet away. Flawless work. Eleanor walks slowly down the line, forcing herself to look closely.  36. The bodies are all different sizes, ethnicities, ages -- but no children or elderly people. Pierced ears, surgery scars, tattoos. All too human. LAMMARK Is the shooter a man? ELEANOR Yes.   MCKENZIE Yes. LAMMARK Why? MCKENZIE On this scale? Unprecedented. LAMMARK (fair enough) You can buy a brand new assault rifle anywhere in Georgia. No background check, no permit. So why use a 40 year old military weapon? MCKENZIE Because he has access? ELEANOR Or he wants to make a point? Are we assuming he was born here? He may not be a US citizen. LAMMARK Which explains the 4th of July? Is this a man who hates America? MCKENZIE Or who loves America too much. ELEANOR Could just be someone with a gap in his diary. Maybe America’s just not important to",
      "dialogue_count": 0,
      "word_count": 1142
    },
    {
      "scene_number": 5,
      "slugline": "EXT. DAYS INN HOTEL - POLICE TENT - DAY The police hold back ONLOOKERS and REPORTERS. Desolate, Eleanor watches McKenzie comforting the Rahmani family. He’s warm, considerate, unselfconsciously tactile. But nothing will stop that boy’s parents’ sorrow. Eleanor admires McKenzie’s ease as she listens to Lammark arguing with Frank Gerber and Jesse Capleton inside the tent. LAMMARK Where’s the weapon, Frank? So far you haven’t even found a catapult! FRANK GERBER He could’ve stashed it anywhere! He fits the profile. Everyone we talk to says he had a difficult upbringing, that he was isolated, ostracized -- LAMMARK Very touching but A, you don’t have a firearm. B, you’re oceans away from establishing any connection to an old XM-21 Sniper System in particular. And C, you don’t turn into a first class marksman by playing goddamn video games. So either find some evidence here and make sense of it or admit this is a colossal fuckup! JESSE CAPLETON C’mon, Lammark, if it wasn’t him, how come he jumped? LAMMARK I don’t know, maybe because that fucking parasite Jimmy Kittridge plastered his face on TV and called him a terrorist. Arab kid in a Georgia high school, I guess he wasn’t picturing himself homecoming king. JESSE CAPLETON (regarding the press) But it could have been him, right? I mean, for now, until he’s proven innocent?  41.",
      "characters": [],
      "action_text": "LAMMARK Jesse, it’s supposed to be the other way around. JESSE CAPLETON Not when tourism is one of our biggest employers. I need the folk out there to feel safe, Lammark. This shows them that we’re on it. Buys us a little more time. Frank Gerber nods. LAMMARK (disgusted) Be sure to send the Rahmanis your invoice. I’m getting back to work. Falco! McKenzie! JESSE CAPLETON And you wonder why you never made it in DC... Lammark storms off towards the FBI SUVs. Eleanor follows. LAMMARK Never argue with idiots, Eleanor. They’ll drag you down to their level and they’ll beat you there because they have experience. Eleanor and Lammark board the SUV, wait for McKenzie. In the background, Jimmy Kittridge continues broadcasting. JIMMY KITTRIDGE According to his classmates, Rahmani was frequently referred to as “Crater-face” due to his acne problem. A quick check of his online activities proves that -- McKenzie accidentally -- not really -- steps on a bundle of cables, ripping them out. The lights flicker, the camera stumbles, the broadcast stops. MCKENZIE Sorry. Kittridge’s CREW scrambles to fix this. Eleanor is starting to like this guy.  42. MCKENZIE (PRE-LAP)  Three painters worked the apartment. Rodney Lang, Abraham Lopez and Dmitiri Bovrov.  INT. FBI FIELD OFFICE - HALLWAY - DAY Eleanor and Lammark follow McKenzie towards RODNEY LANG (39), ABRAHAM LOPEZ (45) and DMITRI BOVROV (52). They’re chatting at the end of the corridor, apparently had not seen each other in some time. MCKENZIE Sorry to keep you waiting, gentlemen. As Rodney Lang turns we discover a NEWBORN in his arms. RODNEY LANG (shaking McKenzie’s hand) Wife’s working a double so guess who’s in charge? LAMMARK This is gonna be quick. Just a couple of questions. Eleanor takes a good look at Lang: short and stocky, designer shoes, expensive watch. He’s clearly making more money than the other two. LAMMARK (PRE-LAP)  Where were you on the night of the 4th of July, Mr. Lang?  CUT BETWEEN: INTERVIEW ROOM #1 Rodney Lang ",
      "dialogue_count": 0,
      "word_count": 1827
    },
    {
      "scene_number": 6,
      "slugline": "INT. FBI FIELD OFFICE - MAJOR INCIDENT ROOM - NIGHT The late night shift taking over now. Eleanor still at her desk, working on her report. Unread emails down to 500, her vision blurring. Lammark’s voice snaps her to attention. LAMMARK (O.S.) Eleanor, did you receive a package from the lab? ELEANOR (looking up) Yes, sir. I’ve included everything in my report. Urine and fecal samples were scarce, but still enough to detect an iron and protein deficiency. I checked, it’s common amongst non meat-eaters. LAMMARK What time did this arrive? ELEANOR I don’t know, twenty minutes ago? LAMMARK Forty-five. I had the courier check. I didn’t have it, so I called the lab to complain. ELEANOR Sir, I only wanted to -- LAMMARK This is urgent, specialized, classified intel. And yet you, a beat cop with no college degree, decided that I would have to wait for your verdict? Lammark holds out his hand. Eleanor gives him the lab report, boiling with shame. He turns and leaves. EXT. FBI FIELD OFFICE - BUILDING ENTRANCE - NIGHT Eleanor heads outside, her face taut with anger. Spectacular lightning bolts sparkle the streets. A storm’s coming. As she walks towards the metro station, a gentle horn behind her and --  50.",
      "characters": [],
      "action_text": "LAMMARK (rolling down the SUV window) Eleanor. I’m sorry. I had a ridiculously stressful call and I took it out on you. ELEANOR No worries. LAMMARK Look, it’s late. Why not come round for dinner? Talk it all through with a good glass of wine? ELEANOR Sir, if you -- (growing angrier, her eyes rapidly filling with tears) If you hired me because you want to fuck me, you can shove this job up your ass. Lammark is taken aback. So is the DRIVER. LAMMARK Eleanor. I’m married. My partner is at home, cooking. And you look like you could use a good meal. Deeply embarrassed, Eleanor doesn’t know what to say. INT. FBI SUV, MOVING - NIGHT The city unnervingly alive, as if nothing has happened. Bars and restaurants packed. Stores open. A few extra police on the streets. ELEANOR (looking out the window) Why did you sign that memo if you think it’ll happen again? LAMMARK You can’t fight every battle. You have to choose the ones you can win. ELEANOR But when you sign you’re part of the game.  51. LAMMARK When you don’t they replace you. And the only decision you’re making is whether to be buried or burned. Lammark remembers, opens a bottle of water, takes his pills. ELEANOR Jesse Capleton can't fire you. He's not your boss. LAMMARK Jesse Capleton operates my boss, who operates him in return. Guys like that, it’s just a circle jerk. All it takes is one phone call. (impersonates them)  \"I’m pleased he’s on the case but don’t you think Lammark’s getting old?” “I’m worried for his heart.\"  They say what the other one wants to hear and before you wake up you’re out the door. You’ve been in the game long enough to know that. ELEANOR I guess I just thought there’s a level that the shit stops raining down on you. LAMMARK You’ll find it just starts rolling uphill. But maybe they have a point. Maybe I’m not the right man for the job. Melancholy crawls over Lammark’s face. ELEANOR This isn’t because they’re afraid you won’t catch him. It’s because they’re afraid that you will. (off Lammark’s l",
      "dialogue_count": 0,
      "word_count": 3166
    },
    {
      "scene_number": 7,
      "slugline": "INT. PERIMETER MALL - SURVEILLANCE ROOM - DAY Lammark, McKenzie and the mall’s HEAD OF SECURITY are sitting in the dark, before a huge wall of monitors. Everyone taut with shock. Eleanor enters. LAMMARK (his eyes on the screens) Come, Eleanor. Sit. Eleanor sits next to Lammark. A SURVEILLANCE EMPLOYEE, hands shaking, syncs and rewinds the footage of every camera in the mall until -- SURVEILLANCE EMPLOYEE This is the first time we see him. CCTV: The shooter emerges from an elevator. Black t-shirt, not the polo or sports jacket yet. Baseball cap covering his face, duffel bag over his shoulder. CCTV: More shots, from different angles. At times we lose him in the crowd. MCKENZIE (nervously) This is like   Where’s Waldo?  POLICE CHATTER (ON RADIOS)  We have a black male, 35, 5.10, 16 stone, a Magnum 357 on the --  LAMMARK (outraged) Are you even listening? This guy’s as white as my ass in December, over six foot and skinny as fuck! Marquand nods, goes talk to the police. We’ve never seen Lammark this crazy. Eleanor and McKenzie share a glance, then follow the shooter into -- CCTV: Ross, Dress for Less. The store is packed. The shooter pulls some pairs of tagged pants from the rails and heads towards the changing rooms. ELEANOR He’s following someone.  65.",
      "characters": [],
      "action_text": "Eleanor’s right. CCTV: The shooter follows a man of similar build in a Lacoste shirt and sports jacket. The man hangs them up to try a new shirt on, then comes out to get another size. Nonchalantly, the shooter grabs the man’s clothes and exits the store. LAMMARK That’s gotta be the weirdest fucking thing I’ve ever seen. CCTV: Multiple angles and shots. We follow the shooter into the restroom. This is where we met him earlier. SURVEILLANCE EMPLOYEE (fast-forwarding) We don’t have cameras inside the restroom. LAMMARK Not yet. Lammark’s phone buzzes. Jesse Capleton. He doesn’t answer. CCTV: The man with glasses leaves the restroom. MCKENZIE Wait a sec -- rewind that. The surveillance employee rewinds, blows up the image, replays those seconds in slow motion. CCTV: Through the half-open door, we catch the shooter’s hand dropping something into the trash. It’s his black t-shirt. MCKENZIE (to the head of security) Take me to that restroom. McKenzie and the head of security hurry out. Eleanor studies the screens. CCTV: The shooter exits the restroom in his new clothes and cuts through the crowd, walking confidently. ELEANOR He’s not searching. He knows where he’s going. He’s been here before. CCTV: The shooter rides the escalator down to the food court.  66. Lammark’s impressed. She’s good at this. LAMMARK (to the surveillance employee, who nods constantly) We’re gonna need old files. Weeks. Months. Years. Whatever you have. (to Krupp) I want a face. Tell Sam to check everything. Everything. Reflections in windows, cameras in stores -- KRUPP (nodding) This much footage, we should be able to 3D print the guy. Lammark’s phone buzzes again. Nathan Bowen. He doesn’t take this call either. He can’t take calls, he needs to focus. CCTV: The shooter helps himself to other people’s leftovers. ELEANOR He didn’t come here to kill. He comes here to eat. Get new clothes. He’s an animal. A dog that learnt where the leftovers are. Both Lammark and Eleanor notice that -- CCTV: The shoote",
      "dialogue_count": 0,
      "word_count": 7018
    },
    {
      "scene_number": 8,
      "slugline": "INT. SLAUGHTERHOUSE #3 - DAY Tied to metal leashes, piglets are sucking on their mother’s teats to get them to fatten up quickly. Eleanor’s face loses color and she vomits. Lammark talks with the LINE SUPERVISOR. LINE SUPERVISOR No, but I didn’t start here ‘til 2014. You guys need to talk to -- (calls out) Hey, Ramona, come over here! Ramona (58) walks over. Powerfully built, looks like she could throttle a bullock. She’s clearly worked here forever. LINE SUPERVISOR This guy look familiar? RAMONA (puts on her glasses) Familiar? That's Dean fucking Possey! SMOKING AREA, MOMENTS LATER Ramona tells her story between puffs on a cigarette. RAMONA Kept his head down, din’t cause trouble. But Alonso, the supervisor back then, he was always teasing him, like he weren’t man enough for the job. He used to call him pinhead because his head had this creepy shape. (she sucks her cigarette) One night, I think it was ‘97, they stay the last shift on the hamburger sector. Next morning, we get in and Alonso’s all ground up. Possey said he tripped and fell in the grinder, but we all knew it was him. He went to the can, actually, but since his father had some kinda connection, they reopened the case and let him out a few years after. CUT TO:  99.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 223
    },
    {
      "scene_number": 9,
      "slugline": "INT. LAMMARK’S CAR, MOVING - DAY Lammark drives fast down the highway as Eleanor reads Dean Possey’s rap sheet. ELEANOR He was let out on parole in December ‘99, with support letters from Colonel Leopold Harper and General Benjamin Tusk. Both served with Possey’s father, Sergeant Arthur Jules Possey, a shooting instructor at the 75th Rangers Regiment. When Possey’s father stepped down as instructor, he remained the arsenal keeper until he passed away in 2003. We drive past empty lots. Eleanor turns the page in the file. ELEANOR The prison psychiatrist wrote: “Awkward young man, downcast gaze, refused to shake hands. Extremely sensitive to body contact and loud noises.” Another report: “Unable to sleep, minimal eye contact. Prefers the isolation unit to general population.” GPS VOICE (PRE-LAP)  You have reached your destination.  CUT TO: EXT. POSSEY FAMILY PROPERTY - DRIVEWAY - DAY A mailbox with “Possey” painted on it. We’re deep in the silent, leafy suburbs, a driveway leading to a secluded, sprawling home. Lammark checks his gun, makes sure it’s loaded. ELEANOR We should call Mac. LAMMARK Not if we care about him. We’re breaking a dozen rules, Eleanor. Mac’s still on the inside.  100.",
      "characters": [],
      "action_text": "ELEANOR This isn’t about him. Mac would bring back up and you wanna catch him yourself. Prove everybody wrong. LAMMARK You don’t? I do things my way because I’ve seen what happens when they’re done the other way. They send tactical, they blow whatever lead is waiting in there. ELEANOR And what if   he’s   in there? LAMMARK Then we’re giving him an extra hour to escape. ELEANOR This man is a trained killer. He has nothing more to lose. And I promised Gavin that I’d keep you safe. LAMMARK So you better follow me in. CUT TO: EXT. POSSEY FAMILY PROPERTY - PORCH - DAY Lammark rings the doorbell. Twice. MRS. POSSEY (68) opens the door a crack. Lacquered gray hair, cardigan, and birdlike, inquisitive eyes. LAMMARK Mrs. Possey? My name is Marcus Flynn and this is my daughter Sophia. Is Dean around by any chance? Eleanor, tense, smiles. MRS. POSSEY Oh, Dean doesn’t live here. I wish he'd come more often. Where do you know him from?  101. LAMMARK We were cellmates. We got pretty close and -- well, Dean’s the reason I got my life back together. We were in town and I just wanted her to meet him. I'm not sure if he ever mentioned me...? Lammark seems to have won over Mrs. Possey. INT. POSSEY FAMILY PROPERTY - KITCHEN - DAY Mrs. Possey slices a lemon, pours some iced tea. Eleanor and Lammark seated across from her at the kitchen table. MRS. POSSEY Sometimes he comes and stays for a few days, makes himself useful in the garden. Then I don't see him for months, even years. I ain't seen him for some time now. Eleanor looks around the house. Pictures of Dean everywhere, alongside others of Major Possey in uniform. A house proud of its military heritage. LAMMARK How come Dean ended up in a slaughterhouse and not the Army? MRS. POSSEY Because they wouldn’t take him. Said he was too strange, too unfit. Arthur was so disappointed... He was 4th generation Army, did all he could to get Dean to join up. Ever since he was born, he taught him strategy, discipline, weapons. Lord, he was hard o",
      "dialogue_count": 0,
      "word_count": 2701
    },
    {
      "scene_number": 10,
      "slugline": "EXT. GAS STATION - DAWN A burly, BEARDED GUY is filling up his truck. As he sees Dean approaching, loaded with weapons, he draws his own gun. BEARDED GUY (aware of who he is) Hey, asshole! BANG! BANG! Dean instinctively returns fire -- BANG! WASTELAND The sound of the shots echoes across the wasteland. Bloody, covered in the blanket, right hand gripping her gun, Eleanor heads in their direction, stumbling as she runs. The score swells as fireflies blink all around her -- the image is beautiful and intense. REACHING THE GAS STATION Eleanor sees the bearded guy lying on the floor, shot in the chest. A frightened young CLERK inside the gas station is already talking to the police, pointing towards -- EXT. SUBURBAN STREET - DAWN The lights flicker on in the Starbucks. The big yellow M of the McDonalds switches on. STREET CLEANERS, OFFICE CLEANERS, REFUSE COLLECTORS already hard at work. A DOG WALKER freezes as -- Dean walks into the street. In the growing light he is paler than ever, the front of his clothes caked in blood. Guns across his back, one in each hand, grenades hanging from his belt. Half zombie, half cowboy, all nightmare. People start noticing him. Fear spreading. Blue lights flashing in the distance. Sirens approaching. Eleanor walks behind Dean, always keeping a safe distance, motioning to everyone she crosses for them to run or hide. Choppers start circling overhead, police radios crackle to life as a SNIPER climbs up to a rooftop. Eleanor watches him, taking position, loading his rifle -- CLIC.  112.",
      "characters": [],
      "action_text": "Dean hears it, turns, points, BANG! The sniper falls to the street, dead. Jesus. Eleanor keeps chasing Dean, taking shelter as she does so, looking for a clean shot. But Dean's a natural, he walks close to the walls, under the shop signs. Both killing and surviving are inscribed on his DNA. Eleanor notices two armed NEIGHBORS, father and son, hunters, walking across the street in parallel to Dean. Decisive, Eleanor motions to them: Don't! We wait! (re: sirens) but the neighbors ignore her, the father confident they’ll get him. They approach Dean, aim, and fire -- CRACK, CRACK, CRACK. Dean's hit in the leg, but he rapidly hides, then comes out again with an Ingram MAC-10 submachine gun raised and already firing -- PFRRRRRRRRRRRRRRRRR -- both father and son are dead in the middle of the street. Eleanor’s furious, she warned them. Dean’s upset too. PFRRRRR. PFRRRRR. PFRRRRRRRRRRRR. Bursts of machine gun fire in every direction as he walks. Cops, civilians, young people, old people, everyone’s an enemy and falls dead. Eleanor needs to take him down. Now. She grips her gun and follows Dean into an alley. We lose him for a moment. Eleanor looks around, he's nowhere to be seen. Trying to stay calm, she looks down at the pavement, follows the traces of blood towards -- There he is, behind the bus stop! She points at him, but he aims at her too, faster, his finger on the trigger, a stand- off. All we hear are their breathing. She could miss. He wouldn't. Suddenly, 50 feet behind Dean, Eleanor sees -- McKenzie. Climbing into a stairwell, a rifle in hand. He aims, doesn't wait. CRACK! Dean's ear is blown away, along with a piece of his neck. He falls to the ground, taking shelter both from Eleanor and McKenzie. McKenzie climbs down the stairwell, approaches, along with the SWAT team.  113. Impossibly, Dean’s on his feet again, stumbling down the alley, reloading, walking backwards now. McKenzie drops his rifle, pulls out his pistol. Dean keeps walking backwards, facing the tea",
      "dialogue_count": 0,
      "word_count": 1704
    }
  ]
}