{
  "slug": "tom-clancys-jack-ryan-101-pilot-2018",
  "title": "tom clancys jack ryan 101 pilot",
  "genre": "action",
  "format": "series",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 15024,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. POTOMAC RIVER - WASHINGTON D.C. - EARLY MORNING The Potomac river, so still it looks like glass.   The sky, bruised by the first rays of morning sunlight, is reflected in the water’s surface.  Potomac River, Washington D.C. - Present Day  The reflection of the sky begins to warp and ripple before it is broken up entirely by the BLADE of an OAR -- -- The V-shaped bow of a single scull enters frame -- its oars dip in and out of the water in powerful, rhythmic strokes. CLOSE ON: a MAN’s back.   His muscles ripple beneath the faded, sweat-soaked fabric of his B.U. Crew shirt.   The Man pushes himself as if he were in a race, but there is no one else out here at this time of morning.   Just him, the river, his scull, and his oars.   He pushes himself until his muscles are on fire and he can’t force another stroke.   The scull glides over the Potomac, cutting through the fog, and we ARM around to REVEAL -- Our MAN.   He is 35, handsome, a face you trust immediately without knowing why.   Eyes that are either warm or intense and rarely anything in between. Meet JACK RYAN.   Our HERO.   Though he doesn’t know it yet. He pulls the oars into the boat and catches his breath, stares out over the Potomac to -- Washington D.C. and its famous monuments to itself.   A modern day Rome. EXT. POTOMAC RIVER - BOAT HOUSE - MORNING A few other ROWERS are just putting their sculls in the water.   Jack carries his scull upside down on his head and walks up the dock toward the Potomac Boat Club to shower and change. EXT. VARIOUS SCENIC LOCALES - MORNING Jack rides his bike to work along the Potomac and through D.C.   A gorgeous commute.   He has his earbuds in, listening to MUSIC.   Loud.   Energetic.   Definitely not what you’d expect Tom Clancy’s Jack Ryan to listen to, but this   our   Jack Ryan, and   our   Jack Ryan is cool.   Sort of. 4. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 346
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ARLINGTON MEMORIAL BRIDGE - MORNING Jack rides over the bridge.   MUSIC blaring, as he glances both ways to cross the street onto Route 123 as --  HOOOOOOONNNNK!   A BLACK CHEVY CAMARO coming from the opposite direction, takes the turn fast, baring down on Jack -- -- Jack swerves at the same time as the Camaro -- they miss each other by inches.   Somehow Jack manages not to wipe out and deftly guides the bike across another lane of traffic and comes to a stop, his momentum nearly ejecting him over the handlebars.   He turns to look at -- The CAMARO skids to a stop in the street as the DRIVER, an African-American MAN about Jack’s age with murderous eyes, leans across the seat and yells out the open window -- DRIVER Wake up, shit head!!! The Driver punches the gas, and the Camaro speed off down Route 123, tires squealing -- JACK (to himself) Asshole. EXT. CIA - FRONT GATE - MORNING Jack rides past a line of CARS waiting to enter the front gate.   The GUARD at the GUARD SHACK scans Jack’s BLUE CIA BADGE. Jack’s PHOTO and his name, RYAN, JACK P, pop up on the guard’s monitor.   He waves Jack through the gate. TILT UP TO -- the sprawling CIA campus surrounded by a moat of trees. EXT. CIA - MORNING Jack locks his bike in a bike rack, turns off his iPhone, and places it in a water proof pouch under his bike seat.   A few feet away we see a couple of other bike riders shutting off their phones as well and stowing them.   Apparently, this is protocol. Jack runs toward the new HQ building passing CIA EMPLOYEES carrying cups of Starbucks and Dunkin’ Donuts coffee.   Just like any office on any morning in America. 5. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 310
    },
    {
      "scene_number": 3,
      "slugline": "INT. CIA - NEW HQ BUILDING - MORNING Jack enters his pin to pass through the turnstiles in the lobby -- he scans his badge again to get on the elevator -- INT. CIA - NEW HQ BUILDING - BASEMENT - MORNING The elevator doors open and Jack exits, pulling his folded up, dry-fit blazer from his backpack, shaking out the wrinkles, and putting it on as he runs down a long, windowless corridor, passing an SECURITY PROTECTIVE OFFICER (SPO), 50s. OFFICER Dr. Ryan, tough loss for your O’s last night! JACK Could be worse, Harold!   I could be a Mets fan! The Guard puts his hands over his heart in mock offense as -- Jack arrives at a heavy steel DOOR with a spin-lock.   He scans his badge and pulls open the DOOR -- INT. CIA - NEW HQ BUILDING - VAULT BX49 - CONTINUOUS Jack enters and walks briskly through a MAZE of cubicles (most of them empty) in a windowless room.   Clocks on the wall display times in different cities: WASHINGTON D.C., PARIS, KABUL, JAKARTA, BAGHDAD, CAIRO, etc.   Flat-screen TVs show live, open-source news feeds from all over the world.  CIA, Langley, Va Vault BX49, Terrorist Finance and Arms Division  Jack slows his gait, arriving at a briefing room off the bullpen of cubicles.   He smooths the lapels of his jacket, wipes sweat from his brow and enters -- INT. CIA - VAULT BX49 - BRIEFING ROOM - CONTINUOUS A motley group: millennial ANALYSTS, a few burned out CASE OFFICERS, and a couple of REPS from other agencies are taking seats around a long table for the morning brief.   These people spend 80 hours a week in this dreary space isolated from the outside world.   It makes for some interesting characters. (CONTINUED) 6. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "A FEMALE BRANCH CHIEF, 40s, looks up from the head of the table -- FEMALE BRANCH CHIEF Are you on Yemeni time, Dr. Ryan? JACK No, ma’am. Jack slides into an empty chair, winded.   His eyes catch on -- a FEMALE COLLEAGUE across the table making eyes at him.   Her name is TERESA, and she’s not so much unattractive as painfully awkward.   Jack smiles politely, averts his eyes. FEMALE BRANCH CHIEF (nods to a female ANALYST) Go ‘head, Layla. LAYLA NAVARRO, 35, a bright, worldly COLLECTION MANAGEMENT OFFICER (CMO), is one of the most experienced analysts in the room.   She moves to a lectern, glances down at a printout -- LAYLA Last night we got some fresh Houthi SIGINT from the Fort.   You'll find the serial link in the morning email... As the morning brief gets under way... INT. CIA - OLD HQ BUILDING - 7TH FLOOR - DAY JAMES GREER, the African-American man we just saw nearly cream Jack with his Camaro, sits in a chair outside a closed office door.   He’s 37 with eyes that look much older than the rest of his face.   His suit is a little tight, like he hasn’t worn it in awhile.   He seems uncomfortable, out of his element. On a nearby desk, a PHONE rings, and a MALE AIDE, 25, Asian- American answers on a headset. MALE AIDE Yes, sir. (hangs up, looks to Greer) You can go in now, Mr. Greer. Greer stands.   Next to the door of the office, a placard reads: “Edward M. Singer, Deputy Director of Operations.” CONTINUED: 7. TV Calling - For educational purposes only",
      "dialogue_count": 0,
      "word_count": 572
    },
    {
      "scene_number": 4,
      "slugline": "INT. CIA - OLD HQ BUILDING - DEPUTY DIRECTOR’S OFFICE - DAY Corner office with a view.   Lots of wood and leather.   Deputy Director of Operations EDWARD M. SINGER, 50s, polished, former Whiffenpoof, the Agency’s “old guard,” sits behind a big desk.   A regimen of vitamins and pills are spread out before him.   He dry swallows them one at a time.   He looks up as Greer enters but makes no move to greet him. D.D.O. SINGER (between pills) Have a seat. Greer takes a seat across the desk, and the two men meet eyes.   Neither are particularly happy to see each other under present circumstances. D.D.O. SINGER (CONT’D) (after a beat) So?   How was your leave? GREER Long. (beat, Singer waits for more) I took the boat out to the Grand Banks.   Did some fishing. D.D.O. SINGER Sounds... calming. Beat.   Greer doesn’t respond. D.D.O. SINGER (CONT’D) Have you talked to Christine since you’ve been back? GREER Once.   At her lawyer’s office. D.D.O. SINGER Sorry, you still have your ring on. I thought maybe you two were trying to work it out. Beat.   Greer’s silence is his answer.   Singer moves on -- D.D.O. SINGER (CONT’D) Anyway, this is a list of T-FAD personnel, their clearances, and what they’ve been read-in on. (MORE) (CONTINUED) 8. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "The group is mostly analysts, a couple of case officers, reps from Treasury and Justice, no one you’d know. He hands Greer a thin folder.   Greer takes it but doesn’t open it or say anything. D.D.O. SINGER (CONT’D) (after a beat) You know, Jim, it is what you make of it. GREER It’s a backwater post, Ed.   We both know it. D.D.O. SINGER It’s a second chance.   One that, frankly, a lot of people on this floor didn’t feel you deserved. Singer lets that land.   A beat.   Greer just stares back, waiting to be dismissed.   Singer nods.   Greer stands to go. D.D.O. SINGER (CONT’D) Oh, and Jim?   Just so we’re clear, I went to bat for you.   Don’t fuck me on this. Greer exits.   Singer watches him go, then dry-swallows another pill. INT. CIA - VAULT BX49 - BRIEFING ROOM - DAY Jack and the other participants are as we left them. LAYLA ...Imagery shows the Iranians and the Saudis maintaining the patterns we've seen this year so far.   Al Arabiya has a special this week on the conflict that has several insights, might be worth checking out. A MALE ANALYST raises his hand -- MALE ANALYST Where can we get that? CONTINUED:   D.D.O. SINGER (CONT’D) (CONTINUED) 9. TV Calling - For educational purposes only LAYLA OSC should have the dailies up online. At the front of the room the door OPENS, and everyone turns as Greer enters. ON -- Jack looks up from his notepad and recognizes Greer from their run-in this morning. JACK (under his breath) Shit. Greer clears his throat.   Everyone shuts up. GREER Morning.   I’m James Greer, your new Group Chief. PATRICK KLINGHOFFER, 31, preppy, gay, campaigned for Nader (twice), leans over to Jack, whispers -- TAREK He was Chief of Station in Islamabad. JACK Chief of Station?   What the hell did he do to get reassigned here? Greer takes a seat at the head of the table, looks over the faces of his new team.   Few meet his gaze.   Including Jack. GREER Why don’t we go around the table. Just stand up, introduce yourselves, and tell me what you’re workin",
      "dialogue_count": 0,
      "word_count": 1526
    },
    {
      "scene_number": 5,
      "slugline": "EXT. DESERT - DAY TIGHT ON: a WOMAN, 25, wearing the traditional black hijab and long, black dress.   She’s RUNNING across the desert, sprinting.   She turns around, looking behind her as if someone is gaining on her.   She is being chased.  SYRIA, 80km west of the Iraq border  TILT DOWN TO -- a SOCCER BALL -- she KICKS it, LAUGHS.   It is odd to see a woman, dressed in all black, playing soccer and laughing in the middle of the desert.   And yet there is something CHARMING about it.   We like her instantly. This is HANI.   Beneath her hijab, her pretty face seems impossibly radiant.   She dribbles the ball between her sandaled feet as... She is “attacked” by her two daughters, ZARA, 12, and RUMA, 8.   They laugh and try to steal the ball from their mother. WIDEN: the girls play on a dirt soccer pitch in front of a big HOUSE with HIGH STONE walls bleached by the relentless sun.   The house sits at the edge of a modest farming village. Next to it is a children’s playground and what looks like a schoolhouse. Zara steals the ball from her mother, dribbles upfield toward a makeshift WOODEN GOAL POST where her brother, SAMIR, 10, stands on defense.   But Samir isn’t paying attention.   He is distracted by something on the horizon -- SAMIR  Mom!   Look!  Hani turns and follows her son’s gaze to a CARAVAN of TRUCKS approaching, chased across the desert by a cloud of dust. She stops smiling. The trucks pull up to the front of the compound, the telltale BLACK FLAGS of an ISIS brigade flapping in the breeze.   .30 caliber machine guns are mounted on the roofs of the trucks. Twenty armed ISIS FIGHTERS dismount.   Their leader, an ISIS COLONEL (late 30s), Iraqi, clad in immaculate black tunic, exits the lead vehicle and puts a hand over his heart, greeting Hani -- ISIS COLONEL  As-salamu ‘alaykum . HANI  Wa-Alaikum-Salaam . (CONTINUED) 15. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "There is a familiarity here.   This isn’t the first time the Colonel has called on Hani and the kids.   But that doesn’t mean she is happy to see him. ISIS COLONEL  I hate to impose, Sayyidah, but is your husband home?  HANI  No.   I’m afraid he is still away.  ISIS COLONEL  When do you expect him to return?  Just then a YOUNG GUARD, 20s, BIG, carrying a RIFLE, approaches from the BIG HOUSE.   Two other MEN with RIFLES behind him. GUARD  Is everything all right, Sayyidah?  HANI (annoyed)  I’m quite capable of carrying on a conversation.   Do you mind?  The Guard looks at the Colonel and his men, then turns and walks back toward the house. HANI (CONT’D) (back to the ISIS Colonel)  My husband’s affairs are his business.  The ISIS Colonel nods.   He doesn’t like being talked to so bluntly by a woman, but Hani’s husband is an important man. ISIS COLONEL (he turns to his men)  Bi-sur’a ! The men begin unloading crates of provisions: VEGETABLES, FRUIT, SACKS of rice, BOTTLED WATER, etc, and carrying them toward the house. ISIS COLONEL (CONT’D)  We picked up a man in Aleppo.   It was your husband’s request that he stay here with you.  CONTINUED: (CONTINUED) 16. TV Calling - For educational purposes only He turns and WHISTLES -- the rear door of one of the trucks opens, and a BLONDE MAN, 30s, wearing a suit and dark sunglasses steps out.   He has impossibly pale skin.   His name, though we don’t know it yet, is ANSOR DUDAYEV. HANI  With us?  The ISIS Colonel shrugs; he’s just the messenger. ISIS COLONEL  Like you said, “your husband’s affairs are his business.”  Ma’assalamah . The ISIS Colonel and his fighters mount their trucks and drive off. The WHITE MAN approaches, removes his SUNGLASSES.   He has the BLUEST eyes.   He gives Hani a small nod. OFF Hani.   Who is this stranger who has been dropped into their lives?  CUT TO : EXT. BIKE PATH ALONG THE POTOMAC - NIGHT Jack rides his bike along the deserted path.   He stops for a moment and looks out over -- Washington D.C. a",
      "dialogue_count": 0,
      "word_count": 2955
    },
    {
      "scene_number": 6,
      "slugline": "INT. WAREHOUSE - CONTINUOUS Jabir enters the cavernous warehouse.   The space is divided in half by a big wall.   This side is empty, but we hear VOICES, MEN yelling in ARABIC and ITALIAN -- the SOUND of MACHINERY -- GLASS CLINKING -- Jabir moves through a big rolling metal-door (half-open) separating the halves of the warehouse.   Pallets and pallets of CRATES are stacked against the wall.   Jabir conceals himself behind one and looks at -- The center of the warehouse where a FORKLIFT sets a big pallet of WOOD CRATES down -- SEVERAL ARAB MIGRANT WORKERS begin prying the lids off and removing cases of LEBANESE OLIVE OIL.   They pass the cases down the line to another TWENTY MIGRANT WORKERS waiting to receive them.   The Migrant Workers have an elaborate set up -- first the LEBANESE BOTTLES are emptied into a vat with a spigot -- empty dark green BOTTLES are placed under the spigot and filled with Lebanese oil -- they are wiped off -- capped -- and finally, new labels are put on the green bottles: ITALIAN   EXTRA VIRGIN OLIVE OIL.   The bottles of the phony Italian olive oil are then re-packaged into new crates.   This is some kind of scam. Jabir peaks his head out further, looking around -- TWO young ITALIAN MEN walk the premises with GUNS, keeping an eye on the Arabs, barking orders. Jabir’s eyes finally LAND ON: a MOROCCAN MIGRANT WORKER, 25, let’s call him “NAJI,” working with the others to off-load the cases of Lebanese olive oil. Jabir gives a faint whistle to get Naji’s attention.   Naji sees him standing behind that pallets and nods surreptitiously.   He peels off from the group, avoiding the gaze of the guards and makes his way over to Jabir. JABIR (whispers; Arabic)  Did it come?  NAJI  Follow me.  Jabir to follows him behind a stack of crates against the far wall hidden from view of the rest of the warehouse.   Naji grabs a wood crate with a specific MARKING on the side and pulls it off the pallet. (CONTINUED) 27. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "Naji pries open the lid and lifts it -- brushes away packing straw to reveal -- SIX METAL CANNISTERS with HAZARDOUS CHEMICAL MARKINGS. Jabir nods.   He hands Naji a wad of Euros and picks up the crate. EXT. WAREHOUSE - PORT OF GENOA - CONTINUOUS Jabir exits the warehouse and walks down the empty loading dock where the Fiat van waits.   He loads the crate with the mysterious cannisters into the van and gets in. Jabir nods to the driver, an OLDER, SERIOUS-LOOKING ARAB MAN, and they drive away.  CUT TO:  INT. CIA - VAULT BX49 - GREER’S OFFICE - NIGHT Greer is packing up to go home for the night.   His hard-line PHONE rings on his desk.   He reaches for it, answers -- GREER This is Greer. INT. U.S. EMBASSY SANA’A, YEMEN - COS OFFICE - DAY - INTERCUT CHIEF OF STATION: SANA’A, PETE CORTWRIGHT, 50, salty ops guy, a kindred spirit to Greer, sits behind his desk.  U.S. EMBASSY SANA’A, YEMEN - CIA ANNEX  Cortwright is surprised to hear Greer’s voice on the other end of the phone. CORTWRIGHT Jim? GREER Pete? CORTWRIGHT I think my aide put me through to the wrong extension, I’m trying to get a hold of the T-FAD Group Chief. CONTINUED: (CONTINUED) 28. TV Calling - For educational purposes only GREER (beat; embarrassed) You’re talking to him. CORTWRIGHT Oh. Awkward silence.   Cortwright doesn’t know what to say. Clearly, Greer’s had a fall from grace. GREER What can I do for you? CORTWRIGHT I’m calling from the annex in Sana’a about this demarche you all sent.   The Ambassador just dropped it on my desk. Beat.   If anger could be measured in MPH, Greer’s just went from zero to sixty in 1.5 Seconds. GREER Can you kill it? CORTWRIGHT Afraid not.   JSOC already deployed a team to sit on the bank.   I just called to let you know.   All we can do now is wait. HOLD ON Greer.   That motherfucker! CUT TO: INT. CIA - VAULT BX49 - SECONDS LATER Greer yanks open his office door -- GREER RYAN!!!   My office!!!   Now!!! ANGLE ON: Jack in his cubicle.   He knew this was coming. A couple of cub",
      "dialogue_count": 0,
      "word_count": 1349
    },
    {
      "scene_number": 7,
      "slugline": "EXT. MARKET - WIDE POV - DAY As seen through the cross-hairs or a sniper’s SCOPE -- the The Bank Manager enters city’s famous “salt market.” SPEC OPS SNIPER (V.O.) Copy.   Got him. REVEAL: a BEARDED AMERICAN SPEC OPS SNIPER and his SPOTTER positioned in the WINDOW of an APARTMENT overlooking the market.   They are dressed in Yemeni-style clothes to help blend in. EXT. MARKET - DAY The Bank Manager walks through the crowded, noisy market that’s selling everything from fresh produce to Red Army HAND GRENADES.   He passes... TWO plain clothes YEMENI PSO OFFICERS following him through the market. The Bank Manager takes a seat at a table on the patio of an outdoor cafe.   He takes out a kerchief and wipes sweat from his brow.   His eyes scan the market.   DROP BACK INTO -- INT. SEDAN - MOVING - INTERCUT Matice keeps vigil on the Bank Manager while the Yemeni PSO Captain eases the sedan through the crowded market. Matice’s POV: a new-model MERCEDES pulls up to the edge of the cafe. Matice raises his SCOPE to his eye: a tall LEBANESE MAN, early 40s, gets out of the driver’s side.   He has a faded SCAR along the curve of his right cheek.   He moves to the Mercedes’s passenger door, opening it for -- A THIN ARAB MAN with delicate features, wearing a suit.   The two men leave the Mercedes parked at the edge of the market and walk to the cafe table and take a seat across from the Bank Manager. MATICE (into wrist mic) Silver Mercedes -- north edge of market.   Two military age males. Let’s get audio on that table. 33. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 284
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MARKET - DAY A YOUNG YEMENI WOMAN, 25, in a hijab, dressed like a college student, enters the cafe’s patio and takes a seat a few tables away.   She takes out a NOTEBOOK and PEN. CLOSE ON: she uncaps the end of the pen, revealing a tiny, tiny unidirectional MICROPHONE.   She angles her hand toward the three men’s table as she writes -- INT. SEDAN - DAY Matice listens to the audio feed.   It’s buried under the noise from the market.   The signal is bad. BANK MANAGER (V.O.) (static, cuts in and out)  -- I’m -- account -- you -- funds --  MATICE (to PSO Captain)  Can’t she get any closer?  PSO CAPTAIN  Not without blowing her cover.  DROP BACK INTO: INT. APARTMENT - SNIPER’S SCOPE POV The Thin Arab Man and his Bodyguard get up from the cafe table leaving the Bank Manager looking distraught. SPEC OPS SNIPER (into wrist mic)  They’re oscar mike back to the car.  INT. SEDAN - DAY Matice and the PSO Captain watches the TWO MEN walk back across the market to the silver Mercedes. YEMENI PSO CAPTAIN  What do you want to do?  Beat.   ON Matice.   It’s a tough call.   And it’s his to make. MATICE  We’ll take them once they’re out of the market.  (CONTINUED) 34. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "The PSO Captain gives an order in Arabic over his radio. EXT. MARKET - AT THE EDGE OF THE CAFE PATIO - INTERCUT One of the plainclothes Yemeni PSO officers walks by the silver Mercedes and deftly places a magnetized BOX under the wheel well.   What is that?   A bomb? INT. APARTMENT - DAY The Spec Ops Sniper and his Spotter break down their position -- an expert exfil, fast and clean -- INT. SEDAN - DAY Matice and his Yemeni counterpart follow the Mercedes a few -- EXT. MARKET - DAY A beat-up Toyota VAN picks up the two plainclothes Yemeni PSO Officers and the SPEC OPS Sniper team -- A SERIES OF SHOTS: cat and mouse through the narrow streets of Sana’a’s “Old City” until -- -- The Mercedes pulls onto a DIRT ROAD with no other traffic, headed away from the city. INT. SEDAN - DAY CLOSE ON: Matice hits a BUTTON on a REMOTE device and -- INT. MERCEDES - DAY -- The engine, electronics, everything goes dead.   The Body Guard’s eyes flick to the rearview mirror -- EXT. DIRT ROAD - DAY -- The Toyota van and the sedan box the Mercedes in -- DOORS OPENING -- Yemeni PSO Officers and American Spec Ops Soldiers jump out with guns, everyone yelling in Arabic -- YEMENI PSO OFFICER  Out of the car now!  CONTINUED: (CONTINUED) 35. TV Calling - For educational purposes only MATICE  Get the fuck out!  The Mercedes doors open slowly and the Thin Arab Man gets out with his hands raised -- his Bodyguard does the same -- USE EMP to stop car The mixed team of Americans and Yemenis descend on the two men, forcing them to the ground, zip-tieing their wrists behind their backs -- BLACK BAGS are pulled over their heads -- PSO OFFICERS drag them to the van as -- Matice deactivates the EMP in the wheel well -- jumps in the Mercedes’s driver seat -- and all three VEHICLES drive off in different directions. The whole thing takes less than thirty seconds, and the road is deserted again.   Quiet.  CUT TO:  INT. CIA - VAULT BX49 - GREER’S OFFICE - DAY Greer opens Jack’s personnel file on his desktop. ",
      "dialogue_count": 0,
      "word_count": 1017
    },
    {
      "scene_number": 9,
      "slugline": "INT. MUELLER FAMILY ESTATE - LIBRARY - DAY Jack is still perusing the shelves of books.   By now he has a good selection piled in his arms.   Among them: the Dickens first edition, a pristine copy of T.E. Lawrence’s letters -- FEMALE VOICE (O.S.) A little light reading? Jack startles and drops all of his books -- they scatter across the wood floor. JACK Shit -- ! He looks up at a WOMAN, early 30s, dressed casually in jeans and a blouse, hair pulled back, little to no makeup, but there is a glow about her.   A raw, whimsical beauty. WOMAN Oh my God, I’m sorry, I didn’t -- JACK -- No, it’s fine -- Jack bends over to pick up the books -- WOMAN -- Here, let me help you -- JACK -- It’s okay, really, I’ve got it -- She picks up one of Jack’s book and hands it back to him, and now they’re both face-to-face.   Jack is taken aback by her beauty.   Something about her eyes -- intense -- intelligent -- WOMAN (off his staring) Are you okay? JACK Huh?   Oh, yeah...   Sorry.   I just, um... you surprised me is all. (points to a book in her hand) So... what do you got there? She holds up her book.   Jack reads the title -- JACK (CONT’D) “Atlas of Human Intestinal Protozoa.”   Sounds... (CONTINUED) 38. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "WOMAN ...Disgusting? JACK (laughs) Yeah.   A little bit. Jack’s PAGER goes off on his belt.   He quickly silences it. WOMAN Are you a doctor? (off his look) I thought only doctors on-call still carried those. JACK I’m not a doctor, but it is for work. WOMAN Do you work in 1993? Beat.   No matter how many times Jack has to say his “legend” to a stranger -- he never gets used to lying. JACK No, for the State Department.   I do supply chain logistics.   There’s 24 times zones in the world, so I’m on call 24/7.   Anyway, it’s not that interesting.   What do you do? She reaches into her bag and pulls out her own clunky 1990s pager.   Smiles. Beat.   Jack is thrown.   Does she work for the CIA, too? WOMAN I’m a doctor. JACK Oh, right.   That... makes sense. WOMAN Washington Memorial. (raises her book) Infectious diseases.   What’s your excuse? (off his look) Your books... CONTINUED: (CONTINUED) 39. TV Calling - For educational purposes only JACK I was just looking.   There’s some incredible books titles here.   Look at this, it’s a Dickens first edition -- She SMILES -- big.   Worth waiting for. JACK (CONT’D) What? WOMAN Nothing.   You’re like a kid in a toy store. Jack’s PAGER goes off again.   Again, he silences it. WOMAN (CONT’D) -- If you need to -- JACK -- No, no.   It’s probably nothing. (beat) I’m Jack, by the way. WOMAN Cathy. Beat.   Jack looks at her, something clicks. JACK You’re Cathy?   Cathy Mueller? Joe’s daughter? CATHY Guilty. JACK I used to work for your dad. Beat.   Cathy expression changes. CATHY Oh. JACK Is something wrong? CATHY No, I’m just surprised.   You don’t seem the type. CONTINUED: (2) (CONTINUED) 40. TV Calling - For educational purposes only JACK What type is that? CATHY The type that would work for my father. Jack’s phone goes off in his pocket.   Jack digs it out, annoyed, about to silence it -- CATHY (CONT’D) I should let you take that -- JACK -- Wait -- CATHY It was nice meeting you, Jack. JACK Nice meeting you, too. She’s already walki",
      "dialogue_count": 0,
      "word_count": 4706
    },
    {
      "scene_number": 10,
      "slugline": "INT. FOB COBALT - DETAINEE INTERROGATION ROOM #2 - NIGHT Khalid scrapes up the last of his lamb and rice with a piece of pita, finishes his meal. KHALID Are you CIA? Beat.   Jack doesn’t answer. KHALID (CONT’D) Do you do this often?   Kidnap innocent people off the street and interrogate them? JACK You’re my first, actually.   How am I doing? Beat.   Khalid grins despite himself.   This is Jack’s chance: JACK (CONT’D) I’m an analyst. KHALID What does that mean? JACK It means I work behind a desk. KHALID So what are you doing here? JACK I’m starting to wonder that myself. Beat.   Jack stands moves to the ice chest on the floor grabs two cans of Fanta, places one in front of Khalid. JACK (CONT’D) How about you, Khalid?   What do you do? KHALID I’m a bodyguard. Jack points to the faded scar on Khalid’s cheek. JACK Is that how you got that scar? Being a bodyguard? (CONTINUED) 60. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "KHALID It’s an old wound.   From when I was a boy. JACK In Lebanon? Beat.   Khalid is done divulging information to this stranger. KHALID Why am I here?   What does the CIA want with me? Jack’s eyes tilt down to Khalid’s hands -- his fingernails are manicured.   Khalid catches Jack looking and puts them in his lap. JACK The other man, how do you know him? KHALID I told you, I’m a bodyguard.   He is my client. JACK You work for him a lot? KHALID First time.   He came to Sana’a on business.   A mutual acquaintance introduced us. JACK What do you know about him? KHALID I know he pays well. Beat.   Jack considers his next move, decides on: JACK What about “Suleiman”?   What can you tell me about him? A micro-beat -- Khalid’s expression registers surprise; it’s almost imperceptible, but Jack catches it. KHALID I’m afraid you’ll have to be more specific.   It is a common name where I come from. CONTINUED: (CONTINUED) 61. TV Calling - For educational purposes only OFF Jack.   Something about this guy makes the hairs on the back of his neck stand up. INT. FOB COBALT - OUTSIDE MAIN GATE - NIGHT The U.S. and Yemeni SOLDIERS we met earlier stand in the guard shack when -- Their POV: the flat bed truck the three dead bodies came in on is driving back toward the GUARD SHACK.   Headlights on. U.S. SOLDIER Now what? But the truck isn’t slowing down...   The Soldier’s FACE falls,   oh no   -- SOLDIERS fire at the approaching truck from the GUARD TOWERS, but it rams into the Guard SHACK -- and EXPLODES -- a massive FIREBALL swallows up the SOLDIERS -- the guard shack -- blowing them away like dried leaves -- the METAL GATE KNOCKED off its hinges -- TUMBLING through the FOB -- taking out more SOLDIERS as -- INT. FOB COBALT - DETAINEE INTERROGATION ROOM - NIGHT The room SHUDDERS.   Jack STARTLES, but Khalid doesn’t flinch. INT. FOB COBALT - DETAINEE FACILITY - HALLWAY - CONTINUOUS Jack exits, turns to look down the hall as Matice, Greer, and the Yemeni PSO Officers exit the big interr",
      "dialogue_count": 0,
      "word_count": 1876
    },
    {
      "scene_number": 11,
      "slugline": "EXT. FOB COBALT - DETAINEE FACILITY - NIGHT (PRESENT DAY) Suleiman and Ali, now all grown up, run to a convoy of waiting trucks -- ANGLE ON: Jack exits the D-FAC in time to see the convoy speed off into the night.   He catches eyes with Greer.   They watch the tail lights of Suleiman’s army disappear into the mountains. What monster have they just unleashed on the world? CUT TO BLACK. END OF EPISODE 67. TV Calling - For educational purposes only",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 83
    }
  ]
}