{
  "slug": "top-gun-maverick-2022",
  "title": "top gun maverick",
  "genre": "action",
  "format": "film",
  "scenes_count": 40,
  "characters_count": 0,
  "characters": [],
  "total_words": 31356,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CARRIER DECK - DAWN 1   1 FIGHTER JETS roll on the silhouetted deck as FLIGHT CREWS work their technical ballet. Men and women devoted to detail and duty, preparing their warriors for the arena. All the while, MUSIC builds over OPENING TITLES as jets LAUNCH into the sky, afterburners blazing, roaring like thunder...  EXT. CARRIER ELEVATOR - DAWN A3   A3 AN F-18 silhouetted against the morning sky, rising to the main deck. A HELMET edges into frame, bearing red white and blue stripes along with the name: MAVERICK. BOOM UP TO REVEAL the man holding the helmet, his back to us, his head turned slightly. Something troubles him. Deeply. MAVERICK  Talk to me, Goose...  MAN’S VOICE (O.S.) Captain Mitchell. And as the pilot turns we MATCH CUT TO:  INT. AIRSTREAM - DAY A12   A12 PETE “MAVERICK” MITCHELL opens his eyes from a deep sleep. He sits up, takes a deep breath, taking in the humble trailer he calls home. For those of us who know Maverick from long ago, we’re left to wonder how he ended up here. He stands, moves to the kitchenette to start the coffee machine and, along with, his day.  INT. HANGAR HOME - DUSK 12   12 CLOSE ON the door of Mav’s trailer as he exits, holding a plate with his breakfast and a cup of joe. Pull back with him TO REVEAL: The Airstream occupies a space one could only describe as the ultimate bachelor pad - motorcycles, a vintage car, a workbench covered with memories of a life dedicated to flight and, the centerpiece: A World War Two-era P-51 MUSTANG. If we suspected for a moment that Maverick had ended up on his ass, we were sorely mistaken. TIME CUT: As Maverick eats his breakfast at a small table across from an empty chair. (CONTINUED)",
      "characters": [],
      "action_text": "Maverick finishes his breakfast, stands, pats the P-51 with affection as he passes her on his way to the workbench. REVEAL: CLOSE SHOTS of Mav’s surroundings (as he dresses in b.g.): TROPHIES and AIRSPEED RECORDS, PHOTOS of a younger Maverick, with ICEMAN, at Ice’s wedding, with GOOSE, CAROLE and their young son BRADLEY. Mav with that same boy as a TEEN. He opens a cabinet lined with jackets. He pulls one out, wrapped in plastic, saved for special occasions, it seems. He rips the plastic off revealing patch laden leather that’s been around a long, long time. Mav passes a calendar, the date marked in red: MACH 9 TODAY He walks past a COLLECTION OF MOTORCYCLES, a beaten up old Pepsi machine, stops at one bike under a tarp. Revealing a familiar ‘86 KAWASAKI NINJA. CLOSE ON: Aviators and a set of keys by a helmet. He takes the keys and sunglasses, leaves the helmet...  EXT. HANGAR - DESERT ROAD 13   13 VROOOM. Maverick screams away from the hangar, spiraling dust, taking his machine to the limit.  EXT. CHINA LAKE TEST FACILITY - CALIFORNIA - DUSK 14   14 A maximum security military facility. At a gatehouse checkpoint, two ARMED UNIFORMS see him coming, open the gate, wave him through without stopping. They watch him go.  INT. TEST HANGAR - DUSK 15   15 A prototype high-hypersonic jet, THE DARKSTAR, dominates the hangar. It is unlike any machine we’ve ever seen before - itching to scream across the heavens. All it needs is a pilot. Mav strides in, ready to ride it. He stops, sees: Several ENGINEERS (JACK, SIMON & MATTHEW) and TECHS, strangely motionless. Something is amiss. All sense of momentum stops. An amiable, salty Warrant Officer, BERNIE “HONDO” COLEMAN (35), grimaces. MAVERICK Hey. What is it? CONTINUED: 12   12 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   2. MATTHEW (SENIOR) It’s over Mav. Three years of our lives, down the drain. HONDO We’ve been ordered to stand down. They’re scrapping her. MAVERICK Says who? Hondo looks to SIMON, the meek engineer who balks. HONDO",
      "dialogue_count": 0,
      "word_count": 1359
    },
    {
      "scene_number": 2,
      "slugline": "INT. MISSION CONTROL - NIGHT - MOMENTS LATER A20   A20 Hondo now has a headset on, amongst Engineers and Techs watching satellite feeds, cockpit cameras, etc. MAVERICK Control, this is Darkstar. How do you read?  INT./EXT. COCKPIT/PLANE - NIGHT 20   20 HONDO Darkstar, Control loud and clear, how me? MAVERICK Loud and clear. Ready for APU start. HONDO You know Mav, you don’t have to do this. MAVERICK I know what happens to the program if I don’t. (alt) I know what happens to everyone else if I don’t. (alt) Everyone loses their job if I don’t. (alt) They’ll scrap the whole program if I don’t. (alt) Alright sweetheart, one last ride. HONDO Cleared APU start. Mav presses the APU START button and the left engine whines. MAVERICK Good start. HONDO Ready left engine start. Mav flips switch and the left engine whines. MAVERICK Good start. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   7.",
      "characters": [],
      "action_text": "HONDO Ready for right engine start. Mav flips switch and the right engine whines. MAVERICK Good start. Darkstar is ready for taxi.  INT. CONTROL ROOM A21   A21 Hondo turns to his engineers. HONDO Thumbs for taxi? The engineers at their consoles give a thumbs up. HONDO (CONT’D) We are ready for taxi. MAVERICK (ON RADIO) Taxi-ing. (to plane) Alright, sweetheart. Let’s go for a ride. With a PRIMAL ROAR, exhaust cones spit plumes of BLUE FIRE. 21   21  INT/EXT. COCKPIT - NIGHT 22   22 Mav is on the radio. MAVERICK (ON RADIO) Tower, this is Darkstar, we are taxing with information Alpha. Mav is taxi-ing. TOWER Darkstar, you’re cleared taxi. Runway two-one. Winds two-one-zero at ten. MAVERICK (ALT) Engine temperatures are looking good. HONDO Control concurs. CONTINUED: 20   20 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   8. MAVERICK (ALT) Batteries holding at ninety-five percent. MAVERICK (ALT) (CONT’D) Cabin pressure looks good. MAVERICK (ALT) (CONT’D) Defog set. MAVERICK (ALT) (CONT’D) Hey Hondo, make a note, right main feels a little stiff. HONDO Copy. We’ll make a note. MAVERICK (ALT) I like the new LEDs on the Mach gauge. Good job. HONDO Glad to hear you like it. MAVERICK (ALT) Checking CG control. HONDO Showing good checks. MAVERICK CG at nineteen percent. MAVERICK (ALT (CONT’D) Fuel temp’s are looking good. HONDO Control concurs. MAVERICK (ALT) Hydrogen pressure at thirty-five PSI. MAVERICK (ALT) (CONT’D) Fuel cell’s warming up. Looks like good H2 and oxygen flow. MAVERICK (ALT) (CONT’D) Adjusting helmet temp. Adjusting Suit temp. HONDO Check data on. CONTINUED: 22   22 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   9. MAVERICK   (ALT) Recorder’s on. HONDO Good data. MAVERICK (ALT) Nav points check good. MAVERICK (ALT) (CONT’D) IFF on. Squawking one-four-zero- two. MAVERICK (ALT) (CONT’D) Engine oil pressure is looking good. HONDO (ALT) Ready for H2 pressure relief check. MAVERICK (ALT) Switch on. Switch off. HONDO Good check. HONDO (ALT) (CONT’D) Control’s ready for sweeps.",
      "dialogue_count": 0,
      "word_count": 1908
    },
    {
      "scene_number": 3,
      "slugline": "INT. MISSION CONTROL - NIGHT 39   39 All screens go DARK. The stream of flight data vanishes. HONDO (INTO RADIO) MAVERICK? Static. Cain doesn’t say anything. He doesn’t need to. SILENCE  EXT. TRUCK STOP - DAWN 44   44 A country highway. Some trucks blow past; a tumbleweed rolls.  INT. TRUCK STOP - DAWN A46   A46 A bell jingles. One by one, PATRONS take in a sight at the door in awe. REVEAL: Maverick, dazed, parched, helmet in one hand, stick in the other. Patrons stare. A WAITRESS at the counter pours water for a dumbstruck CUSTOMER and his YOUNG SON eating ice cream. MAVERICK Excuse me, miss? Maverick motions towards the ice water she just poured. She hands it to him. He drinks it. All of it. MAVERICK (CONT’D) Where am I? KID WITH ICE CREAM Earth. NOISE O.S. Helicopters. The sound of his fate.  EXT. TEST HANGAR - DAY 46   46 A Navy “Rescue Hawk” HH-60 helicopter lands. Maverick is escorted into the waiting embrace of TWO MPs. Maverick glances back at the heli as it flies away. He sighs, walks away with the MPs to face the music.  INT. LONG CORRIDOR - DAY B47   B47 Mav enters, followed by the MPs. He stops. REVEAL: (CONTINUED) CHERRY 11.25.19 - OFFICIAL   19.",
      "characters": [],
      "action_text": "Hondo and the same Darkstar team members Maverick left behind are here to greet him. The emotions are mixed; they are proud of what they’ve all achieved, but unsure of the cost was worth it. He moves on. They part for him, offering muted thanks, some words of encouragement. Some can’t even look him in the eye. It is a solemn moment of farewell. The passing of a legend. As he passes the last of them, he stops and looks back. ( Note: We stay in the wide so as not to undercut the moment later in Cain’s office ) MAVERICK Y’all built one helluva a plane. Bittersweet smiles from the team. Yes they did. Mavericks walks on, ready to face the music. Out on his terms.  INT. HANGAR OFFICE - DAY - MOMENTS LATER 47   47 SILENCE. The SPs flank the door. Cain sits behind a desk, turns page after page of a file. Mav waits, sweating in his flight suit, gently thumbing the stick in his hand. CAIN (looking at file) Maverick... (sighs) Thirty plus years of service... combat medals... citations... the only man to shoot down three enemy aircraft in the last forty years... ALT: distinguished...distinguished. After a long wait, Cain closes the file, stares. CAIN (CONT’D) Yet you can’t get a promotion, you won’t retire and, despite your best efforts, you refuse to die. You should be a two-star admiral by now. If not a senator. Yet here you are...   Captain . Why is that? MAVERICK One of life’s mysteries, sir. CAIN This isn’t a joke. I asked you a question. CONTINUED: B47   B47 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   20. He stares, waits. Maverick’s smile flickers ever so slightly. This is the end of the line. Beat: MAVERICK I’m where I belong... sir. CAIN Navy doesn’t see it that way. Not anymore. Cain stands. Stares out the window at the future. CAIN (CONT’D) These planes you’ve been testing, Captain, one day they won’t need pilots at all. Pilots that need to sleep, eat, take a piss... Pilots that can disobey. All you did was buy time for those men out there. (turns to Maverick) The futur",
      "dialogue_count": 0,
      "word_count": 909
    },
    {
      "scene_number": 4,
      "slugline": "INT. HALLWAY - DUSK 52   52 CLOSE ON: Photos of faces we might recognize: ICEMAN, SLIDER and, of course, GOOSE. For anyone unfamiliar, it’s obvious there is story here - Glory and ghosts. We pass a photo of ICEMAN AND MAVERICK, settle on a prominent photo of: A stern-jawed ADMIRAL TOM KAZANSKY aka ICEMAN. “Commander of the Pacific Fleet”. REVEAL: Maverick, staring at the past. ADMIRAL’S AIDE (O.S.) Captain Mitchell...   Captain Mitchell . Maverick snaps from his thoughts.  INT. OFFICERS’ BOARDROOM - DUSK 53   53 A MONITOR with an image that means little to us now but will come to dominate our thoughts. A HANDSOME, SQUARE-JAWED MAN (40s) steps in front of it. This is: CYCLONE At ease. Captain Pete “Maverick” Mitchell. Your reputation precedes you. MAVERICK Thank you, sir. CYCLONE It wasn’t a compliment. Admiral Beau Simpson. I’m the Airboss. I believe you know Admiral Bates. CLOSE ON: ADMIRAL BATES (55). An affable, brilliant two-star, otherwise known as: MAVERICK Warlock, Sir. I must admit, I wasn’t expecting an invitation back. WARLOCK They’re called orders, Maverick. His tone is friendly enough, but the meaning is clear. No one is exactly excited to see Maverick back. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   23.",
      "characters": [],
      "action_text": "WARLOCK (CONT’D) You two have something in common. Cyclone here was first in   his   class back in ‘88. MAVERICK Actually, sir, I finished second. Just want to manage expectations. Awkward silence. Cyclone nods to Warlock who takes a remote and summons images on the monitors on the walls. Warlock clicks through SURVEILLANCE IMAGES of INDUSTRIAL BUILDINGS at the base of a forbidding valley. WARLOCK The target is an unsanctioned uranium enrichment plant, constructed in violation of a unilateral NATO treaty. The uranium produced there represents a direct threat to our allies in the region. The Pentagon has tasked us with assembling a strike team and taking it out before it becomes fully operational. Maverick steps closer, studying the screens as Warlock points to corresponding satellite and archival images, along with a profile of the run: WARLOCK (CONT’D) The plant sits in a recess at the end of this valley. Said valley is GPS jammed and defended by an extensive radar array, serving a limited number of fifth generation fighters which, in turn, are backed up by a plentiful reserve of surplus aircraft; F-16s and even a few old F-14s. CYCLONE Seems we’re not the only ones holding on to old relics. Maverick lets that go. He has to. WARLOCK What’s your read, Captain? MAVERICK Normally, this would be a cake-walk for the F-35’s stealth. But the GPS jamming negates that. CONTINUED: 53   53 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   24. The surface-to-air threat necessitates a low level, laser- guided strike, tailor made for the F-18. I figure two precision bombs minimum. Makes it four planes, flying in pairs. (studies topography) That’s one helluva steep climb out, exposing you to all the surface-to- air missiles. Survive that, it’s a dogfight all the way home. WARLOCK All requirements for which you have real-world experience. MAVERICK Not in the same   mission , sir. Beat. Maverick realizes. MAVERICK (CONT’D) Somebody’s not coming back from this. CYCLONE Can it be done or not?",
      "dialogue_count": 0,
      "word_count": 1981
    },
    {
      "scene_number": 5,
      "slugline": "INT. HARD DECK - BAR AREA - NIGHT B56   B56 Hangman approaches with an empty bottle, gets Penny’s attention. HANGMAN I’ll have six more on the old timer. Maverick sighs, then: PHOENIX BRADSHAW. Is that you? Maverick freezes. Over his shoulder, BRADLEY BRADSHAW, aka ROOSTER, enter. Phoenix strides over with open arms: PHOENIX (CONT’D) This is how I find out you’re stateside? ROOSTER I thought I’d surprise you. He goes to hug her. She feints a punch to his gut, he flinches. PHOENIX Guess I surprised you back. ROOSTER (recovering) It’s good to see you. PHOENIX Good to see you, too. Maverick watches with renewed interest as the pilots settle around the pool table everyone sizing everyone up. All of them are good. They all want to know who’s best. Penny hands Hangman his beers. HANGMAN Much obliged, Pops. He heads back to the other pilots. More people are entering the bar, the night kicking off. Penny sees Maverick watching Rooster. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   34.",
      "characters": [],
      "action_text": "PENNY Did you see Goose’s son? (off Maverick’s nod) Not gonna say hello? Mav decides he should. Just as he stands, Rooster turns and looks at Mav, as if he knew he was there all along. They stare for a beat, then Rooster turns back to Phoenix. Penny sees this entire thing. MAVERICK How’s about ringing me out before the evening rush. Maverick hands her his card. Penny heads off with it to close him out.  INT. HARD DECK - POOL AREA - DUSK C56   C56 ON THE PILOTS: HANGMAN Bradshaw. As I live and breathe. He hands Rooster a beer. ROOSTER You look good, Hangman. HANGMAN I am good, Rooster. I’m very good. Phoenix and Rooster share a glance. PAYBACK So anybody know what this “special detachment’s” all about? HANGMAN A mission’s a mission. That don’t confront me. What I wanna know is who’s team leader? And which’a y’all have what it takes to follow me? Hangman winks at Rooster, needling him. ROOSTER Hangman, the only place you’ll ever lead anyone is an early grave. CONTINUED: B56   B56 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   35. Hangman looks up from his next shot, stands and walks to Rooster, face-to-face. HANGMAN Anyone follows you is just gonna... run outta fuel. But then that’s you all over, ain’t it... Rooster? Snug on your perch, waitin’ for   juuuuust  the right moment. That never comes. Cold beat. The song changes. HANGMAN (CONT’D) I love this song. He walks off. Rooster exhales as Phoenix steps up, unimpressed by the high-chesting. Rooster never takes his eyes off of Hangman as: PHOENIX He hasn’t changed. ROOSTER No, he sure hasn’t. ANGLE ON: Hangman stepping to the jukebox, smiles and makes a selection. JOHNNY CASH’ COCAINE BLUES kicks off. The energy in the room shifts. It’s Hangman’s party. Mav makes note of this, shifts his eyes back to Rooster and Phoenix, who are slightly annoyed that it’s too loud to talk now. ON THE PILOTS: FANBOY Check it out. More patches. At the door: a second wave of PILOTS enter. More hot shots. PAYBACK Omaha, Halo, Harvard, Yale... S",
      "dialogue_count": 0,
      "word_count": 3098
    },
    {
      "scene_number": 6,
      "slugline": "INT. READY ROOM - DAY 80   80 Rooster is sitting. Phoenix comes in at the other side of the room. PHOENIX Hey, you good? Rooster takes a long time to reply. ROOSTER Yeah. VOICE (O.S.) Phoenix, Bob, Hangman. Your turn. PHOENIX With   him ? Phoenix and Hangman share a look. Neither one wants to fly with the other. HANGMAN With   her ?  EXT. SKIES ABOVE DESERT - SORTIE 2 - DAY 81   81 Two more majestic F-18s roar towards camera.  [RIGHT ESCHELON. HANGMAN IN LEAD, P-BOB RIGHT WING.] INT. HANGMAN’S F-18/INT. PHOENIX/BOB’S F-18 - SORTIE 2 82   82  [LEVEL FLIGHT]  HANGMAN   * Say Phoenix, don’t you think your   * WSO should have a call-sign?   * BOB   * I’m right here you know.   * HANGMAN   * Oh shit, I forgot. Howsabout we   * tell people Bob stands for   * something? Other than Robert I   * mean.   * PHOENIX   * Don’t take the bait, Bob. Hangman’s   * just projecting.   * (CONTINUED) CHERRY 11.25.19 - OFFICIAL   50.",
      "characters": [],
      "action_text": "He’s hates his call-sign. Ever   * since Rooster gave it to him.   * HANGMAN   * I like to think I’ve grown into it.   * Now let’s see, Bob. B.O.B...   * PHOENIX   * Know why Rooster calls him Hangman,   * Bob?   * HANGMAN   * Wait, wait. I know. Baby On Board.   *  [MAVERICK’S JET SOARS RIGHT BETWEEN THEM] , loud and shocking. HANGMAN (CONT’D) (flinches) OH SHIT.  EXT. SKIES - DAY - SORTIE 2 83   83  [THE TWO JETS ARE FORCED TO SPREAD AS AN F-18 ROCKETS PAST 16 MILES A MINUTE ON A “KNIFE EDGE”, CANOPY-TO-CANOPY]. [SLIGHT MOVE OUTWARDS, BACK INTO LEVEL FLIGHT.] INT. MAVERICK'S F-18 - SORTIE 2 84   84 MAVERICK Greetings, Aviators. Let’s get to work.  INT. MAVERICK'S F-18/INT. HANGMAN'S F-18 - SORTIE 2 85   85 They listen as they start to put their masks on.  INT. HANGMAN’S F-18 / PHOENIX/BOB'S F-18 - SORTIE 2 86   86 MAVERICK Fight’s on. They put their masks on.   [MAVERICK RIPS INTO A HARD, NOSE- HIGH, RIGHT-HAND TURN.]  HANGMAN Phoenix, let’s take this guy out. Break right. CONTINUED: 82   82 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   51. PHOENIX Breaking right.  [PHOENIX BREAKS RIGHT AND HANGMAN CLIMBS.]  HANGMAN I’m going vertical.  [BOB IN HARD BANK RIGHT, IS LOOKING LEFT.]  BOB Where’s he going? MAVERICK That’s a mistake. Cover your wingman, Hangman. ALT: That’s a mistake. Never leave your wingman, Hangman. HANGMAN He called you a man, Phoenix. You gonna take that? PHOENIX So long as he doesn’t call   you   a man. (beat) Talk to me Bob. Where’s Maverick? BOB Jesus. His nose is already coming around.  [P/BOB ARE IN HARD LEFT/RIGHT TO EVADE MAVERICK.]  PHOENIX What? BOB He’s coming in for position. He’s on us, he’s on us.  INT. READY ROOM - SORTIE 2 87   87 The class listens. We focus on Rooster. ROOSTER (WHISPERS) Watch your back, Fee. Rooster curses under his breath. CONTINUED: 86   86 CHERRY 11.25.19 - OFFICIAL   52.",
      "dialogue_count": 0,
      "word_count": 483
    },
    {
      "scene_number": 7,
      "slugline": "EXT. SKIES ABOVE DESERT - SORTIE 2 88   88 As   [MAVERICK FALLS IN BEHIND PHOENIX AND BOB.]  HANGMAN Keep him busy, Phoenix. I’m on my way.  INT. PHOENIX/BOB’S F-18 - SORTIE 2 89   89  [P/BOB DO A SPLIT “S” TO THE RIGHT.]  PHOENIX He’s not gonna catch us. Hang on Bob. BOB ALT: What? ALT: Do it. I’m ready.  [PHOENIX MAKES A FIERCE SPLIT-S MANEUVER AND ROLLS RIGHT. BOB HANDLES IT LIKE A PRO. SHE TRIES TO PULL UNDERNEATH MAVERICK.]  BOB (CONT’D) Yeah, Phoenix, yeah. Good move, good move. MAVERICK (to self) Woah. Nice move Phoenix. I like your style.  EXT. SKIES - DAY - SORTIE 2 90   90  [MAVERICK TURNS LEFT AND DOWN TO GET BACK TO THE OFFENSIVE ON PHOENIX AND BOB.] [MAVERICK IS BACK ON P/BOB’S 6 O’CLOCK.]  BOB He’s on us, he’s on us again. He’s still on us. Hangman, Hangman.  INT. PHOENIX/BOB’S F-18 - SORTIE 2 91   91  [P/BOB BANK HARD LEFT/RIGHT TO EVADE MAVERICK.]  PHOENIX Where are you Hangman? (CONTINUED) CHERRY 11.25.19 - OFFICIAL   53.",
      "characters": [],
      "action_text": "[HANGMAN APPEARS BEHIND PHOENIX AND MAVERICK.]  HANGMAN I’m right here. BOB Get him Hangman, get him, get him off us. Bob struggles to look back and keep a visual on Maverick. HANGMAN But dammit I can’t shoot him without shooting you. (to himself) Sorry Phoenix. (to Phoenix) Now break right. RIGHT. PHOENIX BREAKING RIGHT.  [PHOENIX BREAKS RIGHT].  BOB (looking back) NO, NO, NEGATIVE. BREAK LE-  INT. MAVERICK’S F-18 - SORTIE 2 95   95 Which puts them right in Maverick’s gunsights.   [MAV “FIRES.”]  MAVERICK Wrong move, Phoenix. That’s a kill. Knock it off.  INT. PHOENIX/BOB’S F-18 - SORTIE 2 96   96  [LEVEL FLIGHT]  Phoenix punches her canopy. PHOENIX Copy, knock it off. Thanks Hangman. BOB Sorry, Phoenix. That was my fault. PHOENIX No, you made the right call. Hangman sold us out. CONTINUED: 91   91 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   54. ALT: No, no, it’s on me. You made the right call.  [P/BOB RTB BANK LEFT.] INT. HANGMAN’S F-18/MAVERICK'S F-18 - SORTIE 2 97   97  [HANGMAN IN LOOSE ESCHELON RIGHT.]  HANGMAN Sir, permission to continue. MAVERICK Now I know why they call you Hangman. Permission granted. You ready? HANGMAN I’ll give you a head start. MAVERICK Generous. Fight’s on.  [MAVERICK BREAKS LEFT INTO DITCH LEFT, SWEEP LEFT, DITCH RIGHT, SWEEP RIGHT.] EXT. SKIES/INT. HANGMAN’S F-18/MAVERICK’S F-18 - SORTIE 2 100   100 Mav does everything he can to shake Hangman, but nothing is working. At first it’s exciting, a challenge. But it isn’t long before Maverick is feeling the heat.  [INTO THE RIGHT SCISSORS.]  MAVERICK (TO SELF) You’re good. I can’t shake you. ALT: Damn this kid’s good. Can’t shake him. ALT: I can’t shake you, damm you’re good, I’ll give you that. The physical punishment of evasive maneuvering mounts, taking it’s toll as the pursuit stretches on. Maverick is giving it all he’s got. Hangman, on the other hand: HANGMAN (TO SELF)  Got it bad, got it bad, got it bad... I’m hot for teacher ... MAVERICK (TO SELF) You’re good. But you gave up your win",
      "dialogue_count": 0,
      "word_count": 719
    },
    {
      "scene_number": 8,
      "slugline": "EXT. TARMAC - DAY 101   101 As Phoenix, Bob and Hangman give their two hundred. Hondo listens on radio. MAVERICK (OVER RADIO) You’re smoked there, Omaha. Head on home. Next sortie. Come and get it.  EXT. SKIES - SERIES OF SHOTS - SORTIE 3 - DOGFIGHTING MONTAGE 102   102 Two more JETS SOAR, going nose-low to tangle with Maverick... as he puts a jet right in his pipper. MAVERICK That’s guns on you Fritz. Another F-18 is targeted. MAVERICK (CONT’D) Lights out, Coyote. Another. Harvard again. MAVERICK (CONT’D) That’s a kill. Another. Halo again. HALO Copy kill. Another. REMAINING PILOT Copy kill.  EXT. READY ROOM 103   103 Too far away to see who is doing the pushups. It doesn’t matter. One by one they collapse, exhausted. MAVERICK (ON RADIO) All right. You’ve all shown me some real talent. You’ve also proven the very best often have the most to learn. Two of you have my eye for team leader. CHERRY 11.25.19 - OFFICIAL   57.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 165
    },
    {
      "scene_number": 9,
      "slugline": "INT. READY ROOM 104   104 The class is shattered. Demoralized. Halo, Fritz and Harvard stagger in, wasted. Hondo follows. VOICE (O.S.) Hangman. Rooster. Your presence is requested. They look at one another. Rooster is surprised, but neither man is happy about the pairing. Off their confused looks:  EXT. SKIES ABOVE DESERT - LATER - SORTIE 4 - DAY 105   105 Final sortie. Rooster and Hangman head-to-head with Maverick.  INT./EXT. F18S - INTERCUT - SORTIE 4 A106   A106  [TWO F-18’s IN LINE ABREAST FORMATION. ROOSTER ON THE LEFT, HANGMAN ON THE RIGHT.]  Both men are tense, eyes peeled. There’s a shark in the water. And they’re lunch. Rooster is looking down. HANGMAN Nothing on radar. Again. ROOSTER He’ll be coming low to high. Hangman is looking back. HANGMAN I’m guessing from behind. ROOSTER Or both. That was some shit you pulled on Phoenix. HANGMAN I just hastened the inevitable. Besides, I paid for it, didn’t I? ROOSTER That’s not the point. Where the hell is he? MAVERICK (ON RADIO) Right here. Rooster and Hangman instinctively look back and down. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   58.",
      "characters": [],
      "action_text": "ROOSTER’S POV. He looks down to his right. Nothing. He looks down to his left and is shocked to see the tip of Maverick’s wing.  EXT. SKIES - DAY - SORTIE 4 B106   B106 REVEAL:   [MAVERICK IS INSIDE THEIR FORMATION, JUST UNDERNEATH THEM. IN THE NEXT INSTANT, HE ROLLS AND SPLITS THEM FROM BELOW. hANGMAN ROLLS AWAY RIGHT. MAVERICK ROLLS OVER THE TOP OF ROOSTER, INVERTED, LOOKING DOWN AT HIM FROM ABOVE.]  MAVERICK You boys need to focus. (at Rooster) You ready? ROOSTER Fight’s on.  [ROOSTER TURNS THE TABLES AND INVERTS. MAVERICK DOES THE SAME] . Their planes begin falling towards Earth, each trying to out-spiral one another   [IN A LEFT SPIRAL] .  INT. MAVERICK'S F-18/ROOSTER’S F-18 - SORTIE 4 106   106 The Gs are intense, the world spinning, a test of endurance. ROOSTER Not this time, Captain. MAVERICK Show me what you got. ALT: Let’s see what you’ve got. But Rooster has no shot. And neither does Maverick. As they continue to fall.  INT. HANGMAN'S F-18 - SORTIE 4 A107   A107 He chases them, unable to make a shot at the two tangling airplanes.   [FROM 5000 FT IN LEFT TURN, LOOKING LEFT & DOWN.]  HANGMAN ALT: The agreed upon hard deck is five thousand feet. The actual deck is Mama Earth and you are rapidly approaching it. ALT: Hard deck is five thousand feet, Rooster. CONTINUED: A106   A106 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   59. You’re running out of room. ALT: The actual deck is the deck.  INT. READY ROOM - SORTIE 4 107   107 The class is on their feet, staring at the radio in shock as:  INT. ROOSTER AND MAV’S F18S INTERCUT - SORTIE 4 A108   A108 The verbal altimeter is calling out the altitude as they plummet. MAVERICK What are you gonna do Rooster? What’s your move? ROOSTER What does it matter? You’re gonna wash me out anyhow. ALT: You gonna wash me out? MAVERICK Washing out is entirely up to you. ROOSTER That wasn’t always the case, though, was it, Sir? MAVERICK What’s past is past, Rooster. Focus on the enemy up here. ROOSTER You   are   the enemy. They strai",
      "dialogue_count": 0,
      "word_count": 798
    },
    {
      "scene_number": 10,
      "slugline": "INT. HANGMAN'S F-18 - SORTIE 4 A113   A113 HANGMAN Rooster, you got him. You got him. DROP DOWN AND TAKE THE SHOT. TAKE IT. TAKE IT.  INT. ROOSTER’S F-18 - DAY - SORTIE 4 113   113  [ROOSTER BANKING HARD, DANGEROUSLY CLOSE TO THE GROUND] . How much lower can he safely go: ROOSTER WE’RE TOO LOW. WE’RE TOO LOW.  INT. MAVERICK'S F-18/EXT. SKIES - SORTIE 4 114   114 MAVERICK (TO SELF) Sorry, Rooster.  [MAVERICK LEVELS OUT, STRIKES WITH A COBRA MANEUVER, FORCING ROOSTER AND HANGMAN TO SPLIT AND OVERSHOOT HIM.]   Now Mav’s instantly in chase position for a shot of his own.  INT. ROOSTER'S F-18 - SORTIE 4 115   115 Rooster hears the tone. MAVERICK That’s a kill.  INT. ROOSTER’S F-18 - SORTIE 4 116   116 Rooster seethes, outwitted, but concedes the fight... ROOSTER Copy kill.  INT. READY ROOM - SORTIE 4 117   117 Everyone exhales, shares a collective look. This is next level shit, even for them.  EXT. TARMAC - ELSEWHERE - DUSK 118   118 Close on Rooster, sweating and furious as he does push-ups on the tarmac, punishing himself. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   62.",
      "characters": [],
      "action_text": "HONDO Alright. That’s enough man. Rooster, that’s enough. Hondo pats Rooster on the shoulder. HONDO (CONT’D) Tomorrow’s another day. Rooster sits up, exhausted. Feet appear next to him. He looks up to see Phoenix above him. PHOENIX What is going on with you? You trying to get kicked out? Breaking the hard deck. Insubordination. That wasn’t you up there. Talk to me. What’s up? ROOSTER Don’t worry about it. PHOENIX I’m   going   on this mission. But if you get kicked out, you could leave us flying with Hangman. So what the hell was that- ROOSTER HE PULLED MY PAPERS. PHOENIX What? Who? ROOSTER Maverick. He pulled my application to the Naval academy. He set me back four years. Phoenix processes. PHOENIX Why would he do that? Rooster does not answer.  INT. READY ROOM 119   119 Hangman is staring at something on the wall. HANGMAN Yo, Coyote. CONTINUED: 118   118 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   63. Coyote walks over and follows Hangman’s eyes to a photo from the CLASS OF ‘86. Young Maverick, with Goose beside him. COYOTE The man, the legend. There he is... But Hangman is looking at something else. He points to Goose. HANGMAN No, next to him. He look familiar to you? COYOTE (looking closer) What have we here? Hangman reads the names under the photo: Pete “Maverick” Mitchell and his RIO “Goose” Bradshaw. HANGMAN Bradshaw... CYCLONE (PRELAP V.O.) The hard deck is a parameter set for the safety of my pilots, not to mention their aircraft, aircraft, need I remind you, paid for by the American taxpayer.  INT. CYCLONE’S OFFICE - MOMENTS LATER - MORNING 120   120 Maverick stands, holding a folder in one hand. Warlock and Cyclone sit. The mood is grim. CYCLONE Five thousand feet is   not   just a rule. It is a law. As immutable as gravity. MAVERICK The hard deck will be much lower for the mission, sir- CYCLONE It does not   change   without my approval and   certainly   not   in the middle of an exercise . And that cobra maneuver of yours could have killed all three of you",
      "dialogue_count": 0,
      "word_count": 1738
    },
    {
      "scene_number": 11,
      "slugline": "INT. PENNY'S HOUSE AD127   AD127 Penny enters and closes the door behind her before leaning her back against it, letting go of her cool demeanor. She closes her eyes, listening to the sound of Mav’s bike riding away, then hangs her head and exhales, not unlike Maverick. AMELIA (O.S.) Mom, is that you? PENNY Yeah. (to herself) Yeah, it’s me, all right. She shakes her head and exits frame as: MAVERICK (PRE-LAP) Time... is your greatest enemy.  INT. TACTICAL AUDITORIUM - DAY A127   A127 CLOSE ON: The main screen, pulling back from a rapidly ticking timer, counting backwards toward zero... Looming larger on the screen are schematics of: MAVERICK Phase one of the mission will be a low-level ingress, attacking in two- plane teams. You’ll fly along this narrow canyon to your target. Radar guided surface-to-air missiles defend the area. On screen, a schematic of a radar-guided missile array. MAVERICK (CONT’D) These SAMs are lethal, but they were designed to protect the skies above. Not the ground... Not the canyon below. ROOSTER That’s because the enemy knows no one is insane enough to navigate that low at high speed. MAVERICK And that’s exactly what I’m gonna train you to do. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   72.",
      "characters": [],
      "action_text": "ON HANGMAN who smiles. This is gonna be intense. Overhead animation of two planes zig-zagging through a narrow valley. MAVERICK (CONT’D) Your altitude on the day will be one hundred feet... Maximum. Reactions from the pilots. MAVERICK (CONT’D) Exceed this altitude... Radar will spot you - And you’re dead. As the planes on screen bank, one goes too high... A missile fires and destroys the high plane. MAVERICK (CONT’D) Speed on the day...860 knots.  Minimum . Time to target, two and a half minutes. More reactions from the pilots. MAVERICK (CONT’D) (pointing) That’s because these Fifth generation fighters are waiting at an airbase nearby... One screen, schematics of the lethal looking next-gen aircraft. Beside this, animation shows a Tomahawk Missile launch from a destroyer in a carrier group at sea as” MAVERICK (CONT’D) Simultaneous to your ingress, a carrier-based strike will take out this airfield, but if any of these planes are airborne before that, they’ll anticipate your target and immediately move to defend it. In a head-to-head with these planes in your F18s... you’re dead. (more reactions) You want to get in, hit your target and be gone before these planes even have a chance of catching you. This makes time your   greatest  adversary. CONTINUED: A127   A127 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   73. The canyon, the missiles and the fifth gen planes share the screen now. MAVERICK (CONT’D) The faster you navigate this canyon, the harder it will be to stay under the radar of these enemy SAMs. The deeper you are in the canyon, the less margin for error there will be. The tighter the turns, the more intensely the force of gravity on your body multiplies. Maverick points to various turns on the canyon map. MAVERICK (CONT’D) You’ve all faced sustained Gs before. But this... This will take you and your aircraft to the breaking point. Reactions from the class. Holy shit. MAVERICK (CONT’D) For today’s exercise, we’ll start easy. You’ll be flying a route on your nav-sy",
      "dialogue_count": 0,
      "word_count": 1200
    },
    {
      "scene_number": 12,
      "slugline": "INT. ROOSTER’S F-18/HARVARD-YALE F-18 135   135 ROOSTER Negative, Harvard. Hold your speed. YALE Rooster, we’re late. ROOSTER We’re alive. We’ll make up time in the straightaway. YALE We’re too far behind. We have to go now. ROOSTER Maintain current speed. We can make it, WE CAN MAKE IT-  INT. TACTICAL AUDITORIUM - DEBRIEF - DAY 141   141 MAVERICK What did you do wrong? Rooster just stares at him. MAVERICK (CONT’D) Why are you dead? PHOENIX Sir. Maverick looks to her. PHOENIX (CONT’D) He’s the only one who made it to the target. MAVERICK A minute late. He gave the Enemy aircraft time to shoot him down. He’s still dead. ROOSTER You don’t know that. HANGMAN You’re not. Flying. Fast enough. You were team leader up there. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   78.",
      "characters": [],
      "action_text": "COYOTE Man, on the day, the canyon will be tighter. FANBOY We’ll be pulling even higher G’s, and the missiles will be real. PAYBACK The ceiling will be   one hundred feet , time to target,   two and half minutes . HANGMAN You don’t have a second to waste. But Maverick has never taken his eyes off of Rooster. ROOSTER  We made it to the target . MAVERICK And superior enemy planes intercepted you on your way out. ROOSTER Then it’s a dog fight- MAVERICK Against fifth generation fighters. ROOSTER  We’d still have a chance . MAVERICK In an F18- ROOSTER It’s not the plane, it’s the pilot- MAVERICK  Exactly . Maverick regrets saying it in the same instant. Ugly pause. Rooster simmers. ROOSTER There’s more than one way to fly this mission,   sir . HANGMAN You don’t get it. All eyes turn to him. CONTINUED: 141   141 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   79. HANGMAN (CONT’D) On this mission, a man flies like Maverick here or a man doesn’t come back. (to Phoenix) No offense. BOB Yet somehow you always manage. HANGMAN I don’t mean to criticize. You’re conservative is all. MAVERICK Lieutenant- HANGMAN We’re going into combat, son. On a level no living pilot has ever seen. (pointing to Maverick) Not even him. It’s no time to be letting the past hold you back- MAVERICK Lieutenant-   ROOSTER What’s that supposed to mean? Hangman looks around the room, waiting. Finally: HANGMAN I can’t be the only one who knows that Maverick flew with his old man? Or that Maverick was flying when your old man- MAVERICK  That’s enough Lieutenant-  MAVERICK (CONT’D)  Rooster . But it’s too late. Rooster lunges, grabs Hangman’s collar. The class jumps in. In an instant its chaos. Hangman is not fighting back. Rooster is. Maverick, Phoenix and several other have him held tight. HANGMAN (hands up) I’m cool, I’m cool. It’s all good. ROOSTER You sonofabitch. MAVERICK You’re all dismissed. CONTINUED: (2) 141   141 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   80. He snaps, tears himself free of those still gra",
      "dialogue_count": 0,
      "word_count": 1245
    },
    {
      "scene_number": 13,
      "slugline": "INT. READY ROOM - DAY 147   147 Cyclone peeks in. Also empty.  INT. TOP GUN HANGAR - DAY 148   148 Cyclone studies loitering F-18s flanking a deserted hangar.  EXT. CORONADO BEACH - DAY 149   149 CLOSE ON: A football. Hands come down into frame, grip it, ready to snap it camera left to camera right. CLOSE ON: A football. Hands come down into frame, grip it, ready to snap it right to left. REVEAL: The pilots are divided into two teams, squaring off in a game of football with one unusual feature: There are two balls. Both quarterbacks snap at the same time. Both teams scramble. In an instant, it is chaos. Maverick is a quarterback on one team, Rooster on the other. Rooster manages to make a pass. Maverick is sacked. In fact, the opposition seems to care more about sacking the teacher than they do about scoring. Yet, in the midst of the hard-hits, we see something we haven’t seen before: camaraderie. Hondo makes an epic attempt at a touchdown despite half the class clinging to him. Hangman looks down at a prone Maverick, relishing a kill. Rooster, walks past, stops, grudgingly helps him up. It is the first remotely friendly moment they have shared. Maverick, a little sore, tenderly heads off field, waving Bob in as his replacement.  EXT. HARD DECK BAR - REAR 150   150 Maverick sits in one of two low lawn chairs, watching the chaos, mildly amused. He helps himself to a beer from a cooler as he eyes: Hangman helping Rooster off the ground. Another truce of sorts. Both balls snap and the entire class clashes. Anarchy. Mav smiles. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   85.",
      "characters": [],
      "action_text": "And a shadow falls over Maverick. Maverick looks up at: MAVERICK Sir. Cyclone is standing just beside Maverick, sunglasses hiding his eyes. He stares at the game, perplexed. CYCLONE What is this? MAVERICK Dog fight football. Offense and defense at the same time. CYCLONE And who’s winning? MAVERICK Oh, they stopped keeping score a long time ago. CYCLONE This detachment has training to do, Captain. Every available minute counts. MAVERICK Yes, sir. CYCLONE Then why am I looking at this clown show? MAVERICK You asked me to build a team, sir. There’s your team. Cyclone looks again. The cadets are split into two huddles, strategizing, working together. They break for the next play. CYCLONE The mission has been moved up one week. Last phase of training starts tomorrow. And he walks away, taking with him any sense of accomplishment the day has produced. Maverick looks back at the class, Rooster’s team rallying around him. CONTINUED: 150   150 CHERRY 11.25.19 - OFFICIAL   86.",
      "dialogue_count": 0,
      "word_count": 445
    },
    {
      "scene_number": 14,
      "slugline": "EXT. HARD DECK B152   B152 Maverick walks up the beach behind the pilots, keeping the news to himself. PENNY (O.S.) You’re good with them. He turns, sees Penny standing by the back door of the Hard Deck. PENNY (O.S.) (CONT’D) If I didn’t know better, I’d say you’re taking to this job. Maybe even enjoying it. MAVERICK I’ve always liked football. PENNY That’s not what I mean and you know it.  (off his look) If you’re not careful you could find yourself getting used to this. Mav considers this. Nods, uncomfortable. PENNY (CONT’D) You okay? MAVERICK I’m okay, it’s just... Time, you know? There’s never enough. PENNY That’s for sure. They stare at one another for a while.  EXT. PENNY’S HOUSE - NIGHT 153   153 Maverick and Penny arrive on Maverick’s bike. Penny climbs off. A bit of a pause. Easier now. She turns toward the house. Maverick looks away, exhales. PENNY You coming or not? (CONTINUED) CHERRY 11.25.19 - OFFICIAL   87.",
      "characters": [],
      "action_text": "He looks and sees her waiting by the door. He’s not sure how to respond. Penny heads inside. Maverick climbs off his bike and follows.  INT. PENNY'S HOUSE - BEDROOM - NIGHT 154   154 Maverick and Penny lie in bed, laughing quietly.   * MAVERICK   * Should I go? Before Amelia gets   * back.   * PENNY   * She’s staying at a friend’s   * tonight.   * MAVERICK   * You two seem (even/a lot) closer   * than the last time I saw you.   * (off her nod)   * How’d you manage?   * PENNY   * Well you know Amelia has a mind of   * her own.   * MAVERICK   * Where’d she get that I wonder?   * PENNY   * And she wanted more freedom than I   * thought she was ready for. But, I   * realized I had to trust her and let   * her make her own mistakes.   * MAVERICK   * Not an easy choice.   * She sees the look on his face, understands.   * PENNY   * Is that what happened with Rooster?   * He looks at her, realizes she sees everything.   * MAVERICK   * I stood in his way... I pulled his   * papers at the academy, took years   * off his career.   * PENNY   * Why?   * CONTINUED: 153   153 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   88. MAVERICK   * His mother never wanted him to fly.   * Not after what happened to Goose.   * She made me swear to her before she   * died. So...   * PENNY   * Does Rooster know that?   * MAVERICK   * He’ll always resent me for what I   * did. Why should he resent her too?   * PENNY   * Not an easy choice.   * MAVERICK   * I didn’t know what else to do. I   * just... I was trying to be the   * father he lost. I just wish I’d   * handled it better.   * Penny touches his cheek. He sighs.   * MAVERICK (CONT’D)   * The truth is, I didn’t think he was   * ready...   * PENNY Is he ready now? MAVERICK He’s a great pilot. He has the instincts. But he’s too careful. (sighs) He’s flying with his father’s ghost up there. I know a thing or two about that. Long pause. Penny is about to respond when: AMELIA (O.S.) Mom, I’m home. They freeze. PENNY Thought you were staying at Karen’",
      "dialogue_count": 0,
      "word_count": 728
    },
    {
      "scene_number": 15,
      "slugline": "EXT. PENNY'S HOUSE - NIGHT 155   155 Maverick’s drops to the ground, rolls, picks himself up. He turns, brushing himself off, coming face to face with: Amelia, in the kitchen, seeing him through the window. After an awkward moment. AMELIA Just don’t break her heart again. And she turns away, leaving Maverick to process that. WARLOCK (PRELAP) Morning... The uranium enrichment plant that is your target will be operational earlier than expected. Raw uranium will be delivered to the plant in ten days time.  INT. TACTICAL AUDITORIUM - DAY 156   156 Warlock addresses the class. Maverick is off to one side. WARLOCK To avoid contaminating the target valley with radiation, your mission has been moved up one week. (alt) Your mission has been moved up one week to avoid contaminating the target valley with radiation. Reactions from the class. This is bad. COYOTE Sir, no one here has successfully flown the low level course. WARLOCK Nevertheless, you have been ordered to move on. Captain. As the class absorbs this, Warlock nods to Maverick. MAVERICK We have one week left to focus on phase two - the most difficult stage of the mission: a pop-up strike with a steep dive requiring nothing less than two consecutive miracles. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   91.",
      "characters": [],
      "action_text": "AN EXPLOSION OF SOUND TAKES US TO:  EXT. CALIFORNIA DESERT - “ POP-UP TARGETING TRAINING ” 157   157 Two F-18s blast low over ground pockmarked by scrub brush.  INT. ROOSTER’S/PHOENIX & BOB’S F18S - SORTIE 1 - DAY 158   158  [LEVEL FLIGHT] [RIGHT ESCHELON, RIGHT TO LEFT SCREEN DIRECTION]  ROOSTER and PHOENIX/BOB are   [FLYING AS A TEAM] , heading toward a U-shaped cluster of RUSTED SHIPPING CONTAINERS. MAVERICK (V.O.) Two pairs of F-18s will fly in a welded wing formation.  INT. HANGMAN/PAYBACK & FANBOY’S F18S   - SORTIE 2 - DAY 159   159  [LEVEL FLIGHT] [RIGHT ESCHELON, RIGHT TO LEFT]  In a separate sortie, Hangman and Payback/Fanboy fly at the same target: A small STEEL TARGET DRUM behind the containers. MAVERICK (V.O.) Teamwork - the precise coordination of these aircraft - is essential to both the mission’s success, and your survival.  INT. TACTICAL AUDITORIUM - BRIEF 160   160 On the main screen, a simulation of the mission plays out in slow, deliberate motion as Maverick speaks.  [LEVEL FLIGHT] [RIGHT ESCHELON, RIGHT TO LEFT]  MAVERICK As you know, the plant rests between two mountains. To maintain the lowest possible altitude, you’ll invert directly into a steep dive. Your target is an impact point less than three meters wide. CONTINUED: 156   156 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   92. The aircraft in the simulation climb a mountain and roll onto their backs at the peak before diving, upside down. They roll upright and dive steeply.  EXT. CALIFORNIA DESERT/INT. F18S - SORTIE 1&2 - INTERCUT 161   161  [LEVEL FLIGHT] [RIGHT ESCHELON, RIGHT TO LEFT]  Both teams’ aircraft fly in tandem mimicking this maneuver.  [CLIMB A MOUNTAIN AND ROLL ONTO THEIR BACKS AT THE PEAK BEFORE DIVING UPSIDE DOWN. THEY ROLL UPRIGHT AND DIVE STEEPLY.]   Of course, they do so without mountains in their way.  INT. TACTICAL AUDITORIUM - BRIEF 162   162  [LEVEL FLIGHT] [RIGHT ESCHELON, RIGHT TO LEFT]  MAVERICK The two-seat aircraft will paint the target with a laser bullseye. The lea",
      "dialogue_count": 0,
      "word_count": 1781
    },
    {
      "scene_number": 16,
      "slugline": "EXT. SKIES OVER RANGE - DAY - POP UP SORTIE 3 198   198  [COYOTE’S F-18 IS INVERTED, HEADED BACK FOR THE GROUND.] INT. PHOENIX-BOB’S F-18 - DAY - POP UP SORTIE 3 200   200 PHOENIX HE’S IN G-LOC. HE’S GOING IN.  EXT. SKIES OVER RANGE - POP UP SORTIE 3 202   202  [MAVERICK DIVES   LEFT AFTER COYOTE TARGETING HIS PLANE.] [P/BOB FOLLOW FALLING IN TIGHT FORMATION WITH MAV.]  MAVERICK  Come on, come on... gimme tone, you sonofabitch .  INT. COYOTE'S F-18 - POP UP SORTIE 3 203   203 Coyote is half in, half out of consciousness. A WARNING ALARM SCREAMS in his cockpit, rousing him back from the brink. COYOTE’S POV, the ground coming up fast.   [COYOTE YANKS BACK ON THE STICK AND REGAINS CONTROL]   , breathing heavy. COYOTE I’m okay, I’m okay. I’m good...  INT. MAVERICK’S F-18 - DAY - POP UP SORTIE 3 A204   A204  [LEVEL FLIGHT] [RIGHT ESCHELON, RIGHT TO LEFT]  Mav pulls off his oxygen mask, exhales relief.  [P/BOB APPEAR BESIDE MAVERICK’S JET.]  PHOENIX (sigh of relief) That was close. MAVERICK Let’s return to base. CHERRY 11.25.19 - OFFICIAL   100.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 185
    },
    {
      "scene_number": 17,
      "slugline": "INT. TACTICAL AUDITORIUM - DAY - POP UP SORTIE 3 B204   B204 Cyclone, with Warlock, Hondo and the class, stares as this plays out on SCREENS.  INT. MAVERICK’S F-18 - POP UP SORTIE 3 C204   C204 Maverick hears a BANG, looks around. What the?  INT. PHOENIX/BOB'S F-18 - POP UP SORTIE 3 D204   D204 Phoenix is still giving it her all when BANG.  [BANKS LEFT INTO SLOW LEFT ROLL.]  ALARMS BLARE. Bob’s instrument cluster lights up. BOB ENGINE FAILURE, LEFT ENGINE IS OUT. Phoenix, climb. PHOENIX Climbing. Phoenix pulls back on the stick. Bob looks over his shoulder to see the LEFT engine is on fire. BOB We’re on fire, we’re on fire. PHOENIX Throttling back. Shutting off fuel. Extinguishing fire. Phoenix pulls back on throttle and activates the fire extinguisher switch. BOB We’re losing the right engine. PHOENIX It’s still spinning. I’m gonna try to restart it. Phoenix flips the APU switch and pushes the right throttle forward. PHOENIX (CONT’D) APU on.Throttle up. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   101.",
      "characters": [],
      "action_text": "Nothing happens. PHOENIX (CONT’D) Shit. Trying again. She tries the APU and throttle again. But suddenly, with a BANG, the right engine now CATCHES FIRE.  INT. MAVERICK’S F-18 - DAY - POP UP SORTIE 3 E204   E204  [MAVERICK SEES PHOENIX’S JET VEERING.]  BOB (ON RADIO) RIGHT IS OUT. PHOENIX Goddamnit. MAVERICK Oh my God.  INT. TACTICAL AUDITORIUM - DAY - POP UP SORTIE 3 F204   F204 Everyone watches, helpless... Rooster stands, powerless. All he can do is watch.  INT. PHOENIX/BOB'S F-18 - DAY - POP UP SORTIE 3 G204   G204  [PHOENIX STRUGGLES TO REGAIN CONTROL OF THE PLANE.]  BOB I’ve got every warning light lit up back here. PHOENIX We lost hydraulics. I can’t control it.  [P/BOB JET STARTS TO ROLL OFF RIGHT.]  MAVERICK (OVER RADIO) EJECT. EJECT.  INT. TACTICAL AUDITORUM - POP UP SORTIE 3 H204   H204 ROOSTER  PHOENIX ,   EJECT . CONTINUED: D204   D204 CHERRY 11.25.19 - OFFICIAL   102.",
      "dialogue_count": 0,
      "word_count": 322
    },
    {
      "scene_number": 18,
      "slugline": "EXT. SKIES OVER RANGE - POP UP SORTIE 3 204   204 Phoenix’s grabs the handles. The canopy blows. She and Bob are ejected one after the other seconds before their jet COLLIDES with the desert floor and EXPLODES.  INT. MAVERICK’S F-18 - POP UP SORTIE 3 205   205 Maverick watches the two chutes drift, seeing the past flash before his eyes... He pulls off his mask, shutting his eyes. [Note: Still waiting on technical here]: MAVERICK (INTO RADIO) Maverick to tower. We have a plane down. Send a helo.  EXT. COASTAL MOUNTAINS - DAY 206   206 A Coast Guard MH-60T JAYHAWK SOARS OVER the landscape. INTERCUT QUICK GLIMPSES of the Coast Guard rescue: CREWMEN rappelling from the chopper with a RESCUE STRETCHER. Working expertly, they’re able to pluck them off the slope. CYCLONE (PRELAP) In the course of training, have you felt Captain Mitchell was forcing you beyond your natural abilities?  INT. INFIRMARY - NIGHT 207   207 Phoenix and Bob are banged up, but alive, being tended to by MEDICS. Cyclone is here. PHOENIX No, sir. CYCLONE Would you say that his training left you no margin for error? PHOENIX We suffered a double engine failure at low altitude. We had no choice but to eject. CYCLONE (to Bob) Would you say that his training left you no margin for error? (CONTINUED) CHERRY 11.25.19 - OFFICIAL   103.",
      "characters": [],
      "action_text": "Phoenix and Bob share a look. CYCLONE (CONT’D) Don’t look at her. Answer the question.   Would you say that his training left you no margin for error ? BOB I know what you want me to say. I’m not going to say it. PHOENIX We did what the mission calls for. Captain Mitchell is not responsible for what happened out there.  INT. CORRIDOR OUTSIDE INFIRMARY 208   208 Maverick waits anxiously. Cyclone emerges from the infirmary and approaches. There is a long, uncomfortable pause as Cyclone ponders what to say. Just as he goes to say it: WARLOCK (O.S.) Admiral. Maverick and Cyclone turns their heads to see Warlock and Hondo approaching. WARLOCK (CONT’D) At the request of Hondo here, I’ve just been down to inspect Captain Mitchell’s plane. Cyclone looks to Hondo: “Well?” HONDO Bird strike, sir. CYCLONE Come again? HONDO There’s bird guts all down the starboard side of Mav- Of Captain Mitchell’s plane, sir. Phoenix was flying in tight formation with him. I’m guessing the wreckage’ll show she took a flock of birds head on. Cyclone looks at Maverick for another beat, then walks away. Warlock follows, leaving Maverick and Hondo to share a look. CONTINUED: 207   207 CHERRY 11.25.19 - OFFICIAL   104.",
      "dialogue_count": 0,
      "word_count": 433
    },
    {
      "scene_number": 19,
      "slugline": "INT. READY ROOM - DUSK 209   209 Pictures of Top Gun pilots past: Ice, Maverick, Goose. A lone light on. Rooster sits alone... He stares at his phone and a photo of his young self with Maverick. After a hesitant beat, he deletes it. Maverick enters, notices a photo in Rooster’s locker: GOOSE, his wife CAROL, and a tow-headed 3-year-old Rooster, arms around each other, happy. It watches over the scene: MAVERICK They’ll keep Phoenix and Bob in the hospital overnight for observation. But they’re going to be okay. ROOSTER I have never lost a wingman. In combat, off a carrier, never. MAVERICK You’ve been lucky. Fly long enough, it’ll happen. There will be others. ROOSTER Easy for you to say. No kids, no family. No one to mourn you when you burn in. MAVERICK Go home. Get some sleep. He turns to leave, stopping on: ROOSTER WHY DID YOU PULL MY PAPERS AT THE ACADEMY? WHY DID YOU STAND IN MY WAY? The words sting them both. Maverick wants to tell the truth, but can’t. After a long pause. MAVERICK ...You weren’t ready. ROOSTER Ready for what? Ready to fly like you? (CONTINUED) CHERRY 11.25.19 - OFFICIAL   105.",
      "characters": [],
      "action_text": "MAVERICK No, ready to forget the book. Trust your instincts. Don’t think. Just do. You think up there, you’re dead. Believe me. Rooster smiles at the irony. ROOSTER My dad believed in you. I’m not gonna make the same mistake. Before Maverick can respond: WARLOCK (O.S.) Maverick. Maverick turns, seeing something in Warlock’s eyes. And in that moment he knows. The sound of taps takes us to:  EXT. MILITARY CEMETERY - DAY - THREE DAYS LATER 210   210 A portrait of Iceman presides over his funeral. An AMERICAN FLAG is presented to his wife. Her sons, their wives and small children are all by her side. A large group of NAVAL OFFICERS and their FAMILIES are in attendance. Officers are all in crisp dress blues. Maverick stands beside Iceman’s family. Elsewhere, Penny’s with Amelia. Cyclone receives the folded flag from the officers and presents it to Sarah. Sarah glances to Maverick who begins his eulogy. MAVERICK Ice understood what it is to be a wingman. A wingman is willing to defend your life with their own...stay with you no matter how impossible the odds... More than anything, a wingman is there to push you beyond your limits, encourage you to find the very best in yourself. Ice was a wingman to his family, his friends, to every life he touched. That is why I know he’ll never be truly gone. Maverick steps forward to the casket, puts his wings on the casket and salutes. CONTINUED: 209   209 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   106. In THE CROWD: Rooster and the trainees are in attendance too, along with many TOPGUN graduates. Rooster watches Mav step away from the casket... ...as there’s the rumbling CRESCENDO OF JETS as the Navy’s BLUE ANGELS STREAK OVERHEAD. One pulls up into a vertical climb: the “missing man” formation. Maverick and Cyclone make eye contact. CYCLONE (PRELAP) I know that you and Admiral Kazansky were close.  INT. CYCLONE'S OFFICE A212   A212 Maverick stands before Cyclone, seated at his desk. CYCLONE I can only imagine what you must be feeling. ",
      "dialogue_count": 0,
      "word_count": 1144
    },
    {
      "scene_number": 20,
      "slugline": "EXT. TRAINING CANYONS - DAY 217   217 Afterburner ROARS as Mav slices ahead, studying the THREE ROUTES on his display, as he locks in his focus...  INT. TACTICAL AUDITORIUM - DAY 218   218 Rooster watches Mav’s SCREEN POV lining up for a run... MAVERICK (OVER RADIO) Setting time to target at two minutes... fifteen seconds. Reactions from the room. PAYBACK That’s impossible. CLOSE ON ROOSTER, focused on the screen.  EXT. TRAINING CANYON - DAY 219   219 Mav’s jet ROARS into the course, dipping dangerously low, SKIMMING right above the riverbed floor. MAVERICK (OVER RADIO) Final attack point, inbound.  INT. TACTICAL AUDITORIUM - DAY 220   220 Rooster and the rest watch his TIMER and ALTITUDE levels...  EXT. TRAINING CANYONS - DAY 221   221 Mav’s F-18 HUGS the tight twists and curves, seeing the Final Canyon final narrow notch now looming ahead as he KNIFES through the final ridge gap that stymied Rooster. MAVERICK (to himself) It’s no good. Suddenly, he yanks back on the stick and climbs out of the valley.  INT. TACTICAL AUDITORIUM 222   222 The class watches him climb out. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   111.",
      "characters": [],
      "action_text": "COYOTE He’s backing off. (to Hangman) Nobody can do it.   Nobody . Reactions of disappointment from all but two: Rooster, leaning in, waiting... And Cyclone, who nods ever so slightly, in a way that says he will deal with Maverick permanently. CYCLONE Tell the tower to order that man to land that aircraft. When he hears no response, he turns to Hondo. CYCLONE (CONT’D)  Now . Hondo snaps out of it and reaches for the phone.  INT. MAVERICK'S F-18 223   223 BASE ATC (OVER RADIO) Maverick... You are ordered to land immedi- Maverick shuts off his radio. MAVERICK Talk to me, Goose... Maverick resets the clock, cranks the stick hard and dives, coming back around for a second pass. He repeats the same maneuver’s, except:  INT. TACTICAL   AUDITORIUM - DAY 224   224 Cyclone turns, noticing the class staring at the screens, enrapt. CYCLONE (to Hondo) Shut them off. Shut them all off- BOB He’s going again... Cyclone turns to face the screen as everyone else leans in. CONTINUED: 222   222 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   112. HANGMAN He’s less than a hundred feet off the deck. COYOTE ... And dropping. Bob checks his watch, hits the timer. CLOSE ON ROOSTER, waiting...  EXT. RANGE 225   225 Silence. An empty sky. Barely a breeze. A black spot on the horizon growing larger by the second until THE GATES OF HELL EXPLODE and Maverick’s F-18 blows right over us at 920 knots and twenty feet off the deck.  INT. MAVERICK’S F-18 - DAY 226   226 MAVERICK (OVER RADIO) Popping in three... two... one. He SWOOPS into his POP-UP CLIMB, pulling severe G’s as he tops out, rolls and PLUNGES INTO HIS BOMBING DIVE. MAVERICK (OVER RADIO) (CONT’D) No wingman to laze the target. Dropping blind. He struggles to put the shuddering STEEL DRUM target in his crosshairs... MAVERICK (CONT’D) Bombs away.  EXT. BOMBING RANGE - DAY 227   227 He DROPS a TRAINING ROUND as he dives, and SWOOPS INTO A CLIMB at the last possible second. As the SMOKE HITS:  INT. TACTICAL AUDITORIUM - DAY 228   228 FANBOY Bullse",
      "dialogue_count": 0,
      "word_count": 557
    },
    {
      "scene_number": 21,
      "slugline": "INT. MAVERICK’S F-18 - DAY 229   229 Mav BATTLES the jet, pulling 10 Gs on his egress, impossibly steep. Fighting hard to clear the “virtual mountain”...  INT. TACTICAL AUDITORIUM - DAY 230   230 MAVERICK (OVER RADIO) Target is destroyed. Maverick is RTB. The team can see the readout on their screen. 10 Gs, far beyond the accepted limits of the F18. HANGMAN 10 Gs... Damn. The trainees react. They’d cheer if Cyclone weren’t here. Cyclone stares at the screen, his expression impossible to read. Warlock eyes the trainees. Rooster sits back, looks down. He’s the only one not celebrating. He has too much to think about now. CYCLONE (PRE-LAP) You’ve put me in a difficult position, Captain.  INT. CYCLONE’S OFFICE 233   233 Rain is pouring outside. Thunder rolls. A clock ticks. Mav sits beside Warlock in front of Cyclone’s desk. Cyclone’s stares out the widow, hands behind his back. CYCLONE On the one hand, you’ve demonstrated that the mission can be flown. Perhaps in the only way it can be survived. On the other hand, you did so by stealing a multi-million dollar military aircraft and flying it in such a manner that it may never be airworthy again. (turns) Iceman is no longer here to protect you. And I have everything I need to have you court-martialled and dishonorably discharged. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   114.",
      "characters": [],
      "action_text": "But then I would be disposing of the one man with a ghost of a chance of successfully completing this mission. Maverick blinks, stunned. Did he hear that correctly? CYCLONE (CONT’D) So, what do I do? Risk the lives of my pilots, not to mention the success of the mission, by sending them without you? Or risk my career by appointing   you   team leader? Maverick moves to speak, Warlock stops him. WARLOCK I believe the Admiral is asking a rhetorical question, Captain. MAVERICK Sir. And over Maverick’s incredulous expression: CYCLONE (O.S.) You’ll choose your team on the carrier. You ship out tonight.  INT. HARD DECK - NIGHT 236   236 Crowded, busy, alive. SAILORS dancing. Maverick enters in uniform. Behind the bar, Penny brightens when she sees him. But her smile fades when she sees the look on his face. And the sounds of the bar give way to:  EXT. HARD DECK - NIGHT 237   237 The sounds of the ocean. Just Maverick and Penny now. She’s up to speed and stunned. She studies him. He just stares. His eyes say it all. She embraces him tightly and shuts her eyes. CLOSE ON: MAVERICK. His eyes are set on an uncertain future. And the pre-lap of JET ENGINES warming up gives way to: CONTINUED: 233   233 CHERRY 11.25.19 - OFFICIAL   115.",
      "dialogue_count": 0,
      "word_count": 448
    },
    {
      "scene_number": 22,
      "slugline": "EXT. USS THEODORE ROOSEVELT - CARRIER READY ROOM - NIGHT 238   238 The roar of the ocean as the imposing USS JOHN C. THEODORE ROOSEVELT cuts through the waves. WARLOCK (PRELAP) Your target is a clear and present threat: a secret uranium enrichment site under rogue state control.  INT. USS THEODORE ROOSEVELT - CARRIER READY ROOM NIGHT 239   239 Maverick, Rooster and all of the pilots. Hondo is off to the side with Cyclone. All eyes are on Warlock at the head of the room. On a SCREEN behind him, a detailed map of the TARGET VALLEY highlights the flight paths of various elements. WARLOCK It’s an underground bunker tucked between these two mountains. Your route of ingress is heavily defended by surface to air missiles, backed up by fifth generation fighters. (to Mav’s team) Once your F-18 strike team crosses the border, Tomahawk Missiles from the USS LEYTE GULF will be launched in a synchronized strike on the enemy’s airfield... here. (points) The moment those Tomahawks hit, the enemy will know you’re coming. Your time to target will be two minutes and thirty seconds. Any longer than that and you will be exposed to any aircraft the Tomahawks may have missed. MAVERICK Most importantly, remember coffin corner. On the climb out of the valley, you’ll be exposed to enemy missiles. Remember, get low as fast as you can and break for home. Warlock takes a beat, looking over the faces of the pilots. Rooster cannot believe this any more than Maverick. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   116.",
      "characters": [],
      "action_text": "WARLOCK Captain Mitchell, select your two Foxtrots. MAVERICK Payback and Fanboy... Phoenix and Bob. Phoenix and Bob are understandably moved. WARLOCK And your wingman? Hangman straightens, ready for the job. Rooster looks down. MAVERICK Rooster. Everyone is surprised, most of all, Rooster and Hangman. WARLOCK The rest of you will standby on the carrier in reserve. CYCLONE This is what you’ve all been training for. Come home safely. Good luck to you all. Dismissed. As the pilots fall out, Maverick steps to Hangman.' MAVERICK Hangman, you're one of the most fearless pilots I’ve ever seen. HANGMAN But you need someone who’ll put the team first. I did not demonstrate that to you, sir. Maverick doesn’t need to reply. HANGMAN (CONT’D) Rooster is your man. He nods falls out. Hondo approaches Maverick as he shifts attention to Rooster. HONDO Is he ready? MAVERICK He'll have to be. CONTINUED: 239   239 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   117. Maverick’s eyes meet Rooster’s. There is nothing to say.  EXT. CARRIER ELEVATOR - DAWN A240   A240 AN F-18 silhouetted against the morning sky, rising to the main deck. A HELMET edges into frame, bearing red white and blue stripes along with the name: MAVERICK. BOOM UP TO REVEAL the man holding the helmet, his back to us, his head turned slightly. Something troubles him. Deeply. MAVERICK  Talk to me, Goose...  MAN’S VOICE (O.S.) Captain Mitchell. Maverick turns to see Warlock looking up as the elevator rises. WARLOCK You’re where you belong. Make us proud. Maverick smiles, nods.  EXT. FLIGHT DECK - USS THEODORE ROOSEVELT - DAWN 240   240 A ballet of controlled chaos as various FLIGHT DECK CREWS prepping all the aircraft involved in the mission. Rooster, Phoenix, Bob, Payback and Fanboy step onto the deck. It’s for real now. No more training. They trade determined looks... and head for the planes... Rooster finds Hangman in his way. After a long pause. HANGMAN Give ‘em hell. Rooster nods. Hangman walks away, leaving Rooster to conte",
      "dialogue_count": 0,
      "word_count": 783
    },
    {
      "scene_number": 23,
      "slugline": "INT. ROOSTER’S F-18 - DAWN 244   244 MAVERICK (OVER RADIO) Dagger One, comms check.  INT. F-18 - PHOENIX/BOB/ROOSTER - DAWN 245   245 Phoenix and Bob are sweating, psyching themselves past the anxiety. PHOENIX Dagger Two, up and ready.  INT. F-18 - ROOSTER - DAWN A246   A246 Rooster shakes off the nerves. ROOSTER Dagger Three, up and ready.  INT. F-18 - PAYBACK/FANBOY - DAWN 246   246 Fanboy crosses himself. Payback exhales. PAYBACK Dagger Four. We read you, sir.  INT. HANGMAN’S F-18 - DAWN A247   A247 HANGMAN Dagger spare is up and ready. Standing by.  INT. MAVERICK’S F-18 - DAWN 247   247 Maverick is about to respond, hesitates.  INT. F-18'S INTERCUT A248   A248 The other pilots hang in the awkward silence. Finally: ROOSTER Sir, do you copy? CHERRY 11.25.19 - OFFICIAL   120.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 131
    },
    {
      "scene_number": 24,
      "slugline": "INT. MAVERICK’S F18 - DAWN B248   B248 ROOSTER Sir..? MAVERICK (OVER RADIO) I want to thank you all for trusting me to lead you.  INT. F-18'S INTERCUT C248   C248 Reactions from all of the pilots, moved as he continues. MAVERICK You’re the best of the best. It’s an honor to be flying with you. We land on Rooster for: MAVERICK (CONT’D) All of you. PHOENIX We’re with you, sir. All the way.  INT. MAVERICK'S F18 DAWN D248   D248 MAVERICK Forget the sir. We’re all the same rank today. Dagger One up and ready on Catapult one. Maverick clips on his mask.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT - DAWN 248   248 Cyclone and Warlock stand with ship’s Officers and Comms- Crew. Hondo is here as well, anxious. COMMS-CREW TECH 1 Support assets airborne. Strike package ready. Standing by for launch decision. CYCLONE Send ‘em. CHERRY 11.25.19 - OFFICIAL   121.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 151
    },
    {
      "scene_number": 25,
      "slugline": "EXT. FLIGHT DECK - DAWN 249   249 A CATAPULT OFFICER signals with a two-finger wave, as the two jets facing him throttle ENGINES to full... Maverick and Rooster, side-by-side, SALUTE the Officer, then press heads back against headrests. The FINAL CHECK CREWS around each aircraft offer a thumbs-up, one by one, causing the Catapult Officer to crouch, touching the deck to point forward. Maverick and Rooster’s Super Hornets BLITZ across the deck, RIPPING into the sky. Phoenix and Bob, Payback and Fanboy are launched a moment later.  EXT. SKIES ABOVE CLOUDS - MORNING 250   250 Four F-18s fly above dark ominous clouds... MAVERICK (OVER RADIO) Rough Rider. Dagger, Texaco complete. Comanche, standby check- in.  EXT./INT. HAWKEYE - SAME - MORNING 251   251 An AIR CONTROL OFFICER watches streams of data roll in: AIR CONTROL OFFICER Comanche one-one, set. Lightning One, status.  EXT./INT. F-35 - SAME - MORNING 252   252 An F-35 PILOT monitors his electronic view of the valley: F-35 PILOT Lightning One, set. Bravo route is clear.  INT. F-18S - WITH ROOSTER/MAVERICK - MORNING 253   253  [ALL JETS ARE ABOVE A LAYER OF CLOUDS. THEY DESCEND THROUGH THE CLOUDS TO 1000 FEET.]  Rooster takes a deep breath. They’re going in. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   122.",
      "characters": [],
      "action_text": "MAVERICK Taking it down to one hundred feet.  [ALL JETS DESCEND TO 100 FEET]  MAVERICK (CONT’D) Dagger is set. Proceeding to Bravo. Ready on my mark...  INT. F-18’S INTERCUT - MORNING A254   A254 PHOENIX Two. ROOSTER Three. PAYBACK Four. Maverick, Rooster, Bob and Fanboy all place a finger on a timer start button set for [TIME TBD]. MAVERICK Mark. All four push the button and their clocks start counting down. PHOENIX Two mark. ROOSTER Three mark. PAYBACK Four mark. With Mav taking lead, the Strike Package flies in a delta formation toward enemy territory.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT - DAWN AM254   AM254  A TECH STARTS A TIMER ON THE PANEL .  HONDO CLICKS A STOPWATCH OF HIS OWN   and holds it in his clenched fist throughout the sequence, checking it periodically. CONTINUED: 253   253 CHERRY 11.25.19 - OFFICIAL   123.",
      "dialogue_count": 0,
      "word_count": 350
    },
    {
      "scene_number": 26,
      "slugline": "EXT. OCEAN AA254   AA254  [AS THEY ROAR ACROSS THE OCEAN THE JETS SWITCH FROM DIAMOND FORMATION TO THE SNAKE POSITION] INT. F18S INTERCUT BB254   BB254 CLOSE ON all of the pilots sweating, riding the ragged edge. Rooster flips switches on his console, his breathing picks up... This is low. Too low. He’s sweating bullets, pushing himself to focus and hold it together.  EXT. SKIES ABOVE MOUNTAINS - MORNING 254   254 UP AHEAD: SNOWY MOUNTAINS, all crags and jagged pines, tighter alleys than they ever had in training. CLOSE ON: Rooster, watching that narrow canyon coming up fast. He glances at his air speed. Too fast.  INT. F18S - INTERCUT AA255   AA255 ROOSTER (TO SELF) You can do this. Stay cool. Stay cool. MAVERICK Target valley up ahead. Comanche, picture.  INT. F-18S INTERCUT A255   A255 AIR CONTROL OFFICER (OVER RADIO) Dagger, picture clean. Recommend continue. (beat) Do you copy? Picture clean. Recommend continue. Dagger acknowledge. MAVERICK Dagger attack. ANGLE ON each of the pilots taking a deep breath as they commit... CHERRY 11.25.19 - OFFICIAL   124.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 176
    },
    {
      "scene_number": 27,
      "slugline": "EXT. SKIES AB255   AB255  [THE FOUR JETS ROAR INTO THE NARROW CANYON.]   Tension gives way to terror. LOOKING DOWN FROM ATOP A MOUNTAIN on the valley below as the formation flies past. Phoenix and Bob fly freakishly close below several bridges. Bob looks up at them. BOB Uh, Phoenix? PHOENIX Don’t ask Bob. REVEAL: IN the foreground, a AUTOMATED SAM MISSILE ARRAY sitting inertly on the mountaintop, watching the skies above. CLOSE ON Bob looking up at the SAMS above. GOLD/ORANGE ROUTE  BOB SAMs right over our heads. No movement. PHOENIX Looks like we’re clear on radar, Mav. MAVERICK Let’s not take it for granted.  EXT. USS LEYTE GULF - MORNING B255   B255 Massive plumes of smoke and fire send Tomahawk Missiles skyward.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT - MORNING 255   255 Cyclone and Warlock monitor, tense: COMMS-CREW TECH 2 Birds away. WARLOCK No turning back now. CHERRY 11.25.19 - OFFICIAL   125.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 155
    },
    {
      "scene_number": 28,
      "slugline": "EXT. SKIES/INT. F-18’S - MORNING -   GOLD ROUTE 256   256 They shoot into an ever-compressing canyon, hauling ass over the broken landscape, snowy trees flashing just beneath... Training times ten. The valley walls are tight, the high speed and sharp turns resulting in higher Gs.   TBD ROUTE ORANGE ROUTE  The physical pressure on the team alone is intense, requiring every ounce of concentration, skill and endurance. Each of the pilots contends with the intensity in their own way. Training was nothing compared to this. They are all feeling it - Rooster most of all. His wing clips tree tops as he banks at 6 Gs. ROOSTER (TO SELF) Too low... too fast...  INT. F-18S INTERCUT A257   A257 MAVERICK You with me, Phoenix? PHOENIX Don’t wait for me. BOB (looking at clock) [Two minutes] to target. FANBOY (looking at clock) We’re falling behind, Payback. Increase speed to five hundred knots. PAYBACK’S POV of Rooster in front of him. PAYBACK Rooster, do you copy? We’re falling behind. We gotta move. Rooster in his cockpit, eyes focused, sweat beading, breathing shallow, slashing through the canyon as fast as he can go. And it isn’t fast enough. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   126.",
      "characters": [],
      "action_text": "ON MAVERICK, hearing: PAYBACK (ON RADIO) (CONT’D) Rooster,   do you copy ? MAVERICK (TO SELF) Come on, kid. Don’t think. Just do. BOB [Ninety seconds] to target.  ORANGE ROUTE  MAVERICK Bob, do you have visual on Rooster? Bob looks back for a visual. BOB Negative.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT - MORNING B257   B257 The satellite image of Maverick’s teams shows the formation is breaking up, with two planes lagging further and further behind. COMMS-CREW TECH 2 Dagger 3 is falling behind. / Dagger 3 is disengaging from the attack team. [NOTE: The following is optional. A simple edit can show the airfield with routine activity and:] COMMS-CREW TECH 1 [20/30/60/90] seconds to tomahawk impact. ALARM. COMMS-CREW TECH 2 We have movement. Ground crews are on alert. CLOSE ON: The satellite image of an enemy airfield we’ve seen many times - the unmistakable deltas of newer fifth gen planes amidst older F-14s and F-16s. Only this time the image is live. We see people moving on the ground. Running. CONTINUED: A257   A257 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   127. WARLOCK (to Cyclone) The enemy is scrambling (towards) their jets. CLOSE ON Hondo, quietly nervous for his friend. HONDO Come on, Rooster.  INT. ROOSTER'S F-18 C257   C257 Rooster is struggling to hold it together. BOB [One minute] to target. PAYBACK (ON RADIO) Rooster, Mav’s getting away. ROOSTER We’re okay. We’re okay  ORANGE ROUTE  PAYBACK We’re not okay. We’re way behind. You gotta go. CLOSE ON: Rooster’s hand on the throttle, unable to push it any harder.  EXT. ENEMY AIRFIELD - MORNING A275   A275 Watching from a short distance as SILHOUETTED AIR CREWS scramble to prep F-14 Tomcats for takeoff. Then the first Tomahawk missile impacts, decimating a hangar.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT - MORNING 275   275 Everyone on edge, all eyes on the screens where the Enemy Airfield VANISHES in a series of heat blooms. COMMS-CREW TECH 1 Impact, enemy runways destroyed. CONTINUED: B257   B257 (",
      "dialogue_count": 0,
      "word_count": 680
    },
    {
      "scene_number": 29,
      "slugline": "INT. COMMAND CENTER - USS THOEDORE ROOSEVELT - MORNING B278   B278 ALARM. On another screen, two bandits are headed for Maverick and his team. AIR CONTROL OFFICER (OVER RADIO)/COMM TECH 2 We’re picking up bandits inbound, strength 2, X miles east of bullseye. CYCLONE Where the hell did they come from? WARLOCK Long range patrol? HONDO Come on. Move it or lose it, Rooster.  INT. MAVERICK’S F18 AA278   AA278 AIR CONTROL OFFICER (ON RADIO) Dagger, Comanche. Contact, two bandits, 30 miles north of bullseye, targeting you. MAVERICK Dammit. Time to intercept? AIR CONTROL OFFICER [One minute.] Maverick looks at his clock. MAVERICK Rooster, we’re tight on time if we want to outrun those bandits. Where are you?  INT. ROOSTER'S F-18 AB278   AB278 Rooster is sweating, straining through the turns, hand frozen on the throttle. MAVERICK (ON RADIO)  Rooster, do you copy ? CHERRY 11.25.19 - OFFICIAL   130.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 148
    },
    {
      "scene_number": 30,
      "slugline": "EXT. PAYBACK/FANBOY F-18 AC278   AC278 The targeting pod jutters, stabilizes.  INT. F-18S INTERCUT - MORNING B278   B278 FANBOY I GOT IT. Targeting pod is on line. PAYBACK It won’t make a difference if we don’t step on it.   Rooster, bandits are inbound. Come on . PHOENIX COME ON, ROOSTER. MAVERICK (TO SELF) Now or never, Rooster... CLOSE ON ROOSTER, breathing tight, blinking sweat from his eyes. All sound falls away. Radio chatter, his engines. And finally... ROOSTER (TO SELF)  Talk to me, dad . Rooster pushes the throttle. Payback watches as Rooster pulls away. He pushes his own throttle, but Rooster is still increasing his speed. Rooster has crosses over to another place, his flying on instinct, focused in a way we’ve never seen. Now Payback is struggling to keep up. PAYBACK Jesus, Rooster. Not so fast. ROOSTER Take welded wing, Payback. MAVERICK (TO SELF) That’s it kid, push it. BOB Target in ten seconds. CHERRY 11.25.19 - OFFICIAL   131.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 161
    },
    {
      "scene_number": 31,
      "slugline": "INT. COMMAND CENTER - USS THEODORE ROOSEVELT C278   C278 All eyes are watching those two bogies on course to intercept. Comms-crew Tech 2 spots that Rooster has caught up. COMMS-CREW TECH 2 Dagger 3 is re-engaging. / Dagger 3 is re-engaging with the attack team.  INT. ROOSTER'S F-18 D278   D278 Rooster comes around a bend and sees Maverick and Phoenix’s planes up ahead. ROOSTER Dagger One and Two, I have visual. We’re on your six.  INT. MAVERICK'S F-18 -   ORANGE/PURPLE POP BOWL LOCATION E278   E278 MAVERICK You’re just in time. Let’s deliver the mail and go home. Phoenix, we are popping in three, two, one- Maverick and Phoenix’s F-18s roll inverted and crest a mountain, dropping into a valley.  INT. F-18 - PHOENIX/BOB - MORNING -   PURPLE ROUTE 278   278 BOB Dagger-2, targeting... Stand by. PHOENIX You can do this, Bob. Phoenix holds their arc steady, as Bob works the FLIR... MAVERICK Come on, Bob. BOB Got it. I got it. CAPTURED.  INT. MAVERICK'S F-18 A279   A279 TONE. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   132.",
      "characters": [],
      "action_text": "MAVERICK  Target acquired, bombs away . Maverick releases.  EXT. UNDER MAVERICK’S F-18 B279   B279 Two super bunker busters drops from the wings of Mavericks F- 18, fins adjusting as they acquire laser guidance.  EXT. SKIES/INT. MAV/PHOENIX F-18'S C279   C279 CLOSE ON: Maverick snaps the safety paddle on his stick and pulls back as far as he can.  BLUE ROUTE  Maverick and Phoenix both wrench jets into a body-smashing climb - excessive Gs. Only this time it’s for keeps as a mountain face is coming up fast. MAVERICK HOLD THAT TARGET, BOB. CLOSE ON PHOENIX, her face straining. Bob struggles against the Gs to keep the laser on target. CLOSE ON: Maverick’s G meter as it climbs toward, then past, 7.5 Gs... BOB’S POV - the world becomes pixilated, tunnel vision creeping in as he grays out. We’ve seen it before. He bears down, squeezing blood into his head to stay conscious.  EXT. VALLEY BASIN - MORNING D279   D279 Maverick’s bunker buster hits home.  INT. PHOENIX’S F-18 -   BLUE ROUTE E279   E279 Phoenix is pulling back as hard as she can as: BOB IMPACT. IMPACT. CONTINUED: A279   A279 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   133. The target is obscured by a massive plume of smoke.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT F279   F279 COMMS-CREW TECH 2 DIRECT HIT. DIRECT HIT. Far from relief in the room, the tension only increases. WARLOCK That’s miracle number one... CYCLONE And now they’re in coffin corner.  EXT. MOUNTAINSIDE AG279   AG279 CLOSE ON A radar control SAM array. Two F18’s climbing skyward in the distance beyond. The array comes automatically to life, swivels and FIRES.  INT/EXT. MAV/PHOENIX/BOB F-18S INTERCUT -   POP BOWL LOCATION G279   G279 ALARM MAVERICK SMOKE IN THE AIR. GET LOW, GET LOW. Maverick and Phoenix bank hard and fire countermeasures - flares filling the air as SAMs streak toward them.  INT. ROOSTER’S F-18 - MORNING -   ORANGE ROUTE H279   H279 ROOSTER (INTO RADIO) Payback, popping in three... two... one.  EXT. SKIES ABOVE VALLEY - MORNING -",
      "dialogue_count": 0,
      "word_count": 555
    },
    {
      "scene_number": 32,
      "slugline": "INT. ROOSTER’S F-18 - MORNING -   PURPLE ROUTE 279   279 Rooster rolls in, putting nose on target, a scorching 45’ dive...  INT./EXT. ROOSTER’S F-18 - DIVING - MORNING   PURPLE ROUTE 281   281 ROOSTER Fanboy. Where’s my laser? FANBOY Targeting... Seconds away. Rooster’s hurtling headlong, altimeter dropping 6000, 5000... ROOSTER Come on, come on. ANGLE ON: The FLIR on the belly of their plane fails. FANBOY SHIT. DEADEYE, DEADEYE. OUR LASER’S GONE. STANDBY. The target is coming up fast, Rooster blinks away the sweat in his eyes. ROOSTER We’re out of time. FANBOY I’M WORKING ON IT. STAND BY. ROOSTER NO TIME. PULL OUT. PAYBACK ROOSTER, WAIT- ROOSTER (TO HIMSELF) Great balls of fire. Rooster lets his bunkers buster fly before releasing the safety and yanking back on the stick, trying to keep from face planting into a mountain.  EXT. FACILITY SITE - MORNING -   PURPLE ROUTE 284   284 The Bunker Busters vanish into the cloud left by Maverick’s bombs. An agonizing stillness follows. CHERRY 11.25.19 - OFFICIAL   135.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 169
    },
    {
      "scene_number": 33,
      "slugline": "INT/EXT. MAV/PHOENIX/BOB F-18S INTERCUT AA286   AA286 Maverick and Phoenix are fighting for their lives, ALARMS BLARING, SAMs everywhere.  EXT. TARGET VALLEY/INT. ROOSTER’S JET -   BLUE ROUTE 286   286 Rooster BATTLES his jet, climbing, climbing, with Payback right beside him as the belly of Rooster’s jet brushes snow off of tree tops and into the blue. ROOSTER POV: He’s graying out. A FAMILIAR ALARM SOUNDS. A SAM IS COMING RIGHT FOR HIM.  EXT. FACILITY SITE - MORNING 287   287 Just as a RIPPLING SUBTERRANEAN EXPLOSION heaves the earth and the underground facility IMPLODES on itself.  INT. HANGMAN'S F-18 - MORNING A289   A289 Hangman sits in his waiting bird, listening to the game on the radio. COMMS-CREW TECH 2 (ON RADIO) BULLSEYE, BULLSEYE. BULLSEYE.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT - MORNING 288   288 COMMS-CREW TECH 1 Satellite imagery confirms target destroyed. Muted reactions from all in the room. WARLOCK Miracle number two. But Cyclone is listening to the radio - pilots breathing, shouting, straining, cursing. It’s hell. CYCLONE Now get out of there. HONDO squeezes his fist tightly, feeling something crack. He opens his hand to see the crystal of his stopwatch is crushed, the second hand frozen. And omen. CHERRY 11.25.19 - OFFICIAL   136.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 206
    },
    {
      "scene_number": 34,
      "slugline": "INT. ROOSTER/PAYBACK FANBOY F18S AA290   AA290 Their turn to dodge and weave, firing counter-measures, straining, cursing, grunting, breathing heavy in their cockpits, working to outmaneuver the agile, angry missiles. Rooster GASPS for breath as his vision returns. Another alarm. ROOSTER SHIT. THEY’RE EVERYWHERE. PAYBACK GOTTA GET LOW. GOTTA GET LOW. Another alarm, another missile, as: ROOSTER I’M OUT OF FLARES. He looks back and to his right, sees the missile coming. He’s a goner, until: ANOTHER F18 fills his sight picture. ROOSTER (CONT’D) MAVERICK, NO-  INT. MAVERICK’S F-18 (OLD SC B289) -   POP BOWL LOCATION A290   A290 Maverick releases flares, but he’s too late. And he knows it. The missile SLAMS into Maverick’s engine. A FIREBALL SHREDS the splintering rear of the jet.  INT. ROOSTER'S F-18 - MORNING - RED ROUTE B295   B295 ROOSTER MAVERICK.  EXT. SKIES OVER TARGET VALLEY - MORNING -   RED ROUTE C295   C295 Phoenix and Payback SOAR HIGHER, seeing Mav’s FLAMING PLANE veer off course below. PHOENIX (OVER RADIO)  Dagger 1’s hit . CHERRY 11.25.19 - OFFICIAL   137.",
      "characters": [],
      "action_text": "INT. COMMAND CENTER - USS THEODORE ROOSEVELT -   RED ROUTE D295   D295 PHOENIX  I repeat, Dagger 1 is hit. He’s going down . The room reacts with shock. CLOSE ON Hondo, reflecting on his last moment with Mav.  EXT. SKIES AF295   AF295 The remaining jets dive into the valley and below the SAMs and their radar. The SAM arrays go still.  INT. F18S INTERCUT BF295   BF295 ROOSTER (OVER RADIO) Dagger 1, status. Status. Anyone see him? I didn’t see a chute. PAYBACK He’s gone, Rooster. ROOSTER WE HAVE TO CIRCLE BACK.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT F295   F295 CYCLONE Get ‘em back to the carrier. Now. COMMS-CREW TECH 2 All Daggers flow to ECP. You have Bandits headed for you. ROOSTER (OVER RADIO) What about Maverick? CYCLONE (to room) Tell him there’s nothing he can do for Maverick. Not in a (goddamn) F- 18. WARLOCK (to Comm Tech) Launch search and rescue- (CONTINUED) CHERRY 11.25.19 - OFFICIAL   138. CYCLONE Negative. Not with those bandits in the air. We’re not losing anyone else. HONDO But Maverick- CYCLONE He knew the risk. (to Comms)  Get ‘em home now . COMMS-CREW TECH 1 Dagger, you are not to engage. Repeat, do not engage.  INT. F-18S - INTERCUT G295   G295 COMMS-CREW TECH 2 (ON RADIO) Dagger Two. Return to carrier. Acknowledge. PAYBACK Rooster, those bandits are closing. We   can-not   go back. ROOSTER COMANCHE, PICTURE. COMMAND Dagger, Comanche, bandits 30 east. Hot on you. Flow west to evade. PHOENIX Rooster... He’s gone. And off of Rooster’s eyes we CUT TO:  EXT. FROZEN LAKE - MORNING 295   295 A SCORCHED PARACHUTE drapes the ragged ice... as ANGLE REVEALS Maverick lies sprawled, still clipped in, alive. At the distant RUMBLING of the facility implosion, he stirs, coughs, tastes blood in his mouth. He looks down, sees his radio is shattered. He hears the sound of distant helicopter, growing louder, realizes he’s out in the open. He has to move. He scrambled to detach his chute. CONTINUED: F295   F295 CHERRY 11.25.19 - OFFICIAL   139.",
      "dialogue_count": 0,
      "word_count": 511
    },
    {
      "scene_number": 35,
      "slugline": "EXT. SKIES - MORNING A296   A296 A MENACING HIND HELICOPTER, a venerable cold-war relic that will never die, bristling with guns and rockets.  EXT. FROZEN LAKE - MORNING B296   B296 Maverick is running with nowhere to go - the barren trees providing little cover. He’s a sitting duck. The Hind comes into view and her .50 cal rotary cannon opens fire, CHEWING INTO the ice and trees and snow with a HELLSTORM OF LEAD. The angle is bad and the hind has to come around, buying Maverick precious seconds. He reaches a GNARLED FALLEN TREE at lake’s edge. He tries to wedge himself behind it, if only to hide. Nothing out here will stop that cannon. Over Maverick, the Hind wheels slowly around, searching for him. It’s only a matter of time.  EXT. HIND POV - MORNING C296   C296 CREW POV of the ground below. No sign of Maverick. But they’ll find him soon enough.  EXT. EDGE OF FROZEN LAKE - MORNING 297   297 Maverick stays pressed behind the tree as the Hind approaches, flies overhead.  EXT. HIND POV - MORNING A298   A298 CREW POV over the barrel of the cannon. There’s Maverick. Exposed. Done for. A HELMETED CREWMAN - his face hidden from us - swivels the gun patiently. HIS HAND CHARGES THE GUN.  EXT. FROZEN LAKE - MORNING B298   B298 Maverick isn’t dying on his back. He leaps up, runs, as a stream of hot red tracers shred the log and follow him like a laser pointer, gaining on him until: BOOM. The Hind explodes in mid air. Maverick stops in his tracks. What the- (CONTINUED) CHERRY 11.25.19 - OFFICIAL   140.",
      "characters": [],
      "action_text": "An F-18 streaks past. MAVERICK No...  INT./EXT. ROOSTER’S F-18 298   298 Rooster banks, looking down. He can see Mav’s chute, but not Mav. Then an ALARM BLARES. ROOSTER Oh shit.  EXT. MOUNTAINTOP - MORNING A299   A299 A radar guided missile launcher, it’s silhouette familiar to us by now, swivels around and lets fly with a SAM, traveling at MACH 5.  EXT. SKIES OVER MOUNTAINS - MORNING B299   B299 Rooster throws flares, tries to evade, but he too is doomed. IMPACT.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT C299   C299 COMMS-CREW TECH 1 Dagger two is hit. Cyclone pounds a fist on the panel.  INT. PHOENIX'S F-18 D299   D299 Phoenix waits to hear her friend’s voice in vain. COMMS-CREW TECH 2 Dagger two, come in. Dagger Two, do you copy?  INT. HANGMAN'S F-18 - MORNING E299   E299 The shock on his face as he hears: COMMS-CREW TECH 2 Dagger Two, come in... Hangman hits his comm. CONTINUED: B298   B298 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   141. HANGMAN Dagger spare request permission to launch and fly air cover. A painfully long wait. COMMS-CREW TECH 2 Negative, spare... Hangman hangs his head.  EXT. FROZEN LAKE - MORNING 299   299 Scrambling out of the rubble, Maverick sees Rooster’s F-18 ON FIRE and trailing heavy smoke, as Rooster EJECTS. His jet vanishes behind the ridge before slamming into the ground, sending up a plume of BLACK SMOKE. Maverick immediately starts running, tracking the path of Rooster’s parachute...  EXT. FORESTED BASE OF RIDGE - MORNING 302   302 Gripped with panic, Maverick sprints through the trees, seeing Rooster’s chute disappear among them...  EXT. FOREST CLEARING - MORNING 303   303 He emerges in a patch of clearing where Rooster’s on his knees, burying his parachute, still recovering from a brutal landing. Both men are pretty banged up, exhausted, but relieved to see one another. MAVERICK You all right? ROOSTER I’ll manage. Then Maverick shoves him. ROOSTER (CONT’D) What the hell? MAVERICK What are you doing here? ROOSTER What am I   doi",
      "dialogue_count": 0,
      "word_count": 1548
    },
    {
      "scene_number": 36,
      "slugline": "EXT. ENEMY AIRSTRIP - MORNING 308   308 Maverick looks at cockpit instruments. Maverick applies the brakes. ROOSTER We’re stopping. Why are we stopping, Mav? MAVERICK Just give me a second. Give me a second. Rooster spots an enemy tank coming towards them. ROOSTER Uh Mav. There’s a guy on a tank. Big gun. Staring at us. MAVERICK Yep. The tank passes them and Rooster looks down as he salutes. Maverick switches to engage the WINGS. The wings expand. ROOSTER Both runways are cratered, Mav. ALT: Are both runways crated, Mav? ALT: It looks like both runways are cratered, Mav. MAVERICK Yeah. ROOSTER Mav, this is a taxiway. A very short taxiway. MAVERICK Uh huh. Yeah. ROOSTER How we gonna get this bag’a ass in the air? MAVERICK Just hang on. Maverick pushes on the throttle. The afterburners go on full. MAVERICK (CONT’D) Cause this bag‘a ass is about to go ballistic. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   148.",
      "characters": [],
      "action_text": "The jet begins to accelerate down the runway. ROOSTER Holy shit. MAVERICK (under breath) C’mon, c’mon. Mav squeezes every ounce of lift from the plane The F-14 soars into the air.  EXT./INT. F-14 - MORNING 309   309 CLOSE ON: Rooster’s ESAT on his harness. Rooster thinks a beat and activates it.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT - MORNING 310   310 A new alarm sounds. COMMS-CREW TECH 1 Sir. We’re receiving a signal from Rooster’s ESAT... But there seems to be a malfunction... WARLOCK Have you lost him? COMMS-CREW TECH 1 No, sir. Signal is strong, but... CYCLONE But what? COMMS-CREW TECH 1 But... He’s supersonic. Everyone trades confounded looks, confused. Cyclone and Warlock move to look at the screen. Sure enough, a dot representing Rooster is hauling ass toward the sea. WARLOCK He’s airborne. CYCLONE In what? CONTINUED: 308   308 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   149. COMMS-CREW TECH 2 Sir, overwatch reports an F-14 Tomcat is airborne and on course for our position. Warlock and Cyclone share a look. WARLOCK It can’t be- The both look at the dot on the screen. Hondo stifles a knowing smile. CYCLONE Maverick... HONDO He’s still alive. Warlock almost smiles, until: COMMS-CREW TECH 2 Sir, overwatch is reporting two fifth gen fighters on course to intercept that F 14. Warlock and Cyclone share a new look this one of grim certainty. CYCLONE God help them.  INT./EXT. F-14 - MORNING 311   311 Rooster surveys the back seat in frustration, no idea what’s what or what to do. There’s a big circular RIO DISPLAY in front of him, but it’s dark. MAVERICK   * Rooster. Get us in touch with the   * boat.   * Rooster toggles the radio.   * ROOSTER   * I’m working on it. Everything’s   * dead back here. What do I do? Talk   * me through this.   * MAVERICK   * First, the radio. Throw the UHF two   * circuit breaker.   * CONTINUED: 310   310 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   150. Rooster looks.   * ROOSTER   * There’s three hundred breakers back   * here, anyth",
      "dialogue_count": 0,
      "word_count": 1708
    },
    {
      "scene_number": 37,
      "slugline": "INT. CANYON EE313   EE313 In a close-range weaving dogfight chase Maverick fires GUNS at the Fifth Gen. ROOSTER Come on, you got him. (alt) You got him Mav. (alt) Watch the wall, watch the wall. (alt) Side of the mountain, side of the mountain. (alt) Wall-wall-wall. MAVERICK I see it. I see it. (alt) I know, I got it, I got it. The Fifth Gen evades, pulling severe G’s around the bends, working like crazy. Mav’s rounds keep missing as the Fifth Gen continues to slice through the canyon. Mav hustles to keep up and get the Fifth jet in his target. Mav and Rooster struggle against the G-forces, no G-suits to aid them, huffing breaths to ward off a blackout. Mav’s rounds are almost at zero. He knows he’s down to his last attack. The Fifth Gen continues to weave in and out of their target, in and out. Mav focuses in and fires his last bullets. He HITS the Fifth Gen with all of them. It descends and explodes as it crashes into the ground.  INT. COMMAND CENTER - USS THEODORE ROOSEVELT - MORNING A313   A313 Everyone reacts to the radio call that comes through: MAVERICK (OVER RADIO) Rough Rider, this is uh... Ghostrider. We have repossessed an enemy Tomcat. Splash two bandits. We are inbound, tracking south. Hold your fire.  END STAGE 5 – GREEN CANYON  (CONTINUED) CHERRY 11.25.19 - OFFICIAL   157.",
      "characters": [],
      "action_text": "Cyclone and Warlock share a look, stunned. Hondo smiles. HONDO That crazy motherfu-  EXT. SKIES - MORNING B313   B313  STAGE 6 – GREEN CANYON TO OCEAN SET #2: VR202 (CANYON) - TBD  The F-14 roars into frame transitioning from mountains to the ocean below.  END STAGE 6 – GREEN CANYON TO OCEAN INT. F-14 - CONTINUOUS - MORNING 313   313  STAGE 7 - OCEAN SET #3: PISMO BEACH (OPTION 1) OR SAN CLEMENTE (OPTION 2)  MAVERICK   * We can’t outrun this guy. We have   * to eject.   * ROOSTER   * MAV-   * MAVERICK   * We need altitude. Pull that   * ejection handle the second I tell   * you-   * ROOSTER   * MAV, WAIT-   * MAVERICK   * THERE’S NO OTHER WAY.   * Mav pulls back on the stick. As they climb:   * MAVERICK (CONT’D)   * EJECT, EJECT, EJECT.   * Rooster grabs the handle. Nothing happens.   * MAVERICK (CONT’D)   * ROOSTER, EJECT.   * CONTINUED: A313   A313 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   158. ROOSTER   * IT’S NOT WORKING.   * And Maverick realizes they’re doomed.   *  END STAGE 7 - OCEAN STAGE 8 - OCEAN SET #3: PISMO BEACH (OPTION 1) OR SAN CLEMENTE (OPTION 2)  The Fifth Gen flies right past them canopy to canopy, spinning upwards and diving back down on them. Maverick weaves in hard cuts back n’ forth to evade as the Fifth Gen fires bullets in a streak across the ocean. Gunfire finally hits the F-14 as it flies low across the water. Mav keeps pulling hard right. ROOSTER (CONT’D) We got no more flares, Mav. What you got? (alt) Mav, we can’t shake him, we can’t shake him anymore. Maverick does the only thing he can do and pulls up hard to escape the Fifth Gen, but the Fifth Gen follows. Another MISSILE LOCK. The sound of doom. ROOSTER (CONT’D) He’s got a missile lock, he’s got a missile lock, Mav. (alt) What have we got, Mav? MAVERICK We got nothing. (alt) I’m sorry, Rooster. (alt) I’m sorry Goose. The Fifth Gen’s missile appears from its belly. And suddenly the Fifth Gen jet EXPLODES along with its missile. An F-18 streaks out from the shrapnel and smoke.  END ST",
      "dialogue_count": 0,
      "word_count": 608
    },
    {
      "scene_number": 38,
      "slugline": "INT. HANGMAN’S F-18 - MORNING 314   314 Hangman smiles. HANGMAN Good afternoon, ladies and gentlemen, this is your savior speaking. Please fasten your seatbelts, return your tray tables to their upright and locked position and prepare for landing.  INT. F-14 - MORNING 315   315  STAGE 9 - OCEAN SET #3: PISMO BEACH (OPTION 1) OR SAN CLEMENTE (OPTION 2)  As he pulls along side. ROOSTER Hey, Hangman... you look good. HANGMAN I am good, Rooster. I’m very good. Maverick and Rooster watch as Hangman’s F-18 CIRCLES back, doing a hotshot twirl of the wings, a victory roll.  END STAGE 9 - OCEAN INT. COMMAND CENTER - USS THEODORE ROOSEVELT - MORNING 316   316 All eyes are on the horizon. Two planes inbound. As Cyclone and Warlock are leaving the room: CYCLONE Get Hangman down first. Maverick may burn the deck. CLOSE ON: Hondo, realizing. Without a word, he runs from the command center.  EXT. DECK - USS THEODORE ROOSEVELT - MORNING 317   317 Hondo emerges on the deck where the crew is awaiting Hangman’s arrival. Emergency crews are standing by. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   160.",
      "characters": [],
      "action_text": "HONDO The minute Hangman touches down, pull the trip wires and have the barricade stanchions ready. The crew just stare at him. HONDO (CONT’D) HE DOESN’T HAVE A GODDAMN TAILHOOK. The crew realizes and scrambles.  INT. BRIDGE - USS THEODORE ROOSEVELT - MORNING 318   318 Cyclone, Warlock and OFFICERS stand in the BRIDGE, BINOCS UP, watching as Hangman’s F-18 comes in for a landing. CLOSE ON: His tail hook snagging the arrest cable, his plane jerking to a stop. The Deck Crew rush in to clear the way for Maverick. A ballet of precise emergency response. Hundreds of SAILORS work to remove Trap-Wires and raise Barricade Stanchions, lift up a 15-foot-high NYLON BARRICADE, stretching a massive net across the width of the landing deck. The F-14 circles.  INT. BRIDGE/F-14 - MORNING A320   A320 And in this moment of supreme tension, Maverick gets a little glimmer in his eye. One we’ve seen before. MAVERICK Rough Rider, Ghostrider here. We are requesting a tower fly-by. Cyclone and Warlock share a look. Is this a joke?  INT. F-14 B320   B320 ROOSTER  What? Now?  MAVERICK Could be the last one. ROOSTER You can’t be serious. CONTINUED: 317   317 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   161. MAVERICK You keep saying that, but it doesn’t change much. (into radio) Rough Rider, I say again-  INT. BRIDGE - MORNING C320   C320 Cyclone has the radio now. CYCLONE Ghostrider, this is Cyclone. Put that bird on the deck now. MAVERICK (ON RADIO) -odswor- -strider- -adio  INT. F-14 D320   D320 Maverick is smiling, speaking in broken jibbering. MAVERICK -aking up. Do -oo -ead?  INT. BRIDGE - USS THEODORE ROOSEVELT - MORNING 320   320 CYCLONE Does he even   want   to land? WARLOCK He asked permission. That’s progress. Cyclone sighs, nods begrudgingly to the Comm Tech who, despite everything, has to grin a little as: LSO Ghostrider, pattern is clear, you are cleared for flyby.  INT. F-14 A321   A321 MAVERICK Huh. That’s a first. Rooster knocks his helmet repeatedly on the canopy. ROOSTER Why did",
      "dialogue_count": 0,
      "word_count": 533
    },
    {
      "scene_number": 39,
      "slugline": "INT. BRIDGE - USS THEODORE ROOSEVELT - MORNING B321   B321 Maverick blazes by the tower at high speed, rocking the tower. Cyclone shakes his head.  EXT./INT. F-14 - NEARING USS THEODORE R - MORNING C321   C321 Mav’s working the stick and feathering the throttle. He lowers the landing gear. A new light comes on. MAVERICK Shit. ROOSTER What? What more shit could there possibly be? MAVERICK No nose gear. Rooster looks at the carrier, then out at the sea. ROOSTER What say we just eject? MAVERICK There’s a good chance the chutes we have on were packed in the late eighties, but sure. Go for it. ROOSTER I think I’ll stay with the plane. MAVERICK Just as bad, really. ROOSTER You can do this. MAVERICK I appreciate your confidence.  EXT. DECK - USS THEODORE ROOSEVELT - MOMENTS LATER - MORNING 321   321 LSO One mile. Call the ball. MAVERICK Ghostrider. Ball. No hook. No nose gear. (CONTINUED) CHERRY 11.25.19 - OFFICIAL   163.",
      "characters": [],
      "action_text": "And an engine fails. ROOSTER Please tell me that wasn’t an engine. MAVERICK Correction... ball, no hook, no nose gear... single engine. ROOSTER Of course it was an engine. LSO A little power.... Come left... Easy with it... The deck of the Roosevelt now approaching rapidly... as it slips beneath the NOSE of the jet. LSO (CONT’D) CUT, CUT, CUT. The engine cuts out and everything goes SILENT.  EXT. DECK - USS THEODORE ROOSEVELT - MORNING 322   322 As the battered Tomcat SMASHES DOWN, sliding across the deck on its nose, SHOWERING SPARKS, SPEWING SMOKE, until it SLAMS INTO THE NYLON NET, ripping it forwards before snapping to a violent halt. Finally. Safe home.  EXT. DECK - MOMENTS LATER - MORNING 323   323 EMERGENCY CREWS rush the jet as Mav and Rooster climb out. Maverick and Rooster check on each other. MAVERICK You ok? ROOSTER Yeah. Phoenix, Bob, Payback, Fanboy and Hondo all come rushing. Maverick and Hondo reunite. MAVERICK You think you can fix it? HONDO Easy. CONTINUED: 321   321 (CONTINUED) CHERRY 11.25.19 - OFFICIAL   164. Then other SAILORS arrive, mobbing them. Maverick gazes up to Vultures Row, spying Cyclone and Warlock. Cyclone gives him a simple, grateful nod. Rooster turns to see Hangman arriving. His face mock-falls: HANGMAN Well shit... you’re alive. They shakes hands. That’s enough. ROOSTER Chalked yourself another kill. Hangman smiles. HANGMAN That makes two. Phoenix steps in. PHOENIX Maverick has five. Makes him an ace. And Hangman’s smile fades. Just a bit. Rooster turns, looking for Maverick in the crowd. Finds him, pushes toward him. ROOSTER Captain Mitchell... Captain Mitchell, SIR. Maverick turns, come face to face with Mav. ROOSTER (CONT’D) Sir, I- And Maverick grabs him before he can say another word, pulls him close. Rooster is not sure what to do for a moment. Then he hugs him back. MAVERICK Thanks for saving my life. ROOSTER It’s what my dad would’ve done. And as the two men embrace, shutting out the rest of the world we PULL BACK TO: CO",
      "dialogue_count": 0,
      "word_count": 508
    },
    {
      "scene_number": 40,
      "slugline": "EXT. DECK - USS THEODORE ROOSEVELT - MORNING 324   324 Filled with jubilant SAILORS, the whole ship celebrates the mission’s return. Maverick joins Rooster and Hangman, sharing laughter and embraces. All of them, allies at last.  EXT. HARD DECK - LATE AFTERNOON A327   A327 To establish.  INT. HARD DECK - LATE AFTERNOON B327   B327 The place is quiet. Almost deserted. Maverick enters, expecting to find Penny, surprised to find A BARTENDER, JIMMY. Off Maverick’s expression: TIME CUT: Maverick at the bar now. BARTENDER JIMMY Hey Mav. MAVERICK Is Penny here? BARTENDER JIMMY Took Amelia sailing. MAVERICK Gone? Where? BARTENDER JIMMY Wherever they felt like, she said. MAVERICK Did she say when she’d be back. BARTENDER JIMMY I’m guessing whenever she feels like. Maverick nods. He looks around the bar, heads for the door. With nowhere else to go, he goes: CHERRY 11.25.19 - OFFICIAL   166.",
      "characters": [],
      "action_text": "INT./EXT. MAVERICK’S HANGAR - DAY - DAYS LATER 327   327 Where Maverick holds a photo of the moment on the Roosevelt with Rooster and the others, adding it to his wall of memories, medals, accomplishments - a life well-lived, if somewhat incomplete. Among the pictures is one of Goose and Maverick in the bloom of their youth - their whole lives ahead of them. Maverick steps back, takes in the space - the P-51, the airstream, the bikes... The sound of a car OS. He turns in time to see it coming to a stop. The door opens and out climbs Rooster. From the passenger door emerges Phoenix. Emerging from the back is Amelia and, finally Penny. She takes in the sight of the hangar - along with everyone else - clearly a place they have never seen before. CLOSE ON: Mav and Penny as they meet by the P-51. PENNY I heard you were looking for me. Maverick nods. A confession. MAVERICK Good trip? PENNY Great. You? MAVERICK I could tell you, but... PENNY Forget I asked. They both smile. After a beat. MAVERICK I missed you. PENNY I know. They kiss. ALTS (CONTINUED) CHERRY 11.25.19 - OFFICIAL   167. MAVERICK (re hangar) Whatta’ya think? PENNY It’s... very you. (ALT) It’s just like I pictured. (ALT) I’m still taking it in. (ALT) You know..? It works. END ALTS TIME CUT as Phoenix holds two model planes, demonstrating air- to-air combat to a very interested Amelia. As Maverick walks Penny around the other lady in his life - the P-51. As Rooster looks over Maverick’s workspace, the pictures of Maverick and Ice, of Maverick and Goose, of Rooster as a boy... Topped off by Maverick and Rooster on the carrier. Rooster turns, looks at the make-shift family taking shape in this makeshift home... And he smiles. As the sound of a roaring engine takes us to:  INT. P-51 - DAY 328   328 Penny snugly in the back seat, Maverick at the controls. MAVERICK How’re you doing back there? PENNY I’m amazed something this old can still fly. MAVERICK C’mon, don’t say old. It’s vintage. One more time, if anything g",
      "dialogue_count": 0,
      "word_count": 629
    }
  ]
}