{
  "slug": "totem-2017",
  "title": "totem",
  "genre": "drama",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 0,
  "characters": [],
  "total_words": 15037,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. ABBY'S BEDROOM - NIGHT  Kellie tucks Abby in. It's SHIVERING COLD. She tries to shut the window over the bed -- but it's stuck. She PUSHES harder... it comes loose.   Almost   slamming shut before Kellie catches it again... Kellie glances down at Abby. Thankfully still asleep.  INT. KELLIE’S BEDROOM - NIGHT  Kellie carefully hangs her newest prize on the large TROPHY SHELF that hangs over her bed. Winning trophies, medals and ribbons from throughout the years are arranged chronologically from left to right. All of them are SECOND or THIRD PLACE. Except for the very first one --   World's Best Daughter . She gets in bed and pulls up the covers. Satisfied. As soon as she shuts her eyes -- WHISPERS from another room.  INT. ABBY'S BEDROOM - NIGHT  Kellie enters to find Abby standing in a corner of the room -- whispering at the wall. KELLIE What are you doing? ABBY Talking... KELLIE Aren't you a little old for imaginary friends? She walks over to Abby, places her hands on her shoulders, and steers her back to bed. ABBY But I'm not tired anymore. Abby lays in bed, letting Kellie pull the covers over her. 5.",
      "characters": [],
      "action_text": "KELLIE What do you mean? You're not scared, are you? ABBY No. KELLIE So why can't you go back to sleep? ABBY Because. KELLIE Well, count some sheep or something,   alright? It'll make my job easier. Kellie playfully pinches her cheek and gets up to leave. As she reaches the door she glances back at Abby... somewhat unsettled by all of this.  INT. KITCHEN - MORNING  Eggs in a pan. Bacon sizzling. Toast POPS out of a toaster. Kellie cooks breakfast for three. Been doing it for years. Abby shuffles in wearing COWGIRL BOOTS over her tights. KELLIE Nope, inappropriate. ABBY Why? KELLIE Just one of those society things, sis. Go change. James -- wearing a bathrobe -- passes by Abby as he heads to the fridge. JAMES to Kellie (   ) Need any help? KELLIE You don't have time to help. Get dressed. 6. James looks down at his bathrobe and nods -- ' you're right '. He gives her a quick kiss on the forehead. JAMES What would I do without you? James turns and heads back to his room -- leaving Kellie to beam with pride over her successful morning routine.  INT. KITCHEN - LATER THAT MORNING  Kellie and Abby eat breakfast. Playful. Not a care in the world. James, now dressed, sits between them. Nervous about something -- he takes a deep breath. KELLIE What is it? JAMES Nothing... I just... I think it's time we talk about -- KELLIE Oh no. ABBY What is it? KELLIE Not what. Who.   Her . to James (   ) When? JAMES Next week. ABBY I like her. KELLIE Look, I just want you to be happy. JAMES Me too. KELLIE But can I just say one thing? And it's about what's right for you, so you can't get mad. 7. JAMES I reserve the right to get mad, but go ahead. KELLIE I'd rather see you with someone... else. JAMES And now I   am   a little mad. KELLIE Why? JAMES Because you don't get a vote now. You get a vote at the beginning, between our third and fourth date. Not a year and a half later. KELLIE I'm sorry I just... JAMES I've played more than fair. I haven't had her over for   sleepovers -- KELLIE TMI. J",
      "dialogue_count": 0,
      "word_count": 638
    },
    {
      "scene_number": 2,
      "slugline": "EXT. BEER THIRTY - NIGHT  The patio of a laid back gastropub. James sits across from ROBIN (29) -- warm, sunny and ever so slightly \"off.\" JAMES Are you kidding? The girls love you. ROBIN Really? I just get this feeling... JAMES Look, it's a shake-up. But I know it'll be a good one. ROBIN I don't want them to associate me with disruption. JAMES Sometimes disruption is good. I  need   disruption. ROBIN I know. But I remember that age. Seventeen? She'll have an opinion. JAMES Are you having second thoughts? Because the moving deposit's -- ROBIN No! No. I wanna make it work either way. I'm just thinking out loud. I think I could be a good friend to them, you know? beat (   )  And   a good partner to you. JAMES Wow. He smiles and takes her hand. JAMES   (cont'd) What a toxic presence you'll be.  INT. UHAUL - DAY  TIGHT on Robin. She stands in front of a mirror -- steeling herself for something. 9.",
      "characters": [],
      "action_text": "A CRAMPED SPACE containing lots of new-age CERAMIC SCULPTURES and the EQUIPMENT to make them. It looks like we're in her apartment... She braces herself in front of the mirror and takes a calm, reassuring breath. ROBIN You can do this. She takes a few steps towards the exit...  EXT. CALDWELL HOUSE - CONTINUOUS  ...   and   steps outside. Revealing the UHAUL in the driveway.  INT. LIVING ROOM - DAY  Kellie and Abby sit on the floor -- taking in the progress. The family CAT sits between them. The SCULPTURES stick out like a sore thumb in their new environment. Robin kneels down to Kellie and Abby’s eyeline. ROBIN I just want to thank you girls for letting me into your home and your hearts. You know I love your dad and I’m looking forward to being your -- ABBY Mom? KELLIE Sister? ROBIN I could be a bit of both. A Momster. KELLIE Now   that   has a ring to it. ROBIN You’re right. We’ll just   vibe   it out. Abby notices James removing a single PICTURE from the wall. He places it in a box and heads to his room. She follows. 10.",
      "dialogue_count": 0,
      "word_count": 361
    },
    {
      "scene_number": 3,
      "slugline": "INT. MASTER BEDROOM - DAY  James removes a couple of photos from his dresser and adds them to the box. Behind him -- an ELECTRICIAN installs a custom CHANDELIER above the bed. Ceramic and glass. Sculpted by Robin. ABBY What are you doing? JAMES It’s a new start, right? ABBY She doesn’t know you were married? JAMES Of course she does. It’s about making her feel at home. And it’s a new start for me too. Abby pries one of the pictures away from him. Their family as it was five years ago   -- James, Kellie (then 12), Abby (then 3) and   LEXY   (early   30’s). Lexy   was luminous. Big eyes that could find a lie anywhere. ABBY I don’t remember her. JAMES Well, there won’t be a test. You were three. James kneels down next to her and looks at the picture. JAMES   (cont'd) She loved you very much. thinks (   ) We can put this in your room if you want. Would you like that? Abby smiles and nods. Robin enters -- surprised by the chandelier. ROBIN Wow. It's up already? JAMES Yep. 11.",
      "characters": [],
      "action_text": "ROBIN Are you sure it... fits? JAMES lying (   ) Yep.  INT. LIVING ROOM - DAY  Kellie roams among the boxes and knick-knacks infecting her house. There’s definitely some annoyance simmering up.  INT. CALDWELL HOUSE - FOYER - DAY  Robin is unpacking DOZENS OF BOOKS and placing them on the shelves. New age stuff. Some YA fiction. Some poetry and eastern religion selections sprinkled in. Kellie reaches for one called ‘ The Replacement Mother: How Not To Be a Wicked Stepmom .' KELLIE Good stuff. You make it all the way through this one? Robin -- simultaneously gentle and firm -- removes the book from Kellie’s hands. She knows when she’s being made fun of. ROBIN Can't blame me for trying. KELLIE backpedaling (   ) Well you know Abby's kind of weird. If you need any help, you can just ask me. There's no book for her. Robin smiles. ROBIN Thanks. That would be great.  EXT. BACKYARD - NIGHT  James -- draped in a bloody apron -- opens up the grill and inspects a delicious looking tri-tip. A bottle of LIGHTER FLUID at his side. 12.",
      "dialogue_count": 0,
      "word_count": 372
    },
    {
      "scene_number": 4,
      "slugline": "INT. DINING ROOM - LATER  Robin plates the food as Abby sits in her chair giggling and talking to... no one. ABBY girlish and formal (   ) You’ll have to wait. It’s dinner time. Kellie throws a look at Robin -- ' see what I mean? ' ROBIN When did this start? KELLIE Just the other day. to Abby (   ) Abs. What's the deal? ROBIN I guess imaginary friends can be healthy. KELLIE Not as healthy as real ones. ROBIN Meh, let her explore. KELLIE I'm sorry did you just say \"meh?\" Like, phonetically? ROBIN Is that not how you do it? KELLIE No,   momster. Internet only. You sure you're only twenty-nine? ROBIN Just different interests I guess. Robin's smile fades a bit -- Kellie decides to ease up a little. KELLIE Good for you. I'd love to unplug. beat (   ) Plus it's probably just the generation gap. 13.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 152
    },
    {
      "scene_number": 5,
      "slugline": "INT. KITCHEN - NIGHT  BLOOD oozes out as James carves the tri-tip.  INT. DINING ROOM - NIGHT  The “new” Caldwell family settles in for dinner. Kellie and Abby prepare to dig into their steak. Robin swoops in and sprinkles a bunch of SEEDS on their meat right before their forks make contact. KELLIE Sesame seeds? ROBIN Hemp seeds. KELLIE So what, am I going to be stoned all night? ROBIN Of course not. KELLIE I run track. They test, you know. ROBIN It won’t show up. reconsiders (   ) And if it did it’s not like weed ever made anyone faster. JAMES It’s okay, Kellie. ROBIN Its got Omega   3’s. Your dad loves it. JAMES Load me up. Robin sprinkles seeds on his steak as he glares at Kellie -- ‘ give her a break. ’ KELLIE Actually it just adds a little extra crunch. I like it. ROBIN Your brain likes it too. 14.",
      "characters": [],
      "action_text": "James sets his fork down and raises a glass of wine. JAMES I'd just like to take this opportunity to welcome Robin into our home... looks into Robin's eyes (   ) ...   and   into our family. Everyone CLINKS their glasses. Kellie and Robin exchange nervous looks as they move their glasses in for a toast... SMASH. Robin's glass shatters in her hand. Everyone at the table startles. JAMES   (cont'd) Jesus! ROBIN Ouch. Blood drips from Robin's hand. KELLIE Are you okay? Robin gets up, heads to the sink and washes off the wound. ROBIN Yeah, can you just grab me a paper towel? Kellie grabs a roll of paper towels and heads over to Robin. BLOOD trickles down Robin's finger into the water in the sink.   Oddly   similar to the image in the opening scene.  KELLIE Yikes. Robin rinses the wound. It's tiny. Kellie presses the paper towel into Robin's palm.  INT. KELLIE'S BATHROOM - NIGHT  Kellie flosses and brushes her teeth. All of her movements controlled and efficient. Almost comically precise. A NOISE from inside her room. She turns her head... 15.",
      "dialogue_count": 0,
      "word_count": 339
    },
    {
      "scene_number": 6,
      "slugline": "INT. KELLIE'S BEDROOM - NIGHT  Kellie steps from her bathroom into the bedroom. WHOOSH. The window opens. She JUMPS back and lets out a gasp. Todd pokes his head through. KELLIE Jesus Christ, you scared me. catches her breath (   ) You can't be here right now. TODD Why not? KELLIE My Dad's here. Todd finishes climbing through the window. TODD He's never here on Tuesdays. KELLIE Well, now she's here and that's changed. On Todd -- ' Bummer. ' TODD That sucks. KELLIE Didn't you see the cars? Todd moves towards her... aiming for seductive, only achieving awkward. She allows a laugh. He leans in for a kiss but she pulls away. KELLIE   (cont'd) We’ve talked about this. TODD Come on, we’ve been dancing around it forever. You know we’re more than friends. KELLIE How’s that? 16.",
      "characters": [],
      "action_text": "TODD I can tell by the way you look at me. He leans in again. TODD   (cont'd) They won’t hear anything. They’re probably going at it right now. KELLIE And you think we should do it in sync with them? Ew. She gently pushes him away. KELLIE   (cont'd) I don’t want to think of him that way. TODD You mean with another woman? KELLIE  What ?! TODD Instead of your mom. KELLIE No. No one wants to think about their dad doing   anything .  INT. MASTER BEDROOM - NIGHT  James and Robin are in fact not going at it. His advances have been thwarted by some worrying on Robin's part. A breeze blows in through the open window. ROBIN The seeds were stupid. I should have asked before putting them on. JAMES It's not a big deal. She liked them. ROBIN Yeah, but it's my first night here and I'm messing with her food. Not good. 17. She shakes her head, lost in the past. ROBIN   (cont'd) I was never cool in school. Whenever I tried they just hated me more.  INT. ABBY’S BEDROOM - NIGHT  Abby's half asleep. The window by her bed is once again open -- allowing a gentle breeze into the room. She shivers a bit. Pulls the blanket tighter. Her feet are still exposed. BRRR. Abby’s sheet LIFTS up. At first we think it’s the billowing wind... until it’s PULLED down to cover her feet. A quiet beat. The open window SLAMS shut and the sheets pull TIGHT around Abby -- literally imprisoning her on the bed.  INT. KELLIE’S BEDROOM - CONTINUOUS  Todd and Kellie hear Abby SCREAM! She heads for the door. Todd follows.  INT. MASTER BEDROOM - CONTINUOUS  James and Robin exchange looks and jump out of bed.  INT. ABBY’S BEDROOM - CONTINUOUS  Kellie and Todd run into Abby’s room. Abby’s curled up in a ball on the bed. KELLIE What happened? James enters the room -- worried.  INT. HALLWAY - CONTINUOUS  Robin second guesses if she should go into Abby's room or not --   'I don't want to overstep my bounds.'  She sees something MOVING out of the corner of her eye. 18. She turns her head. ' What's that? ' She looks over t",
      "dialogue_count": 0,
      "word_count": 2914
    },
    {
      "scene_number": 7,
      "slugline": "INT. ABBY'S BEDROOM - CONTINUOUS  Abby looks to the closet tentatively... almost as though she's seeking permission from someone we can't see. She nods to whatever she's looking at and then proceeds to give Robin a hug. ROBIN Awww. I’m fitting in already? Kellie enters -- her eyes lock on the box. KELLIE Is that my mom's stuff? ROBIN I thought -- KELLIE Can you ask before doing things like this please? She's already fixated. ROBIN Your dad and I discussed it. Kellie sighs... she'll let this one go. She sits on the bed next to Abby. KELLIE She can have it. It's just weird to see this stuff again. I miss her. ROBIN Of course you do. Kellie pulls the photo out of the box and gazes at it. KELLIE She was great. ill-timed glance at Robin (   ) One of a kind.  INT. MASTER BEDROOM - LATER THAT NIGHT  James and Robin are post-coital in bed. JAMES What you did for Abby today was really sweet. 33.",
      "characters": [],
      "action_text": "ROBIN I just don't want her to think I'm trying to replace this perfect mom. almost in tears (   ) I already feel like I'm trying to replace a perfect wife. JAMES Who says you're not perfect? ROBIN Part of you has to wish she was still here. JAMES Of course. I loved her very much. But she's not here. You are. And you're not second fiddle. She was my first choice then, but you're my first choice now. beat (   ) Besides, it's not like things were perfect at the end. ROBIN How? James takes a deep breath. ROBIN   (cont'd) If you don't want to talk about it -- JAMES No, it's okay. She was just distant, you know? Like something was sucking the joy out of her. beat (   ) I mean, she wasn't wearing her ring when she died. ROBIN I'm sorry, James. JAMES It's not all her fault, you know? I could have done a better job. I was checked out, not involved enough with the kids... beat (   ) So now I just wonder. About everything. He rolls on his side to face her. 34. JAMES   (cont'd) Promise me something, okay? ROBIN Of course. JAMES Keep me in the loop. Don't let me wonder.  INT. KELLIE’S BEDROOM - NIGHT  Kellie stares at the moon outside her window. Something catches her attention... A HORRIFYING vision in the corner. Moonlight bears down on it like an evil, black tree growing out of the floor. She flicks on the lights... it’s just that sculpture of Robin’s. KELLIE Great.  INT. ABBY’S BEDROOM - NIGHT  Abby lays on her stomach, singing softly to herself. ABBY singing (   ) The itsy-bitsy spider went up the water spout... In the background -- her bedroom door slowly CLOSES. ABBY   (cont'd) singing (   ) Down came the rain and washed the spider out... out came the sun and dried up all the rain... A breeze from nowhere waffles the sheets. ABBY   (cont'd) singing (   ) ...and   the itsy-bitsy spider climbed up the spout again. Inching closer to sleep, she starts the song again. 35. ABBY   (cont'd) singing (   ) The itsy-bitsy spider climbed up the water spout... INVISIBLE FINGERS walk ",
      "dialogue_count": 0,
      "word_count": 700
    },
    {
      "scene_number": 8,
      "slugline": "INT. LIVING ROOM - NIGHT  Kellie investigates -- absentmindedly gripping the necklace. BEEP! BEEP! BEEP! Something stirs at the dark end of the room. She approaches slowly... leans down to look... THE CAT JUMPS OUT. She jumps back -- dropping the necklace. At that exact moment a stack of magazines TOPPLES off a nearby table. They fall in the same direction as the necklace. Kellie glances back and forth from the necklace on to the pile of magazines on the floor. She picks up the necklace -- the curtains across the room SWAY UP AND DOWN -- echoing the motion of the necklace as she lifts it... She backs away... frightened... Then... the cat scurries across the room. WHAM! She bumps into James -- scaring the shit out of both of them. JAMES I was hoping that was you sneaking in or something. KELLIE I’m grounded, remember? JAMES give me a break (   ) You’re never really grounded. James and Kellie check the front door. Locked. He hits a button. The alarm stops. JAMES   (cont'd) Motion detector. Abby’s in her room, right? Kellie nods. BEEP! BEEP! BEEP! It goes off again. ‘ What the fuck? ’ 37.",
      "characters": [],
      "action_text": "Then... the cat SCURRIES into the room. James sighs and flicks the alarm off. KELLIE wary (   ) He never sets this off. JAMES Yeah, but you've been feeding him too much. beat (   ) You're not starting to believe this ghost stuff, are you? KELLIE I...   covering (   ) ...   of   course not. JAMES Exactly. Team cat. James yawns and pats Kellie on the shoulder. JAMES   (cont'd) Going back to bed,   kiddo. You should too. KELLIE In a second. She scoops the cat up and heads into the kitchen.  INT. KITCHEN - CONTINUOUS  Kellie -- the cat still cradled in one arm -- walks slowly. She holds out the necklace and sways it front of her. Nothing. BEEP! BEEP! BEEP! The hallway detector BEHIND her. A chill comes over her -- she looks at the cat cradled against her. KELLIE Why couldn’t it be you? She lets the cat fall to the floor and follows as it scurries out of the room. 38.",
      "dialogue_count": 0,
      "word_count": 362
    },
    {
      "scene_number": 9,
      "slugline": "INT. HALLWAY - NIGHT  The cat runs up to Kellie's door -- PURRING and rubbing against it.   A friendly reception for whatever's inside...  Kellie slowly approaches her room and reaches for the door. She PULLS her hand away -- it's dripping. The handle is WET. She opens her door slowly...  INT. KELLIE’S BEDROOM - CONTINUOUS  Kellie scans her room... empty. Still. She glances to the sculpture ...   the   blanket she threw over it billows.   'Is something under there?'  Her eyes move to the trophy shelf. One small trophy on the end is turned askance.   'Weird.'  She slowly stalks toward the display, eyes peeled for anything unusual, and fixes it. Her closet door is open. ‘ Fuck .’ She heads over to close it. PLOP. She spins around to see a trophy on the carpet. She turns back to the closet -- the door SLAMS shut. PLOP. Kellie spins around again. Another trophy on the floor. Kellie doesn’t know what to make of it. They start falling... one by one... PLOP. PLOP. PLOP. Kellie moves to the shelf... then peers down at her hand -- the necklace TIGHTENS around her palm. Painfully... like a noose. BAM! The SHELF TOPPLES over -- sending the trophies and their sharp metal edges down almost all over her. She STUMBLES BACK and FALLS. The necklace slips free, bounces off the floor, slipping under the black recesses of her dresser. She catches a glimpse of herself in the mirror -- SOMETHING is behind her. Undefined, dark... almost wraith-like. 39.",
      "characters": [],
      "action_text": "Terrified, she peers into the mirror... ABBY (O.C.) I told you. It's Mom. Kellie SCREAMS and spins around. Abby stands in the doorway. KELLIE No. Mom wouldn't do this. Mom wouldn't make us feel like this! ABBY She did   Itsy-Bitsy. KELLIE whispers, scared (   ) It was watching us... ABBY Sometimes she whispers things... KELLIE What does she say? Has she said anything about us? Abby thinks... ABBY She asked about the necklace. KELLIE Abby, I know I made a big deal about that necklace, but I was just mad at Robin. I was being a jerk. Mom hated that thing. I don’t know who gave it to her and I never saw her wear it. beat (   ) I need you not to talk to this thing. ABBY Why? I like her. Kellie grabs Abby by the shoulders. KELLIE Abby, I’m your sister. I love you. I would never lie to you. You’ve got to trust me. Do you trust me? ABBY ...yes. 40. KELLIE Whatever this is... stay away from it. James and Robin arrive to investigate the racket. JAMES taking in the mess (   ) What the hell happened? Kellie bends down and grabs the WORLDS BEST DAUGHTER trophy off the floor. KELLIE Robin, can you take Abby back to her room please? ROBIN re: the mess (   ) But let me help you- KELLIE Please, Robin. Abby, remember what I said. Robin steers Abby into the hall. James pulls Kellie aside. JAMES Kellie, are you trying to... sabotage this? KELLIE Sabotage what? JAMES You know... me and Robin. KELLIE re: the destroyed room (   ) You think   I   did this? This thing is real. thinks (   ) Maybe whatever was “bothering” Mom is now bothering Abby too. JAMES What do you mean? KELLIE We both know Mom was acting weird at the end. 41. JAMES That’s not what happened. She was depressed. James gently takes the WORLD'S BEST DAUGHTER trophy from her and places it back on the shelf. KELLIE You don’t believe me do you? James surveys the toppled shelf and the trophies strewn throughout the room -- not knowing what to think.  INT. KELLIE'S BATHROOM - NIGHT  Kellie examines herself in the mirror... there",
      "dialogue_count": 0,
      "word_count": 1477
    },
    {
      "scene_number": 10,
      "slugline": "EXT. BACKYARD - DAY  Robin is on her knees PLANTING SEEDS in the dirt near the deck, a glass of wine at her side. BERNARD (O.C.) Got a second? Robin startles. Bernard enters the yard from the side. ROBIN Hey, Bernard. What's up? BERNARD I wanted to clear the air about something since it seems like we're going to be seeing more of each other. ROBIN Uh... Sure. BERNARD You've probably guessed that I've steered clear of meeting you these past few years. Robin wipes her hands on her jeans. ROBIN Yeah, I thought that might be the case. BERNARD Well, I came to apologize. It's just... at the time I didn’t know what to think of it. beat (   ) Considering you knew her. ROBIN flustered (   ) James and I got together three years after the funeral, Bernard. It's a circle of friends. Things happen. Bernard nods -- looks off in the distance. BERNARD I came to explain, not accuse. I'm fine with it now. Like I said, life goes on. I was just being a Dad. 47.",
      "characters": [],
      "action_text": "ROBIN Well, I was as surprised as anyone he asked me out. She’s not an easy act to follow. BERNARD Have you told the girls? ROBIN James and I don't think it's a good idea right now. It's such an uphill battle already. BERNARD Kellie? Robin bends back down and starts digging with her trowel -- like she’s angry. ROBIN Yep. Bernard pulls out his inhaler... takes a puff. BERNARD She's a handful,   alright. Likes to be in charge, doesn't she? You gotta fight or roll over with her. Robin pauses on her response as she drops a handful of seeds into the soil. Then... ROBIN Don't worry, I'm not going anywhere. BERNARD chuckles (   ) Good luck with that. And call me if you need anything. Lord knows James never does. ROBIN Anytime. Bernard makes his way back around the side of the yard. Robin pulls out the hose to water the seeds -- notices a LEAK where the tube screws into the water spout. She grabs the spout handle to adjust it -- SPSHHH! It SPRAYS her with water. 48. She steps back -- ' great. '  EXT. CALDWELL HOUSE - DAY  Kellie's car pulls into the driveway as Bernard's pulls out. Her eyes trail after him -- ' what's he doing here ?  INT. CALDWELL HOUSE - LIVING ROOM - DAY  Kellie arrives home and catches a glimpse of Robin through the back windows. Her eyes linger on Robin -- DRENCHED with water... MATTED hair...  INT. KELLIE’S BEDROOM - DAY  Kellie closes the door behind her, opens the drawer and pulls out the necklace. She studies it, nervous -- ‘ what the fuck am I thinking? ’  EXT. CALDWELL HOUSE - NIGHT  Kellie's room is the only one with the lights on. Then... they go out.  INT. HALLWAY - NIGHT  Kellie scouts around. Peering in everyone’s bedroom -- they’re all asleep. She opens a closet and pulls down a SHOEBOX. CU   ON SHOEBOX -- Christmas ornaments and tchotchkes.  INT. HALLWAY - MOMENTS LATER  Kellie places a tiny SILVER BELL on her doorknob. She moves down the hall towards the master bedroom and places a silver bell on that doorknob as well.  INT. LIVING ROOM -",
      "dialogue_count": 0,
      "word_count": 2560
    },
    {
      "scene_number": 11,
      "slugline": "INT. ABBY’S BEDROOM - CONTINUOUS  Kellie shakes Abby by the shoulders. KELLIE Where’s the necklace?  INT. MASTER BEDROOM - CONTINUOUS  The chandelier pries loose from its moorings. ROBIN Look out! SNAP! The chandelier FALLS. James and Robin jump out of the way as it CRASHES down to the bed. CERAMIC and GLASS SHATTER into a THOUSAND JAGGED FRAGMENTS.  INT. ABBY’S BEDROOM - CONTINUOUS  Abby scurries over to a SHELF FULL OF DOLLS and pulls the necklace off the neck of an OLDER DOLL hidden in the middle. She hands it to Kellie. Kellie PULLS on either side of the necklace. SNAPPING it into two pieces. We hear a SHRIEK.  INT. MASTER BEDROOM - CONTINUOUS  The WIND STOPS. JAMES What hell is going on? Terrified -- Robin runs to the bathroom.  INT. ABBY’S BEDROOM - CONTINUOUS  Abby looks past Kellie... A RATTLING inside her closet -- something in there is trying to get out. Abby -- sniffling and wiping tears from her cheeks -- gets out of bed. 60.",
      "characters": [],
      "action_text": "ABBY Mommy? Abby’s eyes widen in FEAR. Kellie turns and steps towards her. KELLIE What is it? Abby SCREAMS as she's PULLED across the floor by her ankles into the closet. KELLIE   (cont'd) No! Kellie grabs Abby’s wrist but falls back and SLAMS into her bedside table. She gets up and grabs Abby’s wrist again -- but whatever is pulling on Abby is too strong. James bursts into the room -- sees the terrifying spectacle -- grabs Abby’s other wrist and PULLS her out of the closet. He scoops her up and carries her out of the room. Kellie looks down at the broken necklace. Slack around her arm. It's gone. For now.  INT. MASTER BATHROOM - NIGHT  Robin turns on the sink and splashes water on her face. She glances back in the mirror... ...she looks DEAD. PALE with PURPLE BRUISING, WET MATTED HAIR. Swollen. Like she's been face down in the water for two days. The door SHAKES. Robin SCREAMS. KELLIE (O.S.) It’s me! She looks in the mirror again -- back to normal.   'What the hell?'  ROBIN I’ll be right out. 61. KELLIE (O.S.) You okay? ROBIN No. KELLIE (O.S.) Are you hurt? ROBIN I just need a second.  INT. HALLWAY - LATER  Kellie, James and Abby sit together in a spot with a good vantage point. James pulls out his cell. JAMES We need to get you guys out of here. Kellie grabs his hand. KELLIE You need to ask why this is happening now. What's new here? BEHIND THEM -- Robin appears. In shock. Cheeks stained with tears. KELLIE   (cont'd) I'm   gonna   pack a bag. to Abby (   ) You're coming with me. I'm not letting you out of my sight.  INT. KELLIE'S BEDROOM - NIGHT  Kellie opens the door and guides Abby -- scared and in shock -- inside. They don't see the SILHOUETTED FIGURE sitting on the bed until... Kellie flicks on the LIGHTS. She JUMPS BACK and gasps for breath... it's just Todd. KELLIE Jesus, Todd. Not a good time. (MORE) 62. re: terrified Abby (   ) KELLIE   (cont'd) You need to learn how to read the room a little bit, man. TODD I found something out... He pulls out his   iPhon",
      "dialogue_count": 0,
      "word_count": 1512
    },
    {
      "scene_number": 12,
      "slugline": "INT. LIVING ROOM - CONTINUOUS  Kellie leans in close to James. KELLIE Dad, if this thing took her, we're not going to find her. Not like this. On James -- he can't accept it. JAMES She was terrified, maybe she's hiding outside. KELLIE Maybe. Let's hope so. James nods and heads out the front door as Kellie presses on.  INT. MASTER BEDROOM - NIGHT  Bernard bends down and checks under the bed... nothing. He stands up -- suddenly gets dizzy. Short of breath, he sits on the bed and pulls out his inhaler. Kellie enters -- ' he doesn't look so good. ' KELLIE You doing okay? Bernard nods. BERNARD Just a lot to take in. You seem awful sure this isn't her. beat (   ) Maybe you'd be jealous if it was. KELLIE Trust me. I was never jealous of her. Kellie looks down at her wrist -- the necklace TIGHTENS around it. Whatever this is... it's coming back. She peers out the door and down the empty hallway -- ' where the hell is Robin? ' 69.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 180
    },
    {
      "scene_number": 13,
      "slugline": "INT. KELLIE'S BEDROOM - CONTINUOUS  Robin sits on Kellie's bed and buries her head in her hands -- fighting back tears. On the verge of letting it all out. She straightens herself out a bit... looks around... she's alone. THEN... She suddenly sees her shadow on the wall -- growing in size -- illuminated by the light from a presence behind her. She turns around -- a vapor begins to take shape under the trophy shelf. Then... a single trophy falls from the shelf. PLUNK. It lands on the carpet.  World's Best Daughter . The LID POPS half off. The vapor disappears. Robin looks up to the shelf, then to the trophy on the floor -- ' what the fuck? ' Robin bends down and picks it up. She reaches inside...  INT. HALLWAY - CONTINUOUS  Kellie slowly makes her way to her room... the door open at the end of the hall. Her eyes dart around... keeping a lookout...  INT. KELLIE'S BEDROOM - CONTINUOUS  Kellie enters to find Robin sitting on the floor. In the palm of her hand --   Lexy’s wedding ring . INSERT -- an engraving inside the ring.   ‘ Lexy and James ~ August 9th 1998 ’ Kellie closes the door and slowly approaches her. Robin gets up and backs away. ROBIN Why would you have this? Why would you keep this from your Dad unless -- 70.",
      "characters": [],
      "action_text": "KELLIE Just, relax. Okay? ROBIN She's been trying to tell us this whole time. KELLIE Look, you don't know what it was like. She and Dad weren't happy. He needed someone stronger. ROBIN What? Like you? KELLIE Exactly like me. Robin backs into the bathroom... Kellie follows.  INT. KELLIE'S BATHROOM - CONTINUOUS  ANGLE -- the bathtub. Still full of water from earlier. Kellie sees that Robin is looking   past   her... back into the bedroom... ROBIN Stay away from me. KELLIE Don’t worry about Dad. He’s in the right hands. A GLOW fills the room... Kellie turns around... A BRIGHT presence in the air... A SHRIEK fills the room as the bright presence TURNS BLACK. WIND fills the room. Backing up... Robin trips and FALLS backwards into the tub. SPLASH. She HITS her head on the faucet on the way down. Unconscious... Robin's head bobs limply. BLOOD colors the water. Kellie steps forward -- places a single finger on Robin's forehead -- and PUSHES her underwater. We watch the BUBBLES stream out of Robin's nose... until they stop. 71. Kellie removes her finger... Robin floats. Absolutely still. Kellie looks around.   Lexy   is gone. The wind has stopped. She gets up and exits the bathroom. Robin’s profile surfaces in the   bathwater. Not breathing.  INT. KELLIE’S BEDROOM - CONTINUOUS  Kellie picks up the ‘ World’s Best Daughter ’ trophy and places it back on the shelf.  INT. ABBY'S BEDROOM - NIGHT  Todd's growing impatient -- ' I can't just sit here. ' Todd reaches for the door -- but Kellie opens it first. She enters the room... faking a panic. KELLIE Don't go out there. It killed Robin. TODD Oh my God. Kellie nods -- feigning sadness. TODD   (cont'd) We have to get out of here. Todd reaches for the window. Kellie rushes over to him and places her hands on top of his -- stopping him. KELLIE Wait! Robin was trying to leave too... when it got her. Let’s just figure this out. She paces the room... thinking. Then... she looks to the box of Lexy's stuff on the bedside table. KELLIE   (",
      "dialogue_count": 0,
      "word_count": 1499
    },
    {
      "scene_number": 14,
      "slugline": "INT. KELLIE'S BATHROOM - CONTINUOUS  Robin floats in the bath -- her face breaking the water. Not moving. TAP. A drop of water falls from the shower head and lands on her forehead. TAP. Another one. We hear a small underwater POP... the tub finally starts to drain.  INT. LIVING ROOM - NIGHT  The front door opens and James steps inside. Kellie exits Abby’s room and RUSHES into his arms. KELLIE Thank God you’re back! James looks down and sees Abby. Kellie pulls away from him as he kneels down and puts his arms on Abby’s shoulders. JAMES Where the hell were you? KELLIE We need to get out of here right now. James looks past Kellie into the hallway and sees Bernard on the floor. JAMES Oh my God, Bernard!  INT. HALLWAY - CONTINUOUS  James tentatively approaches Bernard's body -- still several meters away. Kellie jumps in front of James -- blocking his progress. Right in front of Abby's open door. KELLIE This thing got everyone. If we stay any longer we -- 78.",
      "characters": [],
      "action_text": "JAMES Where... where’s Robin? KELLIE Dad, let’s go. JAMES shouting (   ) Robin! He opens his mouth to call out again but stops once he turns... and sees Todd's BODY in Abby's room.  INT. ABBY'S BEDROOM - NIGHT  James enters and kneels beside Todd. He looks up at Kellie. JAMES You're telling me this thing... did  this ? ABBY That’s why Kellie told me to hide in the crawl space. KELLIE  Abby!  Confused, James looks from Abby to Kellie. JAMES Wait... you told her to hide? KELLIE I didn’t want it to know where she was. JAMES Why not just get her out of the house like I asked? James sees Abby in the doorway gazing at Todd’s corpse. JAMES   (cont'd) to Abby (   ) Don’t come in here. James rises to his feet -- stares Kellie square in the eye. JAMES   (cont'd) Where is she? 79. On Kellie -- she can’t come up with an answer. She sees James’ face fall as he takes a step away from her. KELLIE Why are you looking at me like that? James -- speechless -- pushes past her on his way to the door. Kellie GRABS his arm but James PULLS AWAY. Desperate -- Kellie grabs a SNOW GLOBE from Abby's dresser SMASHES James in the head with it. GLASS and WATER fly through the air. James hits the ground -- out cold. FADE TO:  INT. LIVING ROOM - LATER  James wakes up in a haze. Everything’s blurry. He STRUGGLES to stand up. REVEAL -- James is tied to a chair. The box is on the floor. Kellie DOUSES it with LIGHTER FLUID. KELLIE muttering to herself (   ) Come on, Mom. You’ve been showing up every five fucking minutes. Where are you when we really need you? Abby sits in the corner -- scared but dutifully holding a CHARCOAL LIGHTER. JAMES groggy (   ) Why would you... sees the lighter fluid (   ) What are you doing? KELLIE Oh, you’re awake. re: the box (   ) I’m making us safe again. off his look (   ) Don’t worry, I’ll be careful. 80. JAMES It’s her, isn’t it? Kellie sighs and nods reluctantly -- ‘ yes. ’ JAMES   (cont'd) She knew we’d be in danger when Robin moved in. From you. KELLIE That's ridicul",
      "dialogue_count": 0,
      "word_count": 705
    },
    {
      "scene_number": 15,
      "slugline": "INT. LIVING ROOM - CONTINUOUS  Kellie grabs the lighter from Abby. KELLIE to James (   ) What is it you don’t understand! We don’t need her. JAMES calls out again (   ) Robin! KELLIE She can’t hear you. Kellie’s ready to torch the box. Her eyes scan the room for any sign of   Lexy   as she CLICKS the lighter. JAMES Why don’t we stop and figure this out together? KELLIE Where have I heard that before? JAMES  Please . Let me fix this. KELLIE No. You’re not good at that. Without me, Mom would have destroyed this family years ago. Kellie grabs Abby’s hand and pulls her close. KELLIE   (cont'd) to Abby (   ) I need you to cry out for her. Cry out for Mom. ABBY But what if she’s listening to you now? She knows what you’re doing. Kellie closes her eyes and sighs --   ‘ goddammit .’ KELLIE You’re right. Kellie pulls the necklace off her arm and WRAPS IT AROUND ABBY'S NECK. 82.",
      "characters": [],
      "action_text": "KELLIE   (cont'd) Let’s see if she cares about you as much as I do. Kellie sees James’ eyes widen as he looks past her.  Something’s behind her.  Kellie releases Abby and turns to see... Robin. Soaking wet. Bloodshot eyes. Pissed off. ROBIN It’s over, Kellie. Kellie DIVES for the box. Robin quickly approaches and SNATCHES it out of her hands. Kellie jumps to her feet. KELLIE No! Don’t! Robin lets the box fall to the floor and STOMPS on it. The BOX SHATTERS. ROBIN I’m so sick of you. Talking about how you protect them. Kellie crawls on her knees -- grabbing the lock of hair and trying to get as many pieces of the box as she can. ROBIN   (cont'd) You don’t give a shit about protecting them. You want to  possess   them. Kellie gets back on her feet and takes a step towards Abby. KELLIE fuming (   ) That is not true. ROBIN Abby, come here. Abby takes a step away from Kellie towards Robin. KELLIE hurt (   ) Abby... seriously? Abby pauses and looks at Kellie. 83. JAMES Abby, listen to Robin. Kellie -- utterly lost -- looks to James. JAMES   (cont'd) We’re going to get you some help, Kellie. Confused -- she takes a step towards him. JAMES   (cont'd) You’re not well. Kellie takes another step. KELLIE realizing (   ) We’re not going to be together anymore? smiles (   ) You don’t mean that. JAMES a burst of emotion (   ) You destroyed   everything!  Kellie LEAPS onto James -- still tied to the chair -- and wraps her arms TIGHT around him. Manic. Flailing. The first time we’ve seen her totally out of control. KELLIE No, I’ve   done   everything! I   made  this family! You can’t take it away from me! The room starts to shake ever so slightly. Kellie hangs on to him for dear life. She pulls him TIGHTER. He can’t breathe. Her arms slip and -- almost subconsciously -- wrap around his neck. ROBIN Kellie, stop! The necklace once again DIGS into Kellie’s wrist. The room SHAKES violently now. Robin GRABS HOLD of Kellie’s arm. Kellie refuses to let go. James struggles but she’s smother",
      "dialogue_count": 0,
      "word_count": 1266
    }
  ]
}