{
  "slug": "tower-block-2012",
  "title": "tower block",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 15,
  "characters_count": 0,
  "characters": [],
  "total_words": 21004,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. TOWER BLOCK 31 - NIGHT 1   1  A filthy, decrepit old tower block in the middle of the city, built in the early 1960s. The block is run down, shabby, a blight on the landscape. A few windows are lit up, but only on the top floor. The sign outside the building reads \"SERENITY HOUSE\", with \"(Tower Block 31, Rosewater Estate)\" underneath in much smaller letters. It's late. All quiet. A terrified teenager runs past, JIMMY, just a boy, about 15, running for his life. He heads for the light coming from the doorway at the front of the building. Two people chase him, wearing balaclavas and gloves.  INT. GROUND FLOOR HALLWAY - NIGHT 2   2  Jimmy rushes from the front door, through the lift recess, and into the hallway - but all the flats are boarded up, with warning signs: “CONSTRUCTION - DO NOT ENTER”. Jimmy hesitates, confused. But he saw lights on the top floor... He looks up, and decides to go for it.  INT. GROUND FLOOR LIFT RECESS - NIGHT 2a   2a  Jimmy stabs the call button for the lift. Waits. Is it coming? Should he wait? The two pursuers are coming closer, fast. Jimmy gives up on the lift, and runs for the stairs.  INT. FIRST FLOOR STAIRCASE - NIGHT 3   3  Jimmy gets to the top of the stairs - but the hallway is closed off, the door covered with a metal sheet, with a sign: \"FLOOR CLOSED FOR REDEVELOPMENT\". Damn it. Keep going. He keeps running upstairs.  INT. SECOND FLOOR STAIRCASE - NIGHT 4   4  This hallway is closed too. Jimmy mutters under his breath, his face stained with tears. He keeps running.  INT. GROUND FLOOR STAIRCASE - NIGHT 5   5  The pursuers reach the stairs and race up, two at a time.  EXT. TOWER BLOCK 31 - NIGHT 6   6  The staircase has large windows, all the way up, displaying the stairs to the outside world. Jimmy is nearly at the top floor, while the two people chasing him are still two floors behind. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 347
    },
    {
      "scene_number": 2,
      "slugline": "INT. TOP FLOOR STAIRCASE - NIGHT 7   7  Jimmy reaches the top. This hallway is open. He's exhausted, but forces himself to keep running. Behind him, running footsteps echo loudly in the stairwell.  INT. TOP FLOOR HALLWAY - NIGHT 8   8  Several doors have light coming from underneath them. The hallway is dimly lit, half the ceiling lights are broken. Jimmy staggers down the hallway, out of breath, trying to shout as loudly as he can, banging on doors. JIMMY Help me! Help! Please! Somebody, let me in! Please! He keeps banging on the doors and shouting. JIMMY (cont’d) Please! Help me! No response. A couple of the lights under the doors go off. The sound of security chains going on.  INT. BECKY'S FLAT, HALL - NIGHT 9   9  BECKY HARTMAN, late 20s, stands by the door, nervously. Doesn't want to get involved. She switches off her hall light too, and puts her security chain on the door. She picks up her phone and dials 999. But stays well away from the front door.  INT. TOP FLOOR HALLWAY - NIGHT 10   10  Jimmy gets to the very end of the hallway, where there’s another doorway marked “ROOF ACCESS” - but it’s padlocked. He is desperate now that no help is forthcoming. He's in tears, exhausted. There's no escape. JIMMY Please! For fuck's sake! Somebody help me! And now the two people chasing him have reached the hallway. There's no way out for Jimmy.  INT. BECKY'S FLAT, HALL - NIGHT 11   11  Becky listens at the door. Hears approaching footsteps from the corridor outside the door. Her hall light is still off. She hears a scuffle, as Jimmy is grabbed. 2. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "JIMMY (O.S.) Please! Let me go! I gave it back! Becky flinches as she hears Jimmy get punched in the stomach. He gasps for breath. Becky tiptoes to the peephole, and lifts up the metal cover, which makes a tiny squeaking sound. She peers through it. And someone's EYE appears, right up against the outside of the peephole. Becky gasps and jumps back. The person on the outside BANGS on the door, just once, just to show he knows she's there. He slides his hand down the outside of the door, slowly. JIMMY (O.S.) (cont’d) Please! Somebody help me! Becky hesitates. But can't just let this happen. She grabs her fire extinguisher from the hall.  INT. TOP FLOOR HALLWAY - NIGHT 12   12  The two figures in balaclavas start to drag Jimmy away. But Becky slips out of her doorway, and WHACKS one of them in the back. He falls over, grunting in pain. The other one turns to face Becky. She swings the extinguisher, but this guy is ready for her, and dodges. He delivers a swift jab to her stomach, doubling her over in pain, winding her. He kicks her in the face. Becky drops the extinguisher, and rolls around in agony. The guy she hit stands up, and kicks her in the stomach, angrily. They both kick and punch her several times, brutally. Becky's helpless, overpowered and outnumbered. It's about to get worse for Becky, but Jimmy is crawling away. They drop Becky, and grab Jimmy, punching him. They drag Jimmy off down the hallway, into the darkness. Becky stares at Jimmy's pleading face, but she's too battered and broken to do anything.  INT. TOP FLOOR STAIRCASE - NIGHT 13   13  The two figures drag Jimmy into the dark of the staircase. Now, from the stairs, comes the sound of a vicious beating.  INT. TOP FLOOR HALLWAY - NIGHT 14   14  Becky lies in front of her door, bleeding, coughing up blood, hearing Jimmy's screams in the darkness. But still nobody comes out to help. Can't be too careful. And slowly, Becky loses consciousness. 3. Copyright 2011 Surya Productions OMITTED 15   15  OMITTE",
      "dialogue_count": 0,
      "word_count": 1690
    },
    {
      "scene_number": 3,
      "slugline": "INT. TOP FLOOR HALLWAY - DAY 29   29  Kevin and Eddie come back through the roof access door. Kevin locks the padlock. KEVIN Right, this way. All the flats are on the same side of the building - at the front, with all the entrance doors facing into the hallway which runs the width of the building. The hallway is at the back of the building, and has tiny, slit windows. Kevin and Eddie walk down the hallway, as life goes on around them. One door opens, and two kids, five and seven, run in and out, shouting and laughing. From inside, their mum JENNY screams at them. JENNY (O.S.) Stop fucking running around, you're giving me a fucking headache. Oi! I said stop it! Kevin and Eddie walk past. Kevin rolls his eyes. KEVIN Excuse the residents. EDDIE I’ve seen worse. I'm just going to make some notes. He wanders around, writing on a clipboard. An elderly couple - NEVILLE and VIOLET THORPE - head for their flat, carrying shopping bags. Neville nods at Kevin, cautiously polite, with an old soldier's bearing and clipped attitude. NEVILLE Mr Rawlins. Come to look at your investment? KEVIN Yeah, for all the good it's doing me. Don't suppose you've had any word from the council? NEVILLE Not yet, no. KEVIN Didn't bloody think so. One of the kids from the open flat runs out again, and starts pulling the fire hose off the wall, uncoiling it. Jenny comes out and grabs the kid’s arm. 8. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "JENNY Leave that alone! What did I fucking tell you? I'll break your fucking neck if you don't stop. Now get in. She smacks the kid round the head. He's only five. He starts crying and runs inside. Jenny looks up to see Neville, Violet, Kevin and Eddie staring in shock. JENNY (cont’d) What? It’s my fucking kids, innit? NEVILLE They certainly are, Miss Mackenzie. There can be no doubt about that. He and Violet go into their own flat, closing their door. Jenny narrows her eyes - did he mean something cheeky by that? Then she catches sight of the back of Eddie's jacket as he starts re-coiling the fire hose. JENNY Oi! You're not knocking the fucking place down right now, are you? EDDIE I'm just doing a preliminary check, there's nothing to worry about-- JENNY Yeah, you better fucking not be. We'll go when the council says, and not before, do you hear me? KEVIN I think they can hear you in Australia, love. JENNY Good! And she goes inside, slamming her door shut.  INT. TOP FLOOR LIFT RECESS - DAY 30   30  Kevin and Eddie go back to the lift, and press the button. EDDIE Okay, this one should be a piece of cake. All we have to do is wait for everyone to go. KEVIN Do we have to? They both laugh. The lift arrives with Becky and Paul. Kevin and Eddie enter. 9. Copyright 2011 Surya Productions",
      "dialogue_count": 0,
      "word_count": 501
    },
    {
      "scene_number": 4,
      "slugline": "INT. TOP FLOOR HALLWAY - DAY 31   31  Becky walks down the hall. Paul hurries into his flat.  INT. PAUL'S FLAT, KITCHEN - DAY 32   32  Paul sits at his kitchen table, staring at the brown paper bag he's just brought home. Takes out a bottle of vodka. Opens the bottle. Sniffs it. Wants it badly. But hates himself for it. Finally, he takes the bottle to the sink. Holds the bottle over the sink, and starts to tip it over. But can't. He just can't. He takes a quick sip, then holds it over the sink again. Now will he pour it away? No. He can't. He goes back to the kitchen table, and sits there, dejected. Sips at the bottle again, hands shaking.  OMITTED 33   33  EXT. COMPUTER GAME DESERT - DAY 34   34  We're inside a computer game. A desert landscape. Some abandoned buildings. We're looking through a sniper scope. The scope scans over the buildings, until it spots another player - who is aiming directly at us. BANG! We're dead.  INT. BANNISTER FLAT, DANIEL'S ROOM - DAY 35   35  DANIEL BANNISTER, 16, sits at his computer, playing “Covert Action Force” online - a hostage rescue game, with complex weaponry. He sits back, yanking his headset off. DANIEL NO! Oh that is SO rubbish. I totally shot you first. The game freezes briefly, before going back to the menu. DANIEL (cont’d) Not again. His mum CAROL, late 30s, pokes her head into the room. CAROL You still on that bloody computer? DANIEL Mum! You have to knock first! CAROL What's all the shouting about? 10. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "DANIEL The internet froze again, it's ruining my scores. Are they still working on the roof? CAROL Don't know. But it's a good excuse to go out and get a bit of fresh air. Go on, it's good for you. DANIEL Okay. After this game. She smiles at him, and leaves, walking into--  INT. BANNISTER FLAT, LIVING ROOM - DAY 36   36  --The living room, where she finds her husband BRIAN watching a TV horse race. The room is sparsely furnished, trying to look posh with very little money. CAROL Well, I tried. BRIAN Tell him the building's on fire. (to TV screen) Come on, you scrawny bastard. The horses on screen approach the finish line. CAROL I wish it was, we might get rehoused quicker. God, I hope the council get their finger out soon. BRIAN They will. Hey, give it a second, we might be rich. The horse race ends. BRIAN (cont’d) Bollocks. Well, there goes a quid. Carol bursts out laughing. CAROL You bet a whole pound on a horse race? Easy there, big spender. Brian shrugs. Smiles, sheepishly.  OMITTED 37   37  INT. BUXTON FLAT, BEDROOM - DAY 38   38  JEFF BUXTON is trying to calm his wife AMY, who is packing a suitcase. She's not hysterical, but is very upset. 11. Copyright 2011 Surya Productions AMY I said leave me alone! JEFF Let's just talk about it. AMY It won't change anything. JEFF Please. She keeps packing. AMY I'll go first thing in the morning. Stay at my mum's. JEFF We can sort this out. I'm so sorry. AMY Really? Were you sorry when you kissed her for the first time? How about the first time you stuck your dick inside her? Were you sorry then? What about the second time? Or the time after that? No answer. She keeps packing the suitcase.  INT. TOP FLOOR HALLWAY - DAY 39   39  Becky goes into her flat. As she's about to close the door, someone appears in the doorway, blocking it. It's KURTIS, late 20s, tattoos, menacing, dangerous. Becky flinches. Kurtis grins, standing too close. KURTIS Hey, blondie. Time to pay up. BECKY Piss off. She starts to close the door, but Kurtis",
      "dialogue_count": 0,
      "word_count": 1843
    },
    {
      "scene_number": 5,
      "slugline": "INT. BECKY'S FLAT, BEDROOM - DAY 47   47  Becky wakes up in bed. Cringes, as she puts a hand to her head. Killer hangover. She stretches. Hears a movement in the room. Looks to her left, and sees RYAN in the bed next to her. About her age, maybe a bit older. Good looking. And now Becky remembers what she got up to last night. BECKY Oh... She gets up quickly, putting on jeans, t-shirt, shoes. She's equally amused and embarrassed.  INT. BECKY'S FLAT, LIVING ROOM - DAY 48   48  Becky takes two Ibuprofen for her headache, then paces around a bit. She's happy, but trying to get used to the idea. She bites her nail, thinking. She checks her phone. There's a text from Liz: \"u saucy cow, hes gorgeous, dont do nething i wdnt do!!!\" Becky smiles. She replies with \"Too late... :)\" and sends it. The phone beeps: \"Unable to send message - try again?\" Becky hits \"Yes\". Beep - same message, unable to send. She frowns. But then RYAN walks in, wearing her dressing gown. It's a bit flowery, and quite short. Becky laughs. RYAN Sorry, this was all I could find. BECKY Suits you. Fancy a coffee? RYAN Now, that's what started all the trouble last night. BECKY This time, I mean an actual coffee. RYAN I'd love one. Becky's slightly skittish around him, trying to make a good impression. He's patient, and amused by the situation. Becky tries to send the text to Liz again, but now the screen says \"NO SERVICE\".  INT. BUXTON FLAT, BEDROOM - DAY 49   49  Amy drags her suitcase towards the hallway, Jeff follows. 18. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "JEFF Amy, I'm sorry. Please, don't go. Let's have some tea, calm down. AMY I am calm. A cup of tea isn’t going to change anything. JEFF Please. I don't want to lose you. She ignores him. Dials a number on her phone. It beeps - \"No Signal\". She tries again. AMY Well, you have. My dad'll pick up my stuff next week.  INT. BANNISTER FLAT, DANIEL'S ROOM - DAY 50   50  Daniel's still playing his game, curtains closed - he's been up all night. He's bleary eyed but still immersed in the game. He sneaks up on a rival player. DANIEL Here we go, here we go... And then the screen freezes again. Daniel shakes the mouse. DANIEL (cont’d) No, no, no! Bollocks! The screen stays frozen. Then a message: \"Connection lost - check your internet settings and try again.\" DANIEL (cont’d) Oh, you're joking. He tries to connect again, but gets the same message. He quits the game, opens an internet browser. Error message: \"Unable to load page - check your network settings.\" He sighs, stands up, stretches, and walks into the hall.  INT. BECKY'S FLAT, LIVING ROOM - DAY 51   51  Ryan walks in from the bedroom, in jeans and t-shirt, as Becky puts the coffees on the table. BECKY I preferred the dressing gown. Looked good. Ladylike. RYAN Yeah, I wasn't feeling it. He smiles at her. They both sit at the table by the window, and drink their coffee. Awkward silence. 19. Copyright 2011 Surya Productions RYAN (cont’d) So. BECKY So! RYAN Great party last night. BECKY It was, yeah. Really good fun. Silence. BECKY (cont’d) I don't do this all the time. RYAN What, drink coffee? BECKY You know what I mean. RYAN I know. BECKY I just... I got out of a long term relationship a while ago. She's not telling him everything. Something very painful is hiding behind the words. Ryan waits patiently, letting her get to it when she wants to. BECKY (cont’d) I haven't really... been out much. I'm not used to it, you know? She runs out of steam. Ryan lets her off the hook. RYAN We had a great time last night. And I'm having",
      "dialogue_count": 0,
      "word_count": 994
    },
    {
      "scene_number": 6,
      "slugline": "INT. BECKY'S FLAT, LIVING ROOM - DAY 53   53  Back in the flat, the sound roars back into full volume as the bullets shatter objects in the room, tearing chunks out of wooden furniture, peppering holes in the walls. Becky stays down, out of the line of fire. No sound of gunfire the whole time, just the impact of the bullets.  INT. BUXTON FLAT, LIVING ROOM - DAY 54   54  Amy gets her handbag and keys from the table. JEFF Amy, please. Don't go. AMY I’ve said all there is to say. Amy faces the window. Sees the ruby red gleam of a laser sight aiming at her face. It dazzles her. She holds up her hand to shield her eyes. SMASH! THUNK! A bullet comes through the window and vaporises her hand, the deflection making it miss her face. Before she has time to scream, another bullet smashes into the side of her stomach, passing through and hitting Jeff in the arm. Amy is thrown backwards into Jeff, knocking them both over. They crash to the ground, pulling a table over with them as they fall. Jeff hits his head and is knocked out, splattered in Amy’s blood. The bullets stop when they’re both out of sight.  INT. BANNISTER FLAT, HALL - DAY 55   55  Daniel comes out of his room, just as his mum Carol comes out of her bedroom. CAROL You're up early. DANIEL Internet's gone again. Over her shoulder, dad Brian opens the bedroom curtains. SMASH, SMASH! Two bullets come through in quick succession, hitting him in the chest and head. He flies backwards, as more bullets come in, hitting the pillows and far wall. CAROL Brian! She starts to run into the bedroom. But Daniel sees the red laser sight, and grabs her arm, yanking her back. 22. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "DANIEL Mum, don't! CAROL I have to, oh God-- DANIEL Someone's shooting! You can't! He holds on with all his strength, in tears, devastated at seeing his dad get killed, but trying his best to save his mum now, she's all he's got left. CAROL Brian... DANIEL Mum, please. Don't go in. Look at the red beam. Finally Carol sees it, coming through the window. She sinks back against Daniel, and they slump against the wall, holding each other, crying, trying not to look at Brian's bullet- riddled body.  INT. THORPE FLAT, BEDROOM - DAY 56   56  Neville and Violet are dressed, ready to go out. Violet checks her hair in the mirror. Neville stops in the hall. His hearing isn't what it used to be. But the noise from the other flats is horribly familiar - soldiers never forget that sound. NEVILLE Vi, get down! VIOLET Eh? What you on about-- And surprisingly quickly for his age, Neville sprints back into the bedroom and leaps onto Violet, knocking them both to the floor-- --Just as the bullets come smashing through the window, shattering the mirror Violet was just looking into. Neville lands on top of Violet, who cries out in pain. Bullets riddle the room, but Neville and Violet are out of sight behind the bed. Neville holds Violet down, staying on top, shielding her with his body.  INT. MARK AND GARY'S FLAT, LIVING ROOM - DAY 57   57  Gary dives behind the sofa, as bullets slam into the walls. Last night's takeaway and beer cans on the floor, his blanket on the sofa. He wets himself, terrified. Mark comes in, half asleep. 23. Copyright 2011 Surya Productions MARK What's all the fucking noise? GARY Get down! Mark's a moving target, and gets a bullet in the leg. It spins him around. Another bullet catches him in the upper arm, taking out a large, fleshy chunk. He hits the floor, screeching in pain.  INT. PAUL'S FLAT, LIVING ROOM - DAY 58   58  Paul, the loner, stands at the side of the curtains, opening them using a drawstring. Bullets come smashing through, and into a large poster ",
      "dialogue_count": 0,
      "word_count": 1146
    },
    {
      "scene_number": 7,
      "slugline": "INT. TOP FLOOR HALLWAY - DAY 65   65  Becky comes out into the hallway. Daniel and his mum Carol are already in the hallway, trembling in fear, with Neville and Violet. So is Paul, brushing glass off himself. BECKY He's been shooting at you too? Anybody hurt? DANIEL We're not hit. My dad... He can't finish. He looks at his mum, and they hug each other, in tears. Becky looks at Paul, who is pale and in shock. PAUL I’m okay. I was lucky. NEVILLE Has anyone got a mobile phone? BECKY I have, but it's not working. PAUL Same here, there's no signal. DANIEL Me too. They look at each other. That's weird. PAUL How come we've all lost our signal, at the same time? BECKY Landlines and internet, too. CAROL Is it some sort of terrorist thing? BECKY I doubt it - why us? Why here? NEVILLE The police will sort it out when they arrive. CAROL But nobody's called them. NEVILLE Yes, but somebody will have heard the shots. 26. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "DANIEL I didn't hear any actual shots. Did you? They all shake their heads. BECKY He must be using a sound silencer. DANIEL Sound suppressor. PAUL Nobody heard it, then. BECKY The other block is empty. There's at least quarter of a mile between us and any other buildings. CAROL So nobody's coming. Oh God. Oh God. We've got to get out of here. DANIEL Don’t, mum. He’s at the front, we can’t get out. CAROL We’ll use the back door then. Come on, Daniel. She walks over to the lift, Daniel following.  INT. TOP FLOOR LIFT RECESS - DAY 65a   65a  The lift isn't in the line of fire from any windows, and Carol goes over to it, pressing the call button. But there's no movement, and the button doesn't light up. There's a piece of paper on the wall by the lift buttons, but nobody notices it yet. Carol presses the button again, but there’s still nothing. CAROL Light’s not even coming on, what’s the matter with it? Carol sighs in frustration, and they go back.  INT. TOP FLOOR HALLWAY - DAY 65b   65b  Carol is stumped. 27. Copyright 2011 Surya Productions CAROL The lift should be working. I think it’s switched off. Why is it switched off? BECKY Probably the same reason the phones are down. It's okay. We’ll get help to come to us somehow. CAROL How? How are we going to do that? Becky is at a loss. BECKY I don't know. The door to Mark and Gary's flat bursts open, and the two of them come out, Mark limping from his leg wound, arm wound bleeding, Gary supporting his weight. GARY Help! For fuck's sake-- He stops, surprised at seeing everyone out in the hallway. GARY (cont’d) Did you hear that? Someone was shooting into our flat! BECKY Same for all of us. GARY Eh? Look, Mark's been hurt. Can someone help? Everyone looks at him, unwilling to help. CAROL Why should we? You and that Kurtis bastard never help us. GARY Oh, come on! This is a bit different, isn't it? Nobody moves. GARY (cont’d) He's gonna die if nobody helps him. Violet eventually steps forward, she's too nice. VIOLET I can do",
      "dialogue_count": 0,
      "word_count": 4080
    },
    {
      "scene_number": 8,
      "slugline": "INT. TOP FLOOR LIFT RECESS - DAY 81   81  Becky comes back, and carefully holds the mirror so she can see into the lift shaft. She sees what's in there, and quickly waves her hand in front of the opening. She looks with the mirror again, and then stands up, peering around the corner. She calls out to everyone. BECKY There's nobody there. It's some sort of a trap, but I think it's just a one-off. Kurtis and Paul look. Neville, Violet and Carol have come to look now, too. A trap has been rigged up on the far wall of the lift. A modified, sawn-off double-barrelled shotgun with a wire attached to the trigger and a small control box. There's a small camera on top of the assembly. Both triggers have been pulled back. The shotgun can only take two shells at a time. Kurtis climbs in, and pulls it off the wall, bringing it back out. He pulls the wires and camera off, and smashes the camera under his foot. He checks the gun, but apart from spent shells, it's empty. KURTIS Shit. CAROL Great. He could have put these things all over the place. BECKY So we'll have to be extra careful. PAUL He might not even be outside. This could all be automated. BECKY No, he's here. This stuff, sure. But that's definitely him outside. NEVILLE How do you know? BECKY He's taken the phones out, but left all the lights on. He wants to watch us suffer. 45. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 258
    },
    {
      "scene_number": 9,
      "slugline": "INT. TOP FLOOR HALLWAY - DAY 82   82  Neville takes Jeff's body into his own flat, to keep him out of the way, then he and Violet check on Jenny, who still isn’t talking. Everybody else is now back in the hallway. Becky and Paul regroup. BECKY Okay. Let’s try that again.  INT. TOP FLOOR LIFT RECESS - DAY 83   83  Becky, Paul and Kurtis walk over to the open lift shaft. They lean in, and Becky shines the torch down.  INT. LIFT SHAFT - DAY 84   84  She shines the torch down the shaft. It's dark and creepy. But there's a ladder, going all the way down. The lift car is at the bottom. PAUL Well. Long way down. BECKY Good job there's a ladder. Who wants to go first? Nobody's too eager. Becky rolls her eyes. BECKY (cont’d) I really need to stop asking stupid questions like that. She swings herself around and starts climbing down the ladder, slowly, carefully. Once there is room, Paul and Kurtis follow her. Slowly they make their way down the ladder.  INT. TOP FLOOR HALLWAY - DAY 85   85  The rest of the residents sit around awkwardly. Jenny still sits in silence, almost in a vegetative state. Neville and Violet stay together, keeping a brave face. Carol paces, while Daniel plays a game on his iPod Touch. CAROL Where did you get that? Did you go back in for it? I told you-- DANIEL No, it was in my pocket. CAROL Oh. Well, don't go back in there. It's not safe. 46. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "DANIEL I know. I remember what happened. Stop talking to me like I'm stupid. CAROL I'll talk to you how I like, I'm your bloody mother. DANIEL Mum. Stop it. Please. Carol keeps pacing. Daniel retreats further into his game. Mark and Gary sit together, whispering nervously. GARY How's your arm? MARK In fucking agony, what do you think? Give me some more pills. GARY It hasn't been four hours, you should wait. Says on the label. MARK Give them to me! Gary hands them over, and Mark pops another few. Silence. Gary wants to talk, Mark definitely doesn't. GARY Weird, this, isn't it? MARK Yeah. It's weird. That's the end of that conversation. Silence again. Gary can't let it go. GARY Don’t take any more pills for another four hours, at least. MARK Please stop talking.  INT. LIFT SHAFT - DAY 86   86  Becky, Paul, and Kurtis reach the top of the lift car. They open the roof panel and start climbing inside.  INT. GROUND FLOOR LIFT RECESS - DAY 87   87  A thumping and clanking sound comes from the lift doors. 47. Copyright 2011 Surya Productions The tip of a screwdriver pokes through. Then another. The doors widen an inch. Then fingers poke through, and the doors are slowly pulled open a crack. Becky carefully glances out to make sure there aren't any traps. When the coast is clear, Becky, Paul and Kurtis pull the lift doors all the way open, and come out.  INT. GROUND FLOOR HALLWAY - DAY 87a   87a  Becky, Paul and Kurtis head for the back door. It has another sheet of paper taped to it. The same three faces, the same design. PAUL Okay, that's starting to creep me out a bit. KURTIS Come on. He pushes his way past, and tries the door. It's locked. KURTIS (cont’d) Fine, it's locked. Back up we go. BECKY Hang on, don't give up so easily. We've got our own keys. She holds up her screwdriver. Points at the door hinges - they're on this side of the door and wall, and the screws are easily accessible. She starts unscrewing one of the screws in the top hinge. BECKY (cont’d) Surprised y",
      "dialogue_count": 0,
      "word_count": 2703
    },
    {
      "scene_number": 10,
      "slugline": "INT. MARK AND GARY'S FLAT, BEDROOM - NIGHT 95   95  Kurtis holds Gary by the neck, up against the wall. Mark is on the floor next to him, in the middle of the room, trying to crawl away. Kurtis kicks Mark's leg wound. Then STAMPS on his knee, breaking it. Mark screeches in pain. BECKY (O.S.) Kurtis! Stop! Kurtis grabs a stapler from the table, opens it out, and STAPLES one of the sheets of paper on to Mark's chest, and the other one to Gary's chest. He drags Mark up on to the bed, leaving him there, on his back. GARY Kurtis, please, don't. I'll do anything you want! Anything! KURTIS This is what I want. He yanks him over to the window, stands to one side of it. Then pulls back the curtain. Mark is now in the line of fire. He panics, and tries crawling away. But it's too late. Several bullets smash through the window, catching Mark in the chest and head, killing him. GARY No! Ah, shit! Gary struggles. But Kurtis headbutts him, dazing him. And now Kurtis SHOVES Gary away from him, sending him out in front of the window. Gary tries to get out of the line of fire, but the shooter is ready this time, quicker. Two bullets. One in the head, one in the chest. Gary goes down. Dead. Kurtis takes the drawing off Gary's chest, and carefully holds it up to the window, keeping his fingers clear. He pauses for a second, then shouts out the window. KURTIS It was these two who did it. You must know that, cause you sprayed their front door. Well, they're both dead. Okay? You happy? Can we go now? Silence. Not really expecting an answer. Just in case, Kurtis crawls along the floor to the door. 58. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 309
    },
    {
      "scene_number": 11,
      "slugline": "INT. TOP FLOOR HALLWAY - NIGHT 96   96  The table is removed from behind the door, and the door opens. Kurtis comes out. BECKY What did you do? KURTIS You know what I did. I gave him what he wanted. PAUL You killed them. KURTIS No. HE killed them. BECKY Jesus Christ. They all stand around awkwardly. Kurtis shrugs. KURTIS All right, I did a bad thing, so fucking what? I took one for the team, nobody else has to feel guilty. Anyway, what do you care? They beat the shit out of you. BECKY Gary would have climbed down from the roof, we could have used him. KURTIS Well now he doesn't need to. They killed that kid, the sniper killed them. We're safe. BECKY Oh, and did you stand in front of the window, to test your theory? Kurtis hesitates. KURTIS Well... no. BECKY So you're not sure. KURTIS Of course I'm not fucking sure! He’s a nutcase. NEVILLE There must be a safe way to check. 59. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "KURTIS Stick an arm out. Worst case, you lose an arm. Like Mark. Live to fight another day. Unlike Mark. CAROL This is stupid. We gave him those two, he'll leave us alone now. Come on, Daniel. DANIEL What? CAROL We're leaving. Come on. She stands up and takes his hand, but he pulls away. DANIEL No, we can't. CAROL You'll do as you're told, for once. Come on, he's gone. DANIEL He might not be! VIOLET Carol, we don't know if he is. CAROL We're innocent. My boy is innocent. He'll let us go. BECKY I know you're upset. We all are. CAROL Oh, are we? You only met your bloke last night. I've been married to my husband for eighteen years. BECKY Excuse me? CAROL Well, it's hardly the same, is it? Losing a husband, compared to losing a one night stand. Becky SLAPS Carol across the face. BECKY How dare you? How dare you decide who has suffered more? 60. Copyright 2011 Surya Productions CAROL I'll decide whatever I want. And right now, I've decided me and my son are leaving. DANIEL Mum, I'm not going out, I'm scared. CAROL Oh for God's sake, come on. She grabs his hand, and starts yanking him along the hallway, towards the stairs, towards possible danger. NEVILLE Carol, stop! CAROL Piss off. BECKY Don't do this. CAROL Are you going to stop me? BECKY If we have to. Becky, Paul and Kurtis are there, ready to intervene. CAROL Get out of my way. BECKY Don't take Daniel. Just in case. CAROL You what? BECKY If you're wrong, then you're both dead. Just think about this. Carol looks at her. Then at Daniel's pale, terrified face. Horrified at what she's become. She realises she’s being unreasonable, and lets go of his hand. CAROL Daniel - I'll go and get help. Okay? Don't be scared. Just stay here, and everything will be fine. DANIEL Mum, don't, please. I love you. They hug, tightly. 61. Copyright 2011 Surya Productions CAROL I love you too, sweetheart, but I'll be fine. You’ll see. And then you can all follow me out. NEVILLE Carol, if you're determined to go, why not risk an arm first? ",
      "dialogue_count": 0,
      "word_count": 967
    },
    {
      "scene_number": 12,
      "slugline": "EXT. TOWER BLOCK 31 - NIGHT 100   100  Daniel grabs a sheet of thick corrugated iron from the pile of building materials on the ground. Crying, he holds it up as a shield, and makes a run for the corner. The red laser sight finds him. Bullets slam into the metal. DANIEL I'm getting away! I'll get help! Upstairs, the others shout encouragement. More bullets slam into the metal sheet, knocking him sideways, but it looks like he's going to make it. Until one bullet catches one hand holding the metal, shattering his fingers. He drops the metal, screaming, but still shielded. He drags it along with his other hand. He's almost at the corner. He shuffles along. Another bullet gets under the metal, and shatters his ankle. He collapses, screaming louder, and the metal falls away. He's completely unprotected. Two bullets catch him in the side, one in the stomach,   one in the throat. Daniel hits the ground, dying. As he breathes, blood bubbles in his neck wound, and pumps out thick and fast. And the light slowly goes out of his eyes.  INT. TOP FLOOR HALLWAY - NIGHT 101   101  Only Becky, Paul, Neville, Violet, and Kurtis are left. Nobody can speak for a moment. NEVILLE That answers that. Jenny was right. He points to the door of Mark and Gary's flat, with the three faces spray painted on it. NEVILLE (cont’d) He wants to torture us for as long as possible. They all stew on that for a while. Becky's very quiet. Paul looks over at the fire hose. PAUL So I suppose we have to try climbing down from the roof. Becky? She snaps out of it, and nods. BECKY Yeah. Looks like we have no choice. Let’s take a break first. 64. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 302
    },
    {
      "scene_number": 13,
      "slugline": "EXT. TOWER BLOCK 31 - NIGHT 102   102  Silence. The city sleeps.  INT. TOP FLOOR HALLWAY - NIGHT 103   103  They all sit around on some cushions and chairs, eating snacks and drinking coffee. All apart from Becky, who stands at one end, too wired to sit. Paul comes over to her. PAUL Let me go. Let me climb off the roof, I mean. BECKY Why? PAUL Because I need to do something. I'm tired of waiting around for him to kill us. BECKY The fire hoses might not hold. You could die. PAUL If they don't, then we're all dead anyway. Becky looks at the others. BECKY It was my idea. I should be the one to take the risk. PAUL We need someone with ideas, to keep a clear head. We need you. BECKY Me? I don't know what I'm doing! PAUL You're doing pretty well so far. BECKY Maybe we could send a signal from the roof, instead. PAUL Yeah, then he might come in and finish us off. Let me climb down. They hesitate. Becky's out of ideas. BECKY I can't take the responsibility. 65. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "PAUL That's why I'm volunteering. It won't be on your shoulders if anything goes wrong. Becky knows he's right. PAUL (cont’d) We have to try. BECKY I know. If anything happens... do you want me to pass on a message to anyone? Family, friends? PAUL No. I don't have anyone. There's just me. BECKY I'm sorry. PAUL It's okay. You get used to it. Sundays are the worst. The most depressing day of the week. Becky checks her watch. 2am. BECKY It's technically Sunday now. Paul smiles. PAUL So it is. Well, it's not the worst Sunday I've ever had. Becky smiles too. Then quickly hugs Paul, impulsively. He's so surprised, he almost forgets to hug back. BECKY I hope you make it. PAUL Thanks. Just remember that when you're tying the hoses together.  EXT. TOWER BLOCK 31 - NIGHT 104   104  It's still dark. Dawn seems a long way away. Caption: SUNDAY  INT. TOP FLOOR HALLWAY - NIGHT 105   105  Everyone is involved in unravelling all the fire hoses from the coils in the cupboard, and then tying them together, to make a long, thick rope. 66. Copyright 2011 Surya Productions OMITTED 106   106  INT. TOP FLOOR HALLWAY - NIGHT 107   107  Almost ready. Paul is shaking, terrified. The others look at him with concern. BECKY Jesus, you're shaking. You don't have to do this. PAUL It's not that. I need a drink. BECKY It's probably better if you don't, you need to stay sharp. PAUL No, I mean - I need a drink. I can't do this without one. Becky realises what he means. BECKY Oh. Oh, right. KURTIS You're an alco? Fuck me. BECKY Yeah, and you're a drug dealer. PAUL I ran out of booze about 24 hours ago. I’m not coping well. BECKY Has anyone got anything? VIOLET I think I've got some Bacardi, in the kitchen. PAUL That'll do. Anything. KURTIS Fuck that. Might be his last drink, it should be something decent. Fucking Bacardi... Hang on. He disappears into his flat for a moment. PAUL Sorry. I have been trying to stop. You must all think I'm pathetic. 67. Copyright 2011 Surya Productions NEVILLE We all have",
      "dialogue_count": 0,
      "word_count": 2977
    },
    {
      "scene_number": 14,
      "slugline": "INT. LIFT SHAFT - NIGHT 121   121  Becky and Neville climb down the ladder.  INT. GROUND FLOOR LIFT RECESS - NIGHT 122   122  Becky and Neville are down. Becky shouts up the shaft. BECKY We're down!  INT. TOP FLOOR HALLWAY - NIGHT 123   123  Kurtis hears this, and springs into action. He heads into his flat.  INT. GROUND FLOOR HALLWAY - NIGHT 124   124  Becky and Neville put their rucksacks down near the door, and wait nearby.  INT. KURTIS’ FLAT, LIVING ROOM - NIGHT 125   125  Kurtis lights the newspaper balls, and throws them into the room - on to the areas coated in lighter fluid. Whoosh! The fire takes hold in several spots. Kurtis hurries out.  INT. KURTIS’ FLAT, KITCHEN - NIGHT 126   126  Kurtis runs in, switches on the microwave (containing all the metal objects), and runs out.  INT. TOP FLOOR HALLWAY - NIGHT 127   127  Kurtis runs down the hallway.  INT. LIFT SHAFT - NIGHT 128   128  Kurtis climbs down the ladder, as fast as he can.  INT. KURTIS’ FLAT, LIVING ROOM - NIGHT 129   129  The fire has taken hold quite fiercely now.  INT. KURTIS’ FLAT, KITCHEN - NIGHT 130   130  The gas hisses out of the gas hobs, and the oven. The microwave crackles and sparks as the metal inside it begins to flare up. WHUMP! The microwave explodes. The gas from the oven catches light. 79. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 237
    },
    {
      "scene_number": 15,
      "slugline": "INT. TOP FLOOR HALLWAY - NIGHT 131   131  BOOM! A fireball explodes out from Kurtis’ doorway, as the blaze rages.  INT. LIFT SHAFT - NIGHT 132   132  The building shakes. Kurtis loses his grip on the ladder, and falls the last fifteen feet, yelling all the way. He lands on the lift roof, on his legs, and there's a loud CRACK. He clutches his ankle. KURTIS Ahhhhh, fuck!  INT. GROUND FLOOR LIFT RECESS - NIGHT 133   133  Becky runs over to see what happened. BECKY Kurtis? KURTIS (O.S.) I've broken my fucking ankle. Help me down.  INT. LIFT - NIGHT 134   134  Becky manhandles Kurtis down. He cries out in agony. KURTIS Careful! For fuck's sake. BECKY I'm trying!  INT. GROUND FLOOR HALLWAY - NIGHT 135   135  Becky helps Kurtis in. They manage to get him sitting down. Becky looks around at what they've got down here. All the flats are boarded up. She heads for the nearest one, and attacks it with the sledgehammer, until the boards smash open. She heads inside.  INT. ABANDONED FLAT, LIVING ROOM - NIGHT 136   136  Becky walks in, cautiously. The windows of the flat are boarded up. There's old equipment scattered around - broom, paint tins, rags. She grabs the broom and the rags.  INT. GROUND FLOOR HALLWAY - NIGHT 137   137  Becky comes out. BECKY Hold still. 80. Copyright 2011 Surya Productions",
      "characters": [],
      "action_text": "She snaps the broom in half, and lies it next to Kurtis's leg, to form a splint. She ties it to him with the rags. KURTIS Ow. OW! BECKY Oh don’t be such a baby. A muffled thump from far up above, as the fire rages.  EXT. TOWER BLOCK 31 - DAWN 138   138  It's now dawn. The top corner of the building roof is on fire. There's no mistaking it, it must be very visible for miles around.  INT. GROUND FLOOR HALLWAY - DAWN 139   139  Becky paces. Kurtis sits against the wall, while Neville stands around. KURTIS So what now? BECKY We wait. KURTIS For how long? BECKY Until the police turn up and catch him, and tell us it’s safe. A car is approaching. Becky grins. BECKY (cont’d) There you go.  EXT. TOWER BLOCK 31 - DAWN 140   140  A pickup truck pulls up, lots of tools in the back. Inside are Kevin Rawlins, the property developer, and Eddie from Grainger Demolition. Kevin's talking on his mobile. KEVIN So tell him I'll be round to sort it tomorrow if he doesn't. Hello? He looks at his mobile. \"NO SERVICE\". KEVIN (cont’d) What the hell's going on? Eddie looks up at the top floor, surprised. EDDIE Er, Kevin... 81. Copyright 2011 Surya Productions They open their doors and stand by the side of the car. They look up at the inferno that the top floor has become. Kevin is stunned. KEVIN Christ almighty. EDDIE Call someone, quick. KEVIN I can't, my phone's gone to shit. Eddie tries his own phone. Same thing. EDDIE Same here. We in a dead zone or something? KEVIN No, I was just talking to Dave a minute ago. Bloody hell. I hope there's nobody in there. EDDIE You maintain the smoke alarms, don't you? Kevin looks at him, guiltily. They look at the blaze. Eddie spots Carol's body, just visible near the entrance. EDDIE (cont’d) Jesus, is that a dead body? A chunk of his leg explodes as a bullet tears through it. EDDIE (cont’d) Aaaaghhhh! Eddie falls, the next bullet missing him. KEVIN Fuck! He lurches sideways in shock, and the next bullet just misses him too. He dives into the pickup. Bull",
      "dialogue_count": 0,
      "word_count": 2650
    }
  ]
}