{
  "slug": "toy-story-4-2019",
  "title": "toy story 4",
  "genre": "drama",
  "format": "film",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 17122,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BONNIE’S BEDROOM - NIGHT ...to past bedtime. A SLEEPING BONNIE relaxes her hold on Forky...who jumps back into the wastebasket... ...right into Woody’s exhausted arms. This time, Woody climbs up on the bed himself to put Forky back on the pillow... FORKY No, no, no...Big girl scary! WOODY (hushed) Like I said before, Bonnie’s not scary. She loves you and you need to-- Bonnie rolls over in her sleep, and PULLS WOODY CLOSE TO HER. Woody (still holding Forky) smiles with bliss...and relaxes into Bonnie’s embrace. A feeling he’d nearly forgotten. DISSOLVE TO: INT. BONNIE’S ROOM - MORNING Woody wakes. Bonnie’s still asleep, but Forky is gone! In a panic, Woody crawls to the edge of the bed. WOODY (loud whisper) Forky?! BELOW, INSIDE THE WASTEBASKET Forky sleeps like a baby, nestled in the trash. Woody SIGHS WITH RELIEF. Goes to fish him out -- BONNIE’S DAD (O.S.) Bonnie! Woody is forced to go limp. Tumbles off the side. Hits the wastebasket. Forky spills out onto the floor. DAD ENTERS. BONNIE’S DAD (CONT'D) Let’s go! Rise and shine! Dad STEPS ON WOODY as walks to the bed. Bonnie stirs awake. BONNIE’S DAD Who wants to go on a road trip? 23. ©2019 DISNEY•PIXAR",
      "characters": [],
      "action_text": "BONNIE Me! I'm gonna bring Dolly, and Buttercup, and Forky, and... (looks around) Forky? Where are you? BONNIE’S DAD He’s gotta be here somewhere... BELOW, Woody tosses Forky up on the bed. Bonnie finds him. Hugs Forky tight: BONNIE Forky! BONNIE’S DAD Come on. Let’s eat some breakfast and hit the road! BONNIE Let’s go Forky! Again, Dad steps on Woody's head as they exit. Door shuts. Woody sits up. Rubber head caved in, woozy. Buzz steps up. BUZZ Whoa. He’s quite a handful Woody. You need help with him on the road trip? WOODY No. No, no. I got it, I got it. Woody gets to his feet. Holds his nose and blows -- his head POPS back into shape. WOODY We'll just be stuck in an RV, he can't get far. I got this! I got it. EXT./INT. RV TRAILER - VARIOUS LOCATIONS As the family travels West, A SHORT SERIES OF MOMENTS play of Bonnie playing with Forky and her toys. At every chance, Forky tries to throw himself away, and Woody is forced to save him. All to the RANDY NEWMAN SONG: “I CAN’T LET YOU THROW YOURSELF AWAY.” 24. ©2019 DISNEY•PIXAR",
      "dialogue_count": 0,
      "word_count": 401
    },
    {
      "scene_number": 2,
      "slugline": "EXT. RV - LATE NIGHT The RV driving down a wooded highway. Passes a HIGHWAY DIRECTION SIGN FOR “GRAND BASIN”. INT. RV TRAILER - CONTINUOUS Bonnie sleeps, buckled up at the kitchen table. Holds a frustrated Forky tightly in her hand. ON WOODY He lies slumped on the floor, keeping his tired eyes trained on Forky. Buzz sneaks his way over. BUZZ Hey Buddy. WOODY Hey, Buzz. Buzz sits down beside his old friend. BUZZ You doing okay? WOODY I don’t know, Buzz, I know you weren’t around when Andy was little but...I don’t remember it being this hard... They glance up at Bonnie as she stirs in her sleep. BUZZ Want me to take next watch? I'll keep an eye on Forky. WOODY No, no. I need to do this. That little voice inside me would never leave me alone if I gave up. BUZZ Hmmm... Who do you think it is? WOODY Who? BUZZ The voice inside of you. Who do you think it is? 25. ©2019 DISNEY•PIXAR",
      "characters": [],
      "action_text": "WOODY Uh. Me? You know, my conscience? (off Buzz’s puzzled look) The part of you that...tells you things? What you’re really thinking? Buzz considers this. BUZZ Fascinating. So your inner voice... advises you. Buzz taps Woody’s PULL STRING RING...then ponders his own VOICE COMMAND BUTTON. Presses it -- BUZZ VOICEBOX “IT’S A SECRET MISSION IN UNCHARTED SPACE. LET’S GO!” Woody jumps on Buzz to quiet him. They glance up at Bonnie -- still sleeping. PHEW -- Wait. Bonnie’s HAND IS EMPTY! BUZZ Where’s Forky? Frantically, they scan the room. Find Forky on the REAR BED...waddling towards the OPEN REAR WINDOW! WOODY Oh no! Forky! Forky! FORKY I am not a toy! I’m a spork! I was made for soup, salad, maybe chili, and then the trash. I’m litter. Forky jumps out the window!! FORKY (CONT'D) Freedom! Woody freaks! Now all the other toys are up. Everyone forced to SPEAK IN WHISPERS: WOODY Hamm, how far to our next stop? Hamm peeks up front at GPS DISPLAY SCREEN. HAMM 5.32 miles, give or take. 26. ©2019 DISNEY•PIXAR WOODY I can make that. I’ll meet you at the RV park. BUZZ Woody hold on a minute-- Too late. Woody is already climbing out the window... OUTSIDE THE RV Woody swings down to the REAR BUMPER. Stares down at the ROARING HIGHWAY. This is crazy. Before he can commit to jumping, the RV HITS A POTHOLE. Woody goes tumbling to the ground. Hard. WOODY’S UPSIDE-DOWN POV on the RV lights shrinking. He gets up. Dusts himself off. Straightens his hat... WOODY (calls out) Forky! ...and starts walking. EXT. HIGHWAY - NIGHT Woody walks down the dark, empty road. WOODY Forky, where are you? Woody stops. Hears a STRUGGLE in the grass. Finds Forky stuck with his prongs embedded in the dirt. EXT. HIGHWAY - LATER Woody is now dragging Forky by his pipe cleaner hand. FORKY Carry me? WOODY No. FORKY Why do I have to be a toy? 27. ©2019 DISNEY•PIXAR WOODY Because you have Bonnie’s name written on the bottom of your sticks. FORKY Why do I have Bonnie's name written on the bottom of my sticks? WOO",
      "dialogue_count": 0,
      "word_count": 1094
    },
    {
      "scene_number": 3,
      "slugline": "EXT. GRAND BASIN - MAIN STREET - DAWN A quaint turn-of-the-century, roadside town. Made up of a few streets. Only one of everything. A banner over the street advertises “CARNIVAL DAYS”. The entire town still asleep. Nothing moves, except... TWO SMALL TOYS Woody and Forky skirt cautiously along the empty street, trying to stay hidden. Woody spies the illuminated “RV PARK” SIGN, poking above the one-story buildings, one street over. WOODY Forky, look. Bonnie’s right over there. FORKY Hurry! Forky starts running towards the RV park. Woody is right behind him -- then stops short. POINTS OF LIGHT dot the ground at his feet? He looks up at a STOREFRONT WINDOW to see... BO PEEP’S LAMP Like out of a dream, it GLOWS on display amongst ANTIQUES. What the...? Woody walks towards it, like a mirage. Forky realizes Woody isn’t with him. Returns. FORKY Woody? WOODY Bo...? Woody gets a good look at the lamp. Yep, it’s hers. Glances back at the RV park sign. Makes a decision...and heads for the STORE’S FRONT DOOR. FORKY Woody? Aren’t we - aren’t we going to Bonnie? Woody peers into the dark store. Assesses the locked door. WOODY I know, I know, but my friend might be in there. 32. ©2019 DISNEY•PIXAR",
      "characters": [],
      "action_text": "FORKY Friend? WOODY Uh? A friend...Well a friend is like you and me. FORKY Trash? WOODY Tra--like...yes. And I’m very worried that she might be lost. FORKY But Woody, Bonnie’s right there. WOODY Yeah, we’ll have you back before she wakes up. Come on. Clutching Forky, Woody climbs through the FRONT DOOR MAIL SLOT. The name of the store reads: SECOND CHANCE ANTIQUES. INT. ANTIQUE STORE - CONTINUOUS The two toys stand in the midst of an OVERWHELMING COLLECTION OF ANTIQUES. To them, it’s a small city, the mis-matched cabinetry are like skyscrapers, the aisles avenues, but it’s chaotic - a virtual maze. It feels more like a spooky museum. VARIOUS SHOTS of Woody and Forky wandering the store. Every time Woody calls out, Forky mimics him: WOODY Bo? FORKY Bo? Nothing. The store is dead. Forky starts to play with the word “Bo”. Bored. FORKY Bo-bo-bo-bo-bo-bo! - Can we go back to Bonnie now? I don't see your friend. Woody can’t hide his disappointment. 33. ©2019 DISNEY•PIXAR WOODY Yeah okay... she’s not in here. Come on, let’s go. The sound of SQUEAKY WHEELS... It’s coming towards them! Woody pulls Forky behind some FLOOR-LEVEL KNICK-KNACKS. They watch as AROUND THE CORNER appears... ...A BABY DOLL CARRIAGE. And it’s being walked by a VENTRILOQUIST DUMMY?! No emotions. Just a slow, mindless stroll. FORKY Is that Bo? -- The dummy stops. Its head snaps unnaturally far over its shoulder, and STARES STRAIGHT AT THEM. Caught, Woody steps out. All casual. WOODY Uh... Hey, Howdy, hey there. Sorry to bother you, um, but-- VOICE (O.S.) (happy chuckle) Why you’re not a bother at all. A BABY DOLL (GABBY GABBY) sits up in the carriage. Smiles. GABBY GABBY We were just out for my early morning stroll - and look - (happy laugh) - We met you! My name is Gabby Gabby. And this is my very good friend Benson. Benson’s hinged jaw opens for a creepy dummy smile. WOODY Woody. Pleasure to meet you. GABBY GABBY Well it’s nice to meet you Woody. And you are...? WOODY This is Forky. FORKY I’m trash. 3",
      "dialogue_count": 0,
      "word_count": 13526
    },
    {
      "scene_number": 4,
      "slugline": "EXT. MIDWAY GAME BOOTH ROOFTOPS - NIGHT Bo and Woody lead the toys, jumping across the tops of the game booths. They can spot the RV IN THE DISTANCE, lurching towards the carousel! GIGGLE MCDIMPLES Got a visual on the RV heading southbound. Woody looks back -- Gabby has stopped at the edge of the roof, looking down at something... WOODY Gabby? Woody rush over to her -- then sees what has her attention. A LOST LITTLE GIRL (6) stands in the shadows behind the midway. Scared, alone. Crying. GABBY GABBY I think she’s lost. Gabby turns to Woody. A plea in her eyes. ...Woody gets it. WOODY Are you sure? Gabby nods. Bo joins them. Tracks their gaze to the lost girl. Bo’s eyes meet Woody’s, already understanding. WOODY Change of plans. BACK AT THE RV It lurches down the street. The interior lights strobe...car windows randomly open and shut... UNDER THE DASH, Mrs. Potato Head unplugs-and-plugs electrical connectors. A POLICE CAR appears behind them. POLICE OFFICER (over speaker) Pull. Over. 111. ©2019 DISNEY•PIXAR",
      "characters": [],
      "action_text": "BONNIE’S DAD I-I can’t! This is a rental! I don’t know what’s happening! BACK AT THE CARNIVAL The Lost Girl cowers from the foot traffic. Afraid to make her plight known. NEAR HER FEET, the toys now hide BEHIND STORAGE CRATES. Woody and Bo flank Gabby Gabby: GABBY GABBY I’m so nervous. What if she doesn't like me? WOODY Gabby-- GABBY GABBY I don’t know if I can do this... WOODY Gabby, it’s just like you said...this is the most noble thing a toy can do. Gabby looks to Bo. She gives a nod of encouragement. Coaxes Gabby out into the open, behind the Lost Girl: BO Okay. Just edge yourself a bit into the light - Not too far...That’s it... Gabby, now exposed, sits on the ground. Goes into toy mode. BO (CONT’D) ...Perfect. Woody cues Ducky & Bunny, hiding on the other side. BUNNY Winner, winner... DUCKY Chicken dinner. They gently ROLL A SOFTBALL in front of the girl. She watches it roll past... ...and bump into Gabby Gabby. 112. ©2019 DISNEY•PIXAR Sniffling, she walks over to the doll...PICKS GABBY UP. LOST GIRL ...Are you lost too? Tries Gabby's pullstring: GABBY GABBY VOICEBOX “I’M GABBY GABBY. WILL YOU BE MY FRIEND?” She hugs Gabby Gabby tight. LOST GIRL I'll help you. THE TOYS WATCH as the Lost Girl, with newfound courage from the doll in her arms, approach a PASSING SECURITY GUARD. LOST GIRL Excuse me, can you help us? SECURITY GUARD Oh, honey, what’s wrong? LOST GIRL I can’t find my mom and dad. The Security Guard takes the Lost Girl’s hand... SECURITY GUARD It’s okay. I’ll help you find them. I’m sure they’re not far. ...and leads her and Gabby Gabby away. MOMENTS LATER - ATOP THE CAROUSEL THE TOY GANG WATCHES FROM ABOVE as the Lost Girl is reunited with her WORRIED PARENTS. LOST GIRL Mommy! Daddy! The girl runs into her parent's arms, safe. Shows them Gabby Gabby... LOST GIRL ...I couldn't find you, and then I found this doll... LOST GIRL’S MOM You did? 113. ©2019 DISNEY•PIXAR LOST GIRL Her Name is Gabby Gabby. CLOSE ON GABBY GABBY From over the girl’s shoulder, G",
      "dialogue_count": 0,
      "word_count": 2101
    }
  ]
}