{
  "slug": "true-detective-102-seeing-things-2014",
  "title": "true detective 102 seeing things",
  "genre": "drama",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 1,
  "characters": [
    "COHLE"
  ],
  "total_words": 7892,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. COHLE’S APARTMENT - DAY  Early morning, cold, windows frosted. Rust Cohle rises to  start his day. His bed is a   mattress   on the floor, surrounded  by   books . No furnishings. A   crucifix   on the wall. FOLLOW him  to a narrow bathroom, it’s mirror as he stares at himself:  sleep-deprived, hollow-cheeked--  COHLE (V.O.)  Days of nothing. That’s what it’s  like, yeah? You work cases...  INT. HART HOME, BEDROOM - DAY  Early morning. In his big bed with his WIFE, MAGGIE, Hart is  happily woken by his TWO DAUGHTERS running into the room,  bouncing on the bed. Embraces, tickling--  COHLE (V.O.)  You talk, you listen, look for  something to break. Days of  searching. Like lost dogs...  On the groggy, familial joy of Hart’s morning wake-up--  INT. TAXIDERMIST - DAY  A MAN (50s) stands behind the counter inside a Taxidermist’s,  stuffed, mounted ANIMALS clogging the walls all around, game  animals- deer, duck, quail, a bear’s head. Cohle and Hart  stand on the other side, asking the MAN a question, dialogue  only voice-over--  COHLE (V.O.)  Talked to something like ten  taxidermists. Nobody had ever done  a turkey vulture, much less sold  one.  The Taxidermist shakes his head to answer their question--  INT. CID CAR, MOVING - DAY  Hart drives while Cohle looks over the NOTES that fill the  big legal tablet he uses. Hart watches him peripherally, the  portfolio spread across his lap--  HART  Hey. Other night, you were over for  dinner... Why didn’t you go home,  when I had Chris call for you?  17.",
      "characters": [],
      "action_text": "COHLE  ...I don’t know. I guess I’d  sobered up. And it wasn’t as bad as  I thought, meeting your family. I  liked talking to them.  HART  ‘Bad’? Why’d you think it’d be bad?  COHLE  I didn’t. Look--  He closes his portfolio, sighs--  COHLE (CONT’D)  I was married, Marty. Three years.  We had a baby girl. She died, two  years old. Car accident. Marriage  couldn’t handle it.  HART  Shit, man. I’m sorry. Sorry to hear  that. I didn’t--  COHLE  S’alright. It was just me, not you  guys. I was worried... being around  that kind of thing...  After a beat, Rust goes back to looking at his notes, and  Martin glances at him from the corner of his eyes, a new  sympathy in his appraisal--  INT. INTERROGATION ROOM - DAY  51, Rust Cohle smokes, listens to his interviewer. Perhaps  slightly buzzed, he speaks a little discursively when he  answers--  COHLE  Yeah. Just married once. Came close  another time. That was later on.  Marty introduced us. She broke it  off. For the best. I gave her  cause... I can be hard on people.  He puts his cigarette out, thinks, sips his beer. In an oddly  confessional outpouring--  COHLE (CONT’D)  I can pick people apart. I don’t  mean to. But I can be critical. I  have problems getting angry...  18.  (MORE) I’ve had the thought before that  I’m not good for other people. Like  it’s no good for them to be around  me long. I wear them down. They  become unhappy. I don’t mean for  that. But life works its way  through you... I can’t say the job  made me this way. More like, me  being this way made me right for  the job. I don’t know. I used to  think about it a lot. Not so much  now. You reach an age and you  understand who you are...  A beat as he stares into the camera, unable to fully hide the  pathos in his eyes--  COHLE (CONT’D)  It’s better now. I live in a little  room out in the country. Tend bar  four nights a week. In between I  drink, and there’s nobody around to  make me stop. Which is good. I  understand who I am. After all  these years.",
      "dialogue_count": 0,
      "word_count": 3840
    },
    {
      "scene_number": 2,
      "slugline": "INT. CID CAR, MOVING - DAY  Hart and Cohle drive south on 71 through the   foothills   of the  Boston Mountains, deep hollers and hilly woods, layers of  shaded obfuscation and cave systems--  Silence, tension--  Cohle thinks to himself, staring outside the window. Hart  glances at him now and then, still   fuming   (his anger based in  self-loathing, as Cohle guessed)--  Ahead a GREEN HIGHWAY SIGN reads   ‘DEVIL’S DEN STATE PARK 21  mi.’ --  HART  You got a specific location for  this place? Or we just going to  wander around till we find it?  Cohle keeps staring outside the window--  COHLE  Gonna have to get directions.  HART  ...Maybe you can just follow the  smell.  A few beats pass, then Cohle starts laughing. Hart grins,  chuckles with him--  EXT. HIGHWAY 71 - DAY  Both men   laugh   as the CID car exits the highway into steep  hill country, descending into a labyrinth of cold shadows and  icy, skeletal trees--  INT. INTERROGATION ROOM - DAY  Martin Hart, 56, speaks--  HART  No. Except for what happened in  2002, we never fought. He was a  pretty even-keel guy, Rust.  Strange, but we got along.  EXT. DEFUNCT AUTO GARAGE - DAY  The CID car pulls into a small, junkyard-style SERVICE  STATION, blocks of exposed   concrete foundation   where its fuel  pumps used to be. The detectives exit the car, begin walking  toward the open-air garage portion through high weeds--  35.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 232
    },
    {
      "scene_number": 3,
      "slugline": "INT. DEFUNCT AUTO GARAGE - DAY  Inside, TWO MEN on stools are fiddling with something on a  work table as Cohle and Hart approach. We only hear Hart’s  voice-over for dialogue----  HART (V.O.)  ...And he had some moves. Turned  out he had a few CIs down this way  from his time undercover. Told him  some names to maybe talk to.  Both MEN are skinny   tweakers   with wiry, greasy hair, bundled  in raggedy jackets against the cold. They appear to be  working--  COP’S POV-- as the detectives get close, see that the two men  have dismantled an old hi-fi SOUND SYSTEM, scattering the  electronic guts over the work table--  Cohle asks these men something--  HART (V.O.) (CONT’D)  Tell you this, too. He had as good  a bullshit detector as anybody...  The two men both shake their heads in adamant ignorance at  Cohle’s question--  EXT. DEFUNCT AUTO GARAGE - DAY  Cohle and Hart walk out of the garage, back to the car,  dejected, having learned nothing. Hart climbs in, but Cohle  pauses   at his door--  HART (V.O.)  ...And Rust had the keenest eye for  human weakness I’ve ever seen.  Cohle doesn’t get in the car, thinks, tells Hart to ‘hold on’  and starts walking back to the garage--  INT. DEFUNCT AUTO GARAGE - DAY  The   two tweakers   look up from their work table to see Cohle  storming toward them--  COHLE  Sorry. I realized we got off on the  wrong foot--  Cohle   kicks over   their stools--  36.",
      "characters": [],
      "action_text": "COHLE (CONT’D)  --So I wanted to come back and put  the right foot up your ass.  With a wild roundhouse swing he   smashes   a half-dismantled  TURNTABLE over the head of one tweaker, grabs the other by  his jugular,   slams   his face on the table--  INT. CID CAR - DAY  Car running, heater on, Hart waits with a measure of boredom.  Casually, he   sniffs   his fingers... Then COHLE appears from  the garage, walks back. Cohle opens the door and gets inside--  COHLE  We want to go south on 220. There’s  a loop off the shoulder before it  hits 74... Gotta go down a dirt  fishing road toward Lee Creek.  Hart is both surprised and slightly unnerved--  HART  ...’Kay.  Hart puts it in reverse, backs out as the   tweakers   stagger to  the garage entrance, one massaging his throat, the other his  head--  INT. INTERROGATION ROOM - DAY  Martin Hart, 56, continues talking--  HART  ...Yeah. I mean, I didn’t know  then, but he told me later. All  that undercover stuff... Looking  back, I just think he hadn’t quite  transitioned yet, you know? Like  soldiers rotating back into the  world. He had some issues he had to  work through. But he did. He got  over it... He was a straight arrow  for a long time.  A beat, as he listens to a question. Answers--  HART (CONT’D)  No. You want to know about that  stuff, you need to ask Rust.  Off the dim sense that Hart is in some way covering for his  ex-partner--  37.",
      "dialogue_count": 0,
      "word_count": 495
    },
    {
      "scene_number": 4,
      "slugline": "EXT. DEVIL’S DEN - DAY  ESTABLISHING- a forest of limestone cliffs and mostly bare  trees, some verdant foliage, bucolic, steep declivities of  rock and clay, creek SOUNDS in the near distance--  ON a DIRT ROAD cutting through the brush as the CID CAR  enters the forest, bumping along the uneven path, taking  tight turns--  EXT. THE RANCH - DAY  ESTABLISHING- a series of TRAILER HOMES- old, decrepit but  restored -sit arranged in semi-circle, like a wagon train, an  improvised, interdependent shelter nestled in an overhang of  trees and forest. LAUNDRY hangs between trailers, all female  items, an abundance of   antennas   on the roofs of the trailers--  The yard around is unusually clean, and only two CARS are  nearby, both beaters--  A WOMAN (JAN) exits one trailer and crosses the yard to  another,   freezing   to look up the rise as the CID CAR starts  trundling toward her--  INT. TRAILER HOME, THE RANCH - DAY  Inside one trailer, somewhat messy with a scattering of  magazines and dirty plates. TWO WOMEN lounge on a couch,  watching a soap on TV. They look up as ANOTHER WOMAN (JAN,  40s) leads Cohle and Hart inside--  FOLLOW them down a thin hallway with three small bedrooms,  each with a MATTRESS on the floor--  As though conducting a brief tour, Jan leads them back toward  the kitchenette--  JAN  I’m usually here, ‘cause the lease  is in my name. Lots of girls come  through, though...  COHLE  And this is what, like some  hillbilly bunny ranch?  JAN  Excuse me ? You might want to talk  to Sheriff Bilson ‘fore you start  tossing accusations around.  38.",
      "characters": [
        "COHLE"
      ],
      "action_text": "HART  Relax. It doesn’t matter. We’re not  vice.  COHLE  Something happened to a girl. We  need to know if any of you knew  her.  Cohle has taken Dora’s mugshot from his jacket, hands it to  Jan--  JAN  ...Yeah... That’s Dori. Huh.  Something happened?  BETH (O.S.)  Something happened to Dori?  Everyone turns to look at the trailer doorway, where a very  young girl (BETH) now stands, looking concerned--  INT. JAN’S TRAILER HOME, THE RANCH - DAY  Inside another of the trailers, this one neater and cleaner,  cheaply furnished but well-maintained. Home decor includes a  good amount of Precious Moments porcelain figures, other  signs of childish romanticism. Beth sits upset, with Cohle  and Hart on chairs across from her. Jan stands at the  kitchenette counter, smoking a cigarette and listening--  Beth is petite, brunette, very pretty, and looks MAYBE  fourteen--  HART  How old are you?  Beth’s eyes dart to Jan and back--  BETH  Eighteen.  HART  You got I.D.?  BETH  Somebody stole my wallet. Last  week.  Hart looks sternly toward Jan, who smokes with a nonchalant  defiance. A hard-weathered woman who’s made her peace--  39. She’d been going to church. I’s  hoping maybe she just got it  together.  HART  Anybody else around here would  know?  BETH  I don’t know... She talked to me  more than anybody, I think.  HART  (to Jan)  We’re going to need to question any  of the girls might’ve known her.  JAN  That’s a tougher ask than you  think. Folks be staying away, they  hear y’all are at the ranch.  COHLE  It’s the best way to get us to  leave quick.  Jan shrugs, puts out her smoke. Hart is still looking at  Beth, who demurely shrinks under his gaze--  COHLE (CONT’D)  You said she left a bag?  Beth nods, wipes her nose and glances at Jan--  Jan nods--  TIME CUT:  INT. JAN’S TRAILER - DAY  Beth is gone. The detectives face Jan, who still stands at  the counter, now smoking a new cigarette--  HART  That girl ain’t eighteen. Sheriff  know you got teenagers working  here?  JAN  W",
      "dialogue_count": 1,
      "word_count": 1261
    },
    {
      "scene_number": 5,
      "slugline": "INT. CID CAR, MOVING - DAY  Hart drives as he and Cohle reach the main road, Cohle just  finishing flipping through her notebook--  HART  (re notebook)  She sounds like a nutjob. Too much  of whatever she was on, for too  long.  COHLE  It’s... interesting...  A few beats pass as Hart drives and Cohle pulls the YELLOW  FLYERS from Dora’s bag--  HART  ...Figure we should maybe stay out  here today. Check around the bars  and truck-stops for johns, maybe  knew her.  COHLE  Yeah. Okay. Lookit this--  Cohle hands him one of the flyers--  ON the FLYER-- it’s a cheap   photocopy   on yellow paper, a  strange amalgam of COLLAGE cut from magazines and magic-  marker TEXT. Images include a STONE CHRIST, a GLOBE, FLAMES  and drawn, black TENTACLES reaching up into the flames. TWO  EYES watching over it all--  PAN down handwritten TEXT that reads ‘ARE YOU LOST? DO YOU  FEEL THE FLAMES AT YOUR HEELS?   JESUS CHRIST CAN SAVE YOU ! YOU  ARE OUR FAMILY - VISIT YOUR HOME - SPEAK WITH CHRIST -  WORSHIP IN FELLOWSHIP - BE RESTORED -   IT’S NOT TOO LATE !!!’  FRIENDS OF CHRIST THE REDEEMER   - 13590 CR 4588 - Northwest  Arkansas--  HART  Huh. Lot of those type places,  expect the flock to canvas for  them.  COHLE  Make some time for it, we’re done  cruising johns.  Hart nods, gives the flyer back, and the car accelerates onto  the highway--  44.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 236
    },
    {
      "scene_number": 6,
      "slugline": "INT. INTERROGATION ROOM - DAY  Rustin Cohle, 51, listening to his interviewer and smoking.  His flask stands on the table beside the ashtray--  COHLE  Nah. Nothing from any johns that  time... Late by the time we headed  back to Fort Smith...  Rust listens a beat as he receives a questions, smokes--  COHLE (CONT’D)  Think it was eating at Marty a  little. That girl at the ranch. Him  with two daughters.  In Cohle’s expression is the barest hint that he is studying  his interviewers--  INT. HART HOME, KITCHEN TABLE - NIGHT  Early evening. Dinner simmering on the stove. ON MARGARET  HART, 35, sitting at the kitchen table, drink in hand, her  face staring into the glass, cold, unhappy--  Martin stands over her--  MAGGIE  Just don’t see the point... I mean,  why bother?  Hart sits down beside her quickly--  HART  Honey, I’m   sorry . It’s just the  case. I slept it off in the car.  You know how I do. We been through  this.  MAGGIE  It’s like you don’t want to be here  anymore.  HART  What?   Years   we been through this.  Sweetheart, listen to me. There is  nowhere   else I want to be.  Maggie looks at him. She is pretty, but not as young or  obviously sexy as Lisa Tragnetti. We might notice, though,  that Lisa is essentially a younger, fitter version of the  same physical type as Maggie--  45.",
      "characters": [],
      "action_text": "MAGGIE  I don’t think that’s true.  Defensive, hair-trigger, Hart stirs up some self-  righteousness--  HART  Oh   come on . Bad enough the shit I  have to wade through on a daily  basis. Now you bring me this feel-  bad-for-me crap when I been working  forty hours straight. I come home  to the place, the   one   place where I  know there’s peace and love, and  this, this--  She doesn’t respond, and he re-mounts--  HART (CONT’D)  What do you want me to say? You  want me to talk about a woman got  killed, had   wings   melted to her  back? You want me to talk about  kids getting raped and beheaded?  Then   you’re going to stop the “poor-  me” shit?  MAGGIE  ...That’s what I’m doing, huh?  Trying to make you feel bad for me?  He calms, touches her hand--  HART  You’re my world, babe... But yeah,  you know, sometimes I think you  might have a penchant for self-  pity... And I need you   strong . So  that I can do   my   job.  She watches him, her eyes subtly picking him apart. Without  acknowledging any belief in him, she wipes her eyes and  stands , moves to the stove--  MAGGIE  ..Can you tell the girls dinner?  Marty rises, watches her back at the stove for a few beats,  feeling that there is some opportunity for him here, a  partial healing, if he can just cross the kitchen to her--  But he turns around and walks down the hall--  Dry-eyed, Maggie continues stirring a pot of mashed potatoes--  46.",
      "dialogue_count": 0,
      "word_count": 483
    },
    {
      "scene_number": 7,
      "slugline": "INT. HART HOME, HALLWAY/GIRLS’ ROOM - NIGHT  Martin Hart walks down the hallway of his home, FAMILY  PICTURES on the wall, including his WEDDING PICTURE, the  GIRLS at various ages--  As he nears the girls’ room he can hear their voices, and it  sounds   like one of them says “ killed her ” --  Hart moves into the doorway. His TWO GIRLS (Audrey, Macie)  both kneel on the floor around a group of DOLLS and  immediately look up at him, beaming--  AUDREY  Daddy!   MACIE  Daddy!  They leap up to swamp him with   hugs . There is a slight  desperation to their clamoring for his love, and though Hart  could never define the reaction or its catalyst, it makes him  vaguely uncomfortable--  He doesn’t notice, but he gently   prods   them off of him--  HART  Go into the kitchen, okay? Dinner’s  ready.  MACIE  Are you coming?  HART  You bet. I’m starved.  AUDREY  Okay!  They girls move out the room, though they wish to linger--  Hart stands alone in their doorway, looks into their room:  its pink colors and toys, a little girl’s room, these images  contrasting in his mind to the lives he’s seen the past few  days. His eye catches the DOLLS his daughters were playing  with on the floor, and he approaches the toys--  HART’S POV-- we see that the girls have a NAKED BARBIE lying  on the carpet. Arranged around her, standing and wearing  clothes, are THREE KEN DOLLS and a G.I. JOE--  It looks unmistakably like   four men looking down at a dead,  violated body --  ON Hart’s eyes, wide with the inarticulate dread every father  with a daughter must feel at some point--  47.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 278
    },
    {
      "scene_number": 8,
      "slugline": "INT. INTERROGATION ROOM - DAY  Rustin Cohle, 51, faces us, smokes and drinks--  COHLE  ...I think of my daughter now, what  she’d been spared. I feel  grateful...  Cohle leans forward, as though the point he is making is his  most serious--  COHLE (CONT’D)  Docs told us she didn’t feel a  thing. Went straight into a coma.  Then, in that blackness, she  just... slipped into another,  deeper blackness... Isn’t that a  nice way to die. Painlessly, as a  happy child? ...Problem with dying  later is that by the time you grow  up, it’s too late. All the damage  has already been done.  Cohle sits back, hits his cigarette--  COHLE (CONT’D)  ...I think now of the hubris it  took to   yank   a soul out the bliss  of non-existence into this- this  meat . No matter what else, the  world   hurts . 24/7. To force someone  else into that hurt...  He drinks, shakes his head as if the idea is unconscionable--  COHLE (CONT’D)  ...So my daughter, she spared me  from the sin of being a father.  On Cohle’s eyes, the layers within his gaze--  EXT. COUNTY ROAD, NORTHWEST ARKANSAS - DAY  ESTABLISHING-- a RURAL ROAD cutting through barren, rolling  hills , dead yellow grass, desolate fields of scrubweed.  Occasional stretches are demarcated with barbed-wire fencing,  all under a metallic white sky, hazy mountains fringing the  distance--  COHLE (V.O.)  That’s how I learned to see it.  48.",
      "characters": [],
      "action_text": "Cohe and Hart’s black CID CAR passes down the county highway,  dwarfed by the expanse of snowy countryside--  INT. INTERROGATION ROOM - DAY  Martin Hart, 56, slightly irritated, adjusts himself in his  seat--  HART  Listen. Can we cut through this a  minute? I know what’s going on. I  got friends. I read... You caught  another, didn’t you? What was it,  in Bastrop..? Wings.  He sits back, pleased with his intelligence, waits a few  beats as an answer is given to him--  HART (CONT’D)  Right... And I understand our old  files being lost in the flood, but  you’re taking the long way  around... You keep asking about  Rust.  He becomes more serious, studies his interviewers--  HART (CONT’D)  You’re trying to jam somebody up.  Sit a beat on Hart’s stern eyes, then--  INT. CID CAR, MOVING - DAY  Inside the detectives CAR as it continues through the same  expanse of hinterland, cruising the desolation. JUNK in the  fields, isolated SHACKS--  Hart drives while Cohle consults a MAP spread over his lap,  the yellow FLYER for ‘FRIENDS OF CHRIST’ on top of it--  They pass empty plains, a ruined HOMESTEAD or collapsed BARN  here and there--  HART  Doesn’t make sense... There’s  nothing out here.  COHLE  Looking at the map, it’s got to be  around these few miles.  49. They drive a few beats, pass a   burned out   BUILDING with high  gables but no roof, outer walls only standing in a field of  overgrown sawgrass and scrub--  HART  Maybe it was like one of those tent  revival places? Those things move  around.  COHLE  ...There’s no date on the flyer.  (thinks)  Wait. Go back. Make a U--  HART  What? Why?  Hart slows and starts turning--  EXT. BURNED CHURCH - DAY  ESTABLISHING- the burnt-down BUILDING they already passed,  looks like it might have been a small CHURCH, with its tall  gables like steeples. Its front windows are broken out, SOOT  STAINS running halfway up the walls, no door, no roof, KUDZU  engulfing much of the structure--  The CID CAR pulls up. A field of BLACKBIRDS  ",
      "dialogue_count": 0,
      "word_count": 1067
    }
  ]
}