{
  "slug": "true-detective-105-the-secret-fate-of-all-life-2014",
  "title": "true detective 105 the secret fate of all life",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 10812,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "I/E. HART’S CAR - BACK ROADS - CARLYSS, LA - DAY 7   7 Hart following at a long distance, on an exposed country road-- A slight RISE-- and Hart   loses   Dewall’s truck-- He can   no longer   spot the Chevy he’s following--   FUCK--  CUT TO: EXT. BACK ROADS, FOREST - DAY 8   8 Hart stands at his CAR, parked on a dirt shoulder beside some forest as Cohle’s truck arrives, parks-- He exits-- HART Where’s Ginger? COHLE Kicking back in a ditch. What’s going on? HART Lost him a minute. I had to double-back a few times till I saw a turn off-- He nods toward the forest, to a path so thin and grassy it’s almost indistinguishable from the woods-- COHLE  Did you lose him?  HART Found his truck. Parked. CUT TO: EXT. FOREST, LOUISIANA - DAY 9   9 Hart and Cohle walk the thin path, badges and guns visible. THICK FOREST surrounds-- They stop as the trail tapers   off--   Where a rusted CATTLE-GATE fences off a small CLEARING-- Beyond the cattle-gate sits Dewall’s CHEVY. DEEP WOODS surround a wilderness maze-- HART ...We gotta call it in, Rust. COHLE ...We don’t know where they are yet... Just maybe   about   where they are. I don’t wanna flood the woods. How many directions could they run? \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   4. (MORE)",
      "characters": [],
      "action_text": "Parish?   Who says they won’t get a tip-off? HART We’re not gonna find em from here. COHLE ...Cut sign, man. You ever been hunting? HART 10-point buck, year before last.   Sixty yards.  COHLE  Real   hunting. Tracking. Not waiting to ambush a deer sniffing gash bait. Hart looks to the thick forest, endless possibilities for  ambush--   He turns back to Rust-- HART Jesus, you’re a prick. ...We find the place, we come back. Call it in. One of us’ll stay on surveillance. COHLE Yeah. I can live with that. They look at each other a moment, an acknowledgment, the  increasing stakes   of their reliance on one another-- Cohle steps over the gate, Hart following, until they’re swallowed-- INT. INTERROGATION ROOM - DAY 10   10 Hart, 52-- GILBOUGH So you get a tip where Ledoux cooks. Cohle comes back... from wherever he was... PAPANIA ...You knew it was gonna get here, man. Just the once... The way you tell it. HART I tell it the same way I told it to the shooting board and every cop bar between Houston and Biloxi... \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   5. COHLE (CONT'D) (MORE) You know   why   the story’s exactly the same, seventeen years gone? Because it  only   went down the   one way . EXT. FOREST, LOUISIANA - DAY 11   11 Cohle and Hart, dirty, moving through FOREST,   no clear path   is discernible-- Cohle leads in a crouch, scanning-- HART 2012 (V.O.) Cohle’s dad taught him   bow-hunting . Had to track game till you got within maybe thirty yards of it-- Cohle   spots   broken stalks -- He indicates the path to Hart, continues in that direction-- TIME CUT: EXT. FOREST, LOUISIANA - DAY 12   12 ON a   monofilament   TRIPWIRE across a pathless bramble-- Cohle follows the LINE, which leads to a CLAYMORE   at the base of a tree, covered in leaves, ‘ Front Toward Enemy ’-- Rust carefully leads them over the TRIPWIRE, deeper in-- TIME CUT: EXT. FOREST, LOUISIANA 13   13 Same wilderness, another TRIPWIRE Cohle spots,   another   one overhead, cross-hatched to CLAYMORE",
      "dialogue_count": 0,
      "word_count": 2469
    },
    {
      "scene_number": 2,
      "slugline": "EXT. TRAILER / METH SHACK, FOREST - DAY 35   35 SLOW MOTION ON Cohle firing AK with barrel drum, shooting into the woods-- COHLE 1995 (V.O.) ...Myself? In all honesty? INT. CONFERENCE ROOM, POLICE HQ - DAY 36   36 Back to Rust and the shooting board-- COHLE I can tell you I have walked away from the experience with an even greater respect for the   sanctity   of human life. Glances sideways–   ‘anybody buy that?’ -- EXAMINER 2 Thank you, Detective. And I believe I speak for the board when I commend you on the heroism displayed by you and Detective Hart. Cohle meekly waves off the compliment, humble-- EXT. BACK ROADS, FOREST - DAY 37   37 Where Cohle and Hart had left their vehicles parked, now with STATE PD CRUISERS, lights flashing, AMBULANCES. MEDICS and PATROLMEN standing around, a REPORTER waiting as-- ON WOODS-- Martin Hart and Rust Cohle emerge side-by-side, each of them carrying a CHILD covered in a ratty blanket-- Hart carries a little girl, her eyes closed, face dirty-- We don’t know the gender of Cohle’s, because the blanket  covers   the child’s face-- Only see the small feet-- As the medics and patrolmen rush to their aid, a news REPORTER takes a picture-- FADE TO WHITE. FADE IN: \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   14.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 223
    },
    {
      "scene_number": 3,
      "slugline": "INT. STATE POLICE HQ - DAY 38   38 COHLE 2012 (V.O.) There were the twig sculptures. And LSD they had on hand matched the batch in Dora Lange. Everybody was pretty satisfied we’d gotten our man... A week later, after the shooting board. Hart and Cohle enter homicide to   applause -- Copies everywhere of THE LAFAYETTE ADVERTISER, front page pictures of Cohle and Hart carrying the children. Headline: ‘Hero Detectives Stop Killers, Save Girl ’--  The other detectives shake hands with Cohle and Hart. A victory for the whole team-- COHLE 2012 (V.O.) Boy’d gone missing in January. He’d been dead less than a day. The girl hadn’t been reported yet. Came from St. Landry. She was catatonic... INT. INTERROGATION ROOM - DAY 39   39 Cohle, 49, no pleasure in recalling ‘the victory’ now-- COHLE I checked on her, some years later. In assisted living for girls with special needs. Cohle thinks on that event, hits the flask-- COHLE (CONT’D) ... Why should I live in history ? I don’t want to know anything anymore. This is a world where nothing is solved. Somebody once told me,   ‘Time is a flat circle .’ ...Everything we’ve ever done or will do, we’re gonna do over and over again... And that little girl and that little boy are gonna be in that room again and again, forever... INT. INTERROGATION ROOM - DAY 40   40 Martin Hart, 52-- Tired after being pulled into these memories, but still in them-- \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   15.",
      "characters": [],
      "action_text": "HART There’s a few news stories about us, you wanted to find them. I got promoted to detective sergeant. Rust got a commendation for bravery. Basically because I  insisted . And, uh... Things were real good, I guess, for a while. Rust even chilled out, got more regular... Maggie came around. After   a lot   of talking. Counseling. Getting in a shootout kinda opened her up to forgiveness. Or the possibility. INT. SKATE RINK - DAY 41   41 SKATING RINK. Hart skating with Macie and Audrey-- Maggie skates too, left back by the girls wanting to both hold their father’s hands-- MAGGIE’S POV as Hart skates through stage-fog and laser- lights with the girls, one holding each hand-- INT. SKATE RINK/VIDEO ARCADE - DAY 42   42 Macie eyes stuffed-toys through the glass wall of a GRABBING CRANE MACHINE-- She watches Hart steer the claw, set it on a large stuffed TOY-- Audrey already has a stuffed toy and Macie watches with anxiety-- The claw raises and lifts the toy-- TIME CUT: INT. SKATE RINK - DAY 43   43 Maggie meets them as they exit, Hart carrying the toys as the girls skate out the arcade-- MAGGIE Go take off your skates. It’s time to go. They both protest and beg for more time--   ‘Please, please’ -- MACIE Is Daddy coming home yet? MAGGIE ...One more time around. Then take them off, okay? \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   16. The girls rush to get in their last skate on the rink, leaving Hart and Maggie alone, stuffed toys under his arms-- HART Thank you. I needed this. I think they did, too... Beat, some kind of inner Rubicon approached in her-- MAGGIE ...Were there others? HART ...What? MAGGIE Besides her. Were there others? HART  No. No.   And- Listen, that was a different person, Maggie.   I lost it.   Just for a little- I’m back. I’m begging. I’ll keep begging. I’ll go to my grave begging. She looks him in the eye, poker-faced-- Looks away-- MAGGIE It’s not just the... affair. You used to be a good man. You used to  pay attention ... HART Mag,   I almos",
      "dialogue_count": 0,
      "word_count": 3280
    },
    {
      "scene_number": 4,
      "slugline": "INT. ABBEVILLE PD - DAY 61   61 SERGEANT You got the confession,   then you made it inadmissable -- COHLE What’re you doing? He’s   still talking -- DETECTIVE 2  We don’t treat our suspects like that here--  DETECTIVE 1 He’s shucking and jiving you, Detective.   He knows who you are.  COHLE  You called me in--  (calms) ...Hold on. Hold on, I want to talk to him-- DETECTIVE 2 We’ll let you know, we need anything else. SERGEANT You can visit the prisoner when you calm down, request further interview. We appreciate the assist. DETECTIVE 1  Come on--  TWO PATROLMEN pass by to take Francis to holding-- One of them is Childress, who heard the conversation-- COHLE What’s   going on   here? SERGEANT  We gotta salvage a double-murder confession , is what’s going on. If he wasn’t just running you, you’ll get anything we get... You have my word. Cohle’s frustrated, mind spinning with what Francis said-- He clocks the other detectives,   shakes   the Sergeant’s hand-- \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   30.",
      "characters": [],
      "action_text": "COHLE I’ll be back. Tomorrow. Walks out--   Into -- INT. LAURIE’S HOUSE - NIGHT 62   62 Cohle walking from the dining area to kitchen with dishes in hand, fleeing a conversation behind him, as he and Laurie clean up after dinner-- LAURIE ...I’m not saying we   have   to decide now .   It’s just a   subject ... They meet in the KITCHEN, Cohle sets plates down-- COHLE I’m saying. As a subject. I closed that for myself. LAURIE ...Baby, I know how you feel. Because of what happened. I do. COHLE ... It’s not that.  LAURIE Of course it is, no matter what you say. And I’m saying. There might be a kind of   healing   in this for you. COHLE  There’s   nothing to heal , Laurie... It’s a   philosophical decision . She calls him out, blocking his exit from the kitchen-- LAURIE  Bullshit . If you’re going to live... being so   honest .   Without illusion , you said. Then you can’t be serious. If you  really think   the reason you don’t want children is   philosophical , you are a- a blind man describing an elephant... COHLE ...It’s wrong. That’s how I feel. LAURIE ...You’re scared... Or... (beat, hurt) \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   31. (MORE) ...Is it you don’t-- with   me ? ...You don’t love me that way? He freezes a half-second too long-- He wants to be a good man, but that word still registers a   suspicious abstraction -- COHLE No. It’s not about you. I wouldn’t have children with anyone, Laurie. I’m sorry... He passes her, enters the living room, where something  catches his eye ... He pauses beside a shelf, looks at it, as Laurie stands in kitchen doorway-- COHLE POV -- he stares at the framed Lafayette Advertiser PHOTO of him and Hart, the ‘Hero Cops’ headline-- His own  face   in the glass,   seven years later -- LAURIE ...A seven-year old picture’s more important than this discussion? (beat) You’ve got such good eyes for detail, Rust. The seams in everything and all the cracks. But you miss a   shit-ton   of what’s obvious. COHLE ...What’ve I missed? ",
      "dialogue_count": 0,
      "word_count": 1044
    },
    {
      "scene_number": 5,
      "slugline": "INT. HART HOME - NIGHT 66   66 Marty hasn’t moved, looks at his hands, guilt-ridden-- Then, to save himself, through some inner rationale, he converts that guilt into righteousness--   He’s the wronged party -- INT. KITCHEN, HART HOME - NIGHT 67   67 Marty enters the kitchen-- Digs around in a cabinet under the sink, pulling out junk and old cleansers until-- He finds a   dusty, old   bottle of Jamesons, half-full-- Pours himself a tall drink-- INT. LOCKER ROOM, HOMICIDE, STATE PD - DAY 68   68 Martin dresses-- Younger men, detectives, mill around him-- He’s tired, studies his hands,   knuckles   on one hand bruised, scraped (will learn why next ep.)-- Looks to his belt, the RODEO BUCKLE on it dated ‘82-- At the BATHROOM MIRROR above the sink, he checks the skin beneath his chin, the thinning hairline; tries a half-ass comb-over, comb-down, fuck it-- Hart leaves the mirror, unsatisfied with it-- OVERLAP these images with first dialogue of next scene-- INT. INTERROGATION ROOM - DAY 69   69 Cohle, 49, twisting the   flat beer-can   like a doubloon-- COHLE In   eternity , where there’s no time, everything is eternal. Nothing can  grow , or   change . So Death created time to grow the things it would kill... And you   are   reborn, but into the same life you’ve   always  been born into. He draws a figure-eight infinity symbol around the can-men-- COHLE (CONT’D) ...How many times have we had this conversation, Detectives? Who knows? We can never remember our lives. And we can never change anything. Your life is a surface that your consciousness traverses again and again. Forever. And that is the terrible and secret fate of all life. You’re trapped. \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   35. (MORE)",
      "characters": [],
      "action_text": "Like a nightmare you keep waking up  into...  INT. SQUAD ROOM, STATE POLICE HQ - DAY 70   70  Last part of dialogue overlaps -- Hart walks in from the locker room fully dressed in suit. He   approaches his desk, beside Cohle, who stares ahead at a   wall, thinking,   hard -- HART ...You alright? COHLE We need to run to Abbeville today. HART I gotta give a deposition, after lunch... Why? COHLE Come on. I’ll tell you about it on the way-- They exit-- INT. HOLDING AREA - ABBEVILLE PD - DAY 71   71 At the gated entrance toward the HOLDING CELLS--   commotion   as Cohle and Hart face off against TWO ABBEVILLE PD DETECTIVES and TWO PATROLMEN-- COHLE  What the fuck are you talking about?  DETECTIVE A Hold on a minute, sir. You need to walk this   the fuck   back. You don’t  barge   through here-- COHLE  What happened?   You   assholes--  INT. HALLWAY, ABBEVILLE PD - DAY 72   72 WALKING down a hallway of HOLDING CELLS with PD-- SERGEANT We   did   take his belt. Shoelaces  too .   Detective . They stop at a cell where a tendril of dry, dark   stain   has groped beneath the bars-- YELLOW CRIME SCENE TAPE over the door. All stand before the cell, see-- \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   36. COHLE (CONT’D) Guy Francis’s body is   slumped   at a rear corner, bent around the post of his bunk, where a piece has been cut and bent outward a long time ago, making a small, hooked tooth-- Cohle stares through the bars, Francis’s wrists gouged and bled out, pooling at dips in the cement-- SERGEANT (CONT’D) He knew what he was looking at for the double-murder. Guess he thought about it, made a choice. COHLE You got camera feeds? SERGEANT Yes we do. They cover the   hallway . Not the cells. COHLE I want to see it. SERGEANT You wanna modify your tone, Detective? Or you wanna obtain a subpoena? HART Sorry. Chief, if we could get a look, maybe get us out your hair quicker. SERGEANT ...It’s under review with our internal affairs division, but I’m sure they’d let you have a look",
      "dialogue_count": 0,
      "word_count": 964
    },
    {
      "scene_number": 6,
      "slugline": "INT. MOVING, CID CAR - DAY 75   75 Hart drives he and Cohle away toward the interstate-- Cohle stares out the window, thinks-- Hart clocks that Cohle is in his state of obsessive thought-- HART You   really   think he could’ve been serious, about having something? ...And if so, then what? Implications:   Conspiracy? We got the wrong man seven years ago..?  COHLE ...Reggie Ledoux deserved to die, Marty. That’s justice. But I’m not ruling out other agencies. HART What’s that mean? COHLE Francis and Charlie Lange both said the Yellow King. Dora Lange said Yellow King. HART Why haven’t we heard anything? COHLE ...You ever wonder why that task force was so hot to take the case, back in ‘95? Hart doesn’t respond, doesn’t like the gears in Cohle’s eyes-- EXT. HIGHWAY, SOUTH LOUISIANA - DAY 76   76 The CID car passes again through the wilderness cut with asphalt-- INT. INTERROGATION ROOM - DAY 77   77 Hart, 52-- GILBOUGH Did he mention Billy Lee Tuttle? HART ...You know that he did. \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   39.",
      "characters": [],
      "action_text": "PAPANIA Tuttle died a couple years back. 2010. HART Yeah. What was it? Mixed medications? So what. GILBOUGH Not long after Cohle turned back up in Louisiana. HART Alright. Fuck this. Fuck it right now. You tell me why you’re all over Rust. Or I walk. GILBOUGH ...His record. His reports. His stories. They don’t add up. HART So talk to him already. Stop pissing in my ear. PAPANIA We   did.  HART You did? Huh. GILBOUGH What? HART If   you two   talked to Rust, you didn’t get a read on him. He was getting a read on you. OFF Hart, feeling superior to his interviewers-- EXT. MALL, LAFAYETTE - DAY 78   78 Hart, 42, walks through outdoor MALL with a bulky Walgreen’s bag in hand, looking at an ad   torn   from the paper, pictures of  cell phones -- He pauses in the bustle of shoppers, looks around, finds the CELL PHONE STORE across the way-- INT. CELL PHONE STORE - DAY 79   79 Hart lugs the Walgreen’s bag, looks at various phones on display until a salesgirl, BETH (23), approaches him-- As she does, she seems to be taken with something about his appearance, his face-- \"CH. 5: THE SECRET FATE OF ALL LIFE\" - 5/12/13   40. BETH Can I help you with anything, sir? HART Oh, yeah. Please. I’m just looking for this one... He indicates a picture from the newspaper ad; she glances at him while checking the ad, lets him catch her looking-- BETH Right over here. I’ve been seeing that ad all day. She leads him over to the item and hands it to him-- HART ...It’s pretty easy to work, huh? I don’t want anything too fancy... BETH It’s easy... Did you want a camera? Hart thinks it over, looking at the phone box-- HART Yeah, sure. Good. Beth glances at his face, his WEDDING RING, the bulky Walgreen’s bag-- NOTICE the bag is full of THREE BOXES of   tampons -- BETH This has one. It’s easy-- EXT. MALL, LAFAYETTE - DAY 80   80 Later. Walking out the mall, looking at the phone’s box-- Hart sees he is passing a SUBURBAN BAR-- On the bar’s TV, ESPN is on-- He looks at his watch, the Walgreen’s bag--",
      "dialogue_count": 0,
      "word_count": 2832
    }
  ]
}