{
  "slug": "true-detective-101-the-long-bright-dark-2014",
  "title": "true detective 101 the long bright dark",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 1,
  "characters": [
    "COHLE"
  ],
  "total_words": 10753,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. INTERROGATION ROOM - DAY  The same interrogation room, but the chair is EMPTY. A NEW  MAN steps into frame, sits down. Recognize RUSTIN COHLE, 51,  twenty years older, taking Hart’s place across the table,  staring   at us. Same wall with a corner of the BULLETIN BOARD  behind him, same piece of a WANTED POSTER--  He hasn’t lost any hair, but it’s streaked with steel gray,  wild, unkempt and in need of a trim. He’s leaner. In the  intervening years he’s shed pounds ,   and now his cheeks are  sunken. He almost looks emaciated ,   lupine. He’s unshaven,  wearing rumpled clothes. NOTICE covering Cohle’s left inner  forearm, a colorful, slightly-faded TATTOO of FLAMES with a  PAIR OF DICE at their apex--  CHYRON ( typed ):   ‘Arkansas State Police CID / Company D /  Statement of Cohle, Rustin Spencer. / Present: Sgt. Thomas F.  Papania, Sgt. Maynard Gilbough / May, 2010’  Cohle clears his throat, his voice gravelly, when he finally  speaks it’s as if in answer to a question-  COHLE  (into camera)  Yeah. Of course. ‘The Pine Angel.’  Thank the Democrat-Gazette for that  one.  Cohle pauses and lights a CIGARETTE. Then suddenly looks  between it and the camera, as though he’s being admonished.  He deliberates the lit cigarette .   Then keeps smoking-  COHLE (CONT’D)  Don’t be a dick about it...  You want to hear this or not?  (smokes)  Benton County Sheriff requested  assistance with a 419 at the edge  of the woods off Highway 20. South  of Eureka Springs. This our first  real heater. I’d been around about  three months at the time. Had just  observed Marty, till then.  Cohle   ashes   on the table, staring belligerently   -  EXT. WOODS NEAR HWY 20, ARKANSAS - MORNING  Red clouds and a red sunrise. A heavily wooded VALLEY  surrounded with denser FOREST, the OZARKS fencing the horizon  in dun-colored spikes. Blobs of GRAY SNOW litter the dark  soil. A crisp, ruby light--  3.",
      "characters": [
        "COHLE"
      ],
      "action_text": "FOLLOWING THREE MEN across this valley: a uniformed SHERIFF’s  DEPUTY walking point, leading TWO MEN IN TRENCHCOATS and  suits, MARTIN HART and RUSTIN COHLE, c.1990. Hart’s hands are  stuffed in his pockets, and Cohle carries a CRIME SCENE KIT  and a LEGAL-SIZED PORTFOLIO--  We watch the deputy leading them toward deeper woods. NOTICE  all the birds roosting outside the forest, and 2010 Cohle  speaks in V.O.--  COHLE (V.O.)  Last gasp of winter. It was about  seven a.m., March 3, 1990. My  daughter’s birthday, I remember.  Walking, Rustin sees a BLACK SNAKE winding through the grass,  away   from the direction they’re traveling--  ANGLE AHEAD- where the TREE LINE breaks. SHERIFF’S DEPUTIES  stand a couple dozen yards from a DARK SHAPE hunched at the  base of a LARGE PINE TREE. The men talk between themselves,  their backs turned away from the shape, breath visible in the  crisp air--  EXT. FOREST, ARKANSAS - MORNING  Without saying anything, the deputy leads Hart and Cohle to  the   dark, slumped shape .   The deputy tries   not to look at it,  but can’t help himself--  ON HART and COHLE’S FACES as the deputy steps aside. Hart  looks vaguely horrified. Cohle’s face simply tenses and his  eyes sharpen. Behind them, birds   shriek   from the trees--  Cohle moves past Hart to get closer--  ANGLE ON BODY- (depicted as mercifully as possible) -A white  FEMALE, naked, posed   kneeling   over a LARGE TREE ROOT, her  HANDS   folded   as if in prayer.   Head down , a CROWN of ROOTS and  THORNS is set on her scalp. A PAIR OF LARGE, DARK WINGS have  been attached to her back. The WINGS drape over her ribs,  their feather-tips sunken into a small patch of dirty snow--  Cohle puts on a pair of   latex gloves   and looks from the body  to the TREES around it- NOTICE a PENTAGRAM freshly carved  into the pine tree beside the body--  HART  Holy God.  Cohle crouches to examine the WINGS.   ANGLE ON his hands  shifting the feathers.  4. NOTICE   the wings are bonded at their axillars ",
      "dialogue_count": 1,
      "word_count": 1591
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ‘RAINBOW APARTMENTS’, NORTHWEST ARKANSAS - DAY  A seedy BRICK line of APARTMENTS the size of motel rooms, in  the middle of nowhere -   fields and desolation around.  HART (V.O.)  Second week we were together I saw  where he was living, and I felt for  the guy.  ANGLE ON an UNMARKED CID CAR, as Cohle and Hart step out, and  Hart follows his partner to a door--  INT. COHLE’S APARTMENT - DAY  Cohle opens the door, and from Hart’s POV, we take in the  ROOM. It’s empty except for a couple BOXES. Depressingly  bleak and completely unadorned.   A MATTRESS on the floor. A  CRUCIFIX above the mattress. No TV. STACKS OF THICK BOOKS in  various spots on the floor-  HART (V.O.)  I thought of some Quasimodo  character living in a belfry, like.  He had these textbooks stacked on  the floor--  ANGLE ON the BOOKS. NOTICE the TITLES:   Advanced Crime Scene  Analysis. Offender Profiling. Sex Crime Investigation.  Advanced Homicide Investigation --  Hart looks at Cohle, a little weirded-out-  COHLE  I’d offer you a seat.  HART  Don’t mention it.  INT. INTERROGATION ROOM - DAY  Martin Hart, 56-  HART  You know the photos in those books.  Not the sort of thing you’d leave  lying around, at least if you  expected anybody else to ever walk  in your place... One of those  moments I was glad I’d made a  family.  9.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 228
    },
    {
      "scene_number": 3,
      "slugline": "EXT. FOREST, ARKANSAS - DAY  CRIME SCENE- Detectives Cohle and Hart are alone beside the  body, having finished their examination. Cohle sits on a log  and continues writing on his tablet, looking around. Hart  stands and talks on the radio .   We can’t hear his 1988 voice,  only the 2010-  HART (V.O.)  I didn’t really mind he was quiet.  Mainly nobody understood what he  was doing here. Brought in from  Louisiana, and he wasn’t interested  in making buddies.  Hart puts down the radio, moves to where Cohle sits writing.  The body nearby, like a dark angel on the periphery of the  frame-  HART.  DiCillo said he’ll be here in  twenty.  Cohle doesn’t respond, keeps writing. Hart takes out a can of  smokeless tobacco   and fills his bottom lip. Then they both  wait, with the silence between them--  ANGLE ON Cohle’s tablet- he’s moved to drawing   sketches   of  the crime scene and body-  HART (V.O.)  Bobby and Steve and the other guys  thought he was stuck up, like he  thought he’s better than other  people. But up close it was more  complicated. More like a paranoia.  EXT. FOREST, ARKANSAS - DAY  COHLE directs one section of the grid search, and MARTY  another--  ON COHLE as he gives orders--  HART (V.O.)  We didn’t know what he’d been  doing. Before CID... I didn’t know  about all that undercover work  until later.  A tinge of sympathy is evident in Hart’s voice--  10.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 239
    },
    {
      "scene_number": 4,
      "slugline": "INT. INTERROGATION ROOM - DAY  Rustin Cohle, age 51, disheveled, smoking.   Somebody brought  him an old coffee MUG to use as an ashtray-  COHLE  Yeah, well. Devil’s in the details,  yeah? I wrote everything I could.  Try to capture the moment, its  essence. Because you never know  what the   thing’s   going to be, do  you? The essential, unlikely clue.  Thing that, way down the line,  maybe months or years later, makes  you say, ‘ Ah. ’   Breaks the case  wide.  He pauses, remembering, smokes--  COHLE (CONT’D)  So we’re sitting there waiting on  DiCillo. This   scene . I mean, we’d  encountered a full-fledged meta-  psychotic. I had to explain to  Marty what that was-  EXT. FOREST, ARKANSAS - DAY  CRIME SCENE: In the distance we can see DEPUTIES spreading  out across the fields. The detectives are still the only two  near the body. Cohle gestures to it as he speaks to Hart, his  portfolio laid down-  COHLE  This is going to happen again.  HART  What do you think you know?  COHLE  This is fantasy enactment. There’s  fetishization, something like...  iconography.  HART  Satanist shit.  COHLE  No. But it’s a religious vision.  Her body is a paraphilic lovemap.  HART  A what?  11.",
      "characters": [],
      "action_text": "Cohle’s eyes trawl over the body--  COHLE  An attachment of physical lust to  fantasies and practices forbidden  by society.  HART  You learn that in your books?  COHLE  I did. You see how short that skirt  was? Decent odds she’s a prost.  Maybe a hitchhiker. But the guy’s  been thinking about this a long  time.  HART  Just don’t want us jumping to any  conclusions.  COHLE  I bet we get ID off her prints.  Hart, as senior detective, probes Cohle to test his judgment-  HART  What else?  COHLE  Missing persons, obviously. We need  to look into any reports of  unrelated sexual events, like  flashing or fetish burglaries.  Check all prior arrests going back  the last several years for the  northwest counties. Any B&E with a  fetish component. Sexual offenders  paroled to the state.  Hart is impressed by the rookie detective’s assessment.  COHLE (CONT’D)  These things don’t occur in a  vacuum.  Hart nods, and Cohle returns to sitting on his log, watching  the body. Hart watches him--  Silence for several beats- this dark assemblage flirts with  absurdity- the two suited men sitting near that horrible  corpse, being quiet like schoolboys or nervous suitors--  Hart seems perturbed, finally speaks -  12. HART  This is a stupid time to mention  it. But you have to come over to  the house for dinner. I can’t put  Maggie off any more, and it’s  shitty and rude for you not to.  Cohle thinks--  COHLE  Alright.  Cohle looks slightly on   edge   now, grips his portfolio on his  lap, stares at the girl. STAY ON Cohle’s face, a dull   dread  in it, his eyes looking trapped as he sits with Hart--  COHLE   (V.O.) (CONT’D)  I get this stone in my gut, see,  because I think about Marty’s wife  and his two girls, sitting down to  dinner with   this family , and I’m  thinking about Sofia, my daughter,  and how it’s her birthday. And how  she’s been gone almost five  years...  INT. INTERROGATION ROOM - DAY  Older, haunted, Cohle continues his story--  COHLE  And I know right then that I’m ",
      "dialogue_count": 0,
      "word_count": 5970
    },
    {
      "scene_number": 5,
      "slugline": "INT. HART HOME - NIGHT  A short time later. Dinner with the Hart family, everyone at  the table now, Cohle still rumpled, drinking coffee and  looking at least a   little   more sober. MACIE and AUDREY pick  their food while making faces at one another. Hart cuts his  steak quietly, letting MAGGIE carry the conversation-  MAGGIE  I said, ‘Your life’s in this man’s  hands? Am I wrong?’ Of course he  should meet the family.  HART  You know it’s not that dramatic.  (to Rust)  Never used my gun.  MAGGIE  (to Rust)  Have you? Used your gun?  Cohle pauses, looks at the table and the   girls   who’ve turned  their attention to him--  COHLE  Yeah.  MACIE  Have you shot people?!  MAGGIE  Macie-  MACIE  Daddy’s never shot anybody.  COHLE  That’s good. You don’t want to have  to shoot people.  AUDREY  But you have, huh?  A beat as Cohle considers lying--  COHLE  Yeah.  MAGGIE  Marty says you’re from Louisiana?  39.",
      "characters": [],
      "action_text": "COHLE  Southwest Louisiana. Yeah. But I’s  working in Texas too, before here.  MAGGIE  What kind of work?  COHLE  Narcotics, mostly. I was on robbery  squad in Baton Rouge till ‘85.  At the word   ‘ narcotics ’ , Hart’s eyes jump to Cohle’s arm,  where his rolled sleeve depicts the edge of his FLAME AND  DICE TATTOO. In the house, the PHONE RINGS--  HART  I’ll get it. Keep eating.  He rises--  INT. BEDROOM, HART HOUSE - NIGHT  Hart stands beside he and Maggie’s bed, talking on a PHONE  that rests on a nightstand--  HART  (into phone)  Thanks for calling. He’ll  appreciate it... Then   I   appreciate  it.  Hart sets the phone on a pillow. FOLLOW as he walks down the  short hallway, back to the dining area adjoining the kitchen.  He pauses a moment, as he sees Maggie and Cohle talking  between one another, with lowered voices--  As he approaches, he can hear Cohle’s hushed voice-  COHLE  (to Maggie)  --in the street. We didn’t last  long after that. Transferred to  narco. 24/7.  When Hart reaches the table, Cohle stops talking, and Hart  sees that his eyes are a little wet--  HART  Chris Demma’s on the phone for you.  Something about one of your opens.  Cohle nods, excuses himself and walks to the back bedroom--  Hart notices that Maggie seems newly quiet, suddenly   sad --  40. HART (CONT’D)  What was that? What were you  talking about?  MAGGIE  How he got here. Marty, what do you  know about him?  HART  Not much. Could be a good  detective. He’s running with the  new one.  She dabs her eyes with her napkin, emotionally affected by  something--  MAGGIE  You notice how he looks like he  lost his wife, his dog, and his  best friend all on the same day?  Hart shrugs--  MAGGIE (CONT’D)  You ever   ask   him about that?  HART  Baby, trust me. You   do not   want to  pick this guy’s brain.  Cohle re-appears, and they both turn abruptly.  HART (CONT’D)  (re phone call)  You need to go?  COHLE  Nah. It’s nothing can’t wait.  Hart is slightly   taken aback . Cohle’s not going",
      "dialogue_count": 0,
      "word_count": 735
    },
    {
      "scene_number": 6,
      "slugline": "INT. INCIDENT ROOM, CID HQ, ARKANSAS - DAY  Hart and Cohle stand in front a room of TEN OTHER DETECTIVES,  with LT. QUESADA standing to their right, a large DRY-ERASE  BOARD between them. Squad debrief--  Quesada holds up a copy of the ARKANSAS DEMOCRAT-GAZETTE. Its  HEADLINE:   Angel Murdered in Pines of Benton --  Cohle has tacked on the   board   several of the M.E.’S PHOTOS  from the scene. Hart writes the name DORA LANGE across the  top of the board--  COHLE  She look like an angel to any of  you guys?  No one answers, but they eye-fuck Cohle enough that he steps  back--  HART  (re board)  This is what we have right now.  The detectives listen--  INT. INTERROGATION ROOM - DAY  Martin Hart, 56, speaking in response to his interviewer--  HART  Me? I joined in ‘75, when I’s 24.  BA in criminal justice from U of  Ark. One semester of law school.  He looks over his big knuckles, his COLLEGE RING--  HART (CONT’D)  Wasn’t for me. Desks. I was always  an athlete, see, and I think that’s  key to something. Like it has to do  with the need to not be stabled.  Same sort of thing maybe makes  someone right for certain sports.  That urge to run out front.  Reflecting, he shrugs, not really caring to analyze himself  too deeply--  HART (CONT’D)  I wanted action. I wanted to be  there ,   at the places behind our  lives. I wanted to walk past the  yellow tape... And to protect.  43.  (MORE)",
      "characters": [],
      "action_text": "Do good. Same stuff that led to me  opening up the agency after I took  my pension. Why I doubt I’ll ever  stop.  Almost congratulating himself--  HART (CONT’D)  I just need to be out there. Making  moves. Digging... It’s what Rust  called ‘the narcotic of   knowing .’  A long pause, where it appears Hart is receiving a question-  HART (CONT’D)  Met Margaret my senior year. She  was a freshman. Eighteen and  straight off the tree. Small, with  freckled skin. A big pile of thick,  black hair. Green eyes. Irish. This  ass. Tits like softballs. I’ll say  it. We should   celebrate   those  memories, if we got em, yeah?  His tone drops a little--  HART (CONT’D)  Gets difficult to remember her like  that, like back then. I thought  Audrey or Macie would look like her  as they grew, but they look like  me. I don’t even have pictures of  Maggie from back then...  Burned them all one night. Shit-  hammered. Wish I hadn’t done that,  now.  He straightens, dispels the nostalgia and speaks directly--  HART (CONT’D)  Anyway- we were married for twenty-  five years. And for the last  fourteen I worked with Rust Cohle.  I mean, that long a time, a  relationship becomes lots of  different things. Different  incarnations... Rust changed a lot,  back and forth. We both did. And  yeah, we left it bad. But, you  know, I can say this: he was a  great   detective. Things I saw Rust  do--  A beat. Oddly, he grins--  44.  HART (CONT’D) HART (CONT’D)  Look. I try not to hold grudges...  I believe that kind of thinking can  lead to cancer.  INT. INCIDENT ROOM, CID HQ, ARKANSAS - DAY  The long briefing obviously ending, Hart is giving  assignments to the DETECTIVES who aren’t otherwise occupied.  As he says their NAMES, they move out. NOTICE who’s-who among  them. While he talks, Cohle hands out flyers with Dora’s old  MUG SHOT and a list of her known associates--  HART  Lutz and Farvre, get you to do the  hooker questioning.  Lutz and Farvre groan--  HART (CONT’D)  Demma, Geraci, if you guys",
      "dialogue_count": 0,
      "word_count": 1864
    },
    {
      "scene_number": 7,
      "slugline": "INT. INTERROGATION ROOM - DAY  A few minutes later. Cohle has a SIX-PACK of PABST in front  of him, along with his ash-mug and cigarettes. He pops a can  and guzzles half of it with relish. Lights a cigarette--  COHLE  Thank you, boys. Thank you...  Now maybe we can get to brass  tacks. Cause I know why I’m here.  He sits back a little, drags on the cigarette--  COHLE (CONT’D)  It’s started again, hasn’t it? The  killing. Him. And how can that be  possible, when we got the bastard  in 2000?  He sips the beer, smokes--  COHLE (CONT’D)  How indeed, gentlemen. How indeed .  CLOSING IN on Cohle’s eyes, haunted, intense, as he drinks,  hits his cigarette, stares into the camera--  BLACK.  THE END  52.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 126
    }
  ]
}