{
  "slug": "trumbo-2015",
  "title": "trumbo",
  "genre": "drama",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 20183,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. LAZY-T RANCH - TERRACE - DAY -- Robinson and his Wife stare in amazement, watching Cleo expertly JUGGLE two glasses, flipping and catching one behind her back as Trumbo beams. DALTON TRUMBO The misspent youth of a child acrobat. EDWARD G. ROBINSON My God, how long were you in show business? CLEO (juggling away) Till I was 15.   And it was more “show-forced-labor.” Niki tosses her mother a third glass, which Cleo catches, now pinwheeling all three easily. NIKI She never drops one, ever. CLEO Mom had a little saying.   “Drop it, you lose your next meal.” DALTON TRUMBO (to Robinson) And “Mom” wasn’t kidding.   Woman was a Dickensian harridan. CLEO (laughs) No one even knows what that means. EXT. LAZY-T RANCH - DRIVEWAY - DAY The black sedan closes in -- EXT. LAZY-T RANCH - TERRACE - DAY -- as Cleo does over-hand grabs, then switches to a circular pattern, the spool of tumblers catching sunlight in dazzling prisms. AND THROUGH CLEO’S GLASSY WHIRL OF COLOR - WE SEE THAT SEDAN Pull to a stop and Trumbo sees THREE MEN in suits get out. TRUMBO - JOHN MCNAMARA   22.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 192
    },
    {
      "scene_number": 2,
      "slugline": "EXT. LAZY-T RANCH - DRIVEWAY - A FEW MOMENTS LATER Family and friends watching, Trumbo greets the three men, among whom we recognize: HUAC Investigator Robert Stripling. STRIPLING Mr. Dalton Trumbo? Stripling hands Trumbo a pink document. INT. U.S. CAPITOL - ROTUNDA - DAY Congressman J. Parnell Thomas stands before REPORTERS: CONGRESSMAN THOMAS Nineteen subpoenas have been issued to those we believe have knowledge of the ongoing Communist threat in Hollywood. This announcement is greeted with a resounding... pause. REPORTER 1 Uh, what kind of threat is that? CONGRESSMAN THOMAS A conspiracy to corrupt democratic values and bring about the overthrow of this nation. REPORTER 2 Using... movies. The CHUCKLING Reporters clearly think this is horseshit. REPORTER 1 Any movie in particular or...? CONGRESSMAN THOMAS (cutting him off) Movies are the most powerful form of influence ever created and they are infested with hidden traitors who will be dragged into the light, for all to see and all to judge. CUT TO:  HEDDA HOPPER’S HOLLYWOOD NEWSREEL Her talking face again appears alongside her column.  (CONTINUED) TRUMBO - JOHN MCNAMARA   23.",
      "characters": [],
      "action_text": "HEDDA HOPPER (to camera) We travel now... CUT TO: EXT./INT. U.S. CAPITOL - VARIOUS SHOTS - DAY - THE HEARINGS And actual newsreel footage in black & white of the Capitol packed with POLITICIANS, EXECUTIVES and STARS. HEDDA HOPPER (V.O.) ...to Washington, D.C., where battle lines are drawn.   On one side, Communist subversives.   On the other, studio heads, labor leaders and some of our brightest stars. And in actual footage from his testimony that day, RONALD REAGAN, 36, handsome and measured, cooperates with Robert Stripling before a PACKED HOUSE. STRIPLING Your profession, Mr. Reagan? RONALD REAGAN Motion picture actor. STRIPLING And you are currently the president of the Screen Actors Guild? RONALD REAGAN Yes, sir. STRIPLING Has it been reported to you that certain members of the guild were Communists? RONALD REAGAN Yes, sir, I have heard different discussions of some of them as Communists. JUMP CUT TO: More actual news footage -- CONGRESSMAN RICHARD M. NIXON (R- California), 34.  CONTINUED: (CONTINUED) TRUMBO - JOHN MCNAMARA   24. RICHARD M. NIXON Do you believe that the motion picture industry is doing everything it can to rid itself of subversive, Un-American influences? Then answering, in testimony we recreate in matching black & white -- ROY BREWER No!   The Communists are everywhere! They report directly to Moscow! Then -- SAM WOOD Enough is enough!   The Communists have to go! DALTON TRUMBO (PRE-LAP) What we’re about to do... CUT TO:  INT. LAZY-T RANCH - LIVING ROOM - DAY - BEFORE THE HEARINGS DALTON TRUMBO ...won’t make us too popular. Trumbo leads a small strategy session with Robert Kenny, Arlen Hird and a HALF-DOZEN of the SUBPOENAED 19 and -- -- Niki, in a corner, quietly taking everything in. DALTON TRUMBO (CONT’D) Our support’s not only going to vanish, we’re going to get attacked by our own. ARLEN HIRD Okay, we get slandered, then what? ROBERT KENNY You testify and answer every question they ask, in your own way. ARLEN HIRD So don’t tell ’em shit. ",
      "dialogue_count": 0,
      "word_count": 2871
    },
    {
      "scene_number": 3,
      "slugline": "INT. HOSPITAL ROOM - DAY Arlen Hird lies in a weakened, post-surgery stupor.   His eyes open and he sees Trumbo setting down some flowers. DALTON TRUMBO How are you? ARLEN HIRD Breathin’.   With one lung.   Which is half as good as two.   How bad’re things out there? DALTON TRUMBO Everybody envies you. Hird looks around the pleasant, private room. ARLEN HIRD Why not.   Got the best room in the joint.   You oughta know, you paid for it. (then, woozy) Thanks.   By the way. Trumbo smiles at Hird, whose eyes flutter shut. INT. A MODERN BUILDING - ENTRY - DAY BUDDY ROSS (PRE-LAP) Mayer’s a dinosaur... Over the streamlined entrance, a steel-sculpted banner:   ROSS INTERNATIONAL PICTURES.  BUDDY ROSS (PRE-LAP) (CONT’D) ...they all are, extinct and don’t even know it. INT. ROSS INTERNATIONAL - BUDDY’S OFFICE - CONTINUOUS Enormous and pristine. BUDDY ROSS Let’s see now, to, uh... Buddy, Trumbo and other MOVIE-INDUSTRY COMPATRIOTS raise champagne glasses in the winter of 1948. (CONTINUED) TRUMBO - JOHN MCNAMARA   38.",
      "characters": [],
      "action_text": "BUDDY ROSS (CONT’D) ...to no more MGM, no more Mayer, I am strictly independent, got cans of film, wads of Wall Street dough and my favorite boss -- me! (all CHUCKLE, CLINK, sip, then to Trumbo) And you, you crazy son of a bitch, are gonna write all my movies, once this Washington crap clears up. A throat is CLEARED.   Trumbo is a bit more pensive than we’ve seen him. DALTON TRUMBO And how’ll that happen? BUDDY ROSS Hey.   I’m not political.   Thank Jesus.   But if they called me in, accused me?   I’d just say, yep, did it, sorry, didn’t mean it. Trumbo nods, willing to move on.   But somehow just can’t help himself. DALTON TRUMBO (evenly) So Congress asks, “Are you now or have you ever been a Democrat...?” BUDDY ROSS “I am... and God, I just feel awful about it, never again...” DALTON TRUMBO But now they want the names of other Democrats. (points at random MEN) Bill... Stan... Earl... Nat. BUDDY ROSS Then I say go to hell. DALTON TRUMBO Really.   And how many banks fund enemies of the state?   Your money’s gone.   Unless you give the names of your friends here.   They’ll never work again.   But it’s the only way you ever will. (then) CONTINUED: (MORE) (CONTINUED) TRUMBO - JOHN MCNAMARA   39. We’re all friends here, we all know each other... we hope.   What would you do, Buddy? Buddy stares, chilled.   Silence.   Then -- BUDDY ROSS Piss on the best day of a guy’s life!   Only you! BIG LAUGHS all around.   But from those four men Trumbo singled out, nervous ones.   And from Trumbo, not so much as a smile. INT. LAZY-T RANCH - STUDY - NIGHT Trumbo hard at the keys, surrounded by full ashtrays, piles of typescript and a half-empty scotch bottle.   He pauses to shift in his seat and twist his aching back. INT. LAZY-T RANCH - LIVING ROOM - DAWN He lies on the couch, scotch on his chest, pillow under his back, scribbling on typed copy, still in some pain.   Niki, almost 11 now, walks in wearing her nightgown. DALTON TRUMBO Morning, Nikola. NIKI I thought you weren’t allowe",
      "dialogue_count": 0,
      "word_count": 1354
    },
    {
      "scene_number": 4,
      "slugline": "EXT. LOS ANGELES AIRFIELD - NIGHT June, 1950.   NO SOUND at first, just MUSIC as Trumbo, Cleo, Niki, Chris, 9, and Mitzi, now 5, cross the tarmac to a waiting DC-3 prop passenger plane.   Suddenly aware of -- A CROWD gathering at the edge of the light, moving toward them.   Then, TWO PEOPLE raise a banner, the words spread out on a sheet between two poles:  DALTON TRUMBO IS GOING TO JAIL!   FREE THE HOLLYWOOD 10!  The crowd closes around the surprised Trumbos.   Hands are offered and shaken.   More signs raised.   More PEOPLE cluster. Cameras are brought out and -- MOMENTS LATER - TRUMBO Slightly embarrassed, is surrounded by family, well-wishers and more huge, handwritten signs bearing his name and plight. MINUTES AFTER THAT - A MONTAGE Capturing the final, sad moments of Trumbo’s goodbye: - Tiny Mitzi hugs Trumbo.   She can’t be pried off. - Trumbo whispers into Chris’ ear: DALTON TRUMBO I’m counting on you.   Your mother needs to laugh.   Once a day.   At least.   Deal? Chris nods and refuses to cry.   Father and son shake hands. - Trumbo hugs Niki. DALTON TRUMBO (CONT’D) Don’t be afraid. NIKI I’m not. She’s angry at herself for tearing up.   Trumbo hands her his silk pocket square. - Trumbo kisses Cleo one last time on the lips. - Trumbo is led off by TWO U.S. MARSHALS. (CONTINUED) TRUMBO - JOHN MCNAMARA   45.",
      "characters": [],
      "action_text": "- Trumbo is up on the ramp of the plane.   A FLASHBULB POPS. The moment is FROZEN into an old sepia photograph. DISSOLVE TO: EXT. ROAD - NIGHT The Trumbo family car rumbles home from the airport. INT. TRUMBO FAMILY CAR - DRIVING - CONTINUOUS In the backseat, Niki consoles Mitzi.   Up front, Chris rides alongside Cleo, who is driving.   Everyone is grieving in their own way.   Then -- CLEO (suddenly blurting) I was married before. Well, this certainly gets the attention of all the kids. CLEO (CONT’D) Your father’s my second husband. NIKI Holy shit. CLEO Niki... NIKI Mom, gimme a break, you can’t just say that and not -- CLEO I’m saying it for a reason.   When I met your father, I had a boyfriend. CHRIS What was his name? CLEO Hal. CHRIS Hal.   Heh. NIKI Did you love him? CLEO That’s not the point. CONTINUED: (CONTINUED) TRUMBO - JOHN MCNAMARA   46. CHRIS What’d you think of Pop back then? CLEO I couldn’t stand him. NIKI So how’d you end up marrying him? CLEO I was waitressing.   He came in for a hamburger, we talked a little, I brought him the check and he proposed. CHRIS Seriously? Cleo catches Niki’s look in the rear view, a smile that says,  that’s Pop.  CLEO I said he was crazy but he kept coming back, night after night. Talking and talking.   And the tips! On a ninety-cent check, he’d leave ten dollars!   After a year, I had over a thousand dollars.   I saved every penny, I wasn’t going to let him think he could buy me.   But... also... I just, I’d never met anyone like him, ever, I couldn’t stop thinking about him.   And guess who didn’t like that much? NIKI Hal. CLEO Hal.   Who got mad, then jealous, then went and got a wedding license and a judge. CHRIS That must’ve made Pop mad. CLEO No.   He just asked if I could see myself with Hal in twenty years and I burst into tears -- I couldn’t see myself with him for twenty more minutes.   He was big and crude and had all these rules... CONTINUED: (MORE) (CONTINUED) TRUMBO - JOHN MCNAMARA   47. (then) Your father wa",
      "dialogue_count": 0,
      "word_count": 1465
    },
    {
      "scene_number": 5,
      "slugline": "INT. ASHLAND FEDERAL PRISON - SUPPLY ROOM - DAY Immaculately organized now. DALTON TRUMBO (V.O.) Not of this place. Trumbo sits, dutifully typing at top speed. DALTON TRUMBO (V.O.) So far... Prison Guard 1 enters, shocked at the crispness of the room -- DALTON TRUMBO (V.O.) ...its challenges are all surmountable.   Augmented by days of lovely boredom, so flat and calm in the wake of all that churning, ugly, luckless battle. -- and the report Brooks writes with a fuck-you smile. DALTON TRUMBO (V.O.) No, my fear is for what will happen...  EXT. LAZY-T RANCH - DRIVEWAY - DAY Cleo is playing a furious game of ping-pong against both Chris and Mitzi -- DALTON TRUMBO (V.O.) ...when I get out.   To our family... -- while Niki sits nearby, absorbed in a copy of the Daily Worker, with its headline: “NEW COMMUNIST HOLLYWOOD HEARINGS BEGIN.” DALTON TRUMBO (V.O.) ...and our country.  INT. ASHLAND FEDERAL PRISON - MESS - DAY DALTON TRUMBO (V.O.) Not all the national news is worrisome.   Some reminds me that what the imagination can’t conjure, reality delivers with a shrug. Nearly deserted but for Trumbo as he enters with a sheaf of reports, crossing past a lone figure mopping the floor: (CONTINUED) TRUMBO - JOHN MCNAMARA   52.",
      "characters": [],
      "action_text": "Congressman J. Parnell Thomas, wearing a prison uniform identical to Trumbo’s.   He stops mopping.   Trumbo pauses in a doorway.   The two men regard one another. DALTON TRUMBO (V.O.) And reality has delivered, in all its beatific wonder, to the federal penal system, former Congressman and head of HUAC, J. Parnell Thomas.   Convicted of tax evasion. Thomas goes back to work.   Trumbo’s eyes linger on Thomas as the former inquisitor dips his mop then swabs the floor. DALTON TRUMBO (V.O.) Proving the truism... Trumbo deposits his sheaf on a table top and exits. DALTON TRUMBO (V.O.) “...Character is destiny.”  INT. LAZY-T RANCH - KITCHEN - DAY On a sunny morning, her three children eating breakfast around her, Cleo finishes this letter. DALTON TRUMBO (V.O.) Yet in all this, I know I’m the luckiest unlucky man ever to live... because you and the children warm, feed, clothe, pacify and rejuvenate me, by never leaving my heart. Love, Prisoner Number 7551. She touches the paper tenderly, gets up and moves to shoeboxes that overflow with Trumbo letters, adding this one.  INT. ASHLAND FEDERAL PRISON - MESS HALL - NIGHT All chairs face a screen as Trumbo and SEVERAL HUNDRED PRISONERS and GUARDS watch a war movie.  UP ON THE MOVIE SCREEN - JOHN WAYNE Plays a gung-ho soldier, barking orders amid backlot GUNFIRE.  BACK DOWN IN THE AUDIENCE Trumbo smokes and watches.   Sitting next to him, Virgil Brooks is totally caught up in the war drama. CONTINUED: TRUMBO - JOHN MCNAMARA   53.",
      "dialogue_count": 0,
      "word_count": 459
    },
    {
      "scene_number": 6,
      "slugline": "INT. ASHLAND FEDERAL PRISON - CORRIDOR - NIGHT Trumbo, Brooks, Prisoners and Guards walk back to the dorm. BROOKS You know John Wayne? DALTON TRUMBO I do. BROOKS What’s he like? DALTON TRUMBO You’d love each other. EXT. THE BROWN DERBY - TO ESTABLISH - DAY It was, in fact, an enormous, brown, stucco hat. INT. THE BROWN DERBY - CONTINUOUS Near the front door, the MAITRE D’ slides Hedda’s coat on. A MAN (O.S.) ‘Scuse me?   Are you Hedda Hopper? She turns and sees a YOUNG ENLISTED MAN in an army uniform, awkward, nervous, respectful, whose empty right sleeve is pinned up.   He’s lost an arm. HEDDA HOPPER I -- yes, hello, how do you -- ? She holds out her right hand, is instantly mortified, but the Enlisted Man clasps her right with his left. ENLISTED MAN I don’t mean to bother you, I’m here with my cousin, he’s a gaffer at Columbia?   Thought he’d treat me to the big time.   I read you a lot, all the guys do.   Not just the showbiz stuff.   You get what’s really going on, with Russia, the Commies here, the investigations. Thank you. HEDDA HOPPER Where did you serve? ENLISTED MAN Korea. (CONTINUED) TRUMBO - JOHN MCNAMARA   54.",
      "characters": [],
      "action_text": "HEDDA HOPPER And you’re how old...? ENLISTED MAN (proudly) Next month I’ll be twenty. She has no words, just looks at this boy, struck to her core. EXT. LAZY-T RANCH - LAKE - DAY March, 1951.   An Appaloosa horse stands against the mountain range, lazily dipping its head to chew grass, then raising it to scan the horizon. Nearby, Cleo focuses her camera on the majestic animal.   She CLICKS off several shots.   Chris is nearby, holding spare film canisters and lenses. CHRIS Mom. CLEO Mm? CHRIS I’ve got a new one. She glances at Chris, who uses his hands to shove his cheeks in toward each other -- then smiles, making his mouth kind of a chubby vertical smile.   Cleo chuckles and aims her camera at him. NIKI (O.S.) Mom! She turns.   Her daughter is at the back door of the main house. NIKI (CONT’D) You better come quick! INT. LAZY-T RANCH - LIVING ROOM - DAY Chris and Cleo enter, Niki crouched in front of the enormous radio, dialing a clearer reception. STRIPLING (ON RADIO) ...ever been a member of the Communist Party? CONTINUED: (CONTINUED) TRUMBO - JOHN MCNAMARA   55. EDWARD G. ROBINSON (ON RADIO) I am not now nor have I ever been a member of that party, no... INT. U.S. CAPITOL - CAUCUS ROOM - CONTINUOUS EDWARD G. ROBINSON ...I have always been a liberal Democrat. Robinson is in the same seat Trumbo occupied.   But no longer a packed circus, it is now a rehearsed   degradation ceremony.  Robinson speaks into radio microphones splayed before him as he looks into the eyes of Investigator Robert Stripling. STRIPLING But in your home, over the years, there have been political meetings. Attended by those we now know to be Communists. EDWARD G. ROBINSON Yes sir, yes, that has now been made clear to me... there were tremendous activities that went on in my house during the war... EXT. TEXARKANA FEDERAL PRISON - DAY A cinder-block Texas facility on a brown, scrubby flat. EDWARD G. ROBINSON (ON RADIO) ...but I did not know then their true affiliations... the work they were up ",
      "dialogue_count": 0,
      "word_count": 625
    },
    {
      "scene_number": 7,
      "slugline": "INT. ASHLAND FEDERAL PRISON - MESS HALL - DAY Most PRISONERS ignore the hearing CRACKLING on a small radio, but a FEW, including Virgil Brooks and Trumbo, listen. Congressman Thomas, wiping down tables, is far away... but listens intently, glancing occasionally at -- Trumbo, stony, a flicker of sadness in his eyes -- INT. U.S. CAPITOL - CAUCUS ROOM - CONTINUOUS -- as Robinson’s eyes harden, a man determined -- EDWARD G. ROBINSON I was duped and used.   I was lied to. INT. LAZY-T RANCH - LIVING ROOM - CONTINUOUS -- Cleo’s eyes close.   The kids are transfixed. STRIPLING (ON RADIO) Who used you? INT. U.S. CAPITOL - CAUCUS ROOM - CONTINUOUS EDWARD G. ROBINSON Well, these... sinister forces who ran these... organizations in which I became a member, these.... uh, so- called Communist fronts. STRIPLING Tell us the names of individuals. INT. ASHLAND FEDERAL PRISON - MESS - CONTINUOUS Trumbo and Thomas, across the room from one another, both wait. STRIPLING (ON RADIO) (after a beat) Mr. Robinson? INT. U.S. CAPITOL - CAUCUS ROOM - CONTINUOUS EDWARD G. ROBINSON Well, you had Albert Maltz, uh, Ring Lardner, Jr., and that top fellow who they say is the, uh, commissar out there... (CONTINUED) TRUMBO - JOHN MCNAMARA   57.",
      "characters": [],
      "action_text": "STRIPLING Arlen Hird? EDWARD G. ROBINSON Yes... INT. TEXARKANA FEDERAL PRISON - HOSPITAL WING - CONTINUOUS Arlen Hird is unflinching as he hears -- EDWARD G. ROBINSON (ON RADIO) ...Arlen Hird.   Waldo Salt, Ian McLellan Hunter. INT. ASHLAND FEDERAL PRISON - MESS - CONTINUOUS EDWARD G. ROBINSON (ON RADIO) And Dalton... -- as is Trumbo -- INT. U.S. CAPITOL - CAUCUS ROOM - CONTINUOUS EDWARD G. ROBINSON ...Trumbo. -- Robinson feels relief, hoping this is all now behind him. INT. ASHLAND FEDERAL PRISON - MESS - CONTINUOUS Brooks looks at the radio, disgusted, as we hear -- EDWARD G. ROBINSON   (ON RADIO) But at the time, it never entered my mind that any of these people were Communists... BROOKS (to Trumbo) That guy’s a friend of yours? (no response from Trumbo) Lucky he’s out there. And though he speaks to Trumbo, he speaks at Thomas: BROOKS (CONT’D) Snitch like that in here, you’re fuckin’ dead. Trumbo leaves a terrified Thomas with a smiling Brooks. CONTINUED: TRUMBO - JOHN MCNAMARA   58.",
      "dialogue_count": 0,
      "word_count": 379
    },
    {
      "scene_number": 8,
      "slugline": "INT. MOTION PICTURE ALLIANCE OFFICES - LOBBY - DAY BUSTLING.   CROWDED.   Edward G. Robinson is seated.   Waiting. His eyes flick to a closed door.   Stenciled on it:   JOHN WAYNE, PRESIDENT.  INT. MOTION PICTURE ALLIANCE - WAYNE’S OFFICE - CONTINUOUS Wayne, Roy Brewer, Hedda and a FEW OTHERS meet. JOHN WAYNE Eddie oughta go back to work, he did what he had to. HEDDA HOPPER He did what he was forced to. JOHN WAYNE Point is, he did it. HEDDA HOPPER Brave men are fighting this battle, sacrificing in ways we can’t even imagine, and you talk about some asshole’s “career”?   I’d see Eddie Robinson and everyone like him dead if it’d bring one boy back from Korea.   One. JOHN WAYNE So what’re you saying?   Guys like Eddie cooperate and get nothin’? (then) That isn’t right. HEDDA HOPPER Careful, Duke. JOHN WAYNE Or what, Hedda? They stare at each other, neither moving or blinking. JOHN WAYNE (CONT’D) If I’m not careful.   What? The room is frozen, cigarette smoke the only moving thing. Then Hedda breaks the tension with a quick smile. HEDDA HOPPER I had no idea you were such a softie. (CONTINUED) TRUMBO - JOHN MCNAMARA   59.",
      "characters": [],
      "action_text": "Wayne studies her, then allows himself a grin. JOHN WAYNE That’s me.   All cuddles. INT. MOTION PICTURE ALLIANCE OFFICES - LOBBY - DAY Wayne walks Robinson out. JOHN WAYNE I’m proud of ya, Eddie. EDWARD G. ROBINSON (flat, far off) Thanks, Duke. JOHN WAYNE Wasn’t easy, I know, but ya did good.   I’m gonna call the studios, the offers’ll pour in. (off Robinson’s mute nod) Y’okay? EDWARD G. ROBINSON Sure.   Thanks.   And tell Hedda... (beat) Give her my love, willya? JOHN WAYNE Not sure she’d know what to do with it.   That is one hard broad. CUT TO:  NEWSREEL FOOTAGE - STOCK Of the end of the ROSENBERG espionage trial.   The Couple has been found guilty of selling atomic secrets to Russia and sentenced to death, then... CUT TO: NEWSREEL FOOTAGE - STOCK Of SENATOR JOSEPH McCARTHY’S rise as he purports to uncover Communists throughout the United States.  INT. ASHLAND FEDERAL PRISON - PRISONER PROCESSING - NIGHT Spring, 1951.   The same room where Trumbo was stripped naked and examined upon his entrance.   Now he is back in his suit, tie and overcoat.   His wedding ring, lighter, cigarette case and holder are returned by a GUARD. CONTINUED: TRUMBO - JOHN MCNAMARA   60.",
      "dialogue_count": 0,
      "word_count": 399
    },
    {
      "scene_number": 9,
      "slugline": "EXT. ASHLAND FEDERAL PRISON - OUTSIDE THE FRONT GATE - NIGHT A taxi idles.   Cleo waits.   A SILHOUETTE approaches on the other side of the closed gate, which RUMBLES open, revealing Trumbo, now free.   Cleo smiles, they move into one another at last and kiss, then -- EXT. LAZY-T RANCH - DAY -- Trumbo drowns in the hugs of Chris, 10, and Mitzi, 6. DALTON TRUMBO Giants!   What have you huge, beautiful strangers done with my little ones? Niki appears in a dress.   Tall.   Almost 13.   A young woman. DALTON TRUMBO (CONT’D) Good God. (as he moves to her) Lipstick? NIKI (embarrassed) Da-aaad. He takes her hands and kisses her cheek.   Then the five reunited Trumbos move into the house, REVEALING: A “FOR SALE” sign on a fence and tacked across it: “SOLD.” INT. CHASEN’S - DAY CROWDED.   Trumbo enters and sees Arlen Hird at the far end of the bar, makes his way to him, as a KNOT OF BUSINESSMEN cross his path.   Trumbo bumps one. DALTON TRUMBO Pardon me, I’m terribly -- It’s Buddy Ross.   Trumbo is delighted. DALTON TRUMBO (CONT’D) Buddy.   How are you? Buddy is highly aware of the men in his group, watching him. BUDDY ROSS (to Trumbo, icy) I got nothin’ to say to you. (CONTINUED) TRUMBO - JOHN MCNAMARA   61.",
      "characters": [],
      "action_text": "Buddy turns and strides off, followed by the men, all of whom WHISPER to each other. INT. CHASEN’S - AT THE BAR - LATER Trumbo and Hird sip their cocktails. DALTON TRUMBO So.   Jail’s given us the plague. ARLEN HIRD Buddy was always an asshole. He glances into the restaurant dining area, where he can see Buddy animatedly making a pitch to that group of men. ARLEN HIRD (CONT’D) And he’s in trouble.   Three movies, three flops. (re: Buddy’s sweaty chatter) Look at him.   Tryin’ to sell his soul but can’t find it.   Just hope he stays afloat long enough to get the shit sued out of him. DALTON TRUMBO By whom? ARLEN HIRD You, me, all of us, go on the offensive this time, sue the studios, all these guys, use their own capitalist system against them, in civil court -- make ’em admit under oath -- DALTON TRUMBO -- No, no, no, Jesus, haven’t you spent enough time in court?   I have. ARLEN HIRD What do you, got a better idea? DALTON TRUMBO Do the one thing everyone says we can’t.   Work. EXT. RUNDOWN HOLLYWOOD BACK STREET - DAY Trumbo crosses a courtyard of slouching palms and tobacco- colored bungalows, the offices of:   KING BROTHERS PICTURES . CONTINUED: (CONTINUED) TRUMBO - JOHN MCNAMARA   62. FRANK KING (PRE-LAP) Look.   You’re a great writer... INT. KING BROTHERS PICTURES - FRANK’S OFFICE - DAY Trumbo sits across from a beefy, harried, vaguely menacing man in his 40s named: FRANK KING ...we make shit.   I don’t see it. DALTON TRUMBO Mr. King, I’m a screenwriter.   If I couldn’t write shit, I’d starve. On the walls, lurid posters of King Brothers movies: star- free gangster, horror, sci-fi and western quickies. FRANK KING We can’t afford you. DALTON TRUMBO How much did you pay for the script of... (points to western poster) ...that? FRANK KING Twelve-hundred bucks. DALTON TRUMBO I’ll write you a movie for twelve hundred, then. FRANK KING And you don’t want your name on it. DALTON TRUMBO No, you don’t want my name on it. HYMIE KING (O.S.) You got that right... And in a co",
      "dialogue_count": 0,
      "word_count": 1047
    },
    {
      "scene_number": 10,
      "slugline": "EXT. TRUMBO HIGHLAND PARK HOUSE - BACK PATIO - DAY Beside a shimmering pool, Trumbo and Mitzi tend to a tiny, injured bird.   She is upset, Trumbo warmly calm. DALTON TRUMBO It’s a broken wing but he’s going to be just fine, sweetie. MITZI He’s scared. DALTON TRUMBO We’ll get him some water, some nice, yummy worms, go inside, ask mom for a shoebox. She runs into the house.   Trumbo cups the bird. INT. TRUMBO HIGHLAND PARK HOUSE - LIVING ROOM - DAYS LATER The house has been completely moved into.   Cleo comes down the stairs in a bathing suit. CLEO C’mon, Mitzi! Mitzi races down the stairs, also in a bathing suit.   Mother and daughter cross through the house, excited.   They pass a YAWNING Trumbo still in his robe.   He opens the front door -- EXT. TRUMBO HIGHLAND PARK HOUSE - FRONT DOOR - CONTINUOUS -- to get the paper and lying next to it, sees a plain envelope. Trumbo picks it up and opens it.   It reads in block letters --  WELCOME TRAITOR.   WE DID THE POOL. - YOUR NEIGHBORS  Alarmed, Trumbo hurries out to -- INT./EXT. TRUMBO HIGHLAND PARK HOUSE - BACK PATIO - CONTINUOUS -- where Cleo comforts Mitzi, upset as Trumbo exits the house to see -- -- their pool fouled with garbage, dirt, floating dead rats. Trumbo immediately moves to his wife and child. DALTON TRUMBO All right.   Inside. (CONTINUED) TRUMBO - JOHN MCNAMARA   66.",
      "characters": [],
      "action_text": "He glances across his fence and sees his NEXT-DOOR NEIGHBOR, 30s, tight white t-shirt, watering his lawn.   And an unmistakably big, shit-eating grin on his face. INT. TRUMBO HIGHLAND PARK HOUSE - DINING ROOM - NIGHT Trumbo presides over the family dinner. DALTON TRUMBO There are many ignorant, angry people in the world.   And they appear to be breeding in record numbers.   All we can do is stay together and remain vigilant. EXT. LOS ANGELES MOVIE THEATRE 2 - NIGHT Fall, 1953, as WE FIND the bright marquee, announcing:  Roman Holiday .   Starring Gregory Peck and Audrey Hepburn. Below that, a lit poster for the breezy romantic comedy. TIGHT on the movie’s credits and ISOLATE:  Original Story by Ian McLellan Hunter.  INT. LOS ANGELES MOVIE THEATRE 2 - CONTINUOUS Among the ROWS of MOVIE FANS, Dalton and Cleo Trumbo enjoy a lovely, funny scene, LAUGHING with the rest of the audience, though perhaps with a bit more restraint. IAN MCLELLAN HUNTER (PRE-LAP) Big hit, great reviews -- INT. DINER - DOWNTOWN L.A. - DAY IAN MCLELLAN HUNTER -- haven’t worked in nine months. Trumbo sips coffee.   Hunter reaches for the cream. IAN MCLELLAN HUNTER (CONT’D) You? DALTON TRUMBO There aren’t quite enough zeroes in a King Brothers salary to survive -- FLASHBACK TO:  INT. TRUMBO HIGHLAND PARK HOUSE - STUDY - DAY Trumbo at the typewriter, surrounded by empty shelves.  CONTINUED: (CONTINUED) TRUMBO - JOHN MCNAMARA   67. DALTON TRUMBO (V.O.) -- but they need scripts like an army needs food.   Quality, minimal; quantity, maximal. THIS OFFICE MORPHS OVER THE YEAR As Trumbo writes, never leaving the desk, as if chained.   And WITHOUT A SINGLE CUT, all around him, the shelves fill with scripts, the office growing more and more cluttered. DALTON TRUMBO (V.O.) Every work week is seven days, every day is fourteen hours, every minute I’m behind.   And I’m becoming a stranger in my own home. BACK TO:  INT. DINER - DOWNTOWN L.A. - DAY IAN MCLELLAN HUNTER They need five of you. Trumbo smiles slyly. I",
      "dialogue_count": 0,
      "word_count": 1057
    },
    {
      "scene_number": 11,
      "slugline": "INT. TRUMBO HIGHLAND PARK HOUSE - FRONT HALL - DAY DALTON TRUMBO (V.O.) We’ll be adding new phone lines. A phone on a table.   Then ANOTHER DISSOLVES IN alongside it. Then ANOTHER.   One RINGS. DALTON TRUMBO (V.O.) When you answer, never say “Trumbo residence,” just -- Chris, 12, picks up the phone. CHRIS Hello. A MAN’S VOICE (ON PHONE) Is John Abbott there? DALTON TRUMBO (V.O.) Whoever they ask for, find me or -- CHRIS No, sir, may I take a message? He listens as he writes a message for “John Abbott.”  BACK TO: INT. TRUMBO HIGHLAND PARK HOUSE - LIVING ROOM - DAY DALTON TRUMBO The door must be answered at all hours. CUT TO:  INT./EXT. TRUMBO HIGHLAND PARK HOUSE - FRONT DOOR - NIGHT A DOORBELL CHIMES.   Mitzi, 8, opens it.   A UNIFORMED MESSENGER stands, checking a clipboard. MESSENGER Got a pickup from... Sally Stubblefield? Mitzi checks a side table stacked with large envelopes, finds the one marked “Sally Stubblefield” and hands it to the Messenger. MESSENGER (CONT’D) Can I get your dad to sign?  (CONTINUED) TRUMBO - JOHN MCNAMARA   71.",
      "characters": [],
      "action_text": "She scribbles on the clipboard like a pro and shuts the door. BACK TO:  INT. TRUMBO HIGHLAND PARK HOUSE - LIVING ROOM - DAY DALTON TRUMBO Dictation, short hand and typing will be learned.   Those of legal age will have one of the most important jobs imaginable. CUT TO:  EXT. LIPPERT PICTURES - DAY A scruffy little independent company. DALTON TRUMBO (V.O.) Courier. Cleo’s car pulls up, she exits, moves to a delivery entrance. The door opens.   A WOMAN’S HAND holds out an envelope. INT. TRUMBO’S CAR - MOMENTS LATER Cleo checks the envelope, fat with twenty-dollar bills. BACK TO:  INT. TRUMBO HIGHLAND PARK HOUSE - LIVING ROOM - DAY DALTON TRUMBO (to his family) Questions?   Comments? Niki raises her hand. NIKI Is there a schedule? DALTON TRUMBO A what. NIKI I need to know when I can do homework.   And I’m on a fundraising committee for Negro Voting Rights, plus -- CLEO All right, honey, we’ll work it out. CONTINUED: (MORE) (CONTINUED) TRUMBO - JOHN MCNAMARA   72. (as Trumbo begins to object, she throws him a look) Won’t we. He doesn’t answer.   Trumbo and Niki lock eyes in uneasy silence.  INT. TRUMBO HIGHLAND PARK HOUSE - STUDY - NIGHT Niki watches a bulky new television set, the picture jittery: ON TV - AFRICAN-AMERICAN PROTESTERS In actual black & white news footage MARCH outside schools. TV ANCHOR (V.O.) ...and protests continued as the Supreme Court takes up the issue of racial segregation... NEARBY, TRUMBO TYPES Then pulls rough copy from his carriage and holds it out to Niki, but she is riveted by -- TV ANCHOR (V.O.) ...while throughout the nation, heated debate over integration... -- until she sees the page he proffers, SIGHS, takes it, moves to a second typewriter and begins HAMMERING out the final carbon, her eyes straying to the TV images of PROTESTS. SAME SCENE - LATER Trumbo is alone, the TV is off.   Trumbo opens a drawer, takes out a pill bottle, shakes out one tablet, then decides two would be better. As he pops them in his mouth, Cleo appears in the do",
      "dialogue_count": 0,
      "word_count": 1901
    },
    {
      "scene_number": 12,
      "slugline": "INT. TRUMBO HIGHLAND PARK HOUSE - STUDY - CONTINUOUS DALTON TRUMBO -- keep losing, give all your money to lawyers -- ARLEN HIRD I’d rather lose for the right reason than -- DALTON TRUMBO (roaring) WHY? INT. TRUMBO HIGHLAND PARK HOUSE - KITCHEN - CONTINUOUS Cleo’s deft hands flutter, a glass FUMBLES off her fingertips and HITS the floor in an EXPLOSION of shards -- INT. TRUMBO HIGHLAND PARK HOUSE - STUDY - CONTINUOUS DALTON TRUMBO It’s LOSING! INT. TRUMBO HIGHLAND PARK HOUSE - FRONT DOOR - CONTINUOUS Cleo sweeps her children out. CLEO C’mon, kids, we’re going to the store. CHRIS (to Cleo) But -- DALTON TRUMBO (O.S.) I lose -- ! CLEO (to her kids) Now. DALTON TRUMBO (O.S.) -- you lose -- ! MITZI Which store? DALTON TRUMBO (O.S.) -- we ALL lose -- ! (CONTINUED) TRUMBO - JOHN MCNAMARA   81.",
      "characters": [],
      "action_text": "CLEO Any store. Cleo’s calm but sharp demeanor is not to be ignored.   The kids follow her out. INT. TRUMBO HIGHLAND PARK HOUSE - STUDY - CONTINUOUS DALTON TRUMBO -- and the whole goddamn country stays scared and dead!   You want to live like this forever?   Or do something?   We can beat them, we can win! ARLEN HIRD I don’t care if I win -- DALTON TRUMBO -- Oh, bullshit, everyone wants to win -- ARLEN HIRD No, you wanna win, I wanna change things. DALTON TRUMBO I want to win so I can change things -- ARLEN HIRD No, you want the Oscar you can’t have and the money you burn through writing shit for idiots. DALTON TRUMBO Why do I have to explain everything like you’re a fucking child? A beat, as Hird retreats quietly... ARLEN HIRD You don’t.   Okay?   You don’t. (heads for exit) Do what you do.   It’s fine.   For you. Trumbo, sensing he’s perhaps gone too far -- DALTON TRUMBO (calming) Arlen... CONTINUED: (CONTINUED) TRUMBO - JOHN MCNAMARA   82. ARLEN HIRD I know what I’m fighting for.   You want another lake.   And you know what?   You’re gonna get it. Hird is gone.   Trumbo is alone in the sudden quiet. INT. TRUMBO HIGHLAND PARK HOUSE - STUDY - DAY Trumbo sits, still and silent, smoke curling off the cigarette in his fingers, staring at a blank typewriter page. INT. TRUMBO HIGHLAND PARK HOUSE - BATHROOM - NIGHT The tub is full of hot water, Trumbo is in there, writing at about half-speed, pausing every few words to smoke and rub his head. INT. KING BROTHERS - OUTER OFFICE - DAY Cleo drops off a script to the Secretary, gets the cash envelope. INT. TRUMBO HIGHLAND PARK HOUSE - BATHROOM - NIGHT Trumbo in the tub again, writing at top speed as WE RACK FOCUS TO that pill bottle we saw in his office.   And REVEAL here it’s Benzedrine.   From downstairs, he can just barely hear CHEERFUL FAMILY VOICES -- INT. TRUMBO HIGHLAND PARK HOUSE - DINING ROOM - CONTINUOUS Niki, just turning 16 now, blows out the candles on her birthday cake.   APPLAUSE from Cleo, Chris and Mitzi, all",
      "dialogue_count": 0,
      "word_count": 3206
    },
    {
      "scene_number": 13,
      "slugline": "EXT. DINER - DOWNTOWN L.A. - NIGHT Trumbo exits with Niki.   Then she stops. NIKI I didn’t want to fight in front of my friends but -- DALTON TRUMBO -- I‘m not here to fight -- NIKI -- I’m not coming home. She folds her arms and stands.   He pauses, then speaks carefully, quietly, almost hesitantly. DALTON TRUMBO Your mother is a quiet person. (dry) Normally. (then) The effect of which is... she can actually make me hear myself... and lately, it’s not a sound I like much.   Because what I hear mostly is just... how afraid I am. This is not what Niki expected.   She softens, listening. DALTON TRUMBO (CONT’D) Afraid this is scarring you, all of you... and what if it’s all for nothing?   How do I live with that? (then) So I fight.   It’s all I know how to do anymore, just... rage... at anyone in my way. (looking tenderly at her) But you’ve never been in my way, Nikola, not once... and never could be. Tears in her eyes now, she leans against him, allowing him to put one arm across her shoulders and kiss her head. NIKI It’s crazy how mad you make me, since all I ever wanted is to be just like you... DALTON TRUMBO You are.   Which I wouldn’t wish on anybody. TRUMBO - JOHN MCNAMARA   97.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 226
    },
    {
      "scene_number": 14,
      "slugline": "INT. KING BROTHERS - FRANK’S OFFICE - DAY Frank sits at his desk -- across from Roy Brewer. ROY BREWER We know.   Okay?   It’s a small town and the gossip’s always true. (then) Fire Dalton Trumbo and the rest of ’em or you got pickets, headlines and boycotts.   We will put you right out of business. FRANK KING We...? ROY BREWER Motion Picture Alliance for the Preservation of American Ideals. Me, Ronald Reagan, Hedda Hopper, the guilds, studio heads.   John Wayne. FRANK KING I love John Wayne. ROY BREWER I’ll introduce you.   You guys could do a movie together. FRANK KING That’d be great, only... Frank King rises, holding a baseball bat. FRANK KING (CONT’D) ...I don’t think you and me are gonna be pals. King swings viciously and SMASHES a lamp.   Brewer covers up, SCREAMS and goes for the door.   Locked.   Frank comes at him.  FRANK KING (CONT’D) You gonna stop me hiring union? I’ll go downtown, grab some winos and hookers, there’s my next cast ’n’ crew!   It doesn’t matter!   I make garbage! He swings and SHATTERS a poster. (CONTINUED) TRUMBO - JOHN MCNAMARA   98.",
      "characters": [],
      "action_text": "FRANK KING (CONT’D) Wanna call me a pinko in all the papers?   Do it!   Nobody who goes to my movies can fuckin’ read! Another tight swing and he BLASTS a second poster. FRANK KING (CONT’D) I’m in this for the money and the pussy and they’re both fallin’ off the trees.   Take that away from me. Frank jams the tip of the bat into Brewer’s throat. FRANK KING (CONT’D) Go ahead.   I won’t “sue” you.   But this -- (the bat) -- will be the last fuckin’ thing you see when I beat you to fuckin’ death with it. Brewer just stands, hyperventilating with terror.   Frank TAPS the door with the bat and it opens from the outside.   Roy Brewer bolts -- INT. KING BROTHERS - OUTER OFFICE - CONTINUOUS -- tears across the room, passing Hymie and practically tripping over a seated, startled Dalton Trumbo and -- -- Brewer glances at Trumbo, acknowledging the writer with disbelief as he tumbles out the door. FRANK KING Fuck do you want? DALTON TRUMBO New script. FRANK KING Yeah? DALTON TRUMBO Family film, something I’ve been mulling for a while.   About a Mexican boy and his pet bull. (hands it to him) One problem. TIGHT ON the title page:   The Brave One .   By Robert Rich . CONTINUED: (CONTINUED) TRUMBO - JOHN MCNAMARA   99. KING Expensive? DALTON TRUMBO Worse.   Good. INT. LOS ANGELES MOVIE THEATRE 3 - NIGHT Fall, 1956. Hundreds of eyes drink in the vivid color:  UP ON THE SCREEN The Brave One’s opening credits.   Stirring MUSIC.   Vibrant Mexican imagery of a boy and his bull.  IN THE AUDIENCE Amid a sea of clean-cut ’50s FAMILIES WITH KIDS and a FEW YOUNG CALIFORNIA-CASUAL COUPLES we find: THE FIVE TRUMBOS Dalton, Cleo, Niki, Chris and Mitzi, munching popcorn, as:  UP ON THE SCREEN The writing credits appear and we see: Original Story by Robert Rich . CLOSE ON DALTON TRUMBO’S FACE And that writing credit is reflected in his glasses -- as if tattooed across his eyes, marking him: Robert Rich. CLEO Looks down and adjusts the pleats of her dress until the credit passes. INT. TRUMBO HIGH",
      "dialogue_count": 0,
      "word_count": 3056
    },
    {
      "scene_number": 15,
      "slugline": "INT. TRUMBO HIGHLAND PARK HOUSE - STUDY - CONTINUOUS DALTON TRUMBO As someone who’s been thoroughly investigated by the House Un- American Activities Committee, I started wondering... INT. HEDDA HOPPER’S MANSION - HOME OFFICE - CONTINUOUS  DALTON TRUMBO (ON TV) ...why hasn’t anyone ever taken a good, long look at them?   And their work in the movie industry?  She approaches Trumbo’s TV face here in her home, her party guests as awkward as caught children. INT. OTTO PREMINGER’S HOTEL SUITE - CONTINUOUS Preminger dresses for dinner, half-watching:  DALTON TRUMBO (ON TV) They were convened to uncover enemy agents, expose Communist conspiracies and write anti- sedition laws.  INT. KIRK DOUGLAS’ MANSION - KITCHEN - CONTINUOUS Douglas has the phone to his ear but is mostly watching:  DALTON TRUMBO (ON TV) Now here we are, thousands of hours and millions of dollars later: agents uncovered -- zero; conspiracies exposed -- zero; laws written -- zero.  INT. OTTO PREMINGER’S HOTEL SUITE - CONTINUOUS Preminger CHUCKLES, loving it. INT. HEDDA HOPPER’S MANSION - HOME OFFICE - CONTINUOUS  DALTON TRUMBO (ON TV) All they do is deny people the right to work and they can’t even get that right.   Academy Awards -- (self) -- two.  (CONTINUED) TRUMBO - JOHN MCNAMARA   114.",
      "characters": [],
      "action_text": "HEDDA HOPPER Mother-FUCKER! She HURLS her tumbler at the screen -- glass and liquid EXPLODE over Trumbo’s TV image. INT. OTTO PREMINGER’S HOTEL SUITE - CONTINUOUS -- Preminger HOWLS with LAUGHTER -- INT. KIRK DOUGLAS’ MANSION - KITCHEN - CONTINUOUS -- as Douglas hangs up the phone, silently transfixed.  TV INTERVIEWER (ON TV) And how does that feel?   To have so undermined the blacklist it’s almost a joke?  DALTON TRUMBO (ON TV) A joke. (contemplates this darkly) I know the blacklist that produced Robert Rich, I’ve seen its horror, cruelty and hideous waste of life as I’ve marched in the long line of its anonymous.  INT. TRUMBO HIGHLAND PARK HOUSE - STUDY - CONTINUOUS DALTON TRUMBO I can’t invent one more witticism about Robert Rich or the Oscar he can’t claim... because that small, worthless, golden statue is covered with the blood of my friends. Twelve years of this foul thing is enough.   None of us should yield one more inch... or give them one more life. INT./EXT. PREMINGER’S ROLLS ROYCE/BEL AIR - DRIVING - DAY January, 1960.   Preminger is in back, holding the script of  Exodus,   speaking into an elaborate mobile telephone of the era: OTTO PREMINGER I’ve read your latest draft. INTERCUT: CONTINUED: TRUMBO - JOHN MCNAMARA   115.",
      "dialogue_count": 0,
      "word_count": 417
    },
    {
      "scene_number": 16,
      "slugline": "INT. TRUMBO HIGHLAND PARK HOUSE - DINING ROOM - CONTINUOUS Trumbo is just sitting down to breakfast.   He has the Cockatiel. DALTON TRUMBO What do you think? OTTO PREMINGER My answer is on the front page of today’s   New York Times.  Trumbo picks up one of several papers there.   And is stoically astonished by a headline of January 20, 1960:  “OTTO   PREMINGER ANNOUNCES EXODUS WRITTEN BY DALTON TRUMBO”  He is without words as he fully takes this in.   Then: DALTON TRUMBO You hate it that much. OTTO PREMINGER Merry Christmas, Mr. Trumbo. INT. UNIVERSAL PICTURES - SCREENING ROOM - DAY Ed Muhl enters the dark, empty room, FLICKERING with a rough- cut scene of:  Spartacus hurled against the wall by the African slave, DRABA, pinned with his trident.  In a corner of the screening room, our Douglas is pleased, picks up the phone.   Notices Ed Muhl. KIRK DOUGLAS Hi, Ed, hang on. (into intercom) Put up the speech before the big battle? (into phone) Warren, I’d like you to put out a press release, saying the screenplay for   Spartacus   was written by Dalton Trumbo.   Thanks. Douglas hangs up.   Ed Muhl doesn’t like this.   One bit. ED MUHL Kirk.   If you won’t get rid of Trumbo, I will. (CONTINUED) TRUMBO - JOHN MCNAMARA   116.",
      "characters": [],
      "action_text": "KIRK DOUGLAS And right after I quit, you can reshoot all my scenes.   See, Ed, for better or worse... I am Spartacus. INT. AMERICAN LEGION HALL - DAY Hedda Hopper and John Wayne are both on stage, addressing TWO- THOUSAND LEGIONNAIRES. HEDDA HOPPER There’s a picture coming out. Starring Kirk Douglas.   Written by Dalton Trumbo. HISSES and BOOS echo. HEDDA HOPPER (CONT’D) It’s called   Spartacus .   And don’t believe it if there’s some other writer’s name on it.   We’re onto them!   Aren’t we? APPLAUSE and mounting CHEERS. JOHN WAYNE We sure are.   ’Cause it’s a new day! (the crowd ROARS) A NEW DAY! INT. LA SCALA RESTAURANT - NIGHT Ed Muhl threads through the sleek industry CROWD, picks up a phone at the bar: ED MUHL Yes? INTERCUT: INT. MOTION PICTURE ALLIANCE OFFICES - BULLPEN - CONTINUOUS HEDDA HOPPER Ed.   Every theatre that movie is in’ll get picketed unless you pull the prints, tonight, and take that fucking traitor’s name off. ED MUHL Hedda, that’s expensive and pointless. CONTINUED: (CONTINUED) TRUMBO - JOHN MCNAMARA   117. HEDDA HOPPER Then kiss your movie, your studio and your miserable ass goodbye! EXT. GLAMOROUS HOLLYWOOD MOVIE THEATRE - NIGHT October, 1960.   The world premiere of   Spartacus . (ARCHIVAL FOOTAGE) INT. GLAMOROUS HOLLYWOOD MOVIE THEATRE - NIGHT The movie has begun.   Black-tie AUDIENCE eyes drink in:  THE OPENING CREDITS OF SPARTACUS - UP ON THE SCREEN We hear the percussive SCORE and see the stunning titles.  TRUMBO AND CLEO Sit a few seats from Kirk Douglas and his WIFE as --  UP ON THE SCREEN - THE NAME DALTON TRUMBO APPEARS Under the words “Screenplay by.”  TRUMBO’S OWN NAME Is reflected in his glasses.   And strikes him deeply. CLEO Grips her husband’s arm, holds her breath, savors this. INT. TRUMBO HIGHLAND PARK HOUSE - MASTER BEDROOM - NIGHT Undressing, Trumbo hears a quiet SOB from across the room. DALTON TRUMBO Cleo? She is at her vanity table, in her robe, CRYING. DALTON TRUMBO (CONT’D) What, what is it? CLEO It’s over, isn’t it. ",
      "dialogue_count": 0,
      "word_count": 1529
    }
  ]
}