{
  "slug": "tully-2018",
  "title": "tully",
  "genre": "drama",
  "format": "film",
  "scenes_count": 13,
  "characters_count": 1,
  "characters": [
    "MARLO"
  ],
  "total_words": 16813,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. MARLO AND DREW’S HOUSE (JONAH’S BEDROOM) - NIGHT MUSIC: “SPACE ODDITY” by the Langley Schools Music Project MARLO MOREAU wears a maternity T-shirt and sweatpants. She is hugely pregnant. She kneels on the floor of a BOY’S BEDROOM in a small suburban home. Her son JONAH, 5, is standing next to her. He is shirtless but wears pajama pants. The song “Space Oddity,” as performed by a children’s choir plays on Jonah’s little CD player. Marlo holds a strange little PLASTIC BRUSH with nylon bristles. It’s not for Jonah’s hair. Instead, she runs the brush in long, smooth strokes down her son’s bare arm. MARLO Hold still, Jonah. She moves to the other side, running the brush down the other arm, gently pressing the soft bristles into his skin. MARLO (CONT’D) There we go. Let’s do feet now. Sit down. Jonah sits down. He casually grabs his crotch and holds on. MARLO (CONT’D) Do you need to go to the bathroom? Jonah continues holding himself. JONAH No. MARLO Just being your own best friend, huh? Jonah nods blithely. MARLO (CONT’D) Okay. She resumes brushing, gently running the bristles over the soles of Jonah’s BARE FEET. INT. MARLO AND DREW’S HOUSE (SARAH’S ROOM) - NIGHT Marlo heads into another bedroom, equally small but more feminine. SARAH, 8, is sitting at a small desk, looking  irritated with her homework.",
      "characters": [],
      "action_text": "MARLO Almost done here? SARAH No. MARLO Let me see. (reading) “In Chapter Three of I Hate Rules, Katie Kazoo decides that there should be no more rules at school. What are the consequences?” SARAH I don’t know. MARLO Things get out of hand, don’t they? SARAH Yeah. MARLO How about George? He ate ten desserts and then what happened? Sarah plays with her hair, distracted. MARLO (CONT’D) I’m not going to write this for you, Sares. Sarah puts her head down on the desk dramatically. She BANGS it twice. Marlo stares at her daughter wearily. Sarah bangs her head a THIRD TIME for good measure. INT. MARLO AND DREW’S HOUSE (KITCHEN) - NIGHT Marlo walks into the kitchen. It’s small and there are a few boxes of assorted ENERGY BARS propped open on the already- cluttered counters. Marlo Grabs two LUNCH BOXES off the counter. Then, she reaches for her PHONE and plugs a set of EARBUDS into it. She picks a song. MUSIC UP: “Blue” by the Jayhawks. As the music plays, Marlo begins makes two LUNCHES for Jonah and Sarah. Finally, an escape from the children, even if she’s still servicing them.  2. She places two different sandwiches into plastic bento boxes. She pours Goldfish crackers from a Costco-sized container into two of the compartments. She cuts on the diagonal. Marlo’s husband DREW enters. He’s a slightly nerdy software engineer in a   Doctor Who   T-shirt. Marlo pulls out her earbuds. Her private moment is over abruptly. Without missing a beat, Drew begins filling Thermoses and slicing the green tops off the strawberries. Marlo and Drew are a well-oiled machine. Their childcare routines are choreographed like ballet. DREW Jonah’s finally down. Jesus, it’s like trying to kill the head vampire. MARLO Did you bring Sarah her inhaler? DREW Yeah. Did you, uh, brush Jonah? MARLO Roger wilco. Hey, don’t forget, we’re going to my brother’s for dinner tomorrow night. DREW Ugh. Craig hates me. MARLO Craig doesn’t hate you. He just hangs out with i-bankers all day, so his default setting ",
      "dialogue_count": 0,
      "word_count": 921
    },
    {
      "scene_number": 2,
      "slugline": "INT. SCHOOL (PRINCIPAL’S OFFICE) - DAY Marlo enters the PRINCIPAL’S OFFICE, flustered. MRS. BELL, a.k.a. LAURIE, waits at her desk. MARLO Hi Laurie. I’m sorry I’m late. (lying) Regent was backed-up for blocks. LAURIE Hi Marlo. Are you on maternity leave yet? You look like you’re about to pop. MARLO Yeah. Friday was my last day. Marlo stands awkwardly in front of the desk, forcing a big, fake expectant smile. This is her “school persona.” MARLO (CONT’D) Such a blessing. LAURIE I’ll try not to take up too much of your time here, so I’ll just get right to it: Ms. Marvish tells me that Jonah is still having a tough time in class. We’re concerned about his social and emotional development. MARLO Kindergarten’s a tough transition. LAURIE It’s April. MARLO (sheepish) Yeah. LAURIE And there’s about to be a big disruption in Jonah’s life, too. MARLO What? Laurie nods at Marlo’s huge belly:   duh . MARLO (CONT’D) Oh, yeah.  6.",
      "characters": [],
      "action_text": "LAURIE Jonah’s sweetheart. We love him. But as you know, he’s an “out-of- the-box” kid. He’s quirky. Marlo nods, subtly lip-syncing the word “quirky” as Laurie says it. It’s a euphemism that comes up a lot regarding Jonah. LAURIE (CONT’D) There are twenty-four other children in the class, and it’s not fair to them when Jonah needs so much of the teacher’s time. Marlo’s response is eager, desperate. MARLO We’re working on the meltdowns at home. And we’re doing these exercises and all this stuff. I just made this chart-- LAURIE (interrupting) We think Jonah could benefit from a one-to-one aide. A teacher just for him, who shadows him during the day and gives him the extra support he requires. MARLO Is the aide someone on staff here? LAURIE No, we don’t provide aides. MARLO Oh, so I have to go out and get AIDS all by myself. She chuckles dryly at her own joke. Laurie doesn’t catch on. LAURIE Yes, you’d need to hire this person. MARLO I’m   paying   to get AIDS! LAURIE (confused) One aide. He just needs one.  7. Marlo nods seriously, giving up on the AIDS joke. MARLO Right. Okay. LAURIE We don’t usually make these kinds of accommodations for students at Saint V.’s, but you guys are a great family, so... MARLO Thank you, Laurie. I really,   really  appreciate it. I want to make this work. LAURIE No problem. Have a great day now. Marlo musters a smile and rises to exit, shattered. INT. COFFEE SHOP - DAY With the kids dropped off and a temporary reprieve from work, Marlo enters the local COFFEE PLACE on the town’s main drag. She heads to the counter. MARLO I’ll have a decaf skim latte please. An OLDER FEMALE CUSTOMER behind Marlo pipes up. NOSY CUSTOMER You know there’s trace amounts of caffeine even in decaf, right? MARLO Huh? The women gestures to Marlo’s PREGNANT BELLY. MARLO (CONT’D) Oh, yeah. NOSY CUSTOMER Just so you know. BARISTA You still want it?  8. MARLO Yeah, yeah. NOSY CUSTOMER Just don’t overdo it! (then, know-it-all) My daughter has three, so I read up on al",
      "dialogue_count": 0,
      "word_count": 2974
    },
    {
      "scene_number": 3,
      "slugline": "INT. CAR - DAWN A disoriented Drew drives to the hospital. Marlo rides quietly in the passenger seat. INT. HOSPITAL (DELIVERY ROOM) - DAY Drew holds Marlo’s hand while an ANESTHESIOLOGIST who looks sixteen years old injects an EPIDURAL into her spine. INT. HOSPITAL (DELIVERY ROOM) - DAY (LATER) Marlo watches   E! News   on TV in her hospital bed. INT. HOSPITAL (DELIVERY ROOM) - DAY (LATER) Marlo lies on her side checking her phone. INT. HOSPITAL (DELIVERY ROOM) - NIGHT Marlo is pushing out her baby. A DOCTOR and a couple of NURSES are there. Drew stands by taking video with his phone. A not-particularly-meaningful SONG plays on someone’s iPod. The doctor is laid-back, almost distracted. DOCTOR Okay, can you feel my hand inside you? Push against my hand. One, two, three. Marlo closes her eyes and pushes silently. INT. HOSPITAL (RECOVERY ROOM) - DAY Marlo is sitting up in the hospital bed, still wearing a hospital gown and tethered to an I.V. Craig and Elyse are in the room. Elyse holds the BABY, making little cooing noises. ELYSE Marlo, she is your mini. Look at those lips. CRAIG I wish we could stay, but Emmy’s in the middle school musical tonight. MARLO What show is it?  23.",
      "characters": [],
      "action_text": "ELYSE (proud)  Rent.  CRAIG I don’t get it. It’s like, just pay your fucking rent. Problem solved. Elyse is about to pass back the sleeping baby back to Marlo. MARLO You can just put her in the bassinet. ELYSE Oh. Okay. Surprised, she places the baby in the hospital bassinet. Craig leans in and pats Marlo’s shoulder. CRAIG You take it easy, okay? And tell Dad congrats when he wakes up. Reveal Drew SOUND ASLEEP on a cot. Craig and Elyse quietly exit the room. Marlo swings her numb legs out of bed and tries to get up. It’s tough. She looks over at Drew. He is sound asleep on a cot. Marlo manages to get up and walks gingerly toward the bathroom, dragging her I.V. behind her. She stumbles into the door frame. Through the open back of her hospital gown, we see she’s wearing an ADULT DIAPER. Marlo reaches for the nurse call button. INT. HOSPITAL HALLWAY - DAY Craig and Elyse walk to the elevator. ELYSE So did you talk to her about the night nanny? CRAIG Yeah. She said she could never let a stranger take care of her baby. ELYSE Oh, so she’s judging   our   choices. Nice.  24. Craig pushes the elevator button. CRAIG I just want my sister back. The last few years... She used to be happy, you know? ELYSE Wasn’t she also like, totally irresponsible? CRAIG She got a little wild sometimes, sure. But overall, she was just fun to be around.   Then   she had the kids. Once Sarah came along, it was like somebody snuffed the match. And when Jonah was born... They shudder at the unspoken. ELYSE Yeah,   that   wasn’t pretty. (then) Maybe you should call Drew and see if he can convince her. CRAIG Drew hates me. INT. HOSPITAL (BATHROOM) - DAY Marlo sits on the toilet in the cramped bathroom while a motherly RUSSIAN NURSE encourages her. RUSSIAN NURSE You have to show me you can do a pee-pee. MARLO It’s just not coming out. RUSSIAN NURSE If you don’t pee soon, we have to put the catheter back in. Marlo strains desperately, hoping to avoid this outcome. We hear a trickling/pouring sound. M",
      "dialogue_count": 0,
      "word_count": 1145
    },
    {
      "scene_number": 4,
      "slugline": "INT. SAINT VITUS SCHOOL (PRINCIPAL’S OFFICE) - DAY Laurie is seated at her desk, drinking coffee and pushing paper. Marlo enters, escorted by a MALE SECRETARY. MARLO Hi. LAURIE Hi. Thank you so much for coming in today. I know mornings aren’t easy. Especially for you right now. MARLO Why? Laurie gestures to the car seat warmly. MARLO (CONT’D) Oh, yeah. Marlo sits down in front of the principal’s desk and places the car seat on the floor. Laurie obviously finds it a little odd that Marlo doesn’t want to show off or talk about the baby, but says nothing. She comes around to Marlo’s side of the desk and sits in the other chair there. LAURIE So, we’re coming up on the end of the kindergarten year, and I just wanted to talk to you about Mister Jonah! Her quasi-affectionate use of “Mister” doesn’t mask the tension. MARLO We’re getting him the aide. The one- one aide. We just have to figure out how we’re going to pay... Her voice trails off. She’s sick of talking about it. LAURIE Right. I know. (then) Back when you guys applied, we did express some concerns about whether or not Saint Vitus was the right fit for Jonah. But we love your family, and we have such a great relationship with your brother and his wife...  28.",
      "characters": [],
      "action_text": "MARLO I know Jonah is only here because of them. LAURIE That’s not-- MARLO No, I know. They’re big donors and they called in a favor. Now Laurie is uncomfortable. She takes a deep breath. LAURIE We think Jonah might be better served by a different school. MARLO You’re expelling him? LAURIE No, Marlo... Expulsion is a punishment. We would call this a dismissal. MARLO Oh. LAURIE There are places better suited to kids like Jonah. MARLO What does that mean, “kids like Jonah?” LAURIE Well, you know, Jonah is quirky. He-- MARLO (interrupting) What is this “quirky” thing everyone keeps saying? (officious voice) “Parenting Your Quirky Child.” It’s so stupid. What does it mean? It’s like, do I have a kid or a fucking ukelele? Why can’t you say what you mean, which is that you think Jonah is retarded? And he’s ruining it for all the other kids in the class who are reading like, The Iliad or whatever?  29.  (MORE) Sorry about my retarded son. Oh, I’m sorry,   quirky.   Because he’s a pocket watch. Fuck. This. She stands up and grabs the baby carrier. Mrs. Bell is alarmed. LAURIE No, no, no. Jonah is bright. He’s great. It’s just not the right fit. MARLO Just say what you mean. You hate my kid. You hate   us.  The secretary appears, having overheard the skirmish. LAURIE (shaken) Dallas, please walk her out. MARLO Don’t touch me, Dallas. SECRETARY I wasn’t-- LAURIE You need to calm down. I’m not letting you leave like this. MARLO Oh, I leave like this every day; you just don’t know it. This is the real me, when I’m not licking your asshole. Surprise! Marlo turns and accidentally SLAMS the unwieldy car seat hard against the frame of the door. We hear the baby SQUEAL. Laurie and the secretary gasp. MARLO (CONT’D) She’s FINE. She manages to exit, leaving the stunned pair in her wake. INT. VAN (PARKING LOT) - DAY Marlo steps up into her van and manages to snap the baby’s car seat into its base. She climbs into the driver’s seat, and stares into space, breathing heavily. The baby beg",
      "dialogue_count": 0,
      "word_count": 1669
    },
    {
      "scene_number": 5,
      "slugline": "INT. MARLO AND DREW’S HOUSE (BEDROOM) - NIGHT Marlo enters the bedroom. Drew is in bed. The lights are off. He wears a GAMING HEADSET as he plays SKYRIM on his Xbox. He pulls off his headset when he sees Marlo, surprised. DREW Hey. MARLO The night nanny is here. DREW Oh yeah? What’s she like? MARLO (whispering) Weird. DREW What? MARLO She’s weird. DREW Are you going to just leave her down there with Mia? Marlo ponders this briefly. MARLO Yeah. DREW Okay. Marlo climbs into bed. She closes her eyes, overwhelmed by the sudden possibility of sleep. A moment later, she rises from the bed, anxious. She walks toward the bedroom door. Opens it, revealing not the hallway, but...  A BEACH... INT. WATER’S EDGE - DAY (DREAM) Marlo is standing at the edge of the ocean in a bikini. Her body is beautiful, like it used to be. She runs her hands over her flat belly.  37.",
      "characters": [],
      "action_text": "She looks down and sees MIA lying on the sand, alert and kicking.  MARLO  (to Mia) Don’t go anywhere. She walks into the ocean. It’s beautiful. The sun shines on the water. Marlo ducks under. Suddenly, she’s in a deep swimming pool. She swims down, down. We hear the song “Blue” again, but a muffled, underwater version.  The floor of the pool is strewn with TOYS and random detritus, like an empty FROZEN PIZZA BOX. There’s a MERMAID down there. Her hair undulates like kelp. The mermaid turns around smiles at her. It’s TULLY.   The Tully- mermaid swims up to Marlo. TULLY Don’t come up too fast.  MARLO  What?  INT. MARLO AND DREW’S HOUSE (BEDROOM) - NIGHT Marlo opens her eyes. Tully is standing over her, holding Mia and speaking softly. TULLY There you go. Nice and easy. Hi, Marlo. She’s ready for you. Marlo is disoriented. Hair is plastered to her cheek with drool. Drew is sound asleep next to her. Mia fusses a bit. TULLY (CONT’D) I’ll help. She leans down and un-clicks the strap of Marlo’s nursing tank top. It’s a weirdly intimate gesture, but appreciated. Marlo takes the baby wordlessly and feeds her. Tully sits cross-legged on the floor of the dark bedroom. She stares serenely at Marlo, not breaking eye-contact.  38.",
      "dialogue_count": 0,
      "word_count": 376
    },
    {
      "scene_number": 6,
      "slugline": "INT. MARLO AND DREW’S HOUSE (BEDROOM) - MORNING We hear the sound of a BABY STIRRING. Marlo wakes up. It’s Saturday morning. Birds chirp. Drew is still sleeping. An audio-only BABY MONITOR is plugged in next to the bed; Mia’s little noises are being transmitted. INT. MARLO AND DREW’S HOUSE (LIVING ROOM) - SAME Marlo wanders downstairs. She gasps. The house is IMMACULATE. Almost unrecognizable. The kitchen GLEAMS. There are YELLOW DAFFODILS picked from the back yard, arranged in a vase. Marlo walks over to the bassinet. Mia is swaddled neatly as she stirs. Jonah emerges behind Marlo, bleary-eyed in his pajamas. JONAH Is it a school day or a family day? MARLO It’s Sunday. It’s a family day. Jonah looks around the room, confused. JONAH Why is it clean? MARLO  I don’t know.  EXT. PARK/PLAYGROUND - DAY Marlo and Drew walk through a LOCAL PARK while Sarah runs ahead in her SOCCER UNIFORM and Jonah rides a scooter. DREW (incredulous) So she was in our bedroom last night? MARLO Yes. She brought Mia to me to nurse and she just sort of sat in the shadows and waited for me to finish.  39.",
      "characters": [
        "MARLO"
      ],
      "action_text": "DREW And then she went downstairs and chiseled the filth off our floors. Doesn’t she sleep? MARLO Maybe she’s nocturnal. Like an owl. DREW Or Sarah’s hamster. Remember that thing? The wheel going all night long... Sarah runs over, interrupting the conversation. SARAH Mom, I need water. Drew rolls his eyes as Marlo dutifully produces a Thermos. DREW The game didn’t even start yet! SARAH So? I’m thirsty. Marlo offers Sarah water. Marlo resumes the conversation. MARLO The nanny just seems so serene. Like she really enjoys taking care of people. DREW What’s wrong with her? MARLO Right? INT. Marlo AND DREW’S HOUSE (LIVING ROOM/ENTRY) - NIGHT Marlo is watching   Cathouse   again and holding Mia. We hear Tully’s soft, signature knock. Marlo hurries to the door. A smiling Tully, casually attired in a Jayhawks T-shirt, stands on the threshold with her backpack. TULLY Good evening!  40. MARLO Hi. Hey, I just wanted to thank you for cleaning the house. You really, really didn’t have to do that. TULLY I enjoyed it. I have an energy surplus. Like Saudi Arabia. MARLO (WTF) Oh, all right. As they enter the den, Marlo realizes that she has forgotten to turn off the television. A client and a topless hooker are interacting on   Cathouse.  MARLO (CONT’D) Oh, God! I’m sorry. Embarrassed, she reaches for the remote. Tully stops her. TULLY No. What is this? MARLO It’s an old reality show. It’s called   Cathouse.  TULLY What’s it about? People are FUCKING on the TV screen. MARLO Um, the goings-on at a legal whorehouse in Nevada. Just, you know, day-to-day operations. Tully looks at the smiling BLONDE onscreen. TULLY Who’s she? MARLO That’s Air Force Amy. TULLY Is she a pilot? MARLO No... I’m   going to turn this off.  41. TULLY There’s really no need. You’re enjoying it. MARLO I’m not   enjoying   it. It just happened to be on... She realizes she’s hit pause on the RECORDING she’s made. MARLO (CONT’D) ...my DVR. TULLY Marlo, I want to make it abundantly clear that you can’t be self- cons",
      "dialogue_count": 1,
      "word_count": 2338
    },
    {
      "scene_number": 7,
      "slugline": "INT. MARLO AND DREW’S HOUSE (KITCHEN) - NIGHT Different outfits, different night. Tully and Marlo make homemade BREAD together. Marlo wears Mia in the sling while she and Tully talk and knead the dough. The clock on the microwave reads 1:05 AM. INT. MARLO AND DREW’S HOUSE (TABLE) - MORNING Marlo cuts the loaf of FRESHLY BAKED BREAD and serves it to Sarah and Jonah with butter and jam. INT. MARLO AND DREW’S HOUSE (DEN) - NIGHT Marlo fills out I.E.P. PAPERWORK for Jonah while Tully reads a large REFERENCE BOOK called How to Advocate for Your Special Needs Child. Tully points out a passage to Marlo and they discuss. Marlo reaches for a YELLOW MARKER and HIGHLIGHTS a sentence. INT. MARLO AND DREW’S HOUSE (BEDROOM) - NIGHT It’s an unspecified time of night. Marlo climbs into bed next to a sleeping Drew. She pulls the covers up to her chin and snuggles into the pillow, a slight smile on her face. INT. MARLO AND DREW’S HOUSE (BATHROOM) - DAY Marlo is getting ready for the day. She’s looking less and less like a zombie; her hair is brushed, and she actually has a little color in her cheeks. She reaches into a MAKEUP POUCH and takes out a BLACK LIQUID EYELINER. She hasn’t work it in years, but she leans forward and applies it in Tully’s signature cat-like style. It comes surprisingly easily to her. She examines herself, satisfied. INT. MARLO AND DREW’S HOUSE (DEN) - NIGHT Tully and Marlo sit with a pile of inexpensive BABY GIFTS that have been sent to Mia. We see Tully writing a THANK YOU NOTE on stationery that says “MARLO MOREAU” at the mast.  “Dear Aunt Lorene: Thank you for the...”  Tully glances at the GIFT again.  “...glow worm toy for Mia. It is so cute! Love, Marlo.”  52.",
      "characters": [],
      "action_text": "She adds the card to a pile. Marlo, who is also writing a note, smiles gratefully. EXT. PARK - DAY Marlo enthusiastically kicks a SOCCER BALL to Sarah while Mia sleeps contentedly in the stroller. INT. MARLO AND DREW’S HOUSE (BEDROOM) - NIGHT INTO DAY Marlo is sound asleep again. The room goes from DARK to LIGHT in time-lapse. Marlo rises, stretching, refreshed. INT. COFFEE HOUSE - DAY Marlo sipping her morning latte, takes a deep breath and composes a TEXT to her old friend VIOLET.  “This is Marlo Moreau. Wanna be friends again?”  Then, she types.  “(If you’ll have me.)”  A moment. An ellipses. And then:  “Welcome back to the land of the living.”  Followed by:  “Bitch.”  Marlo chuckles to herself, relieved. EXT. CRAIG AND ELYSE’S HOUSE (ESTABLISHING) - DAY Craig and Elyse’s mansion looks even more impressive by day. There are a bunch of PINK BALLOONS tied to the mailbox at the end of the driveway. EXT. CRAIG AND ELYSE’S HOUSE (BACK YARD) - DAY It’s the perfect sunny spring day for GRETA’S BIRTHDAY PARTY. Of course, Craig and Elyse have gone completely over the top. There’s a dessert table, pony rides, etc. A DRONE soars above the proceedings, taking video.  53. Jonah is playing with water balloons. Marlo is hanging out at a folding table while Mia sleeps in the car seat. Drew is a few yards away at the BAR. A costumed PRINCESS swishes past him with an armful of PARTY PROPS (wand, bag of dress-up clothes, etc.)She accidentally drops her tambourine. Marlo watches as Drew bends over to help the princess pick up her items. They chat for a moment. The princess is basically a rough-looking stripper in a ball gown, but Drew is clearly charmed. Craig suddenly and conveniently appears next to Drew and joins the conversation. It’s obvious the two guys are being extra “on” for the princess, who’s laughing. Marlo can’t help but notice how the girly costume and wig affect the two men. Drew notices Marlo watching with a wry expression and heads back over. Craig reluctantly follo",
      "dialogue_count": 0,
      "word_count": 1242
    },
    {
      "scene_number": 8,
      "slugline": "INT. MARLO AND DREW’S HOUSE (DEN) - NIGHT Tully, having just arrived for her shift, drops her OVERSTUFFED BACKPACK on the floor of the kitchen and opens the fridge like a hungry teenager. Marlo can’t help but smile as she paws through the food. TULLY What’s that in the pitcher? MARLO Oh, I made sangria since it’s getting warmer. It always reminds me of college. TULLY You see? You are a homemaker. MARLO Because I made sangria? People make sangria in prison toilets. TULLY I know. It’s called “pruno.” May I have a glass? This request surprises Marlo, coming from her baby’s caregiver, but she MARLO Uh, sure. I guess I’ll have one too. That’s polite hostessing, right? Marlo gets two glasses out of the cabinet. TULLY A-1. Let’s take the baby outside and enjoy the evening. MARLO Sure. EXT. MARLO AND DREW’S HOUSE (BACK YARD) - NIGHT Marlo and Drew’s back yard is small, weedy and unimpressive-- no Japanese soaking tub. But there are WHITE FAIRY LIGHTS strung from the house to the detached garage, and it’s cozy. Tully and Marlo (accompanied by Mia) sit on an outdoor couch side by side, sipping their sangria.  58.",
      "characters": [],
      "action_text": "TULLY (CONT’D) Am I ever going to meet Drew? MARLO (sarcastic) Sure, let’s wake him up right now. TULLY I mean, isn’t he curious about the person who’s ministering to his wife and baby every night? MARLO He’s curious. He asks about you. But he’s-- well, he’s not the most social guy. Like, I love him, but he’s a nerd. A   real   nerd, not like a postmodern nerd. He’s the kind of guy who went to high school wearing a trench coat and a hat and not even a little deodorant. Tully nods. MARLO (CONT’D) Anyway, he works all day and then he really does a lot with the kids when he gets home. Homework, the reading log, all of it. We make their lunches together. And then he just shuts down. He goes upstairs and puts on his little headset and then he’s just out. TULLY Don’t you guys ever... MARLO Have sex? No. We haven’t had sex in months. Maybe close to a year. He does puts a sock on the door to warn me when he’s masturbating. TULLY That’s considerate. MARLO Are you in a relationship? TULLY I’m in several.  59. MARLO Ha. I was like you back in the day. I tried every horse on the carousel. And then I met Drew. TULLY Which horse was Drew? Marlo tosses back the last of her drink. MARLO Drew was the bench. She pours out more sangria for her and Tully. TULLY But you love him. MARLO Yeah. Definitely. I chose the right person; I know that. TULLY Then why don’t you have sex? MARLO Well, I hold the baby all day. It’s me and her and it’s primal; we’re just like two gorillas at the zoo. Then nighttime rolls around, and I’m just supposed to switch gears and go, “Okay, now I’m sexy. Now my boobs are supposed to be sexual, instead of two bags of milk in a Canadian grocery store. It’s like-- did you ever play Tetris? When I was a kid I used to play Tetris for hours and hours. I was addicted. And when I’d go to bed, I’d close my eyes and I’d still see those stupid bricks falling. It’s like that now, except instead of bricks, it’s Mia. I go to bed and I just see Mia. I smell her. I feel her. I ",
      "dialogue_count": 0,
      "word_count": 2217
    },
    {
      "scene_number": 9,
      "slugline": "EXT. BUSHWICK, BROOKLYN - NIGHT Marlo’s car cruises down Wyckoff Avenue in Bushwick. YOUNG PEOPLE cross the street and converge on the corners, smoking and talking. A GIRL wearing leg warmers makes out with her BOYFRIEND. Marlo becomes excited, restless, as she looks out at the passing scene. MARLO This is my old neighborhood. I lived here for years. TULLY Then this is where we should be. MARLO It wasn’t always this nice. Look, there’s a bakery for dogs. TULLY What did it used to be? MARLO A bakery for humans. TULLY Whoa. MARLO Yes. People ate flour in those times. INT. BUSHWICK BAR - NIGHT Marlo and Tully walk into a crowded, popular bar. Marlo looks more radiant than we’ve ever seen her. Younger. It’s like the tension in her face has disappeared for the first time in months. Tully strides up to the bar. Marlo hangs meekly beside her. They somehow get IMMEDIATE SERVICE-- Tully has that power. TULLY Hi. Two Makers, neat. HOT BARTENDER You want any water with that? TULLY Do I look like I need a bath? The young BARTENDER grins at Tully.  70.",
      "characters": [],
      "action_text": "HOT BARTENDER You got it, babe. The bartender disappears to fill the order. Marlo smiles wistfully at the flirtation. MARLO That guy is obsessed with you. TULLY Actually, he was looking at you. MARLO Yeah, right. I have the sex appeal of a binder clip. TULLY You look radiant tonight. Marlo looks at Tully with great affection. MARLO Really? Go on. TULLY How long has it been since you had a girls’ night? MARLO A year or ten. TULLY Do you have a lot of girlfriends? MARLO Not anymore. She smiles uncomfortably, closing the subject. The bartender pushes the drinks across the bar. MARLO (CONT’D) Thanks, babe. INT. BUSHWICK BAR (CORNER/TABLE) - NIGHT Tully and Marlo settle in. Marlo looks around the room. PEOPLE HAVING FUN. Youth. Energy. She can’t help but smile. This is exactly what she needed. MARLO This used to be a different bar. They must have taken it down to the studs. I hardly recognize it.  71. TULLY Have you ever heard of the “Ship of Theseus” paradox? MARLO Yeah, in college, I think. Which one is that? TULLY Let’s say you were to take a wooden ship and replace one plank every year. Eventually, the ship would be made up of entirely new planks and there would be nothing left of the original ship. So is it still the same ship? Or a new ship? A buzzed Marlo thinks about it very briefly. MARLO New ship. TULLY Why? MARLO Because it just is! Nothing’s the same. It’s a new ship, baby.  Nouveau bateau.  Her French accent is absurd as she takes a swig of bourbon. TULLY Then what about people? When you look at your baby pictures, clearly you’re unrecognizable compared to now. But it’s you. MARLO If every part of me has regenerated then I guess I’m not me anymore. TULLY Well, humans can’t regenerate completely. There’s actually one part of us that doesn’t. MARLO What’s that, Encyclopedia Brown? TULLY The hearing cells in our ears. They can’t grow back. Once they’re dead, they’re dead.  72.",
      "dialogue_count": 0,
      "word_count": 532
    },
    {
      "scene_number": 10,
      "slugline": "INT. BROOKLYN BAR - NIGHT We’re in a DIFFERENT BAR, where a ROCK N’ ROLL BAND rips through a raucous song. Music BLASTS, killing those ear cells dead. Tully and Marlo dance wildly. Tully grabs Marlo’s hand. They twirl and spin. Marlo is drunk. She doesn’t care who’s watching. INT. SMALLER BAR (BOOTH) - NIGHT A thoroughly drunk Marlo and Tully settle into a more intimate bar for “just one more.” There’s a newfangled touch- screen JUKEBOX against the wall; a guy is plugging in some songs. Tully clocks it, excited. TULLY I want to play something. Tully dashes off. Marlo checks out the cozy bar. A group of PUNK GIRLS head to the bathroom   en masse.   Marlo stares at them longingly. Moments later, the song “Blue” by the Jayhawks begins playing; we recognize it as one of Marlo’s favorites from the beginning of the movie. Tully returns to the booth. MARLO Hey, this is one of my favorite songs! TULLY Mine too. That’s why I picked it. MARLO I used to listen to this with Violet all the time. (explaining) I lived with her, here in Bushwick, a long time ago. This was our record. (then, confused) How did you get it to play right away? TULLY It’s a secret. MARLO You know what my daughter and her friends say? “  73.  (MORE)",
      "characters": [],
      "action_text": "Secrets, secrets are no fun. Secrets, secrets hurt someone.” TULLY Well, if I tell you a secret, you have to tell me one of yours. Okay? MARLO Sure. Why not? TULLY We’ll do it at the same time. Count of three. Ready? Marlo nods. TULLY (CONT’D) One, two, three. MARLO   *  I’m gay.   *  TULLY   *  I paid an extra fifty cents.   *  MARLO Wait, what did you say? TULLY I paid an extra fifty cents. You can skip the line on these new jukeboxes if you pay just a little extra. I was feeling grandiose. MARLO Thank you for sharing that, Tully. TULLY Wasn’t it brave of me? Marlo sits back in the booth, closing her eyes, her head swimming. EXT. BUSHWICK STREET - NIGHT Tully helps Marlo walk down the street. Marlo is OBLITERATED, stumbling. Tully somehow seems perfectly sober. MARLO Wait... wait... stop. You’re not going to   drive , are you? TULLY I’m fine. I promise.  74.  MARLO (CONT'D) MARLO That’s not possible. You went round for round with me. Let’s just leave the car here and take a cab back. TULLY But Drew will be angry. Marlo braces herself against a parking meter. MARLO Drew doesn’t get angry. He just gets very quiet. TULLY And that’s worse than angry, isn’t it? Right. As always. MARLO This is the last thing you’re going to talk me into, Tully. TULLY You’re right. It is. MARLO Oh, you’re quitting? TULLY You knew this was temporary. Besides, I think it’s time for me to find another line of work. MARLO So what do you have lined up? I bet you have big plans. Your twenties are great. But then your thirties come around the corner like a garbage truck at 5 a.m. Yeah. You gotta think long-term. What are you going to do when that cute little ass drops and your feet grow half a size with each pregnancy, and the whole “free spirit” thing stops being charming and starts looking ugly? TULLY I’m not afraid of the future. MARLO You should be. I’m it.  75. TULLY What’s wrong with that? You know what your problem is? You’re convinced you’re a failure, but you actually made your biggest",
      "dialogue_count": 0,
      "word_count": 791
    },
    {
      "scene_number": 11,
      "slugline": "EXT. BUSHWICK STREETS - NIGHT Marlo is riding as fast as she can toward her undisclosed destination. Tully comes up next to her on a second CitiBike. They both pedal like mad. TULLY Where are we going? MARLO I need to go to my old place. TULLY But you don’t live there anymore. Marlo stops. Considers this. Takes off again. EXT. BUSHWICK RESIDENTIAL STREET - NIGHT After riding for a few blocks, Marlo arrives at a big, old industrial BRICK BUILDING. Panting and sweating, she hops off the bike and drops it on the sidewalk. She approaches the door. There’s a large SECURITY KEYPAD for entry. MARLO (to herself) Okay, what is this? Tully comes up next to her. MARLO (CONT’D) This didn’t used to be here. She drunkenly punches in a few numbers, muttering to herself. MARLO (CONT’D) Unit 5... Nothing happens. MARLO (CONT’D) Fuck. She repeatedly PUNCHES the key-pad in a rage. TULLY Marlo, this is not your home. Marlo’s nose is pressed up to the glass. MARLO There’s a fucking lobby now? With furniture?  77.  (MORE)",
      "characters": [],
      "action_text": "What happened to the guy who sleeps in the doorway? I used to step over that guy every morning to go to work. And he’d say “Good morning, Margo.” Every damn day. Me and Vi would bring him a sandwich sometimes. Where is he? Do you think he died? TULLY Yes, I do. Let’s walk. Marlo pulls out her cell phone, desperately. MARLO She still lives here. I’m texting her. She’ll let us up. Do you like coke? She always has it. You know, you have not cleaned a kitchen until you’ve done it Bolivian- style. Marlo is frantically typing a TEXT MESSAGE. Tully tries to stop her, but she hits “send.” MARLO (CONT’D) I let her know we’re here. She’s going to like you a lot. Like,   a lot.  TULLY We have to go home. And I can’t leave without you, Marlo. I wish I could let you stay, and go up there, but there is no “there” anymore. MARLO Yes there is. Look! She pounds the brick with her fist. Tully just looks at her sadly. TULLY Come with me. Marlo’s tone turns accusing. MARLO This was your idea. Why did you bring me here in the first place?  78.  MARLO (CONT'D) TULLY I was being selfish. We came too far out. I have to bring you home. Marlo rubs her BREASTS, wincing with discomfort. MARLO Ow. TULLY You’re really full. MARLO It hurts. I need Mia. I’ll just go home and feed her. Marlo is massaging her sore breasts compulsively. TULLY No. Not yet. MARLO (crying) I miss her. TULLY You’ll see her soon. Come on. MARLO She won’t the same tomorrow. That’s what you said. I don’t want her to grow! TULLY Yes, you do. Tully beckons to Marlo. Defeated, Marlo stumbles toward Tully. Tully takes her arm and leads her away from the building. Marlo lays her head on Tully’s shoulder and cries. As they walk off into the night, we suddenly hear a VOICE on the intercom. It sounds hoarse and disoriented. VIOLET (O.S.)  Hello? Marlo, are you out there?  But Tully and Marlo are already out of earshot, disappearing into the night. VIOLET (O.S.) (CONT’D)  Marlo?  79.",
      "dialogue_count": 0,
      "word_count": 544
    },
    {
      "scene_number": 12,
      "slugline": "INT. SEEDY DIVE BAR - NIGHT Tully and a disheveled Marlo enter a SEEDY DIVE BAR they definitely don’t belong at. Tully guides Marlo toward the bathroom. The door SWINGS OPEN. A truly DISGUSTING DUDE is walking out. We can see even from this vantage point that it’s not an appealing place to deal with the milk situation. But Marlo is desperate. INT. DIVE BAR BATHROOM - NIGHT Tully and Marlo enter the bathroom. It’s   Trainspotting - filthy, with grafitti on the walls. Tully takes off her SWEATER and wets it in the sink under hot water. MARLO What are you doing? TULLY I’m making a hot compress. It’ll feel like a little baby mouth. MARLO This is really messed up. TULLY It’ll help get things going. She hands Marlo the makeshift compress. Marlo puts it on her boob dutifully. TULLY (CONT’D) Okay. Now milk yourself. Marlo stands over the toilet and starts massaging herself. MARLO It’s not working. (gagging) Oh God, it smells like Spam in here. TULLY Think about Mia. Do you have a photo? That might help. She takes Marlo’s phone out of her purse and quickly pulls up Marlo’s PHOTOS. She scrolls through, looking for a photo of Mia. We glimpse a lot of weird SELFIES of Marlo.  80.",
      "characters": [],
      "action_text": "TULLY (CONT’D) Why do you have so many pictures of yourself? MARLO I keep thinking the next one will look different. Tully finds a photo of Mia and holds the phone in front of Marlo’s face. Someone BANGS on the door. TULLY One second! MARLO I’M PERFORMING A MIRACLE! (then) It won’t come out. TULLY Let me. Do you mind? Marlo tacitly agrees. Tully begins kneading Marlo’s breast. TULLY (CONT’D) You have to use a rolling motion. Marlo looks queasy. Tully rolls her hand back and forth. TULLY (CONT’D) See? It’s like a wave. MARLO I think I’m going crazy. We hear a TRICKLING sound as Marlo’s milk finally lets down into the toilet bowl below. TULLY There we go. Marlo VOMITS. Tully holds back her hair. When Marlo comes up for air, Tully is already there to gently wipe Marlo’s mouth with a napkin. TULLY (CONT’D) Now we’ll go home. INT. MARLO’S CAR - NIGHT Marlo is slumped in the front seat. Tully is in the drivers’ seat. For the first time ever, she seems NERVOUS.  81. TULLY Try to stay awake. MARLO I’m so tired. TULLY I know. But I need you to stay with me. Let’s have a conversation. MARLO All we do is converse. We’re like the people in a Spanish textbook. Maria and Julio, they never shut up.   (then) What am I going to do without you? TULLY You’re going to take care of yourself. You’re going to shower every day, nourish and exercise your body, and maybe even send yourself roses once in a while. Promise me you will. MARLO (drifting off) That’s... so... corny... TULLY Look Marlo, it’s the bridge. They’re approaching the BRIDGE that takes them back to Rye. TULLY (CONT’D) Look. You’re going to be in a soft bed in your little house before you know it. Under the same roof with your three babies, cozy and crowded. That old carpeting in your bedroom. World’s weakest shower. Home. MARLO Mmph. TULLY We’re going home. Tully begins to lose control of the vehicle. First subtly, and then, it’s beyond saving...  82. In an instant, the car CRASHES into a guard rail. Marlo’s eyes briefly op",
      "dialogue_count": 0,
      "word_count": 1450
    },
    {
      "scene_number": 13,
      "slugline": "INT. HOSPITAL ROOM - DAY Drew enters. He sees that Marlo is awake and stops in his tracks. DREW Hi. MARLO Hi. Drew reaches out and touches Marlo’s hand. DREW Um.   (choked up) I’m sorry. MARLO Why are you sorry? Drew is trembling. DREW I’m sorry I let this happen to you. MARLO You didn’t do anything. Drew starts crying. DREW I know. That’s the problem. I didn’t know what was happening at night! I was just overwhelmed, between the baby, and work, and it seemed like you were doing great. MARLO I was doing great. (smiling) Wasn’t I great? DREW Fuck that. I don’t need you to be great. I just need you to be you. We love you so much. I’m sorry if you want to run away. I do too. But I don’t, because I love us. MARLO I love us too. (then) Am I in trouble?  88.",
      "characters": [],
      "action_text": "DREW Yeah. You’re in trouble. Marlo nods, painfully. Drew lays his head on her chest. She touches him with her good hand. DREW (CONT’D) Who were you with last night? MARLO Nobody. Tears slide down her cheeks. MARLO (CONT’D) But next time I want to be with you. DREW Yeah? MARLO Yes. Let’s go out. Let’s talk. There’s still a world out there. We could go see it sometime. Even if it’s just for a few hours. DREW Okay. MARLO Okay. INT. MARLO AND DREW’S HOUSE (HALLWAY) - NIGHT Weeks have passed. Marlo walks down the hallway of her house with a CANE. Her bruises have faded to yellow, but her arm is still in a sling. She stops into Sarah’s room. Sarah is laboring over her homework, as usual. Marlo leans over Sarah’s desk, murmuring guidance, then tousles her hair. INT. MARLO AND DREW’S HOUSE (JONAH’S BEDROOM) - NIGHT Marlo moves on down the hallway to Jonah’s room. Jonah sits patiently in his pajamas, awaiting his treatment as he does every night. Marlo is there to attend to him. She props her cane against the wall and limps toward him. MARLO Ready?  89. As in the beginning, we hear “Major Tom,” from Jonah’s  Langley Schools Music Project   album. Marlo reaches for Jonah’s WILBARGER BRUSH. MARLO (CONT’D) Let’s start with your feet tonight. She begins sweeping the brush over the soles of his feet. JONAH Mom, is this real? Marlo pauses. MARLO What do you mean? JONAH Does it work? We do it every night but I’m not sure what it’s supposed to do. Marlo thinks about it. MARLO Well, honestly, I don’t know. Do you like when we do it? JONAH I like being by you. Marlo smiles. MARLO I like being by you too. JONAH And it feels nice, I guess. MARLO Well, maybe that’s all that matters. JONAH But we can just be together. We don’t have to do the brush. I kind of don’t think it’s real. MARLO Okay. If you don’t think we need it, then I guess we’ll stop. She puts the brush down and rests her chin in her hands.  90. Jonah suddenly leans forward and puts his arms around her. JONAH I love you. The",
      "dialogue_count": 0,
      "word_count": 614
    }
  ]
}