{
  "slug": "twin-peaks-101-pilot-1990",
  "title": "twin peaks 101 pilot",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 5745,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. HARDWARE STORE - DAY 28.   28.  Carrying a small tray of sandwiches, Norma is going into the hardware store down the block from the Double R Diner. She holds the door open for a woman who's exiting, obscured behind a big bag of hardware. It's NADINE HURLEY. Norma sees her first. NORMA (pleasantly) Hi, Nadine. NADINE What are you doing here, Norma? NORMA (pleasantly) I might ask you the same question. NADINE (a hint of aggressiveness) And I will tell you: I've gotten all new drapes for my house. Ed bought them for me yesterday at Gentle Jim's and we installed them together. They're a beige sheer. I was up. all last night, do you know what I was doing? NORMA (a little worried) No, I don't. NADINE I was inventing a noiseless, completely silent drape runner. And do you know how it works, do you know what makes it work? The thing I thought of at four this morning while I was waiting for my husband to be released from intensive care? NORMA What's that? Nadine takes a package out of the bag, wrenches it open and grabs a handfull of ...  29.",
      "characters": [],
      "action_text": "NADINE Cotton balls. By God, those things'll be quiet now. Nadine moves off. Norma enters the store. CUT TO: INT. SHERIFF'S STATION WAITING AREA - DAY 29.   29.  Ed Hurley rises, as James is escorted out and unhandcuffed by Hawk. James moves to Ed. JAMES Did you have to post bail? ED Had a talk with Harry. No charge. JAMES (a source of pain) Mom still out of town? ED Yeah. She's still out of town. Let's get out of here. JAMES (nods) Gonna need a hand from the Bookhouse Boys. Somebody's gotta watch my back. ED Already got it covered. They exit. CUT TO: INT. INTERROGATION ROOM A - DAY 30.   30.  Mike sits at the table, as Dale Cooper enters. COOPER So tell me, Mike, what are you doing hanging around with a guy like Bobby Briggs? MIKE He's my friend.  30. COOPER You don't seem like such a bad kid to me, but Bobby Briggs could drag you straight into hell. How long has Donna Hayward been your girlfriend? MIKE Around two years. COOPER Why were you screaming at her and roughing her up last night at the Roadhouse? MIKE That's between her and me. COOPER Between you and her or you, her and James Hurley? MIKE What's that supposed to mean? COOPER You guys were out looking for James last night -- MIKE That's right, he was fooling around with Laura, next thing we know she's dead and he's out fooling around with Donna -- COOPER You couldn't find James so you picked a fight with his gang instead. MIKE They started it. COOPER After Bobby decked Ed Hurley with a pair of brass knuckles. MIKE He was defending himself - look, I already spent a night in jail, are you charging me with something?  31. COOPER Settle down there, punk. I could make one phone call and you'd go so far away God couldn't find you. Cooper smiles. Mike gets the picture. CUT TO: INT. INTERROGATION ROOM B - DAY 31.   31.  Truman sits across from Bobby, filling out a report, when Cooper breezily enters. COOPER Hi, Bobby, I was just talking to Mike. Now before we get started, have you got your stories straight? BOBBY I",
      "dialogue_count": 0,
      "word_count": 1585
    },
    {
      "scene_number": 2,
      "slugline": "INT. BLUE PINE LODGE KITCHEN - DAY 35.   35.  Josie is on the phone. JOSIE ... yes, Catherine, I'm listening ... INTERCUT: INT. SMALL PLEASANT MOTEL ROOM - DAY 36.   36.  CATHERINE PACKARD MARTELL is on the phone, sipping a drink, unbuttoning her shirt. CATHERINE I just thought you ought to know what your sentimental good-will shenanigans cost us yesterday, you do know what shenanigans are, don't you? ... Josie mouths the word, not at all sure. CATHERINE (CONTINUED) (CONT’D) Shutting down the mill for eight hours, plus the night-shift, cost us eighty-seven thousand dollars and change. Do you really think that would have made Andrew happy? She hangs up. Turns and raises her glass and touches glasses with Benjamin Home, who smiles and swoops down for a kiss. CUT TO: INT. BLUE PINE LODGE KITCHEN - DAY 37.   37.  Josie exits. Pete scrubs the coffee pot, whistling happily. We move off him to reveal a small dead fish on the counter, coated with coffee grounds, in a small, thin pool of steaming percolator water. CUT TO: INT. BLUE PINE LODGE LIVING ROOM - DAY 38.   38.  Josie re-enters the room. Truman and Cooper rise. Preoccupied, Josie sits down,  39.",
      "characters": [],
      "action_text": "mouthing a word to herself. Truman and Cooper slowly sit. TRUMAN Jocelyn -- (covering himself) Mrs. Packard? ... Josie? JOSIE What is \"shenanigans?\" COOPER (word perfect) Nonsense; mischief; often, a treacherous or deceitful trick. Josie looks sad. Koro barks. Truman and Cooper look at each other. CUT TO: (DELETED) 39.   39.  EXT. SMALL PLEASANT MOTEL DAY 40.   40.  Cottages, a little vacation spot tucked away at the base of White Tail Mountain. CUT TO: INT. MOTEL ROOM - DAY 41.   41.  Catherine Martell is lounging in bed. Benjamin Home is in front of a mirror, tying his tie. CATHERINE Why do you always have to rush off? BENJAMIN (looks at his watch) We've been here over an hour. CATHERINE There was a time when we'd take all afternoon. BENJAMIN In the sweetness of passing time, this hour will soon seem like a day.  40. CATHERINE Sing it to somebody else. I'm not one of your teenage peabrain chambermaids. BENJAMIN (insincerely) Oh I'm sorry, did I offend your delicate sensability? CATHERINE My mistake. I'd gotten used to us conducting business and pleasure. BENJAMIN Sweetheart, it's all the same to me. CATHERINE Well I'm no schoolgirl either. What's the next step? BENJAMIN (sits beside her on the bed) We may not have to do anything: a few more local tragedies and josie may run that mill into the ground herself. CATHERINE You should have seen her, so proud and weepy over that little cheerleader's death, as if she was the only one in the world with feelings. BENJAMIN But the fact is those losses are going to look beautiful in the books. CATHERINE With the pace we've set it'll still be months before the mill's bankrupt. I don't know if I can wait that long. Besides, there's always a chance my knothead husband may decide to take a peek at those dusty old books. BENJAMIN Maybe it's time for a fire.  41. CATHERINE Are you talking about business or pleasure? BENJAMIN I'm talking about the Packard sawmill. (she gets the idea) CATHERINE All that dry wood lying around ... BENJ",
      "dialogue_count": 0,
      "word_count": 670
    },
    {
      "scene_number": 3,
      "slugline": "INT. GREAT NORTHERN HOTEL CORRIDOR - DAY 44.   44.  Truman, Cooper and Jacoby move down the corridor. JACOBY I can't get over it. He just stands there day after day, I've never seen anything like it. COOPER Dr. Jacoby, how old is Johnny Horne? JACOBY Twenty-seven going on six. (giggles) Just kidding. Sorry. TRUMAN And you've been treating him for how long? JACOBY Treating him? Well, with Johnny it's not so much a question of treating him -- COOPER I understand Laura Palmer was his tutor. JACOBY Monday, Wednesday and Friday, after school. Those were the same days I'd come to see Johnny and his mother. Laura was Johnny's favorite. He knew which day it was, too, he'd stand just like that, waiting for her. COOPER Does Johnny get out much? JACOBY Sure, after his schoolwork ... Laura would take him out on the grounds hunting for rubber buffalo with his little sunction-cupped bow and arrow set. Some afternoons, he'd bag the limit. TRUMAN Was she here on Wednesday afternoon?  43.",
      "characters": [],
      "action_text": "JACOBY Yes she was. I sat in with them. She read him a story. COOPER What story was that? JACOBY (thinks of it) Isn't that interesting? It was \"Sleeping Beauty.\" COOPER You said Laura was a patient of yours as well. JACOBY Yes. But of course all of that information dwells in the land of client confidentiality. (he beams at them, then reaches behind Cooper's ear and pulls out a silver dollar) Johnny loves that trick. He thinks we've found over four hundred dollars back there. Cooper slow burns. CUT TO: INT. PALMER HOUSE BEDROOM - DAY 45.   45.  A dark room, the blinds are pulled. A subdued SARAH PALMER sits in a chair, wearing a robe,   A NURSE enters, moves to her and says quietly ... NURSE Mrs. Palmer, I'm sorry to disturb you, but Donna Hayward is here ... (Sarah reacts; off the reaction) ... are you sure you're up to seeing her? SARAH I have to see her. She was Laura's best friend.  44. NURSE Take this right now ... (Sarah sticks out her tongue, the Nurse puts the pill on her tongue and hands her a glass of water) I'll send her in. The Nurse exits. Sarah swallows the pill. CUT TO: INT. PALMER HOUSE UPSTAIRS HALLWAY - DAY 46.   46.  Donna is waiting in the hall, looking at a photo on the wall of a young Laura playing, when the Nurse comes out of the bedroom and moves to her. NURSE She's sedated. Try not to upset her. Donna nods and enters the bedroom. CUT TO: INT. PALMER HOUSE BEDROOM - DAY 47.   47.  Donna and Sarah see each other and Donna moves into her arms. They embrace, cry, then Donna sits beside her. SARAH What am I going to do? I miss her, do you miss her? DONNA Yes, yes, I miss her so much. SARAH I miss her so much ... I miss her so much ... Sarah wipes away a tear, looks away, then looks back at Donna, tilting her head, looking at her sadly. Donna hand slowly slides up and touches Sarah, comforting her. Sarah looks down  45. at the hand CUT TO: SARAH'S POV 48.   48.  Looking at Donna's hand. She looks up from the hand and sees ... Laura sitting beside h",
      "dialogue_count": 0,
      "word_count": 1021
    },
    {
      "scene_number": 4,
      "slugline": "INT. BRIGGS DINING ROOM - DAY 57.   57.  BETTY BRIGGS is just setting dinner down on the table in front of her husband, MAJOR BRIGGS and son, Bobby. BETTY Bobby, it's your favorite; meatloaf with pimentos and potato chips and there's plenty more chips in the kitchen. She sits down at the table with them. Major Briggs and his wife bow their heads but Bobby doesn't. MAJOR BRIGGS For what we are about to receive, may the Lord make us truly thankful. Bobby indifferently moves his meatloaf around the plate and mashes up the chips with a spoon. MAJOR BRIGGS (CONTINUED) (CONT’D) Robert, I was hoping we'd have a chance to discuss the events of the past few days. Not the physical events themselves necessarily, but the thoughts and feelings surrounding them. Bobby rolls his eyes. Major Briggs is undeterred. MAJOR BRIGGS (CONTINUED) (CONT’D) Rebellion in a young man of your age is a necessary fact of life and, candidly, a sign of strength. In other words, I respect your rebellious nature, Bobby, however, being your father, I am obligated to contain that fire of contrariness within the bounds established by society as well as those within our own family structure. Bobby impatiently taps his water glass with his knife.  50.",
      "characters": [],
      "action_text": "MAJOR BRIGGS (CONTINUED) (CONT’D) Bobby, I note your reluctance to engage in a dialogue with me, your father. There are times when silence is golden. Silence can be taken many ways; as a sign of intelligence ... truth being invisible ... and the quieter we become, the more we can hear ... Bobby shakes out a cigarette, puts it in his mouth. The Major calmly and firmly backhands Bobby across the face. The cigarette flies across the table and spears into the meatloaf on Betty's plate. Bobby's stunned more than hurt. MAJOR BRIGGS (CONTINUED) (CONT’D) I am a tolerant man, but my patience has its limits. \"To have his path made clear for him is the aspiration of every human being in our beclouded and tempestuous existence.\" Robert, you and I are going to work on making yours real clear. Betty removes the cigarette from her meatloaf. BETTY (sincerely) We're here for you, Bobby. Bobby's hands clench into white-knuckled fists. CUT TO: EXT. DOUBLE-R DINER NIGHT 58.   58.  Re-establish. CUT TO: INT. DOUBLE-R DINER NIGHT 59.   59.  The diner's bustling with dinner traffic. Truman and Cooper are seated at the counter. Shelly pours them some coffee.  51. SHELLY Can I get you anything to go with that, Sheriff? TRUMAN Agent Cooper here might want to try a slice of pie. COOPER (brightening) Cherry pie? SHELLY Best in the tri-counties. TRUMAN And could you ask Norma to stop by for a second, Shelly? SHELLY Sure thing. COOPER (a twinkle in his eye) Nothing's a sure thing, Shelly. (Shelly moves off) Shelly Johnson with a \"j?\" TRUMAN Husband's a trucker, Leo. Minor rap sheet. Cooper nods, makes a note as he sips his coffee. As he puts the notebook away he looks around and sees the LOG LADY seated a couple of chairs away, cradling her log and drinking coffee. Cooper looks back at Truman. COOPER (CO.NMNUED) (whispers) Log Lady? TRUMAN Right. COOPER Hi. She makes a sour face. Cooper turns back to Truman. COOPER (CONTINUED) (CONT’D) Can I ask her about her log?  52. TRUMAN Many have. Cooper p",
      "dialogue_count": 0,
      "word_count": 1179
    },
    {
      "scene_number": 5,
      "slugline": "EXT. LEO JOHNSON'S HOUSE - NIGHT 64.   64.  In long shot, Norma drives up, Shelly hops out and starts for the house, carrying a bag of groceries. SHELLY'S VOICE Thanks, Norma. See you tomorrow. CUT TO: INT. LEO JOHNSON'S HOUSE - NIGHT 65.   65.  Shelly enters the house, sets down her keys. Silence. SHELLY Leo? ... Leo, honey, you here? She moves towards the kitchen. CUT TO: INT. JOHNSON HOUSE KITCHEN - NIGHT 65.   65.  CLOSE on a new bar of soap being dropped into a dark sock. Leo ties the sock off, swings it around, slaps it into his palm a couple of times. LEO I'll be right out, Shelly. CUT TO: INT. JOHNSON HOUSE LIVING ROOM - NIGHT 66.   66.  Leo comes out of the kitchen, swinging the sock around. Shelly turns as he enters ... SHELLY Hi, Leo She sees the sock in his hand, turns pale and goes weak in the knees. LEO Where's my shirt? SHELLY Shirt?  57.",
      "characters": [],
      "action_text": "LEO (advancing on her) My favorite blue shirt. That's the second one you've lost this year ... I'm going to teach you a lesson now Shelly about taking care of my property; that means not only keeping things clean but making sure that things aren't damaged or lost -- this is gonna hurt you -- She pushes the bag of groceries at him and throws herself onto the couch, protecting her face, terrified. The groceries fall to the floor, something breaks and spills. Leo walks over to the stereo and turns it on; loud, heavy metal. Leo starts to spin over his sock, gaining momentum ... and as it flies out of frame we ... CUT TO: INT. GREAT NORTHERN HOTEL CORRIDOR - NIGHT 67.   67.  Audrey Horne is walking down a corridor when a gust of wind slams a heavy door shut behind her. She jumps, then regains her composure. CUT TO: INT. GREAT NORTHERN HOTEL CORRIDOR - NIGHT 69.   69.  Audrey moves down the corridor. SOUND of the wind continues to howl. When she hears voices she slows, sneaks around the next comer and peeks through a partially open door into INTERCUT: AUDREY'S POV - BENJAMIN HORNE'S OFFICE 70.   70.  Benjamin Horne is pouning a couple of stiff Scotches on the rocks. He hands one  58. to his brother Jerry, who's walking back and forth, rubbing his hands gleefully together. JERRY Ben-jamin, Ben-jamin, Ben-jamin -- BENJAMIN What the hell are you so happy about? JERRY I'll give you a One-Eyed guess where I'm going tonight. BENJAMIN Can you get your mind out of the gutter for one second? We've got a tottering empire on our hands -- JERRY Come on, Brother Ben, I hear they dropped a new bombshell up at \"Jack's\" - straight from the perfume counter, am I right? Am I right? BENJAMIN (he's pursuaded) Now that you've jogged my memory ...   (sips his drink) ... and set it on fire ... I'll drive. JERRY That's the spirit; all work and no play makes Ben and Jerry dull boys. Let's roll! They clink glasses and drain their drinks. Audrey moves away, as they start towards the door. She turns",
      "dialogue_count": 0,
      "word_count": 560
    },
    {
      "scene_number": 6,
      "slugline": "EXT. HAYWARD HOUSE - NIGHT 71.   71.  Re-establish. James Hurley's Harley is parked outside. CUT TO: INT. HAYWARD HOUSE LIVING ROOM - NIGHT 72.   72.  Donna escorts James into the living room, where Eileen and Dr. Hayward are waiting. DONNA Mom ... Dad ... this is James ... James Hurley. DR.HAYWARD How do you do, James? JAMES Pleased to meet you, sir -- Mrs. Hayward. EILEEN James, very nice to meet you. An awkward silence. DR.HAYWARD Hope you're hungry, James. Eileen's been cooking up a storm. JAMES Yes, sir. Another silence. EILEEN James, can I offer you something to drink? We have soft drinks, fruit punch or sparkling cider. JAMES Fruit punch. That'd be good, thank you. DONNA I'll get it, Mom. Donna exits to the kitchen. DR.HAYWARD Have a seat, James.  60.",
      "characters": [],
      "action_text": "EILEEN You fellas go ahead and sit at the table. I'll go check on the roast. Eileen drives her chair towards the kitchen. James and Dr. Hayward move to the dining room table and take their seats. Donna returns from the kitchen and sets down a glass in front of James. DONNA Here's your fruit punch, James. JAMES Thanks, Donna. DR.HAYWARD I don't believe I know your parents, James. JAMES No, sir. My dad died when I was ten. My mom ... travels a lot. DONNA Ed Hurley down at the Gas Farm is James' uncle. DR.HAYWARD His wife is the lady with the patch? JAMES That's my Aunt Nadine. She's a real character. EILEEN'S VOICE (from the kitchen) Will? Can you give me a hand? DR.HAYWARD Excuse me, James. He exits into the kitchen. Donna whispers across the table to James. DONNA (more intimately) We can talk after dinner. JAMES It's good to see you.  61. DONNA (smiles warmly) It's good to see you, too. CUT TO: EXT. HAYWARD HOUSE - NIGHT 73.   73.  Mike and Bobby pull up outside in Bobby's car. They see James bike parked in front. BOBBY That bastard. MIKE First your girlfriend, then mine. BOBBY Too bad we can only kill him once. He lights a cigarette. They drive slowly off. The rear brakelights disappear into the darkness. The wind howls. CUT TO: INT. DR. JACOBY'S OFFICE - NIGHT 74.   74.  We hear a soft, cool be-bop tune. Lights are low. A pair of strange, green orthopedic shoes dance expertly into view and execute a few boss moves. We widen out to see Dr. Jacoby in his fifties-style, Hawaiian- themed rec room. He picks up his mail and sifts through it, continuing to dance. He stops suddenly when he comes across a slightly bulky plain manilla envelope. He opens the envelope and finds a single audio cassette tape, without a case. Written on the cartridge are the words ...  62. \"TO DR. JACOBY, WITH LOVE, LAURA\" Overcome with amazement, he instantly turns off the stereo, punches eject, removes the tape that was playing, inserts Laura's tape and hits play. LAURA'S VOICE (from the tape)",
      "dialogue_count": 0,
      "word_count": 730
    }
  ]
}