{
  "slug": "twin-peaks-103-episode-1-3-1990",
  "title": "twin peaks 103 episode 1 3",
  "genre": "drama",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 1,
  "characters": [
    "JOSIE"
  ],
  "total_words": 6923,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HAYWARD HOUSE LIVING ROOM - DAY Doc Hayward steps into the living room, dressed for the funeral save for the tie which hangs undone around his neck. Donna waits for him. She looks at his tie, manages a small smile. DONNA Dad, you're hopeless. Donna knots her father's tie. She does not speak. Her eyes are red from crying. Hayward takes a look at his daughter, consoles: HAYWARD Want to talk about it? DONNA Oh, Dad, I... I can't believe they're burying Laura today. It's so... final. I think and I think and it just doesn't make sense. HAYWARD Death never does. DONNA (tearful) So what are we supposed to do? HAYWARD (after a beat) I live with death and dying every day. There are times when it's merciful, almost a relief. But often it seems nothing but needless and cruel. It made me furious, for many years. Furious and helpless. As you go through life, you learn to accept it. Because we have to. Even when it hurts bad enough to break your heart. DONNA My heart is breaking. And I don't know how to stop it. Donna looks up at her father. Her eyes are bright with tears. Father and daughter embrace. CUT TO:  20.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 209
    },
    {
      "scene_number": 2,
      "slugline": "EXT. BRIGGS HOUSE - DAY Establish. CUT TO: INT. BRIGGS DINING ROOM - DAY BOBBY BRIGGS sits at the dining room table, smoking a cigarette. Quiet, seemingly downcast. But his eyes are angry and cold. He wears dark funeral clothes, a tie. Bobby turns, finds MAJOR BRIGGS standing across the room. MAJOR BRIGGS Robert, this may be a good time for a brief discussion. BOBBY You want to talk about cigarettes? Today? MAJOR BRIGGS No. But put it out. It's a filthy habit, especially for a varsity athlete. Bobby grinds out the cigarette in an ashtray. He glowers. Major Briggs sits next to him, places a hand on Bobby's knee. He means well, but physical affection does not come naturally to him. It feels a little forced. MAJOR BRIGGS (CONT'D) I've attended my share of funerals. Too many. Any man who dies in war dies too soon. Laura died too soon as well. BOBBY Yeah. She did. MAJOR BRIGGS But we have a responsibility to the dead, Robert. Responsibility is the linchpin that binds our society together. Each man responsible for his actions, each action contributing to the greater good. BOBBY What's the good of putting somebody in the ground?  21.",
      "characters": [
        "JOSIE"
      ],
      "action_text": "MAJOR BRIGGS It is man's way of achieving closure. In ceremony begins understanding, and the will to carry on without those we must leave behind. And Robert, in your life, you must learn, will learn, to carry on without them. BOBBY (whispered) Great. MAJOR BRIGGS I know you experience a certain reluctance to enter fully into meaningful exchange. That leads to stalemate, and a desire on my part to force certain wisdom upon you. That's not necessarily a bad thing, sometimes it is the best course available. Briggs pauses, rethinks. Then, a direct emotional statement... MAJOR BRIGGS (CONT'D) Son. Don't be afraid. We'll all be there together. Bobby takes a closer look at his father. These are words he understands. But they have absolutely nothing to do with the way he's feeling. BOBBY Afraid of what? MAJOR BRIGGS The funeral. BOBBY I'm not afraid of any damn funeral. Afraid? I can hardly wait. Afraid? I'm gonna turn it upside--down. The anger pours out of him. For once Major Briggs is speechless. But no matter, just then BETTY BRIGGS steps into the room, and, with a too bright smile... BETTY Everybody ready?  22. Father and son turn jaundiced eyes her way. CUT TO: EXT. TWIN PEAKS POLICE STATION - DAY Establish. CUT TO: INT. POLICE STATION RECEPTION AREA - DAY Cooper and Sheriff Truman step through the station reception area. DEPUTY TOMMY THE HAWK appears, keeps pace beside them. COOPER Deputy Hawk. HAWK Agent Cooper. No sign of the man with one arm. COOPER Keep trying, Deputy. He's out there somewhere. Cooper and Truman continue towards the conference room. TRUMAN If anyone can find him, Hawk can. COOPER Tracker? TRUMAN The best. CUT TO: INT. INTERROGATION ROOM A - DAY Cooper and Truman enter. Albert Rosenfield sits at the table, with a huge file of test results. He refuses to acknowledge Truman's presence. Not even a glare. COOPER Okay, Albert, what've you got? ALBERT Enough evidence to save your butt and get mine out of this godforsaken berg.  23. COOPER We're all ears",
      "dialogue_count": 1,
      "word_count": 6714
    }
  ]
}