{
  "slug": "twin-peaks-102-episode-1-2-1990",
  "title": "twin peaks 102 episode 1 2",
  "genre": "drama",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 4863,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BLUE PINE LODGE CORRIDOR - DAY Josie moves down the corridor and enters another door... CUT TO: INT. BLUE PINE LODGE OFFICE - DAY Catherine's office. Leaving the door open, Josie moves behind the desk. She searches for and finds a catch that releases a latch... ...a false shelf of books hinge out from the wall, revealing an old fashioned wall safe. Josie takes out the key that Pete gave her and inserts it into the keyhole of the safe. She manipulates the handle and opens the safe door. Josie reaches into the safe and lifts out two sets of two ledger books labeled: PACKARD SAWMILL, RECEIPTS; one set labeled \"1989\" and the other \"1990.\" Josie hears a car drive up and brakes squeal outside. CATHERINE'S VOICE I told you to put it in the car-- Josie quickly puts the books back in the safe, closes the safe, replaces the false bookshelf, and scurries out of the room. CUT TO: INT. BLUE PINE LODGE CORRIDOR/OFFICE - DAY Just as Josie enters the corridor, Catherine comes up the stairs to the corridor. Josie hurries back into the office and hides in the closet. CATHERINE (to herself as she enters the office) I told that knothead twice to put it in the car. Catherine moves to the desk, looking for something, which she finds. Josie watches from the closet as Catherine remembers something, picks up a phone, punches in a number on the auto- dialer and waits. CATHERINE (CONT'D) Ben, Catherine... where the hell were you last night? I thought we had a date... family crisis?  31. (MORE)",
      "characters": [],
      "action_text": "You want to see a family crisis, try standing me up twice in a row, Mr. Debonair. She hangs up and exits. In the closet, waiting, Josie ponders this information. FADE OUT: END ACT TWO  32. CATHERINE   (CONT'D) ACT THREE FADE IN: EXT. CHURCH - DAY A church bell rings.   Citizens are leaving church. CUT TO: EXT. CHURCH - CLOSER - DAY Doc Hayward pushes Mrs. Hayward in her wheelchair towards the handicapped access ramp. Donna exits the church behind them and sees Audrey Horne is standing outside, leaning against a railing. AUDREY (to Donna) Hi. DONNA Hi. Something in Audrey's look says she wants to talk to Donna. DONNA (CONT'D) I'll be right there, Dad. DR. HAYWARD We're going over to get a Softie Freeze, you'll be joining us, won't you? DONNA Dad, when I have ever missed a Softie Freeze? MRS. HAYWARD Maybe Audrey would like to join us? AUDREY Do you all go for a Softie Freeze every Sunday? DR. HAYWARD Every Sunday after church since Donna was a little girl. MRS. HAYWARD We enjoy is so much. Hope you can join us. Mrs. Hayward drives down the ramp.  33. DR. HAYWARD Nice to see you in church, Audrey. Dr. Hayward follows his wife off. AUDREY (sincerely) I wanted to come down cause of Laura. DONNA What do you mean? I didn't think you even liked her. AUDREY There were things about her I didn't like, but she helped take care of my brother. And I guess I sort of loved her for that. That's why I'm here. DONNA That's really nice of you. AUDREY I knew how close you were to her. I wanted to tell you how sorry I am. DONNA Thanks. Audrey nods, shyly, ready to move off. AUDREY You take care. Donna starts to watch her go. DONNA (feeling Audrey's loneliness) Why don't you come with us for a Softie Freeze? AUDREY I don't know... DONNA Really. AUDREY (touched) Yeah?  34. DONNA Sure, come on, they're really good. AUDREY Okay. DONNA And if we're really lucky, maybe my dad will tell his story about the night the porcupine got into the hospital. AUDREY Oh, I'd like to hear about that. They ",
      "dialogue_count": 0,
      "word_count": 2004
    },
    {
      "scene_number": 2,
      "slugline": "EXT. WOODS - NIGHT Bobby and Mike walk slowly forward, Mike lagging a step or two behind. They reach a particular tree with a large hollow knot. Bobby reaches into the knot and pulls out a football. MIKE Is it there? It is in there? Bobby kneels down and reaches into a slit cut across the top of the hollow football. He pulls out a small packet of white powder. BOBBY Not all of it. LEO'S VOICE Cash on delivery, Bobby. They look up. LEO JOHNSON is standing between them and the car, backlit by headlights, holding a shotgun. BOBBY (rises slowly) Hey, Leo. MIKE Hey. LEO Toss it over here, quarterback. BOBBY It's empty. He tosses the football to Leo. LEO Is that right? Weren't you supposed to leave something in there for me? BOBBY That's what we wanted to talk to you about, man. LEO Half down, half on delivery. That's the deal. BOBBY You haven't delivered. We already gave you half. (holds up the drugs)  44. (MORE)",
      "characters": [],
      "action_text": "This is less than you owe us for that--where's the rest? LEO Where's the rest of the money? MIKE There's a problem. LEO Problem? BOBBY Laura had the other half in a safe deposit box. LEO You think you got problems? BOBBY We can get it, Leo, soon as things settle down. LEO (advancing) You owe me ten grand. BOBBY (backing off) Okay. So we won't take delivery until we get it for you-- LEO Look at me--I look like a bank to you? BOBBY Man, I can appreciate your concern, but this thing with Laura, how'm I supposed to anticipate a thing like that? LEO Laura was a wild girl. BOBBY Tell me about it. LEO Maybe. Someday. Leo's right next to Bobby, Mike behind him. Bobby and Mike look at each other. Mike reaches into his pocket.  45. BOBBY   (CONT'D) Without taking his eyes off Bobby, Leo slowly swivels the shotgun around and trains it on Mike. LEO (CONT'D) Take your hand out of your pocket, Mike. Mike and Bobby look at each other. Bobby nods. Mike takes his hand out. BOBBY What's your problem, Leo? LEO Problem? You want to know about problems? BOBBY ...Okay. LEO You go out on the road. You're drivin'. Back and forth. Gone for days. You get home and guess what? BOBBY What? LEO You find out your old lady's been givin' it away. BOBBY Yeah? LEO Yeah. Steppin' out. In your own... damn... (loud whisper) ...bedroom... Leo's eyes dart back and forth. Amphetamines. Bobby and Mike look at each other. LEO (CONT'D) That's... a problem. He cocks the gun. BOBBY I guess so. I guess it is. You know who?  46. LEO A man needs a clean house. BOBBY Sure... so do you know who? LEO I will take care of it. BOBBY Sure you will... and this other thing, hell, we'll take care of that, too, don't you worry about that. We'll get that cash and we'll square everything-- LEO Go out for a pass. BOBBY What? LEO Go out. Run. Run. Bobby and Mike back away from him. BOBBY Leo, take it easy, okay? LEO Run! Bobby and Mike turn and start jogging away from him, back towards the car, picking up speed, glancing over th",
      "dialogue_count": 0,
      "word_count": 1550
    },
    {
      "scene_number": 3,
      "slugline": "INT. GREAT NORTHERN HOTEL ROOM - NIGHT Agent Dale Cooper lies in bed, sleeping fitfully, troubled by a dream. CUT TO: INT. HOSPITAL CORRIDOR - NIGHT In shadow, a pay phone in the hospital corridor. A FIGURE that we can't see picks up and dials the phone. FIGURE'S VOICE Agent Dale Cooper, please... wake him... INTERCUT: INT. COOPER'S HOTEL ROOM - NIGHT Woken from his troubled sleep, Cooper answers the phone. COOPER (answers the bedside phone) Agent Cooper... FIGURE'S VOICE Were you sleeping? COOPER Yes, who is this? FIGURE'S VOICE It's a strange night. There's something in the air, can you feel it?   (silence) You know about Theresa Banks, the pretty girl they found last year?... COOPER Yes, I know about Theresa... FIGURE'S VOICE I know the man who did her... I know about the stitches, with the red thread... and there's more that I think you'd enjoy hearing... I'm at the hospital now.  54.",
      "characters": [],
      "action_text": "COOPER I'm on my way. He hangs up the phone, starts to get out of bed, and the phone rings again. COOPER (CONT'D) Agent Cooper... INTERCUT: INT. LUCY'S APARTMENT - NIGHT Lucy is on the phone, Andy is nearby, listening. LUCY Hi, Agent Cooper, it's Lucy from work? COOPER Are you still at work, Lucy?... LUCY No, Andy and I are over at my place, Andy was playing the trumpet and we were getting ready for bed and do you know what happened? COOPER No, tell me -- (stay with Cooper; a long answer) Oh, oh, oh, uh-huh, okay, okay, I understand... Lucy, tell the Sheriff to get that sketch and meet me at the hospital--I've just received a phone call-- Back on Cooper as he hangs up, picks up his tape recorder and speaks into it as he starts to dress. COOPER (CONT'D) Diane, woken from a sound sleep at the Great Northern Hotel, room 315, it's 2:24 am. Received two phone calls, back to back; the first from a man unknown to me who had certain confidential information regarding the Theresa Banks murder. I'm on my way to meet him now. At the same time, Mrs. Palmer apparently remembered or had a vision of the killer.  55. (MORE) The Sheriff is on his way to her and will meet me afterwards. Diane, when two separate events happen simultaneously pertaining to the same object of inquiry, we must always pay strict attention. CUT TO: INT. HOSPITAL - NIGHT Andy stands in the doorway. The One-Armed Man stands in the shadows of the room. Cooper and Truman, carrying two police sketches, join Andy. ANDY He's unarmed. He wants to see you and he wants to see you in this particular room. Truman and Cooper turn towards the man. ONE-ARMED MAN Don't turn on the overheads. The fluorescents don't work. I think a transformer's bad. COOPER We know that. ONE-ARMED MAN Yes. Wasn't Laura Palmer here earlier? \"Through the darkness of futures past, the magician longs to see. One chance out between two worlds... fire, walk with me\"... We lived among the people. I think you say, convenience store. We lived above i",
      "dialogue_count": 0,
      "word_count": 960
    },
    {
      "scene_number": 4,
      "slugline": "INT. RED-DRAPED ROOM - DAY A large, windowless, well-lit, sparsely furnished, red-draped room. A table and three easy chairs. Dale Cooper, twenty- five years older, sits in one of the chairs. A LITTLE MAN, three and a half feet tall, in a red suit, stands with his back to Cooper, shaking violently. A BEAUTIFUL YOUNG WOMAN who looks exactly like Laura Palmer sits across from Cooper in another easy chair. The Little Man stops shaking, turns to Cooper and claps his hands once. LITTLE MAN Let's rock! The Little Man sits in a chair beside the beautiful woman. The Little Man closes his eyes and rubs his hands slowly together. The Little Man holds hands with the Woman, they look at each other, then look at Cooper, smiling enigmatically. The Little Man rubs his hands slowly again; the shadow of a bird passes above them. Both the Little Man and the Woman's speech is oddly stilted. We see sub-titles under them, with the correct words. Throughout, Cooper sits still, watches, and listens. LITTLE MAN (CONT'D) I've got good news! That gum you like is going to come back in style. She's my cousin, but doesn't she look almost exactly like Laura Palmer? COOPER But it is Laura Palmer. Are you Laura Palmer? WOMAN I feel like I know her, but sometimes my arms bend back. LITTLE MAN She's filled with secrets. Where we're from, the birds sing a pretty song and there's always music in the air. Strange saxophone music filters into the air. The Little Man hops off the chair and begins to dance a strange dance around the table.  59.",
      "characters": [],
      "action_text": "The Woman rises, goes over, and gently kisses Cooper on the mouth. She softly whispers something in his ear. CUT TO: INT. COOPER'S HOTEL ROOM - NIGHT Cooper shoots up out of his bed, waking from this strange and disturbing dream. He fumbles for the phone and dials. COOPER Harry, it's Cooper, meet me for breakfast, seven o'clock, here at the hotel. I know who killed Laura Palmer. He hangs up. FADE OUT: THE END  60.",
      "dialogue_count": 0,
      "word_count": 349
    }
  ]
}