{
  "slug": "under-the-silver-lake-2018",
  "title": "under the silver lake",
  "genre": "action",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 5,
  "characters": [
    "MEEK BRIDE",
    "ALLEN",
    "SONGWRITER",
    "MILLICENT",
    "SARAH"
  ],
  "total_words": 30420,
  "total_dialogue": 5,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. SECRET HEADQUARTERS COMIC SHOP - DAY 9   9  Sam browses the aisles of comics. He grabs an issue of Spider Man and adds it to the small stack in his arms. Two nearby patrons chat loudly while looking at some Jimmy Corrigan anthologies. CUTE ART WOMAN Someday I really want to swim with wild dolphins. UGLY ART MAN I have a friend who does that. CUTE ART WOMAN Oh you'll have to introduce me. UGLY ART MAN I will. Sam scans the local press, comics and zines - hanging separately on a rotating wire shelf. He notices one in particular. Rough and xeroxed in an underground art style, Sam picks up a small, handmade and hand-drawn zine. Its title is: Under the Silver Lake On the cover are several strange drawings. The local Silverlake Junction sign, the Elliott Smith wall, a naked woman in a mask, a man holding a sign, and some tiny text at the bottom of the page. Sam flips through the zine. He sees an article titled: Beware the Dog Killer Sam stares at the headline then scans the page. He closes the zine and adds it to his pile. Standing at the register, the CLERK examines Sam's purchases like a curator - nodding approval or staying condescendingly silent. He punches numbers into the register. Lifting up the handmade zine, the clerk grins and stares down at the small text on the cover page. CLERK (reading aloud) Only I know the secrets of Silverlake.  14.  (MORE)  (CONTINUED)",
      "characters": [],
      "action_text": "In time I will reveal the truth behind the mysterious crimes, murders and disappearances within this cursed community. I have the answers... I will reveal all... Under the Silver Lake. The clerk laughs and Sam smiles back at him. Politely. CLERK  Jesus.  SAM Do you know who writes this? CLERK Yeah. A local guy. Uh, strange, but nice. SAM Does he come in here much? CLERK Sure. I see him. SAM If I gave you like five bucks, would you give him my number and ask him to call me? CLERK I don't know. Sam grabs a pen and writes his name and number down on a comic store business card. SAM Come on. I like his work. I'd like to meet him. You're just... passing on a number. CLERK (condescending) Ok. Sure. But I don't need your five dollars. Sam takes the money and puts it back in his wallet. EXT. RANCHO LOS FELIZ APARTMENTS - NIGHT 10   10  Sam walks down the dark garden path. The night is quiet except for crickets, the trickle of water, and the occasional siren.  15.  CONTINUED: 9   9  CLERK (cont'd)  (CONTINUED) Sam notices movement. A small skunk walks along the hedges - seeming to trail the young man. Sam stops and waits, watching the tail of the smelly animal move further into the darkness. Turning beyond the shrubs, toward a first level patio, Sam sees the white Bichon Frise from the pool. The dog is tied to the railing, pooping on an open newspaper. Music pours from inside the apartment through the screen door. Sam steps through the grass toward the dog. He pulls a colorful dog biscuit from his pocket and places it on the ground. Coca Cola nibbles at the biscuit. Enjoying his treat. SAM Good dog. The door slides open and Sarah stands before Sam. She's wearing her white bonnet and a casual, but beautiful dress. Black reading glasses sit atop her nose. SARAH Hello. SAM Hi. Sam leans closer, watching the dog eat. Sarah kneels near her pet and rubs his back. SARAH Wow. Look at that, Coca-Cola. This nice man gave you a treat. Can you say thank you? The dog just continues to ea",
      "dialogue_count": 0,
      "word_count": 2994
    },
    {
      "scene_number": 2,
      "slugline": "EXT. RANCHO LOS FELIZ APARTMENTS - DAY 20   20  Sam walks along the garden path towards Sarah's apartment. He knocks on her front door. No one answers. Sam walks around back and steps onto Sarah's patio. Coca Cola isn't there. The patio chairs are missing. The old newspapers and dog poop are gone. The young man peeks in through the patio door. The blinds are open. There's no furniture inside. The apartment is completely empty. INT. RANCHO LOS FELIZ MANAGER'S OFFICE - DAY 21   21  Inside the glass-walled, log-cabin office, Sam leans against one of the desks. A greasy haired MANAGER with a puckered face, looks up from behind his monitor. His contempt is obvious. He stares at Sam as though he's looking into an unflushed toilet. MANAGER They moved out. How does that   not  makes sense? SAM Who moves out in the middle of the night? MANAGER They wanted to leave. They forfeited their deposit, paid the lease.   They... moved... out.   Nothing strange about it. SAM I don't know why she wouldn't have told me? MANAGER I don't know. Maybe she didn't like you. Maybe she knows you're poor and you haven't paid your rent. Maybe she doesn't want to date a homeless man? Sam says nothing. He stares at the smug manager - anger brewing.  27.  (CONTINUED)",
      "characters": [],
      "action_text": "MANAGER Speaking of rent... this isn't personal, but I want you to know that you'll be forcibly removed if you can't pay in the next seven days. SAM I got it. MANAGER Ok. Great. INT. DRAWING ROOM - DAY 22   22  Sam drinks whiskey in the dark bar. Sunlight occasionally cuts across the shadows, as patrons enter or exit. A heavy man, with a half-bald head, shifts on his stool. Sam's 43-year-old BAR BUDDY gulps his beer and rubs his ear in contemplation. SAM I couldn't even find her online. BAR BUDDY Yeah. It's kinda weird. I don't know. What do ya do? SAM Not sure. Two drunk women, behind tall beers, carry on their own conversation at the bar. We hear pieces of it... BAR BUDDY   OLD DRUNK WOMAN Have you heard about these   The only thing I hate more dog killers?   than   getting patted on the head   is l ooooove on a schedule.  SAM There's more than one?   YOUNG DRUNK WOMAN They always say to me \"you're BAR BUDDY   too pretty to be this nice\" Who knows. Creeps me out.   or \"you don't look like you've It's one thing to get mugged,   had a child.\" God I just want but to have some dude stab   to find somebody with a little your dog right before your   financial security. I can eyes... that would traumatize   dream, right? a person... fuckin' horrible. SAM Totally. Sam takes a sip from his glass.  28.  CONTINUED: 21   21  (CONTINUED) BAR BUDDY Maybe she left a clue? SAM What? BAR BUDDY  The girl.   If something bad happened, there might be...   evidence.   Blood on the carpet. I don't know. Sam shrugs...   Sure, evidence.   Why not?   He takes a big swig of whiskey. EXT. NEAR SARAH'S PATIO - DAY 23   23  Sam steps behind some shrubs, locating Sarah's bedroom window. He's sweaty. A bit drunk. He looks back and scans the neighboring balconies. Seems clear. No one's around. The young man slides a screwdriver behind the window screen and pops it out. Quickly, he climbs inside with a thud. INT. SARAH'S BEDROOM - CONTINUOUS 24   24  Sam twists the blinds closed - covering the op",
      "dialogue_count": 0,
      "word_count": 757
    },
    {
      "scene_number": 3,
      "slugline": "EXT. NEAR SARAH'S PATIO - CONTINUOUS 25   25  Sam remains there, behind the bushes, peeking into the bedroom. Waiting to see who's arrived. A young woman, TROY, in jean shorts and a Joan Jett and the Blackhearts t-shirt, steps into the bedroom. Her hair is thin and \"dirty white\". Her face is pretty, but a little masculine. A tomboy, sex-pot and scenester combined. Sam watches the girl open the closet and go inside - a cloth Trader Joe shopping bag in her hand. After a moment, she emerges with the box in her arms. Setting it down in the middle of the empty room, Troy dumps the contents of the box into the bag. She reaches in, grabs a stick of gum and puts it in her mouth. Troy picks up the bag and walks into the hallway. As she leaves, the girl closes the bedroom door - revealing a marking on the wall - previously hidden. <><> Through the blinds, Sam stares at the strange symbol. Drawn in pink nail polish... Two diamond shapes, joined at the tip... <><> Sam stares at the symbol for a moment. Clearly puzzled. A storm door closes. Footsteps. Sam ducks and watches Troy cross by, swinging her bag of goodies along the garden path. EXT. VESELICH AVENUE - DAY 26   26  Trailing the girl from the opposite side of the street, Sam walks slowly, stepping behind trees and parked cars. Troy strolls along the sidewalk. A car pulls up in the intersection before her. It's a 1984 Volkswagon Rabbit Wolfsburg convertible.  30.  (CONTINUED)",
      "characters": [],
      "action_text": "Two other hipster girls are inside. A black haired girl is driving. A freckled redhead in back. Familiar indie-rock pours from the speakers. Troy races up and hops into the passenger seat. The car takes off towards Los Feliz Boulevard. Sam sprints to his car. INT. SAM'S FORD MUSTANG - DAY 27   27  Sam drives along Los Feliz keeping the Rabbit convertible in his sights - just a few cars ahead. He follows the girls, turning left onto Griffith Park Boulevard. Sam watches their car slow down and stop in front of John Marshall High School. He pulls over and waits. Troy and her friends sit still - engine running - across from the football field. Some local teens pass by Sam's car. They point and laugh at the penis drawing covering his hood. He ignores them. From his center console, Sam pulls out a pen and an LA County parking ticket. He draws the secret shape on the ticket. <><> Looking up, Sam notices the girls staring over at the high school scoreboard. Some numbers flash on the visitor's side. The number 7... then the number 5... and finally the number 1. Sam writes them on his ticket. 7 5 1 The white rabbit convertible pulls back onto the road and heads towards Rowena. Sam stays in pursuit. INT. SAM'S FORD MUSTANG - DAY 28   28  Traveling down Sunset Boulevard... Sam follows, trailing the car toward Echo Park. EXT. ECHO PARK LAKE - DUSK 29   29  The sun begins to set over the lake as Sam idles along Echo Park Avenue.  31.  CONTINUED: 26   26  (CONTINUED) He watches the girls walk up to the nearby boat house. Leaving his car, Sam follows the threesome. He looks around the boat house and sees a PARK EMPLOYEE helping the girls into two red paddle boats. Troy climbs in with the brunette - the Trader Joe bag over her shoulder. They start to pedal away from the dock. The handsome Park Employee eyes them as they float off. Sam hops in his own blue paddle boat and starts to pedal - churning water and gaining momentum. Paddling out, he follows the two red boats from a distance",
      "dialogue_count": 0,
      "word_count": 830
    },
    {
      "scene_number": 4,
      "slugline": "INT. SAM'S FORD MUSTANG - EVENING 30   30  A few lengths behind the convertible Rabbit, Sam drives his car down 2nd Street towards the city. Homeless people look up from their shopping carts and cardboard beds as the black Mustang passes by. Sam enters the tunnel under Bunker Hill. He stares ahead - the girls sit calmly together. Turning onto 6th Street, the Rabbit drives up in front of the Standard Hotel. Sam trails behind, watching as Troy and her friends hop out - pulling beach towels and pool rafts from the car. The brunette passes the keys off to the SHADY VALET. The redhead pulls her t-shirt off, revealing a bikini top. She swings the shirt over her shoulder and smiles to the brunette. Sam drives closer, watching the three pretty hipsters go into the back door of the hotel. Troy laughs as she blows air into an inner tube - disappearing through the doorway. Pulling into a blue-lined parking space, Sam takes out a handicap-parking permit and hangs it from his mirror. INT. STANDARD HOTEL ELEVATOR - EVENING 31   31  Sam rides up alone. The elevator doors open. Live music pours in from the rooftop patio. EXT. DOWNTOWN STANDARD ROOFTOP BAR - EVENING 32   32  Standing before Sam is a leggy woman in a bikini and black top hat. Her extended leg in the doorway forces Sam to face her - although he would have done so regardless. BIKINI TOP HAT GIRL Welcome to purgatory. SAM Uh... good to be here. I needed some time to think about things. The bikini girl smiles. She pulls a small sewing needle from a plush, cherry-shaped, pin cushion and presents it to Sam. BIKINI TOP HAT GIRL Use it wisely. Sam smirks and slides the pin through the pocket of his shirt as he walks on.  33.  (CONTINUED)",
      "characters": [
        "MEEK BRIDE"
      ],
      "action_text": "He passes an identical girl, performing an identical greeting to a small crowd exiting the adjacent elevator. A POET dressed like a 1940's housewife marches by, stepping across the furniture and tables while reading poetry against the loud music.   She tears little pieces of paper from her page and drops them to the ground like rose petals. HOUSEWIFE POET All these... holy trinities of women... thriving like plants... under the heat... of the city's male gaze....three three three... three three three... three three three... Sam scans the area for Troy and the girls. He sees them sitting down on a big couch near the stage. A live band is playing before a crowd. Stepping closer, Sam sees the understated singer and his gorgeous female band. It's Jesus and the Brides of Dracula - made clear by the accompanying signage and drum logo. The THREE BRIDES are all in white 1920's gowns with pale skin and sad eyes. JESUS is in old blue jeans - bare chested with a cross around his neck. Sam moves closer as the band kicks into a prolonged music jam. Faster and faster, the tempo rises. The crowd parts as a dancer emerges from behind the stage. She draws all attention - including Sam's. A teenage girl in a green unitard dances provocatively wearing an enormous mass of multi-colored balloons. BALLOON GIRL smiles and gyrates. Her arms wave in the air as her shoulders sway. Suddenly she begins to scream over the pounding drums. All part of the act, but strange nevertheless. Balloon girl dances through the crowd screaming as everyone pokes and pops the balloons with their sewing needles. Pop. Pop. Pop. Pop. Pop. The music reaches a crescendo and ends with a final roar. Sam watches as balloon girl emerges from the mob - she's covered in deflated rubber over her nylon suit. She stares up at the sky, as though healed by Pentecostal powers. The crowd cheers as the band disappears behind a curtain.  34.  CONTINUED: 32   32  (CONTINUED) TROY I love you Jesus! Sam pulls the sewing needle from",
      "dialogue_count": 1,
      "word_count": 4737
    },
    {
      "scene_number": 5,
      "slugline": "EXT. GRIFFITH PARK BOULEVARD - DAY 44   44  Sam walks down Griffith Park Boulevard, covered in sweat. He stares at the blank scoreboard near John Marshall High School as he passes. A car full of teenagers zips down the road. Sam hears a familiar tune approach and recede with their passing.  You   and   I...  turning like   teeth ... lov ing   beneath ...  the   sur face . Sam listens, wiping sweat from his face. The sun covers all. INT. COMIC MAN'S HOUSE - LIVING ROOM - DAY 45   45  Knock. Knock. Knock. COMIC MAN opens his front door and greets Sam - now soaked from the heat. COMIC MAN Come on in. You want a beer? He waves Sam inside. Closing the door. SAM Yes, please. COMIC MAN Hot day and a cold beer. Sam smiles and looks around, fanning himself. It's a mess of a house. Sketches, papers and books litter the room. Dust balls collect in corners. From the dim living room into the far hallway, the walls are covered in LIFE MASKS. Sam fixates on the dozens of solid-white faces hanging everywhere. Their eyes are closed. Their expressions are frozen in time.  53.  (CONTINUED)",
      "characters": [],
      "action_text": "He sees... Basil Rathbone, Debbie Reynolds, Angelina Jolie, Bela Lugosi, Katherine Hepburn, Christopher Reeve, Ashton Kutcher, Linda Blair, Charles Laughton, Patricia Arquette, Lou Costello and Robert Redford. SAM What are these masks? COMIC MAN They're life masks. Comic Man hands Sam a beer. He cracks it open and takes a drink. SAM What's a life mask? COMIC MAN They're resin castings of famous people's faces. They're   all real   and they are true to life representations of these amazing people. SAM Hm. COMIC MAN Most of 'em are from film productions, but some were cast by sculptors for statue construction. Like Lincoln's... Comic Man points to the chalk-white face of Abraham Lincoln hanging from the wall. His eyelids are closed. COMIC MAN That's his real face... and that's Grace Kelly's right next to Johnny Depp. SAM Huh. MAN I really need to have a family so I have someone to pass these on to. Right? These people need to be remembered. SAM I understand.  54.  CONTINUED: 45   45",
      "dialogue_count": 0,
      "word_count": 364
    },
    {
      "scene_number": 6,
      "slugline": "INT. COMIC MAN'S LIVING ROOM - DAY 46   46  Sitting on the couch, surrounded by books, odd tchotchkes and \"Under the Silver Lake\" zines, Sam draws the double diamond shape on paper. <><> Sam's photograph of Sarah sits on the paper next to the drawing. Comic Man leans in and looks at the symbol. COMIC MAN Stay quiet. SAM What? COMIC MAN It means \"stay quiet\". It's a hobo code. SAM Really? COMIC MAN Yeah. Hobos and rail-riders from the 1930's used it. Here look... Comic Man grabs a book from his giant shelf. He opens it and shows Sam a graph of common hobo symbols. O   --   ||   X   r   <><>   /// Sam lifts a piece of scrap paper from within the book. It's filled with handwritten translations. A simple KEY for the mysterious hobo code. COMIC MAN They used it to let other people know who was cool, who wasn't, what houses might offer food, if there's a doctor in that town who might be sympathetic to travelers. That sort of thing. Sam stares at the symbols, keeping the code-filled book mark in his hand. SAM Well why is it in Sarah's room and who are they telling to be quiet?  55.  (CONTINUED)",
      "characters": [],
      "action_text": "COMIC MAN I don't know. Maybe you? Sam takes a deep breath. Comic man opens an issue of \"Under the Silver Lake\", sitting amongst the clutter. Inside it's filled with snapshots of \"lost and found\" signs from all over the east side of Los Angeles. Page after page... COMIC MAN There's been a rash of \"Lost and Found\" signs for dogs, humans, and musical equipment in the past two years. Something big is going on. I know it. SAM Do you think any of it could be connected to Sarah? COMIC MAN Of course. Sam listens... wanting to believe, but troubled by it all. He looks at the life masks covering the walls. Is this man sane? Am I? Comic Man begins sorting through various issues of \"Under the Silver Lake\" as he talks. COMIC MAN It could be a lot of things. Sex or drug trafficking. The Dog Killer. Cult of the Whale. I don't know... lately I just assume the Owl's Kiss has something to do with everything. SAM I'm not so sure about that. Comic Man stares Sam down - a little offended by his dismissal. COMIC MAN Do you have a dollar bill on you? SAM I might...  56.  CONTINUED: 46   46  (CONTINUED) Sam digs through his wallet and pulls out a dollar. Comic Man takes it, producing a magnifying glass from the drawer. He holds the glass over the dollar bill, steadying it on the coffee table. COMIC MAN Take a look... that's the sign of the Owl's Kiss. Sam leans in and looks through the magnifying glass. He sees it. A tiny owl is visible, peeking up from behind the crest of the top-right corner's numeral one. COMIC MAN Right there. On every dollar bill in this country. With every transaction we enter a pact to live by her law... any household that eats, lives and trades under her eyes is subject to her jurisdiction. Comic Man hands the dollar back to Sam. He stares at the little bird, previously hidden in his wallet. COMIC MAN Our world is filled with codes, pacts, user agreements and subliminal messages. More enthusiastic, Comic Man grabs piles of torn magazine pages and ads from old Play",
      "dialogue_count": 0,
      "word_count": 1274
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BAR BUDDY'S HOUSE - DUSK 50   50  Sam walks up the sidewalk and sees Bar Buddy smoking and drinking on his porch. Seeing Sam, he waves and approaches, meeting in the driveway. BAR BUDDY Where's your car? SAM Oh. It's in the shop. Getting repainted from all that graffiti. BAR BUDDY That's what you get for driving that cockmobile. SAM I like my car. BAR BUDDY I like my cock. I don't have to compensate for it. Sam ignores his friend, shaking his head. SAM Did you hear about Jefferson Sevence? BAR BUDDY Yeah they found him dead in his car last night. With three prostitutes and a dog. SAM Yeah I think Sarah was one of the prostitutes. The dog was the same breed as hers and I saw her hat in a crime scene bag on the news. BAR BUDDY Fuck. I'm sorry, man. SAM Thanks. I feel weird accepting condolences. I barely knew her. BAR BUDDY You liked her though. SAM Mm hm. A little bit.  61.  (CONTINUED)",
      "characters": [],
      "action_text": "BAR BUDDY So what are you gonna do now? SAM I kinda wanna find out who killed her. BAR BUDDY Isn't that a little...   serious?  SAM I guess so. What else am I gonna do? BAR BUDDY I don't know. The two men chuckle to one another. Bar Buddy changes the subject. BAR BUDDY Wanna see something cool? SAM Yeah. What is it? BAR BUDDY You gotta check out my drone. Bar Buddy points his thumb towards the backyard. SAM Your what? EXT. BAR BUDDY'S BACKYARD - NIGHT 51   51  A medium-sized DRONE rises up from the center of the backyard. Silent like some future monster. Its rotors spin. The black quadcopter houses a state of the art camera system. The two men sit on the grass, in front of a laptop - which rests on a cheap folding chair. Their heads are tilted close. Beers in hand. Sam watches the drone hover and soar through the neighborhood. Disappearing into the black sky. Bar Buddy operates the controls from his laptop - piloting the drone. SAM Shit. Where do you get something like this?  62.  CONTINUED: 50   50  (CONTINUED) BAR BUDDY I got it on amazon. SAM Hm. POGO, Bar Buddy's golden retriever walks up to Sam through the grass. The dog licks his hand and arm. Sam pulls away - a fake smile forming. Bar Buddy notices and tugs gently on his dog's collar. BAR BUDDY Leave him alone, Pogo. Come here. Pogo steps away. Bar Buddy rubs the dog's head, petting him fondly. Sam relaxes. BAR BUDDY Look at that. Silverlake from above. The drone soars over Los Angeles. Transmitting a blur of lights, houses, cars and streets. Bar Buddy sniffs the air. Something is afoul. He smells Pogo's fur. BAR BUDDY Jesus, what's that smell? SAM It's me. BAR BUDDY Oh. Bar Buddy accepts the fact with a casual nod. He taps some buttons, watching the drone's camera-relay next to the computer's mapping system. The drone settles in place. Bar Buddy focuses the camera on a large window overlooking a canyon - some modern home in the hills. BAR BUDDY Ok. This is a good one. I've been scouting houses and I think th",
      "dialogue_count": 0,
      "word_count": 3582
    },
    {
      "scene_number": 8,
      "slugline": "INT. CRYPT CLUB - NIGHT 59   59  Sam walks out of the bathroom - dizzy. He holds his head - nauseous and pale - as he scans the crowd. His table is empty. Balloon Girl is gone. SAM Fuck me. Near the entrance, he sees Troy, one of the Rabbit convertible girls. As he steps closer, focusing his eyes, Troy spots him and pushes through the crowd - rushing out the door. Sam follows - picking up the pace. EXT. HOLLYWOOD FOREVER CEMETERY - NIGHT 60   60  Sam chases the girl through the dark cemetery. SAM Hey! Wait! Troy is quick. She darts between the graves and trees. Sam dodges and leaps in pursuit. A long stretch of open grass separates them. Sam kicks into high gear. His breathing intensifies. Sweat everywhere. He gets closer and closer, staring ahead at the girl sprinting along in her jean shorts. Everything starts to slow down... turning purple... then black... Sam falls to the ground - holding his head. Darkness. EXT. HOLLYWOOD FOREVER CEMETERY - MORNING 61   61  Morning birds chirp. Ring. Ring. Buzz. Buzz. Sam opens his eyes and lifts his cell phone to his face. He's laying in the grass, just below a tombstone. Beer and wine bottles litter the ground. Sam answers, rubbing his head. Pain.  78.  (CONTINUED)",
      "characters": [],
      "action_text": "SAM Hi, mom. MOM Hello! I'm so glad you picked up. I have good news. Remember I told you about that Janet Gaynor movie? SAM Uh huh. MOM Well... I taped it for you, and I'm gonna send it in the mail, but I wanted to make sure you had a VCR. SAM It's not hooked up, but I have one. If you send the tape, I can watch it. Old women and old men walk through the cemetery with somber expressions. Their clothes and outfits are identical matches to several of the outfits worn by the young women and men in this same place the night before. All these old hats and colorful slacks... utility over fashion... fashion over utility... utility over fashion... MOM Oh good. I just thought it would be something nice to share. She's soooo  lovely . I feel connected to her. Is that silly? SAM No, mom. Sam watches the seniors go about their business delivering flowers to distant graves. MOM Well I won't keep you. I know how busy you are. But I love you. SAM I love you too. MOM Bye. SAM Bye.  79.  CONTINUED: 61   61  (CONTINUED) Sam hangs up the phone. He lifts his head and looks at the tombstone before him... Janet Gaynor 1906-1984 Sam sees an empty beer bottle sitting atop the gravestone. He stares at it, shaking his head. Sam pulls himself up, grabs the bottle and throws it angrily into the far-off trees. Wait for it... A tiny and soft sound - the crush of glass in the distance. EXT. LOS FELIZ BOULEVARD - MORNING 62   62  Sam passes by the Contact Lens Billboard. He stares up at the beautiful Indian woman with sparkling eyes. She watches over the road and smiles.  I Can See Clearly Now  INT. SAM'S APARTMENT - DAY 63   63  Warping sounds and scrambled music surround us... Sam sits on the floor, listening. A bag of Trader Joe's frozen veggies on his head. An old hardcover version of \"The Code- Breakers\" sits nearby. The turntable plays the Jesus and the Brides of Dracula 45 record backwards. Strange sounds emanate from the speakers. Demonic? Certainly odd. No words or messages. Sam listens. ",
      "dialogue_count": 0,
      "word_count": 4192
    },
    {
      "scene_number": 9,
      "slugline": "INT. TUNNEL - NIGHT 81   81  Sam follows the chiseled path. The stone walls open up a bit - continuing to descend. INT. TUNNELS - NIGHT 82   82  Sam turns a corner and sees a long expanse of branching tunnels. Each dropping lower into darkness. Sam chooses one and walks deeper. He begins to reach additional pathways and optional turns. It resembles a maze. Looking to his sides, Sam sees long expanses of square-cut tunnels sweeping into the earth. Concrete corridors similar to those found at a sports stadium. He turns a corner... and then another... All sense of direction is lost. Earthen walls and sloping floors. Finally... Sam sees a large stone doorway ahead. INT. LARGE TUNNEL ROOM - NIGHT 83   83  Entering the enormous room, Sam is surrounded by roughly painted dry wall, exposed rebar, construction markings, and nail-filled wooden beams. In the center of the room is a long dining table with no chairs. It's covered in the dust of concrete. Thick wooden crates line the inner wall. They are labeled as such... Food. Water. Batteries. Towels. Liquor. Walking further into the giant space, Sam passes a roughed-out kitchen area with a massive refrigerator. A generator is visible behind an unfinished wall. Inside the bathroom is a tub with gold fixtures, a shower and a dead-end pipe - plumbing for an eventual toilet. Stepping into a third concrete-walled room, Sam sees a spray- painted mark on the floor, designating the location for a bed. A giant recess in the wall suggests the inclusion of some large format television.  96.  (CONTINUED)",
      "characters": [
        "ALLEN",
        "SONGWRITER"
      ],
      "action_text": "Sam looks around at the odd living quarters... SAM It's a fuckin' bomb shelter. INT. TUNNELS - NIGHT 84   84  Sam follows a long corridor upwards. Each tired step brings him closer to some sort of imagined surface. Higher and higher he walks through the stone tunnels. His face is weary. INT. TIGHT CRAWL SPACE - NIGHT 85   85  Sam inches his way through a dark shaft. His arms are pinned close to the narrow side walls. Sharp-cut stone rubs against his shoulders. A tiny speck of light is visible ahead. He hears music. Muzak? INT. GELSON'S DAIRY COOLER - MORNING 86   86  Sam's hand rises up from between the metal floor grates. Milk cartons and frosted dairy racks litter the chilled cooler. Sam lifts the grate up and sets it aside on the tile. He climbs out of the tight crawl-space and looks around. It's a supermarket. Fucking Gelson's. Sam laughs to himself. Muzak plays from the store speakers: a softened, instrumental version of Jesus and the Bride's of Dracula's hit single. Sam puts the floor grate back in place, and snatches a bottle of milk. Exhausted and thirsty, he takes a big drink. INT. GELSON'S SUPERMARKET - MORNING 87   87  Sam wipes off his milk mustache as he stumbles through a bright aisle of food - milk bottle in hand. EXT. COMIC MAN'S STREET - MORNING 88   88  Sam sees a police car parked in Comic Man's driveway. He stares at it, while approaching the front porch. A COP steps out of the backyard, waving Sam away from the house. COP Hey... um... you can't go in there.  97.  CONTINUED: 83   83  (CONTINUED) SAM What's going on? COP Are you a friend or family? SAM I just know the guy... not very well... COP The neighbor found him. He committed suicide. SAM Oh my God. He didn't seem suicidal. The cop debates answering.... COP Ahhhh... I've been in the man's house for two hours. There was something wrong with him. Sam nods. What else can he say? EXT. COMIC MAN'S STREET - MORNING 89   89  Further down the street, Sam hides behind some bushes - spying on the poli",
      "dialogue_count": 2,
      "word_count": 3893
    },
    {
      "scene_number": 10,
      "slugline": "EXT. RANCHO LOS FELIZ APARTMENTS - NIGHT 104   104  The gas lamps that line the garden walkway offer dim pools of orange light. Sam walks slowly through the apartment complex's twisting paths. The trickle of running water through the stream follows his footsteps. Sam sips an iced latte, carrying an LA Weekly under his arm. Jesus and the Brides of Dracula pose on the cover. The partially obscured headline reads: JESUS PREDICTS... BAD TIMES AHEAD A DIRTY HUMAN FACE peers out from within a bush - disturbingly low to the ground like a cat or possum. Eyes watch Sam as he passes - he doesn't notice. Leaves and branches rattle above. A squirrel falls from the tree in front of Sam. It hits the concrete, and partially splatters on the ground. The squirrel tries to move but it's mortally injured. Sam stares in horror at the small animal. Is it trying to say something? Sam backs away from it and rushes down the path. He turns a corner. Before him stands a shadowy figure in the center of the garden walkway. Stepping closer, Sam sees more clearly. It is a two-dimensional black cardboard figure of a man stabbing a cardboard dog. Sam approaches the cut-out stand and tips it over with his finger. It lands on the ground with a soft tap - like a leaf coming to rest on the forest floor. Glass shatters! INT. SAM'S BEDROOM - NIGHT 105   105  Sam lifts his head from the damp pillow. Rain pours against the bedroom window. Thunder rumbles - long and steady. A cascade of lightning illuminates the messy bedroom - the Playboys on the floor. Issue July 1970.  113.  (CONTINUED)",
      "characters": [
        "MILLICENT"
      ],
      "action_text": "Sam hears glass breaking. INT. SAM'S APARTMENT - NIGHT 106   106  Sam steps into the living room with pistol in hand. He sees a hole in the glass of the sliding door... it's now half open. The storm breeze moves across the blinds, blowing his paperwork across the carpet. The pages of \"Code Breakers\" and \"Spider Man\" flip wildly. He moves closer to the patio. A careful step. Then another. Behind Sam, a small cabinet door opens quietly. Long bare legs fold out from within - like the appendages of an insect - bare flesh stretches. Now fully emerged from the tight space, the OWL'S KISS stands behind Sam with a kitchen knife in her hand. Sam turns and sees the naked woman in her owl-skin mask. He jumps back as she silently sprints down the hall into his bedroom. The door closes. Sam stares in shock at the closed bedroom door. INT. SAM'S BEDROOM - NIGHT 107   107  Sam enters the room carefully, peeking inside with the gun. He turns on the bedroom light. She's not here. Sam checks under the bed... in the closet... nothing. Lightning flashes. A coyote HOWLS in the distance. Tense. Sam opens his dresser drawer. The gun angled down toward his socks and underwear. Knock! Knock! Knock! Sam turns toward the sound... INT. SAM'S APARTMENT - NIGHT 108   108  Knock! Knock! Knock! Knock! Sam looks through the peep hole and sees a Los Angeles Sheriff on the other side. SAM (whispers to himself) Fuck.  114.  CONTINUED: 105   105  (CONTINUED) He holds his dizzy head as the air leaves his lungs in exodus. Sam tries to breathe as he opens the door. Resigned to whatever happens. His shoulders slump. In the hallway, alongside the SHERIFF, stands the greasy haired apartment Manager. His face is puckered and sour. SAM Hello. SHERIFF Hi, I'm here to inform you that you have to evacuate the premises immediately. SAM Oh... This is about my   rent?  Sam seems relieved for a moment. It could be worse. SHERIFF Yes. You haven't paid. It's... MANAGER  Criminally overdue.  Sam takes a step closer to t",
      "dialogue_count": 1,
      "word_count": 3584
    },
    {
      "scene_number": 11,
      "slugline": "EXT. MOUNT HOLLYWOOD FOREST - DAY 120   120  Sam hikes through the woods, trudging up the hillside. EXT. MOUNT HOLLYWOOD FOREST - DAY 121   121  Sam reaches the tall wooden fence. He notices several painted marks along the wall. /// Three parallel lines - diagonal from the top to the bottom of the wall. What does that mean? Sam opens his wallet and pulls out a piece of scrap paper filled with handwritten translations of Hobo Code. It's the paper \"key\" created by Comic Man. Sam runs his finger over the symbols, stopping alongside the three parallel lines. The hobo translations is: this is not a safe place EXT. MOUNT HOLLYWOOD FOREST - DAY 122   122  Reaching a clearing, Sam steps through the trees and looks ahead. He sees a single straw hut in the middle of an overgrown field. A few Alberto Giacometti human-figure sculptures stand like scarecrows within the grass. An eerie expression of the emaciated human form. Tall or short... all with appendages like twigs. Sam walks toward the straw hut, checking the gun tucked into his waist band. He hears water splashing from inside. Delicately. INT. STRAW HUT - DAY 123   123  Arriving at the doorway of the hut, Sam looks inside. He see a fifty-nine-year-old man in a white gown, crouched on the floor. This man, the FINAL MAN, is washing the feet of three young women in white rags. Sam recognizes their faces as they look up from their seated positions along the wood floor.  130.  (CONTINUED)",
      "characters": [
        "SARAH"
      ],
      "action_text": "It's Troy, Fannie, and Mae. The girls in the White Rabbit. SAM Hello? The Final Man turns and faces Sam. He remains sitting Indian- style in the center of the straw hut. The three beautiful young women sitting in a row along the wall. FINAL MAN Hello. Silence. Sam waits for something to happen. FINAL MAN Can I help you? SAM Um... yeah. The girls cock their inquisitive heads as Sam clears his throat. SAM My friend Sarah was killed. These girls know something about it. FINAL MAN Why do you assume that? SAM I saw   her   taking things from Sarah's apartment. Sam points at Troy. She smiles as his finger singles her out. SAM I found a code in their friend's song.  I've been in the tunnels.  FINAL MAN  Alright.  The Final Man calmly pours several cups of tea into tiny porcelain containers. He passes them out to the girls - taking one for himself. FINAL MAN Please sit down. Drink with us. Sam sits against the wall, staring at the man and his triad harem.  131.  CONTINUED: 123   123  (CONTINUED) SAM I found a bunker down there. Some kind of shelter in case of a nuclear war. TROY It's not a shelter. SAM What is it then? The Final Man places a small cup of tea on the floor in front of Sam. FINAL MAN A tomb. SAM What? Mae's face brightens with excitement. She looks to the Final Man. MAE Was it ours? The Man pats Mae on the leg - a comforting \"I'll be with you in a moment\" gesture. FINAL MAN They're tombs. For kings... like me. Like Jefferson Sevence. The girls begin to drink their tea. SAM Why would Jefferson Sevence need a tomb underneath the city? The Final Man glances over at his Ascension Brides. He makes a face to them - suggesting that Sam doesn't \"get it\". Troy grins back in adoration. SAM A cemetery isn't good enough? Sam glares at them all - growing more irritated with their smug and holy demeanor. FINAL MAN It's not about burial. It's about  ascension . We're not   dying , we're being transported to another world. Somewhere better than this.  132.  CONTINUED: (2) 123",
      "dialogue_count": 1,
      "word_count": 4213
    }
  ]
}