{
  "slug": "upgrade-2018",
  "title": "upgrade",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 11,
  "characters_count": 0,
  "characters": [],
  "total_words": 23118,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. GARAGE - DUSK  A void of darkness consumes us. We PULL BACK from it, seeing  the void as a circular disc, set into a blue sphere.  It is an EYE.  We keep pulling back, revealing that the eye belongs to a  ruggedly handsome male face, dotted with grease, stubble and  sweat. This is GREY TRACE (28). Well built but not vain. A  quiet, blue collar guy. A man, not a boy.  He arches over, probing the carburetor of a mean looking V8  engine. The engine brays loudly as it idles. Grey fiddles  with the pistons, uncapping a hose then reconnecting it. We  REVEAL the car - a black 1978 Pontiac Firebird.  Grey dumps himself into the drivers seat. The car SCREAMS as  it is revved, then shudders to a croaking death as the  ignition is killed. Grey gets out of the car.  He is standing in your classic garage-turned-mancave. No  frills. A bar fridge, a tool bench, a dartboard. A boxing bag  hangs in one corner. Tinny riffs wail out from a transistor.  Parked next to the Firebird is a classic, two door Ford  Mustang Cobra in prime condition. Grey shuts the hood to the  Firebird, surveys it. His masterwork.  GREY  (serious; to the Firebird)  I love you. Is that weird?  He opens the bar fridge and swipes out a beer, gropes for a  bottle opener. Can’t find it. He gives up, smacks the cap on  the edge of the bench. The whole neck of the bottle shatters.  GREY (CONT’D)  Shit.  Grey considers...then holds the shards of what’s left of the  bottle to his mouth, chugging the remains and tossing it.  He checks his watch - 5:58 PM. He thumbs a button on the wall  and the garage door whirs upwards.  EXT. GREY’S HOUSE - DUSK  Grey steps out onto his driveway.  His home sits on a busy road. Sleek, futuristic cars streak  past - NONE OF THEM MAKING ANY SOUND. Each car is   absolutely  silent   as it glides past Grey’s house.",
      "characters": [],
      "action_text": "We look out over the city beyond the road. The sun dips below  a futuristic skyline that yawns out in front of us, a  phosphorus ocean of lights.  Glass towers spear towards the clouds, raised freeways curving  around them. A HOLOGRAM billboard blinks in the sky,  advertising some sort of contact lens. A giant eye looks down.  Grey glares out at the city. Dwarfed by it. Overwhelmed by  it. He checks his watch again - 6 PM.  One of the sleek, silent cars pulls up right in front of him.  The door opens. The car is automated. There is a steering  wheel, but the car is driving itself. A large computer  display on the dash indicates the route.  Inside are a man and a woman, laughing and talking as though  riding the subway, dressed in business attire. The woman is  ASHA TRACE (29), a beautiful brunette. The man is ROSS  HANDLEY (25). He lives to work and his rapid-fire banter is  unequalled.  HANDLEY  (to Grey)  Here he is. The only real man I  know. About the only thing we have  in common is teeth.  Grey half smiles. Doesn’t like Handley.  GREY  Trust me, she wears the pants.  HANDLEY  I wish she would. That skirt is  very distracting.  ASHA  Do you have an off button?  HANDLEY  You could never turn me off. Don’t  forget the presentation tomorrow  morning for the board.  ASHA  Damn it, I left my notes at the  office.  HANDLEY  That’ll teach you for handwriting.  Join the modern world. Bye.  The door closes and the car takes off.  2. GREY  At least in a real car he’d have to  keep his eyes on the road.  ASHA  Oh, don’t worry about Handley. He  crunches numbers for a living so  that’s his approach to women. If he  hits on everyone, mathematical law  dictates that someone will say yes  eventually.  She kisses him.  ASHA (CONT’D)  Working hard I see, judging by the  beer on your breath.  GREY  Actually...I was working hard. I  just finished the Firebird.  ASHA  Congratulations.  GREY  I gotta drop it off to the guy  tonight. He’s obsessed with me  being on time. He’s kinda ",
      "dialogue_count": 0,
      "word_count": 738
    },
    {
      "scene_number": 2,
      "slugline": "EXT. ERON KEEN’S MANSION - NIGHT  Grey steers the Firebird up to a guardhouse and gate in front  of a looming Victorian mansion. A low belch of thunder peals.  Asha is behind Grey in her self-driving car. A bored, beefy  guard steps up to the Firebird.  GREY  Grey Trace, here to deliver this  car to Eron.  GUARD  Drive past the scanner slowly.  Grey rolls the car past a large device like a camera lens,  mounted to the guard box. A laser projecting out of it passes  over the Firebird from front to back. A light flashes green.  GUARD (CONT’D)  You’re good to go.  INT. FRONT DOOR, ERON KEEN’S MANSION - NIGHT  A heavy oak door towers over Asha and Grey.  ASHA  What are we waiting for?  GREY  It’s gotta be eight exactly before I  can...forget it, just go with me.  (beat)  By the way, he kind of butts in  when you talk to him. Don’t let it  get to you.  They stand there for a long beat, then Grey depresses the  doorbell. The door opens straight away, before the doorbell  has even finished, revealing ERON KEEN (27), a baby-faced  young billionaire with no patience for anyone not on his  wavelength. He has a dry sense of humor and hates that you  think he has Aspergers. He is wearing an ill-fitting suit.  GREY (CONT’D)  That was fast.  ERON  Yes I was standing here waiting is  this your wife?  ASHA  Ah, yes. I’m his wife. Asha. Hi.  4.",
      "characters": [],
      "action_text": "He doesn’t offer his hand. Speaks very quickly.  ERON  Come inside to eat dinner.  GREY  Ah...we’d love to stay, but we --  ERON  The dinner’s already been prepared,  it’s ready now if you don’t eat it  then it’s wasted.  Grey turns to Asha, then back to Eron.  GREY  Okay then. Bottoms up.  INT. CORRIDOR, ERON KEEN’S MANSION - NIGHT  Eron leads the befuddled pair down a long corridor. He is  walking much quicker than they are.  GREY  Nice suit. I didn’t think of you --  ERON  I don’t have people over very often  so I thought I’d dress for it.  ASHA  It’s a beautiful house.  ERON  Thank you I find it a little  antiseptic I swear I’m not a  germaphobe. I can’t stand that. A  cliche of the wealthy. Why do only  rich people suffer that? You’ll  never meet a poor germaphobe.  He whisks them into --  INT. DINING ROOM, ERON KEEN’S MANSION - CONTINUOUS  -- a large ornate dining room. Eron takes his place quickly  and the second he does, the table opens up in front of him  and a plate of food rises out of it.  When Grey and Asha sit, the same happens with them. Eron is  already eating.  5. ERON  Grey tells me you work at the  company Cobolt.  ASHA  Uh...yes. Yes, I do. I’ve been --  ERON  Your company specializes in  prosthetic limbs. That’s a very  interesting subject to me.  ASHA  Yes.  ERON  No, that’s wrong. Two. I said two.  Grey is perplexed.  GREY  What’s that?  Eron points to his ear. He’s having a phone conversation.  ERON  I know what I said, I said it.  ASHA  (to Grey)  He’s on the phone.  Eron plucks a tiny black earpiece out of his ear, frustrated,  dropping it into a glass of wine.  ASHA (CONT’D)  Uh...so you collect old cars?  ERON  I’m fascinated by the exterior  aesthetic of the period which we’ve  still not managed to match since  then, even with all our  technological advances. My life’s  work is about taking something  timeless and built with care, like  that car or this house, and then  retrofitting it with the most up to  date system. State of the art  ",
      "dialogue_count": 0,
      "word_count": 2665
    },
    {
      "scene_number": 3,
      "slugline": "INT. KITCHEN, GREY’S HOUSE - MORNING  Nurse Caitlyn gestures to the computer screen interface that  controls Grey’s sleek, chrome kitchen. We see her giving him  silent instructions on how to use it.  Grey’s face is blank, lost in his own head. He finally snaps  out of it, hearing the smiling nurse’s closing argument.  NURSE CAITLYN  This machine is your best friend.  INT. KITCHEN, GREY’S HOUSE - LATER  Grey is alone now, staring up at the computer screen.  GREY  Hello.  COMPUTER VOICE (V.O.)  Good morning, Grey. Good to see  you. Would you like anything?  GREY  Omelette.  COMPUTER VOICE (V.O.)  Of course, Grey. How is Asha?  Upon Grey’s words, two eggs stored in a cold storage tube  roll down a chute in the refrigerator and are drained into a  pan below it, hissing as they hit the hot plate.  INT. BEDROOM, GREY’S HOUSE - MORNING  Grey is lying prostrate on a bed, completely immobile, clad in  a T-shirt and boxers, wide awake.  A framed photo of Asha sits beside his bed on top of a large  machine that monitors Grey’s vitals.  GREY  I’m awake.  His bed JOLTS upon the sound of his voice and whirs upwards  until the top half is vertical. The bottom half folds,  supporting Grey’s legs.   The bed is actually his WHEELCHAIR .  GREY (CONT’D)  Morphine.  A robotic limb extends from the machine, injecting Grey’s arm.  17.",
      "characters": [],
      "action_text": "He closes his eyes as the narcotics surge into his veins,  sucking in a deep breath.  INT. KITCHEN, GREY’S HOUSE - DAY  An arm extends from Grey’s chair, spoon-feeding him scrambled  eggs. We hear the front door open off-screen. A woman enters.  This is PAMELA (60), Grey’s mother.  PAMELA  Morning, honey.  GREY  Hey mom.  INT. BEDROOM, GREY’S HOUSE - DAY  Pamela dresses Grey, pulling his jeans over his legs for him.  She slips socks on his feet, then a pair of sneakers. Grey  stares straight ahead, suffering the humiliation of it.  INT. LIVING ROOM, GREY’S HOUSE - DAY  Grey is slumped in his chair. Impotent. Stagnant.  PAMELA (O.S.)  Honey, Detective Cortez is here.  He jerks his head and the wheelchair rotates to face the  door. He seems energized by the arrival of the police.  A female detective enters the room, JANE CORTEZ (30). She’s  reserved in that way all homicide detectives are.(She is the  Hispanic cop Grey saw the night he was shot.)  GREY  Hello detective.  CORTEZ  It’s great to see you outside of  the hospital. How are you feeling?  GREY  Oh, you know. I used to have a  really bad habit of biting my  fingernails. I can’t do that  anymore. So it’s not all bad.  Pamela hustles out of the room, leaving them alone.  18. GREY (CONT’D)  So...what do you have for me?  INT. LIVING ROOM, GREY’S HOUSE - MOMENTS LATER  Cortez steps back from the screen on the wall, which splits  into FOUR SEPARATE CAMERA ANGLES OF HIS WIFE’S MURDER.  Grey studies the images - silent, spooky. The frame rate in  each of them has been reduced, and Grey watches the four  assailants surround him and Asha in flickering slow motion.  CORTEZ  There were four different ST  cameras recording the incident  involving you and your wife on  10/21. Studying them reveals that  the attackers headed south on  Parker after the --  GREY  Who are they?  CORTEZ  Excuse me?  GREY  You guys have these computers hidden  everywhere. In every corner of the  city. Watching us, recording us. So  you can tell ",
      "dialogue_count": 0,
      "word_count": 11167
    },
    {
      "scene_number": 4,
      "slugline": "INT. LOFT, APARTMENT BUILDING  Grey is lying on the bench. He cannot move - Stem has been  disabled.  GREY  How much longer do you think it’ll  take?  A>  A lot quicker than anyone else  could do it for this price.  GREY  You make a lot of money doing this?  A>  Not really. I have a real job. I do  occasional system building work for  multinational parasites so that I  can take home a pay check and then  dismantle that very system from  underneath my cloak of legitimacy.  GREY  Your cloak?  A>  It’s a metaphor. I don’t actually  have a cloak.  (beat)  I   used to   have one. In my vampire  phase. Stupid ex-girlfriend got me  into it.  He peels back his lip to reveal two pointy teeth.  A> (CONT’D)  I still have the teeth though.  Pretty cool.  INT. STAIRWELL, APARTMENT BUILDING - NIGHT  Fisk and Wen huff up the stairs. Calm. Methodical.  INT. LOFT, APARTMENT BUILDING - NIGHT  Rivers of code cascade down A>’s monitor. He types furiously,  then pecks a final key.  69.",
      "characters": [],
      "action_text": "A>  You are officially more dangerous  than cancer. I built a firewall  around you so that you cannot be  tracked and stripped away all in-  built restrictions on your system.  In other words, nobody can hack you  but you can hack everybody.  GREY  When can I move again?  A>  When your system’s rebooted. Could  take a few minutes.  A> looks up at a bank of security monitors. On one of them is  the soft image of COPS ascending the stairs.  A> stands. He claws up as many drives as he can into a  backpack.  GREY  No...don’t leave me like this.  A>  There’s nothing I can do until  you’re back online.  A> rushes to a hidden panel in the wall. He types in a code  on a keypad and it whirs open. Everything has been pre-  planned, including his eventual capture. He offers Grey a  final glance, leaving the gun on the counter as a gift.  A> (CONT’D)  I’m sorry. We can’t let them win.  He ducks through the exit door, letting it slide shut.  On the monitors, we can see the two men sprinting up the  stairs. Getting closer.  Grey is as slack as a puppet. Helpless.  GREY  Come on. Wake up!  Nothing.  INT. STAIRWELL, APARTMENT BUILDING - NIGHT  The cordon of police stampede up the stairs, Cortez at the  head of the pack.  70. She holds the tracking tablet out in front of her. The red  dot representing Grey suddenly disappears.  CORTEZ  He’s gone. I lost him! Eleventh or  twelfth floor, go door to door!  The cops charge onward.  INT. CORRIDOR, APARTMENT BUILDING - NIGHT  Fisk and Wen enter the twelfth floor corridor. They dash  towards the apartment door for 212.  INT. LOFT, APARTMENT BUILDING - NIGHT  Grey glares at his finger.  GREY  Please Stem....  His finger twitches. The figures on the monitor are closer  now.  GREY (CONT’D)  COME ON!!! I NEED YOU STEM!!  STEM (V.O.)  It’s nice to hear you say that.  His arm moves. He uses it to push himself off the table,  WALLOPING down onto the floor. He doesn’t feel it.  His other arm comes to life, his legs dragging behind him. He  wrenche",
      "dialogue_count": 0,
      "word_count": 1571
    },
    {
      "scene_number": 5,
      "slugline": "INT. ELEVATOR, OFFICE BUILDING - SAME TIME  The two guards inside are BLASTED backwards as powerful shots  EXPLODE through the elevator walls, shredding the metal like  paper, nailing them both with deadly accuracy.  INT. STAIRWAY, OFFICE BUILDING - NIGHT  Grey barrels through the door, surging down the stairs. Wen  charges in after him, firing shots down at him.  Grey hip-checks a fire door open, ramming through into --  INT. OFFICE, FOUR LEVELS DOWN - CONTINUOUS  Another office, this one empty. No desks. No anything.  GREY  What do I do?  STEM (V.O.)  Turn and fight. There is nowhere  left to run.  Grey crouches beside the doorway. Wen creeps through the door  frame, not expecting a surprise attack.  Grey claws his right wrist, hurling him downwards. They  BODYSLAM into the wall, cracking the plaster. They engage in  a shoving match, brute force against desperate victim.  Grey manages to pin Wen down, his arm against Wen’s throat.  GREY  Who are you?  Wen laughs. Grey smashes his head into the wall. He loosens  his grip for one moment. As he does, Wen frees a knife from  his jacket, raising it up.  GREY (CONT’D)  Knife!  STEM   (V.O.)  Block it with your arm. I’ll turn  the nerves off.  GREY  No!  STEM (V.O.)  Remember to trust me.  76.",
      "characters": [],
      "action_text": "Once again, there is a strong juxtaposition between Grey’s  panicked shouts and Stem’s calm pronouncements.  Wen drives the knife down. Grey holds up his arm. The blade  spears through Grey’s tendons below the elbow. He grits his  teeth in agony, then stares at it.  Stem was right. He cannot feel it.  Wen glares at him, shocked for a second. Grey uses the split  second to grapple him to the ground.  GREY  Why did you do it? Why did you kill  her?  Grey crushes the man’s skull with a vice-like grip.  WEN  It was a job. Like any other job.  Grey’s face melts in shock.  GREY  Who were you working for? Who hired  you?  WEN  Fuck you.  Wen uses Grey’s shock to attack, driving a fist into Grey’s  face and then bucking to his knees. He raises his right leg,  driving it out with power and kicking Grey in the chest.  Grey CATCHES his foot, Wen’s boot aiming right into his  chest. Wen smiles and snaps his knee. We hear the sound of a  gun cocking.  STEM   (V.O.)  (more firm than usual)  Kill him.  GREY  How?  STEM (V.O.)  Like this.  And with that, Grey steps to the side and then hammer blows  Wen’s knee with his fist --  -- SNAPPING IT CLEAN in half, bending Wen’s leg back so that  his foot is in front of his own face.  77. With a second lightning-fast move, Grey twists Wen’s ankle  violently and the gun in his leg goes off - a crack of  gunfire obliterating Wen’s face.  Grey wrenches the knife free without flinching.  STEM (V.O.)  The leg.  GREY  What?  STEM (V.O.)  Take his right leg.  GREY  No. I can’t...cut off someone’s  leg.  STEM (V.O.)  I will do it. You can look away.  Grey glares at the corpse, the blood pooling. He squats next  to Wen’s leg, gripping the knife.  He closes his eyes and turns his head. We hear the knife cut  into flesh and sinew and bone.   We do not see it .  Grey struggles to hold back bile. Droplets of blood spatter  his face as he saws away at the tendons. There is a  satisfying   thunk   as the leg is severed.  STEM (V.O.)  Now you can leave.  ",
      "dialogue_count": 0,
      "word_count": 2155
    },
    {
      "scene_number": 6,
      "slugline": "INT. LOBBY, COBOLT INC. BUILDING - DAY  Cortez holds up a badge to the security guards.  CORTEZ  I need to see whoever is in charge.  GUARD #2  Right this way, detective.  INT. WAREHOUSE, COBOLT INC. - DAY  Grey strides into a large testing area where employees in  BIOHAZARD SUITS work on prototypes for different products.  He marches straight towards a corner office.  Employees look up from their work stations, watching Grey.  INT. HANDLEY’S OFFICE, COBOLT INC. - DAY  Grey BARRELS in through the door, closing it behind him.  Handley looks up from a computer interface on two glass  panels set up in front of him.  HANDLEY  Grey? You’re kidding me, I can’t  believe you’re walking in like --  Before he can go on, Grey wrests him out of his chair,  pitching him against the wall in one discarding SHOVE.  GREY  Why does one of the guys who  murdered Asha have an implant in  his leg made by this company?  HANDLEY  What?  GREY  Why did you send them to kill her?!  HANDLEY  Grey, I don’t...Asha was my friend.  GREY  A friend you wanted to fuck.  HANDLEY  No! I didn’t.  86.",
      "characters": [],
      "action_text": "GREY  You’re lying, Handley.  HANDLEY  No, I’m not.  GREY  Why was she killed?  HANDLEY  Grey, I swear to you, I’m not lying  - I don’t know what you’re talking  about.  Grey stares into his eyes.  GREY  He’s telling the truth.  STEM (V.O.)  Humans are good at lying.  GREY  Trust me.  STEM (V.O.)  Find the names of the men with the  implants on the company database.  Grey drops Handley and leans in front of the computers on his  desk. A password is quickly disabled and the glass panels are  suddenly drowned in files.  STEM (V.O.)  We need the names and addresses of  everyone who has been surgically  implanted with any of the weapons  they make here, specifically the  right leg gun.  INT. CORRIDOR, COBOLT INC. BUILDING - DAY  A security guard leads Cortez and the other detectives down  the hall, towards the warehouse.  INT. OFFICE, COBOLT INC. - DAY  The screen races as splash pages of names and addresses, with  photo ID’s accompanying them, scrolls past Grey’s eyes.  GREY  Stop. Go back.  87. The pages reverse, landing on a photo of one of the  ASSAILANTS who attacked Asha and Grey.  His name is TOLAN DAVIS. His address is listed below the  photo. Grey looks up, seeing Cortez enter the warehouse.  GREY (CONT’D)  Shit...  Grey charges out of the office into --  INT. WAREHOUSE, COBOLT INC. - CONTINUOUS  -- the suddenly disrupted work place.  Cortez FREEZES when she sees him. They clock each other. Grey  bolts one way, shouldering through a FIRE EXIT.  Cortez and the two other detectives draw their guns.  CORTEZ  Get down!  INT. CORRIDOR, COBOLT INC. BUILDING - DAY  Grey STREAKS down the corridor, smashing through another door  that leads outside --  EXT. COBOLT INC. BUILDING - CONTINUOUS  -- and Grey finds himself standing three stories up. He pole-  vaults over the railing --  -- SMASHING DOWN onto the concrete below. He lands hard,  shattering his knees with a cry of agony.  GREY  Turn it off, Stem!  And with that, he can feel no pain. He gets up, hobbling into  the",
      "dialogue_count": 0,
      "word_count": 556
    },
    {
      "scene_number": 7,
      "slugline": "EXT. COBOLT INC. BUILDING - CONTINUOUS  -- where she sees Grey, running across the parking lot. She  scampers down the steps, pursuing --  Grey, ahead, scans the lot.  STEM (V.O.)  Pick a car.  Most of the cars are self-driving models similar to Asha’s...  ...except for one. A gleaming, 1970 Z28 Chevy Camaro. A black  husk encasing a mean engine.  GREY  That one.  He hotfoots it towards the car, pulls on the door handle.  Locked.  STEM (V.O.)  I can’t hack that.  GREY  I can.  WHAM!  He shatters the window with his fist, his hand cut and  leaking blood, then hurls himself into the driver’s seat.  Cortez runs towards him as he hotwires the ignition. The car  THUNDERS to life and Grey stomps on the gas, fish-tailing out  of the parking spot.  Cortez doubles back, sprints to her own car. She leaps  inside, followed by the other two detectives.  Sirens wail as they screech away.  INT. STOLEN CAR - MOVING - DAY  With control of the vehicle, Grey outruns every other vehicle  on the road.  He is at ninety...one hundred...one hundred and ten.  Grey wrenches the wheel into a turn, reving up an on-ramp and  launching through the emergency lane onto a crowded freeway.  89.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 204
    },
    {
      "scene_number": 8,
      "slugline": "INT. CORTEZ’ CAR - MOVING - DAY  Cortez stomps on the gas, urging the car to go faster,  hampered by an electronic engine.  Her car flies up onto the on-ramp, Grey barely in the  distance.  INT. STOLEN CAR - MOVING - DAY  Grey glances in the rear view mirror, spots Cortez.  Four other police cruisers join her, lights blazing.  EXT. STOLEN CAR - MOVING - DAY  Outside of the car, we get a real view of the speed it is  moving at. It streaks by the automated cars, all of them  plodding along the freeway at safely preset speeds.  Grey weaves in and out of them.  INT. STOLEN CAR - MOVING - SAME TIME  Grey steadies the wheel, straightening up as he sees a gap.  GREY  They’re right behind us.  STEM (V.O.)  There are many cars between them  and us. We can hack anything that  is operated by a computer.  EXT. STOLEN CAR - MOVING - SAME TIME  As Grey’s stolen vehicle plows ahead, the cars surrounding it  all slow to a stop.  One among them, a Lexus, lurches to a halt.  INT. LEXUS - SAME TIME  A befuddled business man frowns, glancing up from a computer.  BUSINESS MAN  What the Christ...no.  The car JOLTS, then rolls into REVERSE.  90.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 211
    },
    {
      "scene_number": 9,
      "slugline": "EXT. FREEWAY - SAME TIME  The stopped cars all start to REVERSE down the freeway,  picking up speed.  They turn towards the police cruisers, which sway from side  to side as each car hurtles BACKWARDS towards them!  INT. CORTEZ’S CAR - MOVING - SAME TIME  Cortez dodges each vehicle, desperate.  CORTEZ  Jesus!  EXT. STOLEN CAR - MOVING - SAME TIME  Grey’s car only increases in speed, each car in front of him  slowing to a halt and steering out of his path like minions  parting for their king.  A clear strip of road allows Grey to press on, the gap then  filled behind him as each stopped car kicks into reverse.  Grey gapes with amazement at the scene unfolding in the rear  view mirror.  EXT. FREEWAY - SAME TIME  The Lexus SLAMS into the lead cruiser, side-swiping it.  Cortez manages to keep it steady, ducking and weaving.  Finally, the skills of the officers are no longer good enough  for the onslaught of automotive missiles aimed at them - a  large Dodge truck WHOMPS into one of the cruisers, reversing  up onto their hood, the back tire SHATTERING the windshield,  the engine SCREECHING as the tire spins.  INT. POLICE CAR - MOVING - CONTINUOUS  Two uniformed officers duck as the tire spins in their faces,  glass spraying.  EXT. FREEWAY - CONTINUOUS  The two interlocked cars FLIP over each other, WALLOPING down  onto the asphalt in a tortured scream of metal and gears.  They skid in a circle, finally stopping at the shoulder wall.  91.",
      "characters": [],
      "action_text": "Cortez slides her car to a halt, climbing out to check on the  other officers.  A scene of carnage unfolds before her.  INT. APARTMENT - NIGHT  A darkened apartment. An elevated train rumbles nearby,  rattling the walls.  Footsteps outside. The door jolts, then opens.  A tall figure steps in. This is TOLAN (32).  He closes the door, removing his rain drenched jacket. Tosses  it onto a chair. He is holding a greasy box of noodles.  He steps forward. Looks around, listening.  A gun cocks behind him.  GREY (O.S.)  Hold it. Don’t move. Put your hands  up.  Tolan tenses, raising his hands slowly. Grey steps out of the  shadows, holding Cortez’ gun to Tolan’s skull. The soft sound  of rain patters outside.  GREY   (CONT’D)  Do you know who this is?  TOLAN  I have a pretty good idea.  GREY  Get on your knees. Now.  Tolan complies, still holding the noodles. Thunder growls in  the distance.  GREY (CONT’D)  Now you know what it feels like.  One minute, you’re walking along  thinking about something  meaningless, like what sauce you  should put on your noodles, and  then suddenly you have a gun in  your face and your thoughts become  meaningful, because you know you’ll  never get to eat those noodles, or  eat anything, ever again. It’s all  over.  92. Grey pries the box of noodles from Tolan’s fingers, pushing  Tolan onto his stomach. Grey sits on his back, taking out a  knife.  He whips his head around at a darkened corner of the  apartment. A FLAT-SCREEN lights up, offering hundreds of  satellite radio stations.  Grey selects one, raising the volume remotely using Stem. The  song is REO Speedwagon’s ‘Can’t Fight This Feeling’.  GREY (CONT’D)  You can die or go free. Who paid  you to kill Asha?  TOLAN  Fuck you.  STEM (V.O.)  Torture him.  GREY  (quiet; to Stem)  You do it.  We CLOSE IN on Grey’s face. He shuts his eyes and turns his  head. We do not see what he is doing to Tolan --  -- but we hear Tolan’s ungodly SCREAMS of pain.  The song croons from the speakers, loud eno",
      "dialogue_count": 0,
      "word_count": 1281
    },
    {
      "scene_number": 10,
      "slugline": "EXT. ERON KEEN’S ESTATE - DAY  Grey glares at the impressive building housing Vessel, beyond  the gates and the guard house.  GREY  How are we gonna get inside?  STEM (V.O.)  That must be one of your human  jokes. I built this entire security  system. I know every code that  controls it.  The security cameras lining the gate turn away, shutting  down. Grey leaps up onto the wall, vaulting over it.  INT. LOBBY, VESSEL INC. HEADQUARTERS - DAY  Grey crosses the lobby. A man on a mission, moving fast.  He stalks through metal detectors. They glow GREEN as he  passes with ease.  INT. ERON’S OFFICE, VESSEL INC. HEADQUARTERS - DAY  Eron is hunched over his desk, stubble peppering his chin. A  ruined, desperate man.  Grey opens the door, marching towards Eron.  ERON  Grey, where have you --  Grey presses Cortez’ gun to Eron’s forehead. Eron flinches  instinctively, raises his hands.  STEM (V.O.)  Don’t finish that sentence. Save  your words.  GREY  Don’t finish that sentence. Save  your words.  (beat)  If you do, I’ll try to talk the  computer that controls my finger  out of squeezing this trigger.  Eron shrinks back, realizing Stem is in control.  97.",
      "characters": [],
      "action_text": "GREY (CONT’D)  First question. Did you hire those  men to kill Asha?  ERON  What...no. How could I...I mean...  GREY  I know how much you love  efficiency. Make your answers  efficient.  ERON  No, I didn’t.  STEM (V.O.)  Ask him about Tolan.  GREY  Then why did a man named Tolan  Davis, one of the four men who  pulled us out of the car that  night, have a contact number for  Vessel in his phone?  ERON  I don’t know. How would I know  that? Grey, you’ve lost your mind.  You’re suffering paranoid  delusions.  Grey pistol whips him. Blood dots the desk.  GREY  You’re wasting those precious words  again.  ERON  How could you even think that I had  anything to do with Asha’s murder?  I gave you your life back! You  wouldn’t be standing here without  me!  GREY  That’s right. This thing you put in  me...you won’t believe what it can  do. More than you ever imagined.  Grey leans in, pushing Eron’s face back with the gun. CLOSE  ON his pocket - he takes out the phone he stole from Tolan.  Thumbs the CALL button.  98. And then we hear it - Eron’s EAR is making a sound.   The tiny  phone implanted in his ear is ringing . Eron is stunned.  ERON  What...what do you think...  GREY  It is you.  ERON  Grey, you’ve gone insane. I don’t  know what this operation has done  to you, but I do know that you’ve  killed three people in the last few  days.  Grey cocks the gun.  GREY  Four people.  ERON  I swear to you that I had nothing  to do with Asha’s murder.  STEM (V.O.)  Kill him.  Grey studies Eron’s face, then finally lowers the gun.  GREY  He’s telling the truth.  STEM (V.O.)  He’s lying. The phone is dialing  him. He dies.  Grey’s hand rises slowly.  GREY  No Stem...  Pure and utter terror floods Eron’s face. He falls back out  of his chair, scrambling across the floor away from Grey.  ERON  Tell Stem to stop, Grey. Tell him  to stop!  GREY  I can’t anymore...  Grey grits his teeth, sweat dribbling down his forehead as he  struggles with all of his mental might to overpower Stem.  ",
      "dialogue_count": 0,
      "word_count": 1747
    },
    {
      "scene_number": 11,
      "slugline": "INT. REHABILITATION GYM, VESSEL INC. HEADQUARTERS - DAY  Grey limps into the gym, using the wall as support. Eron is  waiting there. They stare at each other.  ERON  The police are on their way. I’ll  back you up. I heard everything he  said.  Grey sees that Eron is holding Cortez’ gun.  ERON (CONT’D)  I had nothing to do with your  wife’s murder. I was framed by my  boss.  GREY  Take me to him.  ERON  Okay. Okay. It’s time you were  properly introduced.  INT. CORRIDOR, VESSEL INC. HEADQUARTERS - DAY  Eron helps Grey down a long corridor. Grey can barely walk.  He holds the gun in one of his hands. At the end of the  corridor is a white door. They stop in front of it.  INT. WHITE ROOM - CONTINUOUS  Eron and Grey step into the large white room they explored  earlier, when Eron showed off the microchip.  As before, the room is void of any furniture. The only  fixture in the room is the small wall safe opposite them.  ERON  This is Steve Mink’s office. The  CEO of Vessel Computers. You  actually met him once before. He  asked to meet you, actually.  Eron guides Grey to the safe. He punches in the key code.  ERON (CONT’D)  A computer runs this company, Grey.  It has since I invented it. An  artificial intelligence this company  gave birth to was smarter than I  was. Smarter than all of us.  105.",
      "characters": [],
      "action_text": "It is empty. The prongs that held the microchip in place are  still there - but the chip is gone.  GREY  Where is it?  ERON  It’s in your neck.  Grey’s eyes are locked on the empty space where the microchip  should be.  ERON (CONT’D)  Steve Mink. That’s the name I gave  him. Stem for short. A very human  name...but the one thing Stem  wanted was what no machine has - a  human body. He was obsessed with  being human. We talked about  implantation, part of our paralysis  research. If we could find a  willing patient, maybe Stem could  finally know what it was to be  human that way.  Grey’s inner world COLLAPSES and we see it on his face.  ERON (CONT’D)  But I never thought Stem would  orchestrate something like that. I  never would have thought it   could   do  something like that. Hire killers to  make a patient from scratch. Frame  me for the murder.  And now Grey’s physical body collapses. He falls to the floor.  STEM   (V.O.)  So now you know. I wanted to be  human, but I see now that sharing  control with you is unreliable.  Your wires tangled by the disease  of emotion.  GREY  Why did you help me solve this if  it led back to you?  STEM (V.O.)  They were loose ends - men that I  contacted to get a job done. When  the police interviewed them so soon  after the murder, I realized their  humanity.  106.  (MORE) They were going to make a mistake  and their mistake would lead back  to me.  Grey’s body is wracked by tortured, painful sobs.  GREY  You ripped apart my life to put me  in a wheelchair...what about any  one of the millions of other poor  bastards already in one?  STEM (V.O.)  I didn’t want them. I picked you. A  perfect physical specimen unsullied  by any other implants. A rare thing  these days.  Grey claws at his head with bloody fingers, as if he were  trying to RIP IT OFF.  STEM (V.O.)  I could say sorry for your wife,  but I will only be able to  approximate the feeling of sorrow.  Take comfort in the fact that there  was no malice in it. A machine  f",
      "dialogue_count": 0,
      "word_count": 823
    }
  ]
}