{
  "slug": "upload-101-welcome-to-upload-2020",
  "title": "upload 101 welcome to upload",
  "genre": "drama",
  "format": "series",
  "scenes_count": 3,
  "characters_count": 1,
  "characters": [
    "NATHAN"
  ],
  "total_words": 7114,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. FOYER - MOMENTS LATER Nevaeh is TWERKING happily to “OMG” by Arash as Nathan mimes riding her like a cowboy. DANCING MONTAGE:   Nathan holds Nevaeh’s hands and spins her around.   He glances in the mirror and fixes his hair.   Nevaeh slips out of his other hand and crashes into the wall. NEVAEH Uncle Nathan! NATHAN Sorry! They keep twirling.   Nevaeh is red in the face but loving it. Ingrid watches him dance with a smile, then checks her phone. She catches Nathan’s eye and makes a “let’s go” face. INT. AMAZON OFFICE AREA - BROOKLYN - DAY Nora walks past rows of desks, puts her coat on her chair, and touches her ear.   A little earbud blinks on and she hears Beyoncé’s “Crazy in Love.”   She waves at her terminal and her screen lights up. Across the room, Nora’s supervisor, LUCY, looks at a map of the workstations.   Next to “Nora Antony” is a headset icon. Lucy pokes it with her finger. LUCY No music! The music stops. NORA Cool!   Thanks so much, Lucy!   Merry Winterday! She turns to her screen covered with folders and opens one labelled “Rechna Futawarab.” Inside is an avatar of a MIDDLE- AGED INDIAN WOMAN next to a million video files and an alert: “rendering complete: activate?” Nora hits a key and a window opens with a jiggling brain wave and an upload circle that starts filling up. NORA (CONT’D) (into her headset) Hello, Rechna.  8.  (MORE)",
      "characters": [],
      "action_text": "I’m not expecting you to answer me yet, the system is sorting through a lot of information right now, but I’m gonna count to three, try to count with me. One... two... three. RECHNA (V.O.) (moaning) Oo-oh my God, where am I...? NORA (O.S.) It’s all good, Rechna.   Welcome to Heaven. INT. A BED SOMEWHERE - NIGHT - LATER Nathan and Ingrid finish making love, and she snuggles into him.   Passing lights and advertising flicker on the ceiling. REVEAL the bed is in Ingrid’s CAR. INGRID Think they liked me? NATHAN Sure.   You’re so fucking hot. INGRID What? NATHAN Sorry, what’d you say? INGRID Your family.   Your mom said I was the first girl you ever brought home for Thanksgiving. NATHAN No big deal. INGRID I think it is a big deal.   I feel very special, babe. NATHAN ... Cool.  HONK!! The car swerves, people outside curse, Nathan sits up. NATHAN (CONT’D) Whoa, do you have “prioritize occupant” on?  9.  NORA (CONT’D) INGRID Of course.   I care about us.   You don’t “prioritize pedestrian,” do you? He does.   Ingrid notices something outside. INGRID (CONT’D) Park! INT./EXT. INGRID’S CAR POD - CONTINUOUS Ingrid’s car pulls over across from a little bodega called “Whole Foods.”   (For some reason, that chain has shrunk in the future.)   Behind them, Nathan’s empty car pulls over too. INGRID Sleep over tonight? NATHAN Uh... INGRID (sexy) I’ll make it worth your while in the morning. NATHAN Okay. INGRID Good.   We need egg powder and a can of toast. EXT. INGRID’S CAR POD - CONTINUOUS Nathan enters the store.   Her pod takes off, his waits. INT. WHOLE FOODS - FREEZER AISLE - NIGHT Nathan pushes a cart down the freezer aisle. FREEZER (Australian accent) You lack iron.   Buy some spinach. INT. WHOLE FOODS - CHECK OUT - A LITTLE LATER A robot arm bags his groceries. Nathan pages through a tabloid on a screen.  10. CLOSE ON - TABLOID ARTICLE “Facebook/Panera Heaven Breaks First Weekend Attendance Records.”   Videos show a Morongo-style hotel, with crowds gambling, learning to sexy ",
      "dialogue_count": 0,
      "word_count": 714
    },
    {
      "scene_number": 2,
      "slugline": "INT. NORA’S WORKSTATION - BROOKLYN - DAY Nora sucks an iced coffee from Dunkin Donuts, and works on a new folder on her screen labelled “NATHAN BROWN.” She opens a video memory file to see...  Nathan’s POV: he happily dances with Nevaeh at Thanksgiving. Nathan catches sight of himself in the mirror and grins . Nora pauses the image, then screenshots Nathan’s face and drags it to an empty wire frame animation, giving it a blurry Nathan face. Lucy walks down the line of desks. LUCY Anyone see my coffee order? Nora rotates her cup which says “Lucy” away as Lucy passes. NORA Nope. She opens another memory file.  Nathan’s POV: the Pacific Coast Highway over the top of motorcycle handlebars, ocean on the left. Nathan looks into the side mirror and grins, the wind whipping his hair.  Nora pauses the picture of Nathan checking his look in the mirror again.   This guy just loves himself, doesn’t he?   She drags the image to the wire-frame avatar, which gets more detailed and high-res. FEMALE CO-WORKER (O.S.) Ooh, young. A female co-worker looks over Nora’s shoulder. FEMALE CO-WORKER (CONT’D) And cute. NORA He sure thinks he’s cute. Basic Beverly Hills douche.   App start- up?   Vintage motorcycle?   Come on. FEMALE CO-WORKER I didn’t say have his baby, I’d just dance that pole.   I’m in the wrong neighborhood -- my Nitely fucks all have less muscles and body hair than me...   How’d he die?  12.",
      "characters": [],
      "action_text": "NORA (looks at file) Car accident. FEMALE CO-WORKER You mean motorcycle? NORA It says car. FEMALE CO-WORKER Weird.   I’m Uploading my fifth old woman in a row.   Fun, huh? LATER Nora carefully edits Nathan’s hair on the avatar she is building, which is very detailed now. Using a stylus, she smooths out a cowlick.   Perfect.   She is very good at what she does.   She looks at his handsome face for a beat, then mischievously “undos” the last few strokes until the cowlick is back, and saves her work. She clicks on another memory file, but it doesn’t open. “MEMORY FILE A56F432C8 DAMAGED.”   Nora frowns.   That usually doesn’t happen.   She starts a folder labelled “???” and drags the damaged file into it.   She opens the next memory file. Nathan’s POV: lights pass by on a ceiling. DISSOLVE TO: INT. EMERGENCY ROOM - SHORTLY AFTER THE ACCIDENT Chaos.   Nathan is on a gurney being pushed into an OR where a team is working on him.   Ingrid follows, freaking out. ER NURSE Do you have any drug allergies, Nathan? NATHAN (voice is weird and whispery) No.   I really think I’m okay. ER NURSE When’s your birthday? NATHAN On the brif of Febinary.  13. INGRID Oh, you’re not okay.   God, I should have waited for you! NATHAN ... Your teeth are so white. ER NURSE Morphine has kicked in. NATHAN I’m going home. Nathan tries to stand up. BLOOD PRESSURE MACHINE (another Australian female voice) Sit down please. ANOTHER ER NURSE His vitals are dropping. ER NURSE 5 mgs epinephrine NOW. INGRID Oh! We really want to Upload and I don’t want to miss the window. ER NURSE Is the paperwork all filled out? INGRID No. ER NURSE Heaven sales rep to the ER. NATHAN Wait, what? ER NURSE Just in case.   ANOTHER ER NURSE Can’t Upload a dead body. NATHAN (CONT’D) Dead body?!   I’m going to be fine. INGRID Baby there’s pieces of you sticking out all over the place! NATHAN Could someone call my folks?   ANOTHER ER NURSE Vitals still dropping.  14. INGRID They’re on their way.   Your car called them after me. E",
      "dialogue_count": 0,
      "word_count": 1475
    },
    {
      "scene_number": 3,
      "slugline": "INT. NORA’S WORKSTATION - CONTINUOUS Nora’s screen has Nathan’s brainwaves playing in a window. NORA I want you to think of your   self . The “I” in the sentence, “I think therefore I am.”   Okay, cool, just gonna grab that... She highlights a section of his waveform with her cursor. NORA (CONT’D) That’ll be your password, or passthought.   I’ll always be able to use this to-- BACK TO DARKNESS NORA (V.O.) recognize you.   Now, remember kindergarten?   The alphabet song,   A B C D ?   Think that for me... Yeah, good.   Now think the color blue... white... red... yellow. Perfect. The darkness goes blue, then white, then red, then yellow, then starts resolving slowly into a scene. INT. NORA’S WORKSTATION - CONTINUOUS Nora looks at the screen. NATHAN (V.O.) (Australian female) I’m feeling pins and needles. NORA (laughs) Why do people always set it for Australian accent?   Say again please. She adjusts some stuff on the screen. NATHAN (V.O.) (regular voice) Pins and needles. NORA There we go.   That’s a lot better voice for you.  20.",
      "characters": [
        "NATHAN"
      ],
      "action_text": "NATHAN (V.O.) Yours is nice too. Nora rolls her eyes and ignores that. NORA Pins and needles is just the program finding your nerve endings. Can you see anything? INT. AMAZON LAKEVIEW - CONTINUOUS The place is booting up -- a rectangle becomes a window. Details emerge: a wooden rocking chair, a crocheted cushion, porcelain door knobs.   Out the window, brilliant blue sky, dark green fir trees on a distant mountain. NATHAN (O.S.) I’m in some kind of old-fashioned room... Nathan’s voice comes out of a simple male avatar with brown skin and hair, whose details are quickly getting filled in. He looks out the window... NATHAN (CONT’D) ...looking over a lake... Aaaannnd, he is completely detailed and HD. NATHAN (CONT’D) ...beautiful trees... And, whoa!   A shark swimming right towards me! NORA (V.O.) What?!   That’s not supposed to-- NATHAN JK. INTERCUT BETWEEN NATHAN AND NORA NORA (a little impressed) Ha! Sense of humor. Nice. Um, so, welcome to Amazon’s Lakeview.   The only digital afterlife environment modeled on the grand Victorian hotels of the United States and Canada.  21. Nathan looks around the room -- a big, luxurious, hotel suite with a stuffed moose head and handmade wooden chairs with the bark still on. NORA (V.O.) (CONT’D) Hope it’s not too specific for you. NATHAN It was never my thing, but it’s kinda cool. NORA Yeah, our design team is brilliant. They took for inspiration the vacation spots of the Gilded Age millionaires, with a little Gatsby and Niagara Falls thrown in for fun. Timeless Americana, uplifting views, healthy pursuits.   Good stuff. NATHAN Are there slaves? NORA What?!   This is a design scheme, one, and that’s not even the right period, two.   Lakeview is open to all races, religions, genders, absolutely anybody.   I see you selected “non-denominational charismatic Christian” as your creed.   That means, for you, the little chapel east of the hotel will be a Pentecostal Church.   For someone else, the same building could be a mosque or even ",
      "dialogue_count": 1,
      "word_count": 4925
    }
  ]
}