{
  "slug": "us-2019",
  "title": "us",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 1008,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. THE UNDERPASS. CLASSROOM HALLWAY. DAY The chase explodes into the main tunnel. Red backs up as Adelaide pursues her. They manage to avoid stepping on rabbits. FLASHBACK... INT. BALLET - NIGHT Fourteen-year-old Adelaide spins perfectly. INT. UNDERPASS. CLASSROOM HALLWAY. 1993. NIGHT Fourteen-year-old Red portrays a body being dragged through the tunnel. PRESENT DAY... INT. THE UNDERPASS. CLASSROOM HALLWAY/ BARRACKS HALLWAY Adelaide chases Red around a corner. A new hallway extends in front and behind her. FLASHBACK... INT. BALLET - NIGHT Fourteen-year-old Adelaide delicately caresses her arms while standing en pointe.. INT. UNDERPASS. CLASSROOM HALLWAY. 1993. NIGHT Fourteen-year-old Red reaches to the ceiling with heartbroken longing. PRESENT DAY... INT. THE UNDERPASS. BARRACKS HALLWAY. DAY Adelaide pins Red against the door. Her fire poker up against Red’s scissors. Adelaide smiles as she pushes. Then Red quickly separates the two sides of the scissors and pokes Adelaide in the side with one of the blades sending her reeling back. Red slips through the door into... 89.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 165
    },
    {
      "scene_number": 2,
      "slugline": "INT. THE UNDERPASS. BARRACKS. DAY Rows of bunks line the empty, red-tiled sleeping quarters. It’s dark. Adelaide charges in. Red is nowhere to be seen. Adelaide stalks through the bunks. The MUSIC crescendoes. Red emerges from the shadows behind one bunk with a huge sneak attack. Adelaide turns, just in time. FLASHBACK... INT. BALLET - NIGHT Both girls prepare for their huge finale. As the MUSIC PEAKS... Sixteen-year-old Adelaide runs and leaps landing perfectly with no partner. INT. UNDERPASS. CLASSROOM HALLWAY. 1993. NIGHT Fourteen-year-old Red’s sorrow turns to rage she runs an leaps but falls to the floor hard. PRESENT DAY... INT. UNDERPASS. BARRACKS. DAY Red has been run through by the fire poker. She falls to the floor. Adelaide stands over her. INT. THE UNDERPASS. BARRACKS. DAY Adelaide picks up and places Red’s limp body on the bed and sits next to it. Red begins to whistle “ITSY BITSY SPIDER.” Adelaide pushes the chain from her handcuffs into Red’s neck. Chocking her.. Adelaide weeps, but her weeping turns into LAUGHTER. Red struggles and dies; Her face goes soft in the end. 90.",
      "characters": [],
      "action_text": "A NOISE takes her out of it. She turns sharply. She walks over to an industrial locker/closet with ventilation slats in it. She opens it. Jason stands inside, trembling. His eyes and mouth wide open in shock. Adelaide hugs him hard and weeps happily. ADELAIDE There you are, my love. I found you! He is frozen in fear. ADELAIDE (CONT’D) Look. She starts wiping his tears but smears blood across his cheek. ADELAIDE (CONT’D) They’re all gone now, ok? They can’t hurt you. You understand..? Jason? Do you? Everything is going to be like it was before. She starts to shake him. And realizes he’s afraid of her. She stops and an awful expression comes over her face. He heard. She keeps wiping his cheek obsessively but just smears more and more blood. ADELAIDE (CONT’D) It’s going to be like before and you will never have to leave me. I promise. Never, ever, ever, ever... INT. AMBULANCE. DAY Gabe and Zora hide inside. Zora goes to the back window and opens the door. They turn to see Adelaide arrive with Jason in tow. MOMENTS LATER... The ambulance drives. We see each persons’ traumatized face. Jason watches his mother. RUSSELL (O.S.) What...? She wasn’t in Nam’; she got lost for fifteen minutes. DR. FOSTER (O.S.) That can be very scary. CONTINUED: 91. RAYNE (O.S.) We don’t know what happened to her. FLASHBACK... INT. PSYCHIATRIST’S OFFICE. DAY Young Adelaide listens to her parents talk to the psychiatrist. RUSSELL So, how do we get her to talk? INT. THE WILSON’S BAYSIDE HOUSE. BASEMENT. DAY The mini home ballet studio. Young Adelaide practices methodically in front of the mirror. DR. FOSTER (O.S.) I think we need to encourage her to draw, write... dance... anything to help her tell us her story... but we have to be patient. INT. VISION QUEST PORTAL. NIGHT We are inside the Vision Quest portal looking out at the beach and ocean. Young Adelaide, (the real one) stands by the water. Lightning bursts in the distance over the ocean. Then, beckoned by the mysterious portal, she walks to",
      "dialogue_count": 0,
      "word_count": 843
    }
  ]
}