{
  "slug": "vacation-2015",
  "title": "vacation",
  "genre": "drama",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 8,
  "characters": [
    "RUSTY",
    "BLUESMAN",
    "DEBBIE",
    "JAMES",
    "KEVIN",
    "CHAD",
    "LOCAL DJ",
    "CLARK"
  ],
  "total_words": 18214,
  "total_dialogue": 13,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. REST STOP - MOMENTS LATER The Griswolds’ car heads back onto the highway.   We PAN OVER to reveal the familiar TRUCK idling ominously with the TEDDY BEAR on the grill watching them go. CUT TO: SERIES OF SHOTS as the Colossus exits the highway and heads into a city. SUPERIMPOSE:   MEMPHIS, TENNESSEE The giant vehicle cruises down BEALE STREET, passing neon- lit tourist traps, blues joints and a larger than life bronze statue of ELVIS. EXT. HEARTBREAK HOTEL - NIGHT The Griswolds pull up to the Elvis-themed hotel just across the street from Graceland.   As they stiffly exit the car after a very long day of driving, we quickly ANGLE ON their JOINTS audibly POPPING and CRACKING: Rusty’s neck, Debbie’s back, the boys’ knees and elbows. RUSTY See, I told you we could cover 700 miles today.   No problem. JAMES I can’t believe I’m actually in the birthplace of the blues! KEVIN I wish I could go back to your birthplace and kick you in the face. JAMES You wouldn’t be alive then. KEVIN Wanna bet? RUSTY Come on, guys.   We’re 500 yards from where Elvis died on the toilet.   Show some respect. They head into the lobby.   Rusty leans in to Debbie.  26. (CONTINUED)",
      "characters": [
        "RUSTY"
      ],
      "action_text": "KEVIN I call bottom bunk. JAMES Dad, I don’t like it in here. KEVIN (O.S.) I do.   It’s awesome. They look over to see Kevin doing tricep dips on the side of his bunk like a hardened inmate. RUSTY There.   See?   Kevin’s got the right attitude. DEBBIE (quietly) So much for our romantic evening. RUSTY Guess I brought this for nothing. He holds up the familiar Sade CD. DEBBIE (flat) Darn. EXT. GRACELAND - NEXT MORNING The Griswolds enter the front gate of the famous mansion. James notices a street performer, an OLD AFRICAN-AMERICAN BLUESMAN, sitting on a milk crate beside the entrance, playing a soulful song on a well-worn guitar. RUSTY Here it is.   The house that Elvis built! JAMES Is it okay if I catch up with you inside? (re:   the Bluesman) This guy is really speaking my language. DEBBIE Uh, sure, honey.   Don’t be too long. They head inside while James closes his eyes and listens to the old man jam.  28. CONTINUED: INT. GRACELAND - MINUTES LATER Rusty, Debbie and Kevin stand with a half dozen other VISITORS while a female TOUR GUIDE, who is a little off, leads them through the lavishly decorated house. TOUR GUIDE This is Elvis’ salon where he would entertain guests, wrap gifts or just relax with one his trademark peanut butter and banana sandwiches. A few visitors chuckle. TOUR GUIDE Sounds like some of you know about those sandwiches.   That’s why you’re laughing, isn’t it? A handful of the visitors nod. TOUR GUIDE Now you’re nodding.   Because you agree with what I said, don’t you? Uh-huh.   Okay.   Now, if you look around the salon, you’ll notice there are three different types of velvet.   There’s crushed velvet in the drapes, cut velvet on the love seat and plain weave velvet on the throw pillows.   Elvis loved velvet. (beat) I see one of you is nodding again. You probably knew that Elvis loved velvet and that’s why you nodded? Okay... The group moves on. ANGLE ON KEVIN who couldn’t be more bored. KEVIN This sucks. DEBBIE Kevin. (then, sotto to Rusty) This ",
      "dialogue_count": 1,
      "word_count": 1053
    },
    {
      "scene_number": 2,
      "slugline": "EXT. GRACELAND - SAME TIME James is finishing up his song. JAMES (singing)  I’ve looked at life from both sides now/From win and lose, and still somehow/It’s clouds’ illusions I recall/I really don’t know life... at all.  James self-consciously hands the old man back his guitar. BLUESMAN All right, then.   You got some chops, boy. JAMES Aw, thanks.   I’m no Joni Mitchell... BLUESMAN I’ve got a buddy over at Sun Records who would love your sound. JAMES (thrilled) Really?!   I’m not too young? BLUESMAN Heck no.   Muddy Waters was 16 when he started out.   Trust me.   I know talent.   I jammed with all the greats.   B.B. King, Stevie Ray, even Elvis himself. JAMES No kidding? The Bluesman starts to play again. BLUESMAN That’s right.   In fact, I’m jamming with him right now. He looks over at the empty space beside him. BLUESMAN (to no one) Ain’t that right, Elvis? James doesn’t know how to react.   Is he kidding?  32. (CONTINUED)",
      "characters": [
        "BLUESMAN"
      ],
      "action_text": "It’s signed, “To EP,   We’ll always have Tahiti.   Love, RH.”   Rusty has stumbled on ELVIS’ SECRET GAY ROOM. RUSTY Holy moly. Debbie and Kevin stick their heads in. DEBBIE Oh my. Kevin picks up the Rock Hudson photo and examines it. KEVIN What is all this stuff? RUSTY (to Debbie) Honey, you want to take this? EXT. GRACELAND - ELVIS’ GRAVESITE - MOMENTS LATER Rusty, Debbie and Kevin hurry toward the exit, passing Elvis’ grave as they go.   A group of TOURISTS stand around the grave, paying their respects. James rushes up to his parents. JAMES Mom, Dad!   This crazy guy tried to -- RUSTY Not now, buddy.   We’re getting out of here.   Let’s go. As they leave, Kevin hangs back, noticing a WOMAN placing a wreath on Elvis’ grave alongside other mementos left by fans.   He takes the FRAMED GAY PHOTO from his jacket and sets it on the grave.   He nods to himself, feeling he’s done a good thing, then hurries to catch up with his family. ANGLE ON THE GRISWOLDS leaving the memorial garden.   BEHIND THEM we see PEOPLE begin to notice the photo and react with shocked GASPS. A CROWD quickly forms and we hear SHOUTS, SCREAMS and, inexplicably, GLASS BREAKING.   One MAN PUNCHES another and a RIOT takes shape as the Griswolds obliviously head to their car.  34. CONTINUED:",
      "dialogue_count": 1,
      "word_count": 576
    },
    {
      "scene_number": 3,
      "slugline": "EXT. HIGHWAY - SHORT TIME LATER The Colossus speeds down the road, as Memphis recedes into the distance. INT. CAR - CONTINUOUS ACTION Rusty fiddles with the GPS as he drives.   In the backseat, Kevin torments James by repeatedly trying to pull a plastic bag over his brother’s head. JAMES Cut it out! KEVIN I just want to see how long you can hold your breath before you die. He tries it again. JAMES Mom, Kevin’s trying to kill me again! DEBBIE Kevin.   Do not kill your brother. RUSTY (re:   GPS) All right, next stop:   University of Arkansas.   Let’s see how far it is. GPS VOICE (V.O.) (calm English female) You are 147 miles from your destination. RUSTY Not bad.   Let me just check the best route... Rusty pushes a button. GPS VOICE (V.O.) (calm German female) In sechs kilometer, biegen Sie rechts ab-- RUSTY Whoops.   Think I changed the language here.   Let me just...  35. (CONTINUED)",
      "characters": [
        "DEBBIE",
        "JAMES",
        "KEVIN"
      ],
      "action_text": "He pushes another button. GPS VOICE (V.O.) (calm French female) Dans six kilomètres tournez à droite-- RUSTY That’s not it. He pushes the button again. GPS VOICE (V.O.) (angry Korean male) Jebalneun jwahoejeon!! DEBBIE What is that?! RUSTY I think it’s Korean. GPS VOICE (V.O.) Gyesog hyeonjae noseon!! DEBBIE It’s terrible!   Change it back, Russ. RUSTY The menu is all in Korean now.   I don’t know what to push. He tries various buttons, but it seems to only make the Korean voice angrier. GPS VOICE (V.O.) MOGSOLINEUN-I BOLLYUM-EISS-EUL GEOYEYO!!!! The Korean voice PANTS heavily from the exertion. JAMES Why is he so much angrier than the other voices? RUSTY Okay, we’ll just leave it alone. We’ve got maps.   No biggie.   Who knows.   Maybe we’ll all learn Korean by the time we get to Walley World.  36. CONTINUED: ANGLE ON JAMES whose eye is suddenly caught by a passing JEEP WRANGLER with the top down.   Sitting in the back seat is a VERY CUTE GIRL his own age.   The WIND WHIPS THROUGH her HAIR as we go into SLOW MOTION.   James is transfixed. The girl notices him and smiles. Embarrassed, James looks away.   After a moment, he looks back and sees that the girl is still smiling.   She gives him a wave.   James waves sheepishly back. Suddenly, a PLASTIC BAG is THRUST over James’ head, squashing his face as it smothers him.   The girl’s smile fades as James struggles to yank off the bag.   He manages to pierce the plastic with his tongue so he can breathe. The girl is understandably disgusted.   At last, James manages to free himself. JAMES (to Kevin, gasping) What is wrong with you?! KEVIN What’s wrong with you? James turns back to the girl, but her car has pulled away from theirs.   She’s gone.   James sighs heavily. EXT. UNIVERSITY OF ARKANSAS CAMPUS - DAY The Colossus rolls down SORORITY ROW.   In Korean: SUPERIMPOSE:   FAYATEVILLE, ARKANSAS DEBBIE (V.O.) There it is.   Kappa Delta.   I’ll call Heather. The car pulls up and parks.   As the Griswolds climb out of the ca",
      "dialogue_count": 3,
      "word_count": 2200
    },
    {
      "scene_number": 4,
      "slugline": "EXT. HIGHWAY - DUSK The Colossus continues westward through Arkansas. INT. CAR - CONTINUOUS ACTION Rusty drives in silence through the flat landscape.   He glances over at Debbie, who reads a hardcover copy of   The Help .   She doesn’t glance back. The radio plays the final bars of Annie Lennox’s “No More ‘I Love You’s’.” The next song fades in. MUSIC CUE:   Tracy Chapman’s “Fast Car.” RUSTY I don’t believe it.   I love this song. Kevin groans.   James is indifferent. RUSTY Come on, everyone.   Sing it with me! With great passion and sincerity, Rusty sings along with Tracy Chapman. RUSTY (singing)  ‘You’ve got a fast car/I want a ticket to anywhere --’   Come on, guys.   ‘Maybe we make a deal/Maybe together we can get somewhere...’  Deb? Rusty looks over at Debbie hopefully, but she’s not up for it. RUSTY (singing)  ‘Anyplace is better --’   Guys, no? The boys don’t join in. RUSTY  ‘Starting from zero we’ve got nothing to lose/Maybe we’ll make something/But me myself I’ve got nothing to prove --’   Kevin? James?  48. (CONTINUED)",
      "characters": [],
      "action_text": "KEVIN This song sucks, Dad. JAMES I like Tracy’s deeper cuts. RUSTY What?!   This is one of the most beautiful -- (singing)  ‘I remember we were driving, driving in your car/the speed so fast felt like I was drunk --’   I cannot believe no one in this family wants to -- (singing)  ‘And I-I-I-I had a feeling that I belonged...’   Anyone?   ‘ I-I-I-I had a feeling I could be someone, be someone, be some --’ agghhh!  SFX:   TRUCK HORN. The whole family JUMPS as they look out the back window to see the familiar TRUCK with the TEDDY BEAR, directly on their tail, flashing its blinding lights at them. DEBBIE Oh my God! JAMES He’s come back to kill us! The Colossus SWERVES in and out of the lane trying to evade the truck. RUSTY You call a guy a pedophile a half- dozen times and he won’t let it go. KEVIN Gun it, Dad!   Lose him! RUSTY I’m not gunning anything.   This is just a misunderstanding -- SFX:   TRUCK HORN BLARES TWICE MORE. The 18-wheeler practically touches the rear bumper of their car. DEBBIE Gun it, Russ.  49. CONTINUED: (CONTINUED) RUSTY Gunning it. Rusty floors it, and they begin to PULL AWAY from the truck.   Their speedometer edges up toward 95 mph. JAMES Faster, Dad!   Go faster! RUSTY I’m driving a tank.   It won’t go any faster! Slowly but surely, the truck is closing the gap between them.   Just then, Rusty spots an exit a quarter mile ahead. RUSTY Everyone buckled in? They all nod, terrified, as they near the offramp. RUSTY Okay, hang on tight. The truck has now caught up again and is closing in on their bumper.   At the last possible second, Rusty VEERS to the right, BOUNCING over the divider, SCRAPING along a guardrail and SMASHING OPEN a large WATER BARREL, soaking the car. ALL AGGGHHHHH! It’s too late for the truck to follow.   It’s forced to continue down the highway. Rusty manages to SCREECH to a stop at the bottom of the offramp.   He and the others are silent except for their heavy breathing.   After a beat: RUSTY I think we lost him. (laughing n",
      "dialogue_count": 0,
      "word_count": 562
    },
    {
      "scene_number": 5,
      "slugline": "EXT. MOTEL - NIGHT The Colossus, with a new scratch down one side, is parked outside a rundown two-story motel. INT. MOTEL HALLWAY - CONTINUOUS ACTION Rusty unlocks a room and hands the key to James. RUSTY Okay, guys, this is you. Kevin runs inside. KEVIN I call both beds! James gives Rusty a forlorn look. RUSTY You get one bed, Kevin. (to James) If you need anything, Mom and I are right next door. JAMES I think I saw a hot tub outside. Is it okay if I take a soak? RUSTY Sure.   But if anyone tries to shove you in their car, you scratch them like I showed you. JAMES I will. RUSTY Atta boy. INT. MOTEL ROOM BATHROOM - MOMENTS LATER Debbie wears a nightgown and brushes her teeth. Suddenly, from the bedroom she hears MUSIC CUE:   Sade’s “Smooth Operator.” RUSTY (O.S.) Alone at last. Debbie turns to see Rusty has entered.  51. (CONTINUED)",
      "characters": [
        "RUSTY"
      ],
      "action_text": "RUSTY Come here, you. He grabs her and kisses her for several seconds.   When he pulls away, his mouth is covered in white foam.   Debbie leans over the sink and spits out the toothpaste that was in her mouth. DEBBIE I was brushing my teeth. RUSTY Now I don’t have to. (then) So, that stuff you were telling Heather today about how crazy you were in college... DEBBIE Russ, that was a long time ago, and I was just trying to scare her. RUSTY So, they didn’t really call you ‘Debbie Do-Anything’? DEBBIE No, they did.   But I obviously didn’t do anything. RUSTY Of course.   You didn’t actually sleep with your professors. DEBBIE No, I did. RUSTY Oh.   Do you ever miss that lifestyle? DEBBIE Nah.   It’s like you said:   part of getting older is realizing some of the things you used to do were silly. Rusty tries to read her expression. RUSTY Are you... bored with me? DEBBIE Bored?   No, not really.  52. CONTINUED: (CONTINUED) RUSTY What then? DEBBIE I guess, I feel like we’ve stopped being romantic. RUSTY Really?   What about the Sade? What about the candles? DEBBIE It’s always the same thing, Russ. RUSTY There’s a choice of candles... DEBBIE Yeah.   But it would be nice to be surprised once in a while, y’know? (then) I’m gonna take a shower. RUSTY (light bulb) I’ll take one with you. DEBBIE What? RUSTY Surprised? DEBBIE Well, yeah.   We’ve never done that before. RUSTY Exactly.   What do you say, Debbie Do-Anything? DEBBIE (smiles) Let’s do it. She pulls open the shower curtain and they both recoil as they take in the MOST DISGUSTING BATHTUB in the world: mildew, fungus, odd brown stains. DEBBIE/RUSTY Ooh!/Ugh! DEBBIE Are those mushrooms?  53. CONTINUED: (CONTINUED) RUSTY Looks like someone blew their head off in there. They both deflate as the “romantic” moment passes. RUSTY Raincheck? DEBBIE Yeah. EXT. MOTEL - CONTINUOUS ACTION James sits at the edge of the hot tub, his feet dangling in the water as he quietly strums James Taylor’s “Fire and Rain” on his guitar. ADENA (O.S",
      "dialogue_count": 1,
      "word_count": 1897
    },
    {
      "scene_number": 6,
      "slugline": "EXT. FOREST TRAIL - LATER The Griswolds, in bathing suits and flip-flops, hike along the narrow wooded trail. JAMES Where is everybody? RUSTY I guess we found our own private hot spring.   Let’s call it ‘Griswold Springs.’ Debbie gives him a peck on the cheek.   Rusty beams as they arrive at the water’s edge. RUSTY Now make sure you ease in slowly. Hot springs can be very hot. They all take off their flip-flops and carefully submerge themselves in the water, reacting to the water temperature. DEBBIE Ooh! RUSTY Oh boy! JAMES Wow, this is -- KEVIN Freezing! DEBBIE (shivering) Russ, this isn’t hot at all. RUSTY No, it’s pretty brisk, isn’t it? Maybe if we find the source, we’ll get the hotter water. They wade around, increasingly cold and shivering. JAMES I don’t think I like Griswold Springs. RUSTY (teeth chattering) Aw, come on.   This is how the Indians bathed!  63. (CONTINUED)",
      "characters": [],
      "action_text": "KEVIN My balls are gone! RUSTY They’re not gone.   They just went inside to protect themselves. DEBBIE It smells a little funky in here. RUSTY That’s just the sulfur.   That’s natural. JAMES Dad?   I think I found the source. ANGLE ON JAMES who points to a pipe that is dumping brown SEWAGE RUNOFF into the pond. ANOTHER ANGLE RUSTY What the -- ? KEVIN Look, James, I found a dart. Kevin is holding a hypodermic needle.   He tosses it at James, who dodges it. JAMES Are you crazy?! DEBBIE Okay, everyone out of -- SFX:   CAR ALARM RUSTY Is that our car alarm? SMASH CUT TO: EXT. FOREST CLEARING - MINUTES LATER The Griswolds, shivering in their bathing suits, stare forlornly at the Colossus which has been BROKEN INTO.   A rear window is SHATTERED and all of their luggage is gone.  64. CONTINUED: (CONTINUED) KEVIN You’ve gotta be shitting me! RUSTY Why didn’t those local guys warn us there were thieves in these woods? (realizing) Oh.   Right. JAMES They stole my guitar. DEBBIE Not to mention all our money. JAMES Not all our money. He reaches into his bathing suit and begins rooting around, to the confusion and discomfort of the others. DEBBIE James. JAMES Just give me a second, Mom.   I’m trying to get this off. RUSTY James! JAMES Here it comes. He pulls out a waterproof nylon pouch which he unzips to reveal some cash. RUSTY What is that? JAMES My emergency money pouch.   Little trick I picked up from Hemingway. RUSTY Good job, son. (noticing) Oh, and look, Deb.   They left your book. He hands Debbie her copy of   The Help . RUSTY Looks like we get the last laugh!  65. CONTINUED: (CONTINUED) DEBBIE Last laugh?!   We don’t even have anything to wear! RUSTY Don’t worry.   I’m sure Arkansas has plenty of fine clothing stores. EXT. GUM SPRINGS GENERAL STORE - LATER The Colossus is parked outside a podunk store.   Signs in the window read “Nightcrawlers 50 cents each” and “Men’s Slacks $4.99” After a beat, Rusty and Debbie emerge from the store, followed by the boys, in their new",
      "dialogue_count": 0,
      "word_count": 625
    },
    {
      "scene_number": 7,
      "slugline": "EXT. UPSCALE NEIGHBORHOOD STREET - LATER The Colossus, looking fairly ghetto with one window covered in plastic and a big scrape down the side, drives down a street lined with palatial homes. SUPERIMPOSE:   (In Korean) Plano, Texas DEBBIE (O.S.) This is so embarrassing.   We look like your Cousin Eddie’s family. INT. CAR - CONTINUOUS ACTION RUSTY It’s no big deal.   We’ll just explain to them what happened. Remember what happened, kids? JAMES We pulled over to rescue a baby from a burning car and someone stole all our stuff while we were distracted. RUSTY And what happened to our clothes? JAMES I don’t remember. RUSTY That’s right.   We don’t remember. DEBBIE Is that really the best story we can come up with? RUSTY Honey, it’s perfect.   They’ll be so focused on the baby and the burning car, they won’t even notice that the story falls apart at the end. Debbie shakes her head dubiously. GPS VOICE (V.O.) (outraged) DANGSIN-EUN MOGJEOGJIE DOCHAGHAESSEUBNIDA! RUSTY Here we are.  67.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 167
    },
    {
      "scene_number": 8,
      "slugline": "EXT. AUDREY AND STONE’S HOUSE - CONTINUOUS ACTION The Griswolds turn into an impressive circular driveway in front of an even more impressive house. As the family climbs out of the battered car in all their redneck glory, AUDREY and STONE CRANDALL emerge from the house to greet them.   Stone, early 40s, is tall, confident and weatherman-handsome.   Audrey has grown up to be quite attractive in a Texas-big-hair-and-too-much- jewelry kind of way.   She’s carrying a baby, COOPER. AUDREY Hey, y’all!   Welcome! (then) What on earth are you wearing? RUSTY You won’t believe what happened on our way over -- KEVIN Dad got scammed by two guys at a park. RUSTY Kevin! Stone laughs heartily as he shakes Rusty’s hand. STONE Same old Rusty.   You’d buy water from a faucet. RUSTY Not really sure what that -- AUDREY Well, no worries.   We’ve got plenty of clothes we were gonna give to Goodwill. DEBBIE Thanks, Audrey. (re:   the baby) This must be little Cooper.   He’s adorable. AUDREY Thank you. STONE Kevin and James.   Would you look at these young men.  68. (CONTINUED)",
      "characters": [
        "RUSTY",
        "JAMES",
        "CHAD",
        "LOCAL DJ"
      ],
      "action_text": "KEVIN Hi, Uncle Stone. STONE You still wrestling, son? KEVIN Uh-huh. STONE Let’s see some moves. Kevin grabs James and quickly wrestles him to the ground, pinning him on his back. JAMES Get off of me! STONE (to Kevin) Very nice lateral toss. KEVIN Thanks. Stone gives Debbie a kiss on the cheek.   Rusty watches the following with some discomfort. STONE Debbie Griswold.   You just keep getting prettier. DEBBIE (charmed) Stop it. STONE I mean it.   You could make hot water come out of the cold faucet. Rusty reacts to this second faucet metaphor as Stone continues staring into Debbie’s eyes. AUDREY Well, come on in the house.   We’ll show you around. They all head inside.   James gets to his feet and limps in behind them wearing his “Slut” shirt. INT. AUDREY AND STONE’S HOUSE - CONTINUOUS ACTION Audrey and Stone, walking hand in hand, show the Griswolds through their enormous, slightly gaudy home.  69. CONTINUED: (CONTINUED) KEVIN Man, this place makes our house look like shit. DEBBIE Kevin! KEVIN It does. STONE (chuckling) Well, Kevin, that’s only ‘cause the dollar goes much further out here than it does in Chicago. (beat) Especially when you make a lot more of them. He gives Rusty a playful wink.   Rusty winks back, annoyed. They walk into a large entertainment room where a tall, heavyset African-American boy, DARRYL, 15, sits watching the news on a 60-inch screen:   RIOTERS run through the streets. NEWSCASTER (V.O.) (on TV) ... the Memphis riots continue to spread throughout the South following the stunning revelation that Elvis Presley, the king of rock and roll, may have been homosexual... Rusty and Debbie exchange a quick look. AUDREY Oh, and here’s Darryl.   Darryl, say hello to your Uncle Rusty and his family. Darryl stands and smiles shyly. DARRYL (softly) Hello, Uncle Rusty.   Hello, everyone. RUSTY Uncle?   I don’t -- AUDREY Stone and I have adopted Darryl.  70. CONTINUED: (CONTINUED) RUSTY Oh, like   The Blind Side . Stone, Audrey and Darryl look at him blan",
      "dialogue_count": 6,
      "word_count": 6545
    },
    {
      "scene_number": 9,
      "slugline": "INT. CAR - CONTINUOUS ACTION With a final SPUTTER and plume of exhaust, the car runs out of gas and comes to a halt near a large manmade MUD PIT in which a number of HALF-NUDE EARTH LOVERS squirm. RUSTY Damn.   Well, hopefully someone around here can spare a couple gallons. They all exit the car.   Debbie takes her purse.   Kevin gapes at the nudists in the mud, until Debbie yanks him away. EXT. DESERT - MOMENTS LATER The Griswolds walk a few yards into the crowd.   Rusty approaches a skinny STONED GUY who repeatedly runs his hands over his arms and torso. RUSTY Excuse me, sir?   I wonder if you have any idea where I might find some gasoline? STONED GUY Touch my arm. RUSTY I’m sorry? STONED GUY It feels alive.   Like I’m made out of wind. RUSTY So... no idea about the gas then? STONED GUY I have brown rice.   In my tent. RUSTY (looking around) Anyone else I can talk to? Suddenly, they hear GLASS BREAKING and SHOUTING.   They turn to see a MOB of Desert Fest HIPPIES have surrounded the Colossus and are ROCKING IT back and forth violently. HIPPIES (chanting) S.U.V., R.I.P.!   S.U.V., R.I.P.!  105. (CONTINUED)",
      "characters": [],
      "action_text": "DEBBIE Russ? RUSTY What are they -- (yelling) Hey!   Stop that!   It’s gonna -- All at once, the car TIPS OVER AND ROLLS ONTO ITS SIDE. From inside, we can hear the GPS VOICE YELLING OUT a stream of angry pronouncements in Korean. GPS VOICE (V.O.) MOGSOLINEUN-I BOLLYUM-EISS-EUL GEOYEYO!!!! Rusty runs over as another GUY begins pouring gasoline onto the Colossus. RUSTY What is wrong with you people?! That’s a rental! Rusty SLIPS on a patch of mud and FLOPS face-first into the giant MUD BATH. HIPPIE CHICK Let’s burn this gas-guzzling monster!   We’re gonna need a lot of gas! Rusty flails around, finally emerging covered in mud.   He wipes the muck from his eyes, just in time to see the HIPPIES CHEER as the car GOES UP IN FLAMES. RUSTY (getting to his feet) No, no, no! DEBBIE What are we going to do now?! Rusty grits his teeth, trying to keep his cool. RUSTY Okay.   Okay, we can handle this. DEBBIE (exasperated) We can’t handle this, Russ!   This trip has been a disaster from the start.   We would’ve been better off at the cabin in Cheboygan!  106. CONTINUED: (CONTINUED) KEVIN I knew this vacation would suck balls!   I didn’t even want to come on this stupid trip! JAMES I’m actually glad we did this. All the best writers had horrible childhoods. RUSTY Come on, guys, all we need to do is... He stops when he sees the faces of his exhausted, miserable family.   At last, Rusty’s eternal optimism has reached its limit. RUSTY FUCK ME!   I don’t know!   I give up!   All I wanted was to take my goddamn family on a goddamn trip to Walley World and ride the goddamn Whipper Snapper! In a fit of rage, Rusty PUNCHES a nearby CACTUS, immediately pulling his hand away in pain. RUSTY OW!   I guess I’m the asshole for wanting to show this family a good time!   And what do I get?   Kids who hate me, a wife who’s bored of me -- DEBBIE Russ -- RUSTY Come on, Debbie.   It’s true. You think I’m just a lame, regional pilot.   A glorified bus driver.   Well, guess what?   I get offers from in",
      "dialogue_count": 0,
      "word_count": 1154
    },
    {
      "scene_number": 10,
      "slugline": "EXT. CASTRO DISTRICT, SAN FRANCISCO - EVENING The truck drives through the predominantly gay neighborhood.   We see rainbow flags, a MUSCULAR MAN walking a tiny dog, etc. EXT. CASTRO DISTRICT STREET - MINUTES LATER The truck pulls to a stop outside a two-story bungalow and the Griswolds get out. DEBBIE (to the Trucker) Thanks again, Josh.   Hope your mom feels better. TRUCKER You all take care now.   And, Deb, I’m gonna try that Moroccan slaw recipe. The truck pulls away.   The Griswolds turn and approach the house.   Rusty rings the doorbell then turns to Debbie. DEBBIE So this is where the trip ends. RUSTY We’ll get a flight home tomorrow. After a beat, the door opens, revealing CLARK GRISWOLD. RUSTY Hi, Dad. CLARK I don’t believe it!   Ellen, get out here! As Rusty, Debbie and the kids AD LIB greetings and hug, ELLEN GRISWOLD appears at the door. ELLEN What are you guys doing here?! RUSTY Long story. CLARK Well, come on in!   You can tell us all about it. (then, to the boys) Get over here, you two!  111. (CONTINUED)",
      "characters": [
        "CLARK"
      ],
      "action_text": "Clark attempts to pick up both Kevin and James in his arms.   It’s obviously a struggle. CLARK (gritted teeth) Boy, you guys are getting big. With great difficulty, he manages to carry both boys over the threshold. JAMES Grandpa, you don’t have to -- CLARK (strained) No, I got ya. They all go inside. INT. CLARK AND ELLEN’S HOUSE - CONTINUOUS ACTION The family enters, followed by Clark lugging his grandsons. CLARK Here we are... Kevin has slid down Clark’s arm to where he is hanging by his neck and starting to turn blue. JAMES I don’t think Kevin can breathe. CLARK Okay, everybody off the Grandpa Express! He releases the kids.   Kevin falls to the floor, gasping for air.   Clark mops his brow from the exertion. DEBBIE I love the new place, Ellen. ELLEN Thanks.   If we’d known you were coming I would’ve cleaned up. RUSTY The neighborhood is a little... CLARK Gay?   Yup.   Very gay.   Funny thing is, we didn’t know when we bought the place.  112. CONTINUED: (CONTINUED) RUSTY You didn’t know the Castro District was gay? ELLEN We thought it was just full of hip, young bachelors. CLARK Turns out, they were hip, young bachelors who make love to each other.   But you know what? They’ve totally embraced us. ELLEN They call us ‘breeders.’   Isn’t that cute? DEBBIE Adorable. CLARK Anyway, who’s hungry? INT. CLARK AND ELLEN’S DINING ROOM - LATER The Griswolds sit around the dining table having finished dinner. RUSTY ... and that’s when the mob of hippies set our car on fire.   But it didn’t really matter because our luggage and all our stuff had already been stolen. JAMES They even took my guitar. ELLEN Oh, James.   That’s terrible. CLARK A musician without his instrument is like a murderer without his murder weapon.   Give me one second.   I might have just the thing for you. He crosses to a drawer in the next room and returns with a harmonica that he hands to James. CLARK Here you go.  113. CONTINUED: (CONTINUED) JAMES A harmonica? CLARK I know it’s not a guitar, but it is a ",
      "dialogue_count": 1,
      "word_count": 1561
    },
    {
      "scene_number": 11,
      "slugline": "EXT. CLARK AND ELLEN’S GARAGE - MINUTES LATER The Griswolds stand in the driveway as Clark pushes the garage door clicker.   The door slowly opens to reveal the 25-YEAR-OLD WAGON QUEEN FAMILY TRUCKSTER in all its rusted glory, “HONKY LIPS” still graffitied on the side. Clark tosses Rusty the keys. EXT. CLARK AND ELLEN’S HOUSE - SHORT TIME LATER MUSIC CUE:   “Holiday Road.” Clark and Ellen wave from the driveway as Rusty and the family drive off in the Truckster.   THICK SMOKE pours out of its tailpipe, leaving Clark and Ellen in a black cloud.   They keep waving as they cough violently. EXT. HIGHWAY - LATER The Truckster chugs south on the I-5.   Lost in the smoke from its exhaust, another car blindly VEERS off the road. EXT. WALLEY WORLD PARKING LOT ENTRANCE - DUSK The Truckster drives under the entrance arch, into the vast parking lot.   The amusement park is visible in the distance. INT. TRUCKSTER - CONTINUOUS ACTION The Griswolds gaze out the front window, awestruck. RUSTY We made it.   We actually made it! Debbie leans over and kisses Rusty. DEBBIE I’m proud of you, honey. JAMES (quietly, to himself) ‘Thus did the travellers shed their weary cloaks and alight at last upon journey’s end.’ KEVIN What queer wrote that?  120. (CONTINUED)",
      "characters": [],
      "action_text": "JAMES I did. KEVIN (backing down) It’s lovely. RUSTY Okay, guys.   You ready to have the time of your lives?   Come on! EXT. WALLEY WORLD ENTRANCE - MOMENTS LATER The Griswolds stand looking up at the park entrance, their eyes wide. DEBBIE Wow. REVERSE ANGLE to see the park has gone DRAMATICALLY DOWNHILL since we last saw it.   The sign on the entrance arch now reads: “WALL   WOR D.”   Beyond it, garbage cans overflow, several rides are out of order and the crowd is pretty thin. KEVIN This is Walley World? JAMES It looks kinda rundown. RUSTY It could use a little freshening up.   But I’m sure the rides are as awesome as ever! They head into the park.   Kevin looks up dubiously at a faded, grafitti-covered statue of MARTY THE MOOSE.   An empty beer can rests on his nose. EXT. WALLEY WORLD - QUICK SERIES OF SHOTS - MOMENTS LATER The Griswolds react with disappointment as they see one ride after another is “CLOSED FOR MAINTENANCE.” The family sits at a food concession area picking at food that is clearly repulsive.   James glances over nervously at a neighboring table where a PARK MASCOT has passed out clutching a vodka bottle.   The head of his costume sits on the table beside him.  121. CONTINUED: (CONTINUED) James and Kevin play the ring toss game in the park’s fairway, as Debbie and Rusty cheer them on.   Kevin manages to snag one of the empty Coke bottles with a ring.   Rusty and Debbie congratulate him.   The TEENAGER running the stand removes the empty Coke bottle and hands it to Kevin as his prize.   Kevin looks pissed. EXT. WALLEY WORLD - EVENING With night nearly fallen, the Griswolds, tired and dispirited, trudge past heaps of trash and defunct rides. DEBBIE (quietly) Russ? RUSTY Yeah? DEBBIE Walley World is, well, kind of terrible. RUSTY It is, isn’t it?   They’ve really let the place go.   I guess, maybe it’s time to -- Just then, he is interrupted by the ROAR of a passing roller coaster car and the SCREAMS of its RIDERS.   The Griswolds look up and behold",
      "dialogue_count": 0,
      "word_count": 1549
    },
    {
      "scene_number": 12,
      "slugline": "INT. LOS ANGELES INTERNATIONAL AIRPORT - LATER The Griswolds arrive at a gate marked “Chicago.”   Rusty hands the boys their tickets. RUSTY Okay, boys, the Petersons are going to pick you up at O’Hare and you’ll stay with them for the week.   Have a great flight. He hugs them. DEBBIE Wait.   What’s going on? JAMES Yeah.   Aren’t you coming with us? RUSTY There’s someplace I need to take your mom first. DEBBIE There is? INT. AIRPLANE - SHORT TIME LATER We TRACK DOWN the aisle of a wide-bodied jet in flight, STARTING IN the FIRST-CLASS SECTION and MOVING TOWARD the rear. DEBBIE (O.S.) How did you do this?! We MOVE PAST first class and INTO the COACH SECTION. RUSTY (O.S.) I used my connections as a pilot to get us free seats. DEBBIE (O.S.) Free tickets to Paris!   You’re amazing. RUSTY (O.S.) I told you, you’re my queen and you deserve to be treated like one. We ARRIVE AT the VERY REAR OF THE PLANE, just behind the lavatories, where we FIND Rusty and Debbie perched UNCOMFORTABLY UPRIGHT on JUMPSEATS, like those used by flight attendants.  128. (CONTINUED)",
      "characters": [],
      "action_text": "A TOILET FLUSHES and the door swings open, slamming into Debbie’s arm.   An OVERWEIGHT WOMAN squeezes past them. RUSTY I know this isn’t exactly first class... or coach... DEBBIE It’s perfect. They kiss as a VERY FAT MAN squeezes past, his crotch smooshing up against Debbie’s shoulder. EXT. SKY - CONTINUOUS ACTION The AIR FRANCE plane soars through the clouds as the sun rises in the b.g. DEBBIE (V.O.) How long is the flight again? RUSTY (V.O.) Eleven hours. SFX:   TOILET FLUSH. DEBBIE (V.O.) ... perfect. FADE OUT. THE END OVER CREDITS: A SERIES OF “ON-RIDE” STILL SHOTS of the Griswolds, hanging upside-down, taken in the Whipper Snapper’s loop.   Each consecutive photo shows them a little more miserable as the hours go by.   A colorful border bears the words “I survived the Whipper Snapper!”  129. CONTINUED:",
      "dialogue_count": 0,
      "word_count": 325
    }
  ]
}