{
  "slug": "vengeance-2022",
  "title": "vengeance",
  "genre": "drama",
  "format": "film",
  "scenes_count": 6,
  "characters_count": 0,
  "characters": [],
  "total_words": 18348,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. BEN’S APARTMENT - LATER Ben and Brunette Random House Party (sleeping in a borrowed Pod Save America T-shirt) are deep asleep. Ben’s phone rings. After many rings, he picks it up. BEN Hello? The VOICE ON PHONE (whom we will meet later as TY) is intense and emotional, with a West Texan accent. TY (V.O.) Ben? BEN Yeah? Hello? TY (V.O.) I’m so sorry to be the one to have to tell you this. This is the worst phone call you’re ever going to get in your life. Oh, God. (deep breath) Your girlfriend is dead. BEN Huh? What? TY (V.O.) Your girlfriend. She’s dead. BEN Sorry, what did you say? TY (V.O.) “She’s dead.” BEN No. The first part? TY (V.O.) “Your girlfriend.” BEN Yeah, I’m so sorry, I don’t understand -- TY (V.O.) We just can’t make any sense of it. BEN Who is this?  7.",
      "characters": [],
      "action_text": "TY (V.O.) This is her brother, Ty. BEN Whose brother? TY (V.O.) Your girlfriend. BEN Who -- who are you talking about? I’m really confused. TY Is this Ben Manalowitz? BEN Yeah. TY (V.O.) This is Ty Shaw. Abby’s brother. Ben opens his laptop. He types “Shaw” into Facebook. TY (V.O.) I know this must be hard to process. I’m so sorry. Ben sees the profile of a girl he recognizes. A beat as this news comes into focus for him: Ben’s confusion turns to shock, and sadness, and awkwardness. BEN Oh my God. Abby. Sure. (beat) I wouldn’t have called her my - yeah. Oh my God. BRUNETTE RANDOM HOUSE PARTY Shhhhhhh. Ben covers the phone a bit. BEN Ty, I’m so sorry. TY (V.O.) Funeral’s Sunday. BEN Oh my God. Okay. Do you have an address where I can send flowers?  8. TY (V.O.) No need to send flowers. BEN No, really. I definitely want -- TY (V.O.) Really, brother. I promise. There’s no need. If you really want, there’s a flower shop by the airport. We can just swing by there when I pick you up. Ben realizes he’s expected at the funeral. BEN When you pick me up. Right. Funeral, Sunday. (beat) Okay, Ty, this weekend is really kind of -- I need to prepare for -- do you know who Ira Glass is? TY (V.O.) You’re breaking up, brother. Ben looks at the Facebook screen again. “In a Relationship.” He takes a breath, facing a wave of guilt. BEN ... Yeah. Of course. (then) Remind me where are you guys are, exactly? TY (V.O.) You been to Texas before? BEN (dammit) Texaaas. (then) Okay. Are you near Austin? TY (V.O.) We are not near Austin. BEN Dallas? TY (V.O.) Dallas ain’t Texas.  9. BEN Houston? TY (V.O.) Houston’s another country. BEN San Antonio? TY (V.O.) That’s another planet. BEN El Paso? TY (V.O.) That’s offensive, that you’d think we’d be from El Paso. BEN Why don’t you just tell me where-- TY (V.O.) Have you heard of Abilene? BEN No. TY (V.O.) Really? You’ve never heard of Abilene? The city? BEN No. TY (V.O.) Well, Abilene’s about three hours from Dallas. BEN Got it. TY (V.O.) And we’re",
      "dialogue_count": 0,
      "word_count": 554
    },
    {
      "scene_number": 2,
      "slugline": "INT. TEXAS AIRPORT - DAY Ben emerges at the terminal, a little ragged from travel. TY SHAW, rugged and tattooed and extraordinarily sensitive, deeply Texan, recognizes Ben instantly. TY Brother. Ty hugs Ben hard. INT./EXT. TY’S TRUCK/TEXAS STATE HIGHWAY I-20 - A LITTLE LATER [DRIVING] Ty drives his pickup truck on a long stretch of highway. TY So. You and my sister. BEN Yeah. Ty, I’m so sorry. TY I don’t know what to do. What to focus on. I’ve never been through anything like this in my life. BEN (gently) Well, I’ve heard one thing that helps is to share as many memories as you can. So the whole person becomes real to you again, not just the grief. TY Yes.   Yes.   Okay. What are your favorite memories? BEN Maybe you start. TY (thinks) She loved... the road. Trees. I mean, I’m picking things right in front of me - but that’s what she was like! She loved easily. She’d see something and just fall in love with it. That was Abilene. BEN That was Abilene.  11.",
      "characters": [],
      "action_text": "TY It doesn’t make any sense. An opiate overdose? Does that sound like the Abilene you know? BEN ... I don’t know what to say. TY Me neither, brother. Me neither. BEN Where, or when, did it -- TY Some party out in the oil fields, supposedly. I don’t know, I wasn’t there. I just got the call. Worst call of my life. BEN I’m so sorry. TY I mean, her being down here the past few weeks, all normal, hanging with us, at the factory, then all of a sudden this... It just feels so crazy. More driving. Long silences. Signs dot the landscape: “Pray for Rain.” “Cherish Life.” “Watch For Blowing Dust.” TY (CONT’D) How’s stuff been going in New York? BEN Good! Busy, but good. Writing’s going well. Producing a couple of podcasts that seem to be getting some traction. And I have a meeting with Ira Glass this week, so that’s the big news. TY Very exciting. Who is that? BEN He hosts   This American Life,   the radio program. Big producer, too. Does a lot of the big podcasts. He’s kinda my hero, so that’s cool. How about things for you?  12. TY You know, can’t complain. (beat) Actually, fuck it. My sister just died, I got a lot to complain about. A beat. Ben nods. BEN How much longer? TY Totally depends. Could be four hours. If we hit traffic, it could be four ten. EXT. FUNERAL - DAY A large outdoor service on a beautiful day. It’s a real funeral, and as in real life, it is something of a shock to be suddenly witnessing one. Ben sits in a back corner. He notices a surprising number of guns. SHARON, very early 40s, beauty hollowed by grief, powers through the end of her eulogy. SHARON ...And while she could be quite a handful when she was a girl... I suppose that might have been the influence of her mother. Or her father. Or her step-father. Or her other step-father. Lord knows I’ve made some interesting choices. Some affectionate laughter. SHARON (CONT’D) But whatever mischief she made, it always came from the best kind of spirit. A restless one. A searching one. A spirit that was fina",
      "dialogue_count": 0,
      "word_count": 8413
    },
    {
      "scene_number": 3,
      "slugline": "EXT. HONKY TONK - LATER - NIGHT A big open-air bar circling a line-dancing floor. The music alternates between modern country and hip hop. Two ROWDY STRANGERS approach Ben to taunt him. ROWDY STRANGER (re: Ben) Hey! It’s the Longhorns fan! TY (protecting him) Hey, it’s the why don’t you fuck the fuck off. A dance anthem (e.g., “Honky Tonk Badonkadonk”) starts. Kansas City runs out to the dance floor to join in. Ben stares at the huge MASS OF PEOPLE line dancing in unison. TY (CONT’D) You ever see anything like that? Ben shakes his head. BEN It’s kind of like a Bar Mitzvah, actually, but so much bigger. TY Everything’s bigger in Texas. (then) There’s our man. Sancholo. He nods his head towards a man, SANCHOLO, in the corner, with an ASSOCIATE. Ben steps towards him. TY (CONT’D) You want my gun? BEN You brought a gun? TY (concerned) Uh oh. Didn’t I? (checking pockets; by rote) “Keys, phone, wallet, gun...” Yep. All yours. BEN (re: gun) No thank you.  59.",
      "characters": [],
      "action_text": "He approaches Sancholo. A good journalist, this is one of Ben’s areas of confidence. BEN (CONT’D) Heard you were a good guy to know. SANCHOLO I got enough friends, faggot. BEN Just want to talk. SANCHOLO Mama taught me not to talk to strangers. BEN Just want to ask a couple questions. SANCHOLO Are you a cop? BEN I’m not a cop. SANCHOLO Cop doesn’t have to say he’s a cop. BEN Then why did you ask? SANCHOLO You’re wasting my time, figured I might as well waste yours. BEN Look. I’m not here to get you in trouble, all right? I’m a journalist. Obviously I know how to protect a source. This isn’t my first rodeo. EL STUPIDO But it is, Ben. It   is   your first rodeo. Ben turns to see Ty and El Stupido. BEN Technically this is the first rodeo I’ve been to.  60. SANCHOLO What’d’ya you think? BEN I really liked it. I liked the community spirit. SANCHOLO It’s a good energy, isn’t it? Wholesome. TY You fucking killer. Sancholo’s associate steps to Ty. Sancholo waves him off. SANCHOLO Go easy on him. He lost his sister, poor thing. Most beautiful girl in Texas. Lucky me: her last breath was on my shoulder. Ty charges Sancholo. Sancholo’s associate decks Ty, knocking him to the ground. El Stupido charges the Associate. Commotion -- the fight looks to escalate. Ben scoops up El Stupido to protect him and defuse it. BEN I knew her. Abilene. In New York. My name’s Ben Manalowitz, I’m doing a podcast about her. SANCHOLO What’d you say your name was? BEN Ben Manalowitz. Sancholo gestures to the alley outside. Ty gets up and tries to follow. Sancholo’s Associate stops him. SANCHOLO (to Ben) Just you, amigo. Ben follows into the dark alley. EXT. ALLEY OUTSIDE THE RODEO - MOMENTS LATER It’s dark now. Sancholo and his associate lead Ben down a deserted path to a small shed. The Associate frisks Ben and takes his iPhone. A SECOND ASSOCIATE blows an enormous cloud of vapor at Ben as he crosses his path.  61. INT. SHED OUTSIDE THE RODEO - A LITTLE LATER Ben sits on a chair across from Sancho",
      "dialogue_count": 0,
      "word_count": 1725
    },
    {
      "scene_number": 4,
      "slugline": "INT. SHERIFF’S OFFICE - A LITTLE LATER The Sheriff shows pictures of recent drug seizures -- boxes containing rectangular “Oxy Bars.” SHERIFF GONZALEZ These are Oxy Bars. See how the pills are squared off like a little candy bar, that way they can pack ‘em in boxes to the corners without wasting any space. That’s how big this business is. We don’t who’s shipping it, all we know is, they’re coming along the interstate right along the border. BEN And that route cuts right by the oil field, where the party was. SHERIFF GONZALEZ Yessir. I’d get you confirmation on that, but apparently no one was at this party. He shoots a teasing glance to the Deputies, who snicker. SHERIFF GONZALEZ (CONT’D) So we’re out of luck. BEN But this is your jurisdiction. SHERIFF GONZALEZ No sir. This was along the highway, that’s a matter for highway patrol. INT. HIGHWAY PATROL OFFICE - DAY Ben interviews two HIGHWAY PATROLMEN. HIGHWAY PATROLMAN Ain’t that just like a Sheriff to puff his hot air and blow you straight into my office. If there’s a drug overdose at a party in a fucking field off 29 -- well, I’m sorry, we got shit to do. We’re not a bunch of army rejects gazing at the Rio Grande. BEN I didn’t say you were.  69.",
      "characters": [],
      "action_text": "SECOND HIGHWAY PATROLMAN He ain’t talking about us. He’s saying this is a criminal incident that took place within fifty miles of the U.S. border. INT. BORDER PATROL OFFICE - DAY Ben is rattled as a BORDER PATROLMAN yells at him. BORDER PATROLMAN (furious) Oh, is   that   what they told you over at Highway Patrol? Well you can tell Junior Brown and the rest of ‘em glorified meter maids that if they spent more time with their real guns and less with their radar guns, we might not have to chase goddamn Texas Syndicate up and down the Trans-Pecos! Got it? BEN ...If I find a natural way to work it into the conversation, I’ll bring that up. Over CROSS-CUTTING of all four departments presenting Ben the same one-page CORONER REPORT labeling the death an accidental overdose (M.O.S.), we hear Ben updating Eloise. BEN (V.O.) There are four overlapping jurisdictions for where the party took place. P.D., which is city; Sheriff, which is county; Highway Patrol; and Border Patrol. INT. PUBLIC RADIO OFFICES - ELOISE’S OFFICE - DAY Eloise is on the phone with Ben. ELOISE I wonder if that’s a piece of the puzzle. Four departments where they bounce things from one office to the other. So it’s no one’s responsibility to solve.  70.",
      "dialogue_count": 0,
      "word_count": 437
    },
    {
      "scene_number": 5,
      "slugline": "EXT. SHAW FAMILY BACKYARD - DAY - INTERCUT BEN Exactly. And like everything else down here, it’s personal. So their cooperation is all dependent on their personal relationships. ELOISE You know, if this never gets solved, that actually could be a really good ending. Leaves the listener wondering forever. BEN And the family wondering forever. No. I have to solve it. INT. SHAW FAMILY HOME - ABILENE’S BEDROOM - NIGHT Ben watches videos. At a live venue: ABILENE (ON VIDEO) ... Thank you. You’re all so kind, so supportive. When I told my mama I was coming to New York to try to make it in music, she said, “bless your heart.” (some “aws” from the crowd) Which is Texas for “fuck you.” Some laughs. Ben laughs, too. ABILENE (ON VIDEO) (CONT’D) This one goes out to a man in my life who’s not here, and is probably never even going to watch this. But if he does... (to camera) You must think I’m crazy for caring so much about you so early. Well, I think you’re crazy for not caring so much yet. Ben reacts, with regret and longing. Abilene sings an original song. As the song continues, it scores a montage of scenes of Ben connecting more to the family: - Ben and Ty with Crawl at Ty’s vape “cloud chasing” competition.  71.",
      "characters": [],
      "action_text": "- Ben and Ty with Crawl at Crawl’s underground cage fight. - Ben line-dancing with the sisters and their friends; asking them questions after. - Ben helping El Stupido with his homework. - Ben interviewing lots of people in town. - Sharon and Ben go through a shoebox of photos of Abilene from childhood. Sharon pauses with tenderness at some of them; Ben sorts the ones that are of interest. He has Abilene’s phone next to him, trying passwords based on any potential clues he sees: sports jersey numbers, etc. Ben pauses on a photo of young Abilene smiling in a D.A.R.E. T- shirt. - Ben in the bathroom, brushing teeth, noticing a bottle of Advil. Curious, opens it. Safety seal is still on. - Ben at the diner. We see from body language with waitress, etc. that Ben is a regular there now. He’s editing sound. This connects to: INT. ELOISE’S APARTMENT - DAY Eloise is watching the clip of Abilene singing, enthralled by it. ELOISE (on phone) Her voice. It’s so... EXT. DINER - DAY - SAME TIME - INTERCUT Ben is eating a Frito Pie as he walks to his car, talking to Eloise with air pods in his ears. BEN Specific. ELOISE Yeah! It’s wonderful. Any luck with her phone? BEN No. No luck. ELOISE People in town?  72. BEN (eating) I think the answer is with the family. I just have to get closer. Listen harder. ELOISE What are you eating? BEN Frito Pie. ELOISE What is that? BEN They take a Frito bag and pour chili and stuff on it. ELOISE That sounds disgusting. BEN (laughing) Yeah, in a good way -- Ben’s Prius EXPLODES. Not as big as a mafia hit, but enough to seriously injure a person -- at least. And enough for that high-pitched piercing sound to resonate, and for a concussion to take us to black. On Eloise’s side of the call: confusion, concern. ELOISE Ben? Ben? INT. WEST TEXAS EMERGENCY ROOM - DAY A far West Texas emergency room. As much Spanish as English. Children running around. Overdose patients. Narcan (sort of an Epi-Pen for opiate overdoses) being administered in triage. INT. WE",
      "dialogue_count": 0,
      "word_count": 4283
    },
    {
      "scene_number": 6,
      "slugline": "INT. SHAW FAMLY HOME - KITCHEN - EVENING CLOSE ON: Ben pulls his phone out of a charger, at 100%, and clicks it in the other holster on his cowboy outfit. INT./EXT. TY’S TRUCK/HIGHWAY I-20 - NIGHT [DRIVING] Ty drives. Ben takes a phone call from Eloise. BEN (into phone) Yeah, hey. ELOISE (V.O.) Ira loves it. BEN Hm? INT. ELOISE’S OFFICE - NIGHT - INTERCUT ELOISE The piece you sent last night. You, lost. It’s beautiful. It’s perfect. It’s so raw, so real. BEN No, no -- ELOISE Ira wants to tease it on the show this Sunday and then debut the podcast. How soon can you get back here? BEN Delete it. ELOISE What? BEN Delete it. Pull it. I’m staying down here. I’m close. I know it in my gut. I gotta do this. For Abilene. ELOISE Ben... Eloise, in her office, puts her head against the window in caring frustration.  93.",
      "characters": [],
      "action_text": "ELOISE (CONT’D) Why do you think I’m doing this? Because I think it’ll win a Webby? It’s because I believe in you -- and this is you! No one cares about this one girl -- I mean, the listeners don’t, they don’t know her. Last night we finally did get to know someone: you. That’s the story. If we scrap this now... I don’t think there’s any coming back from it. A beat. ELOISE (CONT’D) Ben? BEN You don’t think this will win a Webby? She laughs and sighs. ELOISE Good luck. EXT. OIL FIELD - NIGHT A grandly wild scene. Two raucous IDIOTS are setting off fireworks. FIREWORKS GUY #1 Fuck yeah! Halloween fireworks, bitch! Orange and black! FIREWORKS GUY #2 I told you the black fireworks wouldn’t show you jackass! FIREWORKS GUY #1 I can see ‘em! EXT. OIL FIELD - LATER Celebration and depravity all around. Drugs and drinks. Ty eyes SOMEONE in a Santa costume. TY See that? Santa, already? That’s messed up. It’s not even Thanksgiving.  94. PARIS Maybe it’s late stage capitalism dressing up as itself. BEN Technically it’s a costume. Like any other costume. They all stare. TY It just feels wrong. BEN It does feel wrong. KANSAS CITY Imma do a lap. EL STUPIDO Same. TY (to El Stupido) You stay with me. Ben looks out at the seemingly endless party. He notices familiar faces half-hidden behind costumes. The field has an epic vastness to it, a dangerous energy. Guns everywhere, even on costumes that would never have them (e.g. doctor, bunny rabbit). Ben is startled by a thunderous grinding sound as the oil pumpjacks, on automatic timers, start to pump. One PARTYGOER IN A SOMBRERO is waiting for this moment atop the “Bush Machine,” the largest of the pumpjacks, and rides it like a bronco, unleashing a classic “grito” yelp. Ben takes it all in. TY (CONT’D) You all right? BEN I’ve been to some parties before but... When you get weird in Texas, you really get weird. TY Everything’s bigger in Texas. The boring is bigger, the crazy is bigger. Sancholo aggressively pushes past Ben -- cold, in c",
      "dialogue_count": 0,
      "word_count": 2936
    }
  ]
}