{
  "slug": "vice-2018",
  "title": "vice",
  "genre": "drama",
  "format": "film",
  "scenes_count": 14,
  "characters_count": 0,
  "characters": [],
  "total_words": 17065,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. WHITE HOUSE HALLWAY - DAY Rumsfeld continues down the hallway. Cheney follows. RUMSFELD You’re quiet. I like that. You’re not blabbing to everyone what cards you have. I missed my flush draw a month ago but everyone still thinks I have pocket kings. Except maybe fucking Haldeman. DICK I mostly play hearts so I’m not- RUMSFELD No, no, no. FREEZE NARRATOR (V.O.) For a man like Donald Rumsfeld he only wanted three things from his lackey: he had to keep his mouth shut, do what he was told and always be loyal. They stop by Rumsfeld’s office. RUMSFELD So is it a yes or a no? Half beat. DICK It’s a yes. RUMSFELD You don’t even know what the question is do you? DICK I, uh, I assume it was- RUMSFELD Good. That’s exactly the kind of “yes” I was looking for. NARRATOR (V.O.) Cheney had always been a so so student and a mediocre athlete. But now finally he had found his life's calling, he would be a dedicated and humble servant to power. 14.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 178
    },
    {
      "scene_number": 2,
      "slugline": "INT. WHITE HOUSE - CHENEY’S OFFICE - DAY Cheney enters his office. It’s basically a closet with a desk, phone and a chair. STAFFER Here’s your new office. No windows. But all you’d see is a bunch of hippies flipping off Nixon. He sits down and picks up his phone. NARRATOR (V.O.) Now at this point you're probably wondering who exactly I am. INT. MIDDLE AMERICA HOME - 2011 - DAY A DAD, 29 and MOM, 28 play with their SON, 2, on the couch. NARRATOR (V.O.) Well my name is Kurt. My favorite football team is the Steelers. And me and my son love watching Sponge Bob. And if you are wondering how I know so much about Dick Cheney, well let's just say we are kind of related... We’ll get to that later. BACK TO: INT. WHITE HOUSE CHENEY’S OFFICE Dick is talking to Lynne on the phone and beaming with pride. DICK Lynnie... guess where I’m calling from? INT. SMALL APARTMENT IN D.C. - SAME TIME Lynne is on the phone holding her new BABY MARY while LIZ, now 3 plays in the background with the TV on. Intercut phone call: LYNNE I am so damn proud of you right now Dick Cheney... I knew I picked the right man. I knew it even when I didn’t... 15.",
      "characters": [],
      "action_text": "DICK We did it. LYNNE Have you seen Nixon? DICK I did. I met him. Shook his hand. That impish smile of his. FLASH TO ACTUAL STILL of Nixon with an odd smile posing for camera. DICK (CONT’D) Pardon my French, but it’s the best fucking feeling in the world. LYNNE I am so proud of you. DICK I love you. LYNNE WE are proud of you. Your girls are proud of you. (to girls) Are you proud of your Daddy? YOUNG LIZ Yes! INT. WHITE HOUSE HALLWAY - DAY Rumsfeld and Cheney are walking down a hallway. DICK Now that I’m not just flipping cards, I have a few ideas-- RUMSFELD (suddenly) Stop. They both stop. RUMSFELD (CONT’D) You see that door? He motions to an office door. DICK Isn’t that Kissinger’s office? 16. RUMSFELD Yes, but I happen to know that Nixon’s in there right now. Now why would Nixon not meet Kissinger in the Oval Office? DICK He’s having a conversation he doesn’t want to go on the record? RUMSFELD Very good. DICK What’s the conversation? RUMSFELD They’re going to bomb Cambodia. DICK That’s impossible. That would have to be approved by Congress and I’m over there every day- RUMSFELD Fuck Congress. Unless you’re in it. Then it’s the greatest deliberative body on earth. But we’re not, so fuck it. DICK I thought the President campaigned on ending the war? RUMSFELD Shhhh. Listen to me... GLANCING PIECES OF NIXON AND KISSINGER TALKING: A cigarette being put out in an ash tray. A polished shoe tapping, etc. RUMSFELD (V.O.) Because of the conversation Nixon and Kissinger are having right behind this door, five feet away from us... in a few days, 10 thousand miles away... EXT. CAMBODIAN VILLAGE - DAY - SAME TIME A peaceful Cambodian Village goes about it’s day to day life. We hear a WHISTLING SOUND far above. 17. RUMSFELD (V.O.) ... a rain of 750 pound bombs dropped from B-52s flying at twenty thousand feet will hit villages and towns across Cambodia...thousands will die and the world will change either for the worse or the better. We SNAP BACK TO THE HALLWAY. Cheney enthralle",
      "dialogue_count": 0,
      "word_count": 1094
    },
    {
      "scene_number": 3,
      "slugline": "EXT. CHENEY HOME IN MARYLAND 1973 Dick holds Lynne in his arms. LYNNE (in shock) She doesn’t swim, Dick. My Mother doesn’t swim. She never swam. EXT. GRAVE YARD - FUNERAL - DAY About 20 MOURNERS including Lynne, Dick, Dick’s parents, Liz and Mary and yes, Wayne, Lynne’s Father listen to a priest read from the Bible as a coffin is lowered into the ground. NARRATOR There was never a serious investigation into Lynne's Mom's death. THE FUNERAL HAS ENDED. WAYNE IS TRYING TO DO A HANDSTAND FOR LIZ AND MARY. Lynne stops him. LYNNE Dad...Dad... Dick walks over. DICK Girls, Lynne. Why don’t you go to the car. LYNNE (raspy from crying) Come on. Listen to your Father. They leave. Dick is intense. WAYNE Heya Dick. You catching any fish? THERE IS A RESOLUTE LOOK IN DICK’S EYES. He stares at Wayne. WAYNE (CONT’D) How’s it going in DC? DICK Don’t ever go near my daughters or my wife again. A tense beat. Then Wayne finally walks away. 21.",
      "characters": [],
      "action_text": "WAYNE (yells) Big shot! Big shot in D.C. Dick! Dick stares straight ahead. He has a resolute quiet power about him. He can feel it. CUT TO: INT. WHITE HOUSE OFFICE - 2003 - MORNING CLOSE UP: a basket of plain brown donuts, flaking croissants and one GLORIOUS DANISH WITH A BRIGHT YELLOW CENTER. HANDS REACH IN and take a few brown donuts, a croissant. BUT THEY STAY AWAY FROM THE DANISH WITH THE YELLOW CENTER. Finally, Cheney TAKES THE LARGE TREAT. FOUR WHITE MEN IN SUITS (CIA AGENT, SCOOTER LIBBY, DAVID ADDINGTON AND PAUL WOLFOWITZ) ages 35 to 55, all wait for him to speak. The room is his. DICK So what do you got? The Unseen Man’s hand flips through papers marked CLASSIFIED. CIA AGENT (slightly nervous) Hassan Mustafa Nasr. A cleric based in Milan, Italy. He’s a member of Al-Gama’s al-Islamiyya, the group that killed Anwar Sadat. SCOOTER LIBBY That’s the blind sheik, right? CIA AGENT There’s some debate at Langley on whether they’re a threat or not. They claim to be peaceful now. He holds up the danish he’s eating. DICK I “claim” to be eating healthy. Everyone laughs a bit too hard. DICK (CONT’D) Okay... pick him up. 22.",
      "dialogue_count": 0,
      "word_count": 375
    },
    {
      "scene_number": 4,
      "slugline": "EXT. STREET IN MILAN - DAY POV: A DOOR OF A VAN SLAMS OPEN: A CLERIC, 40, with beard, wearing a Muslim taqiyah (cap) walks down an Italian street. THREE MEN IN ALL BLACK JUMP OUT, CHASE HIM DOWN AND PULL HIM INTO THE VAN IN A MATTER OF SECONDS. CLERIC NOO! Help! Help me! QUICK CUTS: 1. Scissors slice off the Cleric’s clothes 2. He is struck hard in the face 3. A black hood is put over his terrified bloodied face. 4. A diaper is then put on him. THE VAN DRIVES AWAY. BACK TO: INT. OFFICE - 2003 - MORNING DICK What’s the next name? CIA AGENT Well Mr. Vice President, there’s been some chatter about an engineering student in Berlin... FADE TO BLACK RICHARD NIXON (V.O.) I have never been a quitter. INT. CHENEY’S LIVING ROOM - 1974 - DAY TV in the Cheney’s living room shows Nixon resigning as President. RICHARD NIXON (SOT) But I must put the interests of the nation first... DICK Nixon forgot the voice activated recorders were there. He got sloppy. LIZ Mom, is the President being punished? 23.",
      "characters": [],
      "action_text": "LYNNE The President has a lot of enemies. Never forget Lizzy: when you get power they always try and take it from you. Always. LIZ Yes M’am. Dick dials the phone. DICK Donald Rumsfeld please... LYNNE I can’t believe this, this is our President. This is a tragedy! DICK I actually think this could be very, very good news. MUSIC: Kicking 70’s horns come in. This is starting to feel like good news. EXT. DULLES PARKING LOT - SAME TIME Rumsfeld gets into Cheney’s beat up black VW Bug in the airport parking lot. Both toss their cigarettes. RUMSFELD What’s your read on things? DICK The way I see it, any Republican not touched by Watergate is golden right now. RUMSFELD Nice. Ford called me right before my flight took off. (sees black bug) You’re still driving this chick magnet, huh? CHENEY You can always take the bus. CLOSE UP ON TELEVISION. 24. RICHARD NIXON (SOT) Effective immediately I will resign the Presidency of the United States and Vice President Ford will be sworn in tomorrow at noon. INT. VW BUG - PENNSYLVANIA AVE - SAME TIME Both are smoking again as they pull up to the White House. RUMSFELD So what’s the plan? DICK The plan? Well the plan is to take over the damn place... RUMSFELD Who lit a fire under your ass? DICK I haven’t flipped cards in a long time Don. INT. RUMSFELD’S NEW OFFICE - MOMENTS LATER RUMSFELD CLOSES THE DOOR TO HIS BIG NEW OFFICE. RUMSFELD They gave me the damn keys to the palace! He pours two Glenlivet neats. RUMSFELD (CONT’D) Chief of Staff. DICK Holy shit. You salty son of a bitch. You did it. They clink and drink. RUMSFELD Now we have work to do. Kissinger is trying to kiss and make up with the Soviets. DICK Well, let’s make sure that shit doesn’t happen. 25. RUMSFELD (laughing) Yeah. Yeah. INT. OVAL OFFICE - WHITE HOUSE - SAME TIME Ford talks with Kissinger, Rumsfeld and Cheney. CHENEY If I may, I believe I may have a way to put an ore in the water, on Russia. What if- KISSINGER Mr. President- FORD Come on Henry let’s hear Dick out. NARRATO",
      "dialogue_count": 0,
      "word_count": 686
    },
    {
      "scene_number": 5,
      "slugline": "INT. CHENEY’S NEW OFFICE - DAY - NOVEMBER, 1975 Lynne spins around her husband’s well appointed office. LYNNE --the youngest Chief of Staff in history! It’s like a dream. DICK It’s real. And Don is the youngest Secretary of Defense ever. LYNNE Well, I’m not talking about Don, I’m talking about you. And I’m going to give you a kiss, right her in the White House. She holds Dick. They kiss. A SECRET SERVICE AGENT peeks in the door with Liz and Mary in tow. SECRET SERVICE AGENT Excuse me Mr. and Mrs. Cheney. These girls tried to enter the Oval Office. They run into Dick’s arms. DICK Oh dear! LYNNE Girls this is not a playground, please do not-- MARY Daddy! Is this where Santa lives? DICK Better than Santa. It’s where the leader of the greatest nation on earth lives! MARY Are you one of his elves Daddy? DICK In a way, yes. LYNNE No he’s not Mary. Your Father is Chief of Staff. Chief. Of Staff. (MORE) 27.",
      "characters": [],
      "action_text": "(to him) Dick, if you’re silly with her she’ll grow up to be a silly woman. DICK Right of course, I forgot, that’s just silly, Mary. INT. OFFICE OF LEGAL COUNSEL - DOJ - THE NEXT DAY Cheney talks to a YOUNG LAWYER at the OLC. NARRATOR (V.O.) And as the new Chief of Staff and with the Presidency weakened by Watergate, Dick Cheney wanted to find out exactly how much power did the President have. DICK I would like to reinstate Executive Authority. How? NARRATOR (V.O.) Antonin Scalia, a young lawyer with the justice department who would later go on to serve on the Supreme Court, rocked Dick’s world. YOUNG LAWYER Have you heard of the theory of the unitary executive? DICK No, tell me about it. YOUNG LAWYER It’s an interpretation a few, like myself happen to believe, of Article two of the Constitution that vests the President with absolute executive authority. And I mean absolute. Cheney and Scalia both smile. This is what Cheney has been looking for. MUSIC: GLORIOUS ORCHESTRAL STING. VT footage of a Lion chasing a gazelle and catching it. LYNNE (CONT'D) 28.",
      "dialogue_count": 0,
      "word_count": 361
    },
    {
      "scene_number": 6,
      "slugline": "INT. MIDDLE AMERICA HOME - DAY Narrator Dad plays with his son on the floor. NARRATOR (to wife) Honey, you wanna get Cole up to the high chair? I gotta explain this to the people. WIFE (picking up son) Come on buddy! IMAGES OF THE WHITE HOUSE, THE SCALES OF JUSTICE AND SOLDIERS AT WAR. NARRATOR (V.O.) The Unitary Executive Theory. Certain legal scholars believe that if the President does anything it must be legal because it’s the President. To hell with checks and balances, especially during times of war. This was the power of kings, pharaohs, dictators, FREEZE ON DICK CHENEY NARRATOR Dick Cheney was a foot soldier in the power games of Washington DC, but with the Unitary Executive Theory, he could become Galactus, devourer of planets, Image of the super villain... GALACTUS NARRATOR (CONT’D) But then it was Election Day and there was one big problem... INT. RESIDENTIAL QUARTERS - WHITE HOUSE - NIGHT Ford, Betty Ford, Cheney, Lynne, Rumsfeld watch the returns on ABC NEWS with BARBARA WALTERS and HARRY REASONER. Cheney is chain smoking. They all sip cocktails. TV SCREEN reports Carter winning presidential election 29.",
      "characters": [],
      "action_text": "BARBARA WALTERS (SOT) ...Which means that Jimmy Carter is the next President of the United States. NARRATOR (V.O.) And just like that it was all over. LYNNE That can’t be right. It got to be some sort of a mistake. RUMSFELD Well...there goes the neighborhood. FORD (his voice is horse) Thank you everybody. TV REPORTER (V.O.) The Republicans have lost the Presidency, they are the minority in Congress and in most states. With America demanding change, I don’t see a future for the GOP. They are the party of the past. EXT. WHITE HOUSE ROOF - 1976 Maintenance workers install giant solar panels on the roof of the White House. DAVID BRINKLEY (SOT) President Carter went to the roof of the White House today to announce his new solar initiative... VT President Carter speaking to the press. PRESIDENT CARTER (SOT) We must end our dependence on fossil fuels. And by the using the energy God gave us in the sun, we may have an endless source of power with solar energy... 30.",
      "dialogue_count": 0,
      "word_count": 364
    },
    {
      "scene_number": 7,
      "slugline": "EXT. WYOMING RIVER - 2012 - DAY Cheney trudges through a river with fishing gear in hand in slo-mo. He is older, unsteady, but determined and focused. CUT TO: EXT. SMALL TOWN IN WYOMING - DAY - SUMMER - 1978 A VFW IN A ONE STOP SIGN TOWN. A beat up Winnebago with a shabby “Cheney for Congress!” on it parked out front. INT. SMALL TOWN VFW - DAY - SUMMER - 1978 Cheney speaks to RANCHERS at a VFW. It’s hot. DICK ...I will become the gentleman from Wyoming. And hear this, taxes must come down. Lynne coaches from the back of the room. LYNNE (whispers) Talk. Talk. DICK I’ll say it again, taxes must go down, we must ameliorate pain for the taxes of the working man....and bring perspicacity to the fore. Lynne watches, pained. He’s not good at this. The Campaign Manager leans in. CAMPAIGN MANAGER (whispers) Thank God for name recognition. DICK But enough of the horsing around. Which is of course, what us cowboys do. So uh, remember, vote Cheney for Congress. Uhh, thank you and vote for Cheney in Congress. LYNNE Either he drinks next time, or I do. 31.",
      "characters": [],
      "action_text": "Crowd applauds tepidly. Dick walks over to Lynne and his Campaign Manager. He’s rubbing his arm. DICK I don’t want anyone to panic. But I do believe I have to go to the hospital. FADE UP ON AN ACTUAL HEART BEATING AND THEN STOPPING AND THEN BEATING ERRATICALLY BEFORE FINALLY IT STOPS. QUICK CUT: A CUCKOO CLOCK STRIKING TWELVE: A cuckoo pops out. INT. HOSPITAL ROOM - DAY Cheney is in bed, IV coming out of his arm, heart monitors beeping. Lynne is there by his side. A DOCTOR, 39. DOCTOR It’s an inferior wall infarct. LYNNE But it can be fixed, right? DOCTOR If it was up to me you’d drop out of the election. But you’ve both made it clear that’s not an option. So you must have a minimum of two weeks bed rest. DICK Two weeks off. We’ll lose our lead. LYNNE The hell we will. EXT. RANCH - DAY A microphone stand on the back of a truck and a crowd of fifty HARD FACED MALE FARMERS AND RANCHERS waiting. A good ol boy RANCH OWNER, 59, intros. MAYOR Dick Cheney has an illness so he can’t be here today. But we have his wife and a heck of a pretty gal here to fill in: Lynne Cheney! Lynne walks up to the Podium. SHE IS TOO SMALL TO REACH THE MICROPHONE. THE CROWD LAUGHS. Lynne takes the mic off. 32. LYNNE I grew up in Wyoming. But somewhere along the line Washington DC stopped listening to real folks like us! And started only listening to liberal snobs who want us all to lose our jobs to affirmative action! Awkward silence. The Campaign Manager tries to usher her off. CAMPAIGN MANAGER Okay Lynne... The crowd EXPLODES in applause. Lynne pushes the Manager’s hand away. LYNNE When I was in New York City I saw women burning their bras. Well you know what women do with bras in Wyoming? We wear them! Crowd applauds lustily again. The Campaign Manager looks around “What the hell is happening?” EXT. WYOMING RURAL AREA A VAN weaves through a windy dirt road. LYNNE (V.O.) Here in Wyoming we believe there is a right and a wrong. INT. CHURCH BASEMENT - DAY A Ladies Auxiliary Meeting. Some wome",
      "dialogue_count": 0,
      "word_count": 1040
    },
    {
      "scene_number": 8,
      "slugline": "INT. HALLWAY - CAPITOL BUILDING - DAY - 1984 Dick COLLAPSES IN THE HALLWAY, going to his knees. MUSIC: OUT PANICKED AIDE Someone call an ambulance!! (to Cheney) Can you breathe? DICK I’m having a heart attack you idiot. INT. WHITE HOUSE - EAST WING - NIGHT - 1986 White House CHRISTMAS PARTY. REAGAN AND NANCY (from behind) meet and greet celebrities, leaders and friends like Royalty. REVEAL: Lynne and Cheney ENTER like a Duke and Duchess. Dick looks dashing in a tux and Lynne stunning in a tasteful gown. ON SCREEN: “Dick Cheney House Minority Whip 1989” and “Lynne Cheney Chair of the National Endowment for the Humanitites 1986-1993” Quick shots of people at the party CATCHING GLIMPSES OF THE CHENEYS, some whisper, some smile. LYNNE (finishing a conversation) Thank you... I’m very excited. The couple she was talking to walks away. LYNNE (CONT’D) They’re both brilliant, but broke. VICE PRESIDENT GEORGE BUSH SR. walks up. GEORGE BUSH SR Hey Dick... Hello Lynne. Congratulations on your appointment. LYNNE Why thank you Mr. Vice President. How is your lovely family? 36.",
      "characters": [],
      "action_text": "GEORGE BUSH SR My son Jeb seems cut out for office. We may be asking you for endorsements in a few years. LYNNE If he’s half as charming as you George, he’s got both our votes. GEORGE BUSH SR Dick. I just wanted to say thank you for getting the House not to override the President’s veto of the fairness doctrine. DICK Not a problem. Happy to get rid of any big government regulations. FREEZE NARRATOR (V.O.) The fairness doctrine was a law from the forties that required any broadcast TV or radio news to present both sides of an issue equally. Its repeal would lead to the rise of opinion news. QUICK CLIPS OF MORTON DOWNEY JR, RUSH LIMBAUGH, AND THEN A GIANT FOX NEWS ANIMATED LOGO “FAIR AND BALANCED.” INT. NEWSROOM - MODERN DAY 30’S FEMALE BLONDE ANCHOR AT A NEWS DESK NEWS ANCHOR (To camera) ... And eventually to the realization of Roger Ailes’ dream: Fox News. Which would go on to dominate all other news and swing America even more to the right. CUT BACK TO: INT. CHRISTMAS PARTY - NIGHT UNFREEZE: There’s a CRASH on the other side of the party. We see a LANKY DRUNK GUY who’s knocked over a tray of champagne glasses. A waitress is distraught. 37. LANKY DRUNK GUY Lighten up sweetie! It’s a party! DICK What’s that fella’s problem? GEORGE BUSH SR Let me go see if everything’s okay over there. Great to see you both. Love to the girls... George goes over to the young drunk man and ushers him out. LYNNE (quietly) That’s his son. George W. He’s the black sheep of the family. DICK A little too much unconditional love. LYNNE Can you feel it Dick? Half the room wants to be us and the other half fears us. I know George is up next but after that, who knows? She rubs her hand against his back. DICK (takes it in) I respect the hell out of Reagan... But no one’s really shown the world the true power of the American Presidency... SMASH CUT TO: EXT. VIRGINIA HIGH SCHOOL - DAY MARY CHENEY, now 17, leaves school SOBBING HARD. A TEACHER FOLLOWS HER. TEACHER Excuse me Ms. Cheney! You cannot l",
      "dialogue_count": 0,
      "word_count": 5050
    },
    {
      "scene_number": 9,
      "slugline": "EXT. LINE OF CARS STOPPED AT A RED LIGHT - DAY Track past cars, hearing their RADIOS. A mixture of sports talk, classic rock and a fair amount of RIGHT WING RADIO. SNIPPETS OF TALK RADIO (V.O.) Folks, the government is taking your money AFTER you die!... It’s a death tax... Death tax... The liberals want you to pay a tax when you die! etc. QUICK CUTS TO WEB PAGES: DRUDGE REPORT, THE WASHINGTON TIMES, NEWS MAX: “DEATH TAX MUST GO!” INT. MIDDLE AMERICA HOME - DAY Kurt the Narrator plays on the floor with his son while Mom makes lunch in the kitchen. Reports on the Death Tax blares on the TV with our BLONDE ANCHOR at the desk. NEWSCASTER (SOT) The liberals would tax you for laughing or crying if they could. NARRATOR So with one of the biggest media and political machines every created behind him, Cheney was able to squash action Global Warming, cut taxes for the super rich and gut regulations for massive corporations. CUT TO: INT. NEWSROOM - DAY 30’S FEMALE BLONDE ANCHOR AT A NEWS DESK NEWSCASTER And then there was Cheney’s National Energy Policy Development Group. His first major test to expand executive power. INT. OFFICE OF THE VICE PRESIDENT - DAY Libby, Addington and Cheney sit in Cheney’s office. 64.",
      "characters": [],
      "action_text": "DICK CHENEY I don’t understand what the goddamn problem is! I want to hear what the energy CEOs need and I’m not allowed to? SCOOTER LIBBY It’s called FACA. DICK What the hell is FACA? DAVID ADDINGTON It’s the Federal Advisory Committees Act. Congress got their panties in a bunch that elected officials would just let CEOs roll in and, you know, write the laws. SCOOTER LIBBY The Act demands that appropriate government officials be present. Tense beat DAVID ADDINGTON Hold on a second. Addington picks up the phone and dials. DAVID ADDINGTON (CONT’D) Hello? What’s your name?... Doug? Doug, how long have you been working reception at the Department of Energy? Three months? Perfect. INT. WHITE HOUSE MEETING ROOM - DAY CU: NAME TAG READING “DOUG.” Some guy in a Men’s Warehouse suit, DOUG, 24, sitting in the corner of a conference room. DOUG So what am I supposed to do? DAVID ADDINGTON Just sit there and be quiet. Cheney and Addington sit at the large table very far away. Two men walk in, FACES PIXILATED AND VOICES DISTORTED. 65. DICK Hello (BEEP) and (BEEP). How’s business at (BEEP)? OTHER MAN We’re good. (BEEP) has been performing quite well and (BEEP) and (BEEP) are quite optimistic. They all shake hands and have a seat. ADDINGTON (pointing to Doug) Oh, he’s with the Energy Department. Doug now listening to music on his head phones gives a chipper thumbs up. INT. ENVIRONMENTAL GROUP’S HEADQUARTERS - DAY CU of hands opening a large envelope and removing copies of maps that are laid on a table. NARRATOR (V.O.) The details of Cheney's meetings with the energy CEO's were never disclosed. CU on a MAP OF ALL THE IRAQI OIL FIELDS with OIL COMPANIES’ NAMES ON THEM... NARRATOR But a freedom of information request did provide some documents, including a map of Iraq's oil fields with all of the oil companies that would be interested in acquiring them if “somehow” they were ever to become available. We pan over the map. Seeing names like Exxon, BP, Shell etc. NARRATOR (CONT’D) And t",
      "dialogue_count": 0,
      "word_count": 4152
    },
    {
      "scene_number": 10,
      "slugline": "INT. SMALL ROOM - IRAQ - SAME TIME Zarqawi and five other TERRORISTS watch Powell on a laptop. POWELL (on TV) Iraq today harbors a deadly terrorist network headed by Abu Musab Zarqawi, an associate and collaborator of Osama Bin Laden and his Al Qaeda lieutenants. NARRATOR (V.O.) Powell’s UN Address was seen by millions of Americas. But other people were watching as well. POWELL (on TV) Zarqawi's activities are not confined to this corner of Northeast Iraq. NARRATOR (V.O.) The great general of America saying his name over and over again immediately made Zarqawi a star. ZARQAWI Allah Akbar! NARRATOR (V.O.) Within a day he had gone into hiding. OTHER TERRORISTS Allah Akbar! Allah Akbar! INT. U.N. GENERAL ASSEMBLY - CONTINUOUS POWELL ...an Al-Qaeda source tells us that Saddam and bin Laden reached an understanding that Al-Qaeda would no longer support activities against Baghdad. NARRATOR (V.O.) By the time we invaded Iraq 70% of Americans thought that Saddam Hussein was involved in 9/11. Powell shuffles his papers. 86.",
      "characters": [],
      "action_text": "NARRATOR (V.O.) Later Colin Powell would call the speech the most shameful moment of his life. POWELL Thank you. FADE TO BLACK: INT. DINING ROOM - NIGHT Dick Cheney, Lynne, Liz, Philip, Mary and her girlfriend Heather eat a LAVISH FISH DINNER with the grandkids. They laugh and talk over each other. MARY It was Kelly. And the Justin DICK What are you talking about? MARY American Idol. LIZ You’ve watched it. You’ve seen it. MARY We watched it at your house.   LIZ (CONT'D) I watched it sitting next to you. LIZ (CONT’D) The singing and mean judge. DICK Oh, I like him. Everyone is drinking and laughing DICK (CONT’D) How do you stop a fish from smelling? LIZ I don’t know.   DICK (CONT'D) You cut off his nose. LYNNE Ok, we aren’t going to revisit your father’s colorful conversation. CUT TO: 87.",
      "dialogue_count": 0,
      "word_count": 313
    },
    {
      "scene_number": 11,
      "slugline": "EXT. BAGHDAD - MARCH 20, 2003-   NIGHT STOCK FOOTAGE: The skyline of Baghdad explodes with rockets. INT. OVAL OFFICE - WHITE HOUSE W Bush talks to camera addressing the nation. W BUSH My fellow citizens, at this hour, American and coalition forces are in the early stages of military operations to disarm Iraq, to free its people and to defend the world from grave danger. On my orders, coalition forces have begun striking selected targets of military importance to undermine Saddam Hussein's ability to wage war. These are opening stages of what will be a broad and concerted campaign. To all of the men and women of the United States armed forces now in the Middle East, the peace of a troubled world and the hopes of an oppressed people now depend on you. W Bush’s leg bops up and down nervously under the desk. INT. APARTMENT IN BAGHDAD - SAME TIME An IRAQI FAMILY cowers under a table. The Father’s leg also bounces up and down. EXT. BAGHDAD - SAME TIME POV VT FEED: A CRUISE MISSILE HITS THE APARTMENT BUILDING EXT. IRAG DESERT - DAY - 2003 US SOLDIERS run alongside a tank. Bodies burning in the street. MONTAGE - EXT. IRAQ -DAY A CROWD OF IRAQIS pull down the statue of Saddam and put an American flag over his head. 88.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 225
    },
    {
      "scene_number": 12,
      "slugline": "EXT. AIRCRAFT CARRIER - APRIL 9, 2003 - DAY ACTUAL VT: WIDE SHOT: W BUSH lands on the aircraft carrier in his flight suit (STOCK FOOTAGE/HEAD REPLACEMENT). EXT. VAST WYOMING FIELD - DAY Lynne, Dick, Liz, Philip, Mary, Heather, RIDE ACROSS A FIELD ON HORSES IN MODERN WESTERN GARB. They stop and pose in a line. We FREEZE. It is magnificent. EXT. TAILGATE - DAY PUMPED UP AMERICANS with USA caps and beer, chant to camera. AMERICAN TAILGATERS USA! USA! USA! EXT. IRAQ - DAY Kurt the Narrator talks to us into a video camera. NARRATOR Hi. Seems like they’ve been shipping men and equipment out of Afghanistan and into Iraq. And at the moment we’re a little unsure of what’s going on. I don’t want you to worry about me. EXT. AIRCRAFT CARRIER - APRIL 9, 2003 - DAY ACTUAL VT: W BUSH speaks from a podium. (STOCK FOOTAGE/HEAD REPLACEMENT). W BUSH Ladies and Gentlemen... Major Combat operations in Iraq have ended.   In the Battle of Iraq, the United States and our allies have prevailed. INT. RUMSFELD’S OFFICE - DAY Cheney, Rumsfeld, Wolfowitz and TWO GENERALS meet. GENERAL #1 We have concerns over Halliburton KBR’s billing practices. (MORE) 89.",
      "characters": [],
      "action_text": "As you know, the no-bid contracts they received were quite sizable and now- RUMSFELD Well, we’re not concerned. Are we? DICK Not at all. WOLFOWITZ The Secretary of Defense and the Vice President just said they’re not concerned. Now can we please talk about Iran? EXT. TEXAS SKY - DAY - 2006 Birds fly across a late morning Texas sky. We hear a SHOTGUN BLAST AND A SCREAM. Tilt down to reveal a lawyer, 78, HARRY WHITTINGTON with blood all over his face. It is a hunting group: PAMELA WILLEFORD, Cheney, holding a smoking gun, a RANCH HAND, SECRET SERVICE AGENTS and OTHERS sitting in town cars parked across from the hunting blind. NARRATOR To this day, Dick Cheney has never apologized for this incident. KATHERINE ARMSTRONG, late 50’s and her sister run up. KATHERINE ARMSTRONG Jesus Dick.. CU OF AN EMPTY BEER CAN. NARRATOR (V.O.) But, someone else did. CUT TO: TV SCREEN: BREAKING NEWS MSNBC - DAY HARRY WHITTINGTON My family and I are deeply sorry for all that Vice President Cheney and his family have had to go through this past week. We send our love and respect to them. GENERAL #1 (CONT'D) (MORE) 90. And we hope he will continue to come to Texas and seek the relaxation that he deserves. INT. CHENEY’S OFFICE - DAY Cheney and Scooter look at the famous Op-ed in the NY Times by Joe Wilson questioning the yellowcake intel. DICK This Joe Wilson asshole is questioning our intelligence in the New York Times? What’s his wife’s name? SCOOTER LIBBY Valerie Plame. I confirmed it. She’s undercover CIA. DICK Leak it... SMASH CUT TO: “ONE YEAR LATER” EXT. ROAD OUTSIDE OF BAGHDAD - DAY - 2004 A road near some Iraqi apartments. A CONVOY OF AMERICAN HUMVEES MAKES THEIR WAY DOWN THE ROAD. Two SOLDIERS, 19 AND 29 sit in the front of one of the vehicles. SOLDIER #1 Okay, okay, like... they don’t care about their dogs. They’ll shoot em, let em run wild... What kind of people don’t love a dog? SOLDIER #2 People in India love cows. They would look at us and how we treat cows and think the same t",
      "dialogue_count": 0,
      "word_count": 1687
    },
    {
      "scene_number": 13,
      "slugline": "INT. SURGICAL ROOM - DAY Cheney is wheeled into the surgical room. INT. MORGUE - SAME TIME The NARRATOR WITH CROSS HATCHED STITCHING ACROSS HIS CHEST, nude, lays on a morgue slab. NARRATOR (to camera) They say my heart could give him another ten years. Cheney doesn’t like to refer to it as someone else’s heart, he likes to refer to it as his NEW heart. And even though I’m dead, it still makes me feel pretty shitty. A helicopter lands on the roof of the hospital. A doctor runs with a cooler. INT. SURGICAL ROOM - CONTINUOUS The SURGEON AND TEAM make an incision in Cheney’s chest. NARRATOR (V.O.) And so, when Liz decided to run for one of Wyoming two senate seats against Republican incumbent Mike Enzi, our Dick was right there to hopefully see the Cheney legacy of power continue. INT. CHENEY’S LIVING ROOM - DAY CU of a phone. We hear a RECORDING OF MAN’S VOICE coming through the receiver. RECORDING (SOT) Are you aware Wyoming Senate candidate Liz Cheney supports gay marriage? Her sister is married to a woman and Liz refuses to support a constitutional amendment banning same sex marriage. Don’t you agree, Wyoming deserves a Senator who believes marriage is between a man and a woman. Liz, in tears puts down the phone. 98.",
      "characters": [],
      "action_text": "LIZ CHENEY (in tears) These calls went to every house in Wyoming. Every single house.   I will never win! What are we gonna do? INT. SURGICAL ROOM - CONTINUOUS The Surgeon has the chest spreader out and opens up Cheney’s chest, revealing his heart. INT. NEWS STUDIO - DAY Liz being interview by male news anchor. MALE NEWS ANCHOR We’re joined here today by Liz Cheney who is running for the Senate from the state of Wyoming. According to one poll she is behind by double digits. Welcome. LIZ CHENEY Thank you for having me here Chris. And may I point out there are other polls that have me much closer. MALE NEWS ANCHOR Your opponent Senator Mike Enzi claims you support gay marriage. In part because you support your gay sister’s union with her wife. How do you respond? LIZ CHENEY Let me make this very, very clear: I do not support gay marriage. I believe marriage is between a man and a woman. MALE NEWS ANCHOR But you’ve always claimed gay marriage is a state issue. Your opponent claims this is an equivocation. INT. CHENEY’S TV ROOM - VIRGINIA - NIGHT Cheney and Lynne watch. Cheney is silent. 99. LYNNE I think she’s coming off very well. INT. MARY CHENEY'S HOME - THE NEXT DAY Mary is on the phone with Heather behind her. Their children’s toys scattered on the floor. MARY (in tears) I know Liz wouldn’t have done this without you and Dad didn’t approve. I can’t believe you would do this. I really thought there was a limit to politics.. INT. CHENEY’S VIRGINIA HOME - SAME TIME Lynne is on the phone. LYNNE No now you’re just being hysterical. I can’t talk to you when you get this way. You need to settle down. Dick sits in the background. INT. SURGICAL ROOM - CONTINUOUS The Surgeon removes Cheney’s heart. We see Cheney on the table. A hole where the heart should be. Even the Surgeon takes a beat to take in the image. QUICK CUTS SHOWING: 1) A Soldier’s body in a casket as a group of soldiers salute. 2) Bodies burning in the streets of Iraq. 3) Rumsfeld alone in the Pentagon basemen",
      "dialogue_count": 0,
      "word_count": 648
    },
    {
      "scene_number": 14,
      "slugline": "INT. CHENEY’S LIVING ROOM - DAY Liz waits for Dick’s response to the push poll about her sister. LIZ DAD?... Lynne looks at Dick...who after a beat, NODS “DO IT.” INT. MARY’S HOME - DAY Mary’s wife rubs her back as she cries. QUICK CUTS/STILLS SHOWING: 1)Iconic Crying Border Girl 2) Cops pulling guns on a group of black teenagers 3)High school graduates being arrested. 4) Alex Jones from INFO WARS 5) A family praying 6) Dick walking out to fish. EXT. WYOMING LAKE SIDE - DAY Push into the trees til we focus on one tree with an aged worn carving in it of a HEART WITH: DICK + LYNNE INT. SURGICAL ROOM - CONTINUOUS We hear a heart monitor beeping. NURSE Patient’s heart rate is stable. Blood pressure increasing... Pan to the side table where CHENEY’S OLD HEART SITS, SCARRED FROM IT’S MANY HEART ATTACKS AND TWICE THE SIZE OF A NORMAL HEALTHY HEART. “Lynne and Dick split time between their home in Wyoming and Virginia.” “In 2016, Liz was elected as Wyoming’s sole representative to the House of Representatives.” “Mary Cheney was asked in 2015 whether she and Liz had mended their relationship. She replied, “I don’t have to answer that.”” CUT TO BLACK: 101.",
      "characters": [],
      "action_text": "INT. INTERVIEW ROOM Camera crew surrounds Dick and Martha the interviewer. MARTHA Hello Mr. Vice President. DICK This must be the right place. MARTHA Nice to meet you. DICK Pleasure. MARTHA You can sit right there. DICK So is it gonna be just me on camera or... MARTHA Primarily you. It’ll cut back to me. Eddie’s got you on the “A” camera. Me on the B. OVER BLACK: “4,550 US Soldiers were killed in the Iraq war with over 32,325 casualties. Suicide among American soldiers has increased 31% since 2001.” ”More than 600,000 Iraqi civilians died as a result of the war.” “ISIS is responsible for the deaths of an estimated 150,000 civilians in Syria and Iraq with more than 2,000 murdered in international terror attacks. CUT TO: INT. INTERVIEW ROOM Camera crew surrounds Dick and Martha the interviewer. Dick takes a drink of water. MARTHA Two-thirds of Americans say the Iraq war is not worth fighting. (MORE) 102. And their looking at the value gained at the cost of American lives. And Iraqi lives. DICK So? Beat. MARTHA So...don’t you care what the American People think? DICK No..uh...I think you can’t be, uh, blown off course. Dick struggles then turns to camera. DICK (CONT’D) I can feel your recriminations and your judgement. And I am fine with it. If you want to be loved, go be a movie star. The world is as you find it. And you gotta deal with that reality. And there are monsters in this world. We saw 3,000 innocent people burned to death, by those monsters. And yet, you object, when I refuse to kiss those monsters on the cheek and say, “pretty please.” You answer me this, What terrorist attack would you let go forward so you wouldn’t seem like a mean and nasty fella? I will not apologize for keeping your families safe. And I will not apologize for doing what needed to be done, so your loved ones can sleep peacefully at night. Dick gets emotional. DICK (CONT’D) It has been my honor to be your servant. You chose me and I did what you asked. CUT TO BLACK: “In the years followi",
      "dialogue_count": 0,
      "word_count": 892
    }
  ]
}