{
  "slug": "victor-frankenstein-2015",
  "title": "victor frankenstein",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 14122,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. VICTOR’S FLAT - CONTINUOUS Victor sits at his desk; he’s engrossed in drawing something, a blueprint.   He’s fully absorbed in it, and doesn’t look up when Igor enters. VICTOR Where have you been?   Do you really think it’s wise that you go gallivanting about on the town when there’s a manhunt- FRANKENSTEIN Victor. VICTOR I’m busy-   father!?  Victor jumps up in such boyish haste he nearly knocks over his work table. FRANKENSTEIN Hello. VICTOR You- you came for Christmas- FRANKENSTEIN No, Victor.   Sit down. VICTOR I- yes, of course, please. FRANKENSTEIN (to Igor)  Leave.  Igor looks to Victor; shit, there goes his chance to confront him.   He goes up the stairs, but then stops at the top, surreptitiously eavesdropping as Victor and his father sit by the fire. VICTOR Father, I’m so excited to tell you, I’ve had great breakthroughs with my experiments- Frankenstein talks into the fire, never once addressing Victor; throughout their discussion Victor leans further and further forward in his chair, trying to force himself into his father’s eye-line. FRANKENSTEIN I don’t care. VICTOR My theories- listen father, my theories, they were all correct- 61.",
      "characters": [],
      "action_text": "FRANKENSTEIN I don’t care about your disastrous experiments or your poorly researched theories- VICTOR Haha, yes, but that’s what I’m- FRANKENSTEIN  Victor, silence.  Victor falls quiet, the smile dripping off of his face. FRANKENSTEIN (CONT’D) When you were   smaller   I always had a great anxiety about you.   Your mother and myself always saw that you had a capacity to   ruin   things. Do you remember all the things you  ruined.  VICTOR I- FRANKENSTEIN Do you recall what I said about your experiments. VICTOR Yes- FRANKENSTEIN I said your experiments were of ill repute.   I told you not to become a doctor.   The modern doctor is a wasteful man, I said, many times. He cannot accept that death is the inevitable, inescapable conclusion of life.   He tries to “beat the reaper.”   This is futile.   I have told you this many thousands of times throughout your childhood, as it is a lesson, as you know, that cost me a great deal. VICTOR But- you see that’s what I wanted to tell you, I’ve done it- I mean I can show you, I’ve finally... Claus stares at Victor.   Victor freezes in the gaze of the one person he clearly most wants to impress.. FRANKENSTEIN Yesterday I received a telegram, informing me that you are to be called before the board of directors of the college.   They say you   neglect   schoolwork.   They say you behave   strangely .   They intend to expel you.   Did you know this? 62. VICTOR I- expel me, they can’t- FRANKENSTEIN  Can’t they?  VICTOR ...Father...if you just listen to me, I...I... FRANKENSTEIN You what? VICTOR I- FRANKENSTEIN Luckily you are of age where I no longer need to take responsibility for your faults and failings.   If the board asks me to speak in your hearing, I will tell them you never should have been admitted in the first place. Victor sits staring at his father. VICTOR I...I’m so sorry father. FRANKENSTEIN Apologies.   Are.   Meaningless.   How many times must I tell you. Frankenstein stands up and leaves, just like that, leaving Victo",
      "dialogue_count": 0,
      "word_count": 2320
    },
    {
      "scene_number": 2,
      "slugline": "EXT. DETTWEILER’S LAB - CONTINUOUS Igor slams the door behind him, breathing hard, tears streaming down his face.   He stares out into the predawn fog, his mind racing... The Baby Winthrop coos.   Igor looks down: The baby, though unconscious, is alive.   He blinks in shock.   A scrap of paper is tucked in with the baby. Scribbled in familiar handwriting: “ I - How little you think of me. - F.”  Igor let’s out a little gasping laugh, and then looks around in disbelief. EXT. LONDON - DAWN The snow falls lightly, the crowd bustles, and Igor emerges, carrying the baby.   He walks across half the city, purposeful, not pausing; Christmas morning is peaceful, but we watch as the streets slowly crowd with people. We see him ask several strangers for directions, finding his way, crossing bridges, going down alleys, finally reaching... EXT. WINTHROP RESIDENCE Igor stops outside the house, and looks down at the baby.   He goes up to the door of the rickety little brownstone house, knocks, no reply. And then   MR. WINTHROP   answers the door; the man is a wreck, pale, red-eyed, bereaved.   He sees Igor; he speaks.   Igor doesn’t respond. Instead, he simply holds out the baby. Winthrop stares at it, and then calls out, and again, and again.   Igor hands the baby to him and he nearly faints.  MRS. WINTHROP   appears in the doorway. She sees the baby, and simply stares in shock.   Mrs. Winthrop clutches onto both her child and her husband as Igor slowly backs away from the door.   The reunited family collapses in a sobbing heap in their door frame. They begin to call after Igor, but Igor, taking one last long look at them...vanishes into the crowd. EXT. THE THAMES Igor stands staring out over the water, crying, breathing hard, laughing and talking to himself.   He seems to realize something, and then   takes off running . 72.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 316
    },
    {
      "scene_number": 3,
      "slugline": "EXT. THE STREETS OF LONDON Igor runs, and runs, and runs, a man on fire.   He stops, winded, to loosen his back brace. EXT. BARON BOMINE’S RESIDENCE - MOMENTS LATER Igor runs up from the street, through the garden, up to the front door, knocks frantically, waits, knocks again, waits, the butler answers, Igor speaks frantically, the butler goes away, Igor waits, tries to fix his disheveled appearance, makes it worse, Lorelei appears in the doorway- Igor grabs her and kisses her. After a startled moment, she kisses him back.   They stand in the doorway, laughing and holding each other. EXT. VICTOR’S FLAT - LATER Igor approaches, divinely happy, driven, heading towards the door, when someone  grabs his sleeve...  ...It’s Turpin. CUT “FIX YOU” ABRUPTLY. TURPIN Hello again, Igor. INT. VICTOR’S FLAT Igor is bringing out tea, his hands shaking.   Turpin is settling down opposite Victor by the fire, Constable Alistair over by the window. Victor now sits in the chair his father sat in, with Turpin in the smaller seat. TURPIN Pleasant Christmas? VICTOR Indeed.   We went caroling.   We’re both very tired- TURPIN Whose coach was that I saw drop you off, Victor? VICTOR My father’s.   He took me for lunch. Turpin smiles. 73.",
      "characters": [],
      "action_text": "TURPIN Igor, would you mind showing me your shoes? VICTOR  Not just yet , Inspector.   What’s all this about? ALISTAIR It’s in relation to the Blue Meringue Circus Hunchback Murder. VICTOR What’s his shoe got to do with it? TURPIN Interesting you said “shoe” rather than “shoes.” (beat) Something wrong, Mr. Straussman? VICTOR Oh!   That’s right!   I do recall reading about it: the hunchback what threw the dwarf off the bridge. (beat) Wasn’t there talk of...witchcraft? ALISTAIR Well, we don’t give credence to occult speculation- TURPIN  Not officially.  VICTOR Oh, but unofficially?   You believe in...witches, Inspector?   Goblins? TURPIN Oh, no, nothing so extreme.   But I do believe there are punishments for dealing with the devil.   Just as there are punishments for lying to police officers. Victor and Turpin seem to lock in on each other. VICTOR Ah, yes, but police officers  actually exist , you see. TURPIN Funny, Victor.   But, in the end, things have a way of catching up, even with the   funny   people.   Now let me see his shoes. 74. VICTOR To see his shoes I’m afraid I’m going to have to see a proper search warrant. TURPIN What’re you playing at Victor? What do you have to hide? VICTOR You’ve twice mentioned punishment without specifying who would be meting it out. TURPIN I inferred our Lord. VICTOR Oh yes, “God,” hm, well, I’m sure if god existed I would be in far deeper trouble than I am now- TURPIN I’m not here to convert you, Victor- VICTOR No, indeed, go ahead, it’s a cause without a champion.   Tell me more about this “god” fellow who apparently has some vendetta against me- TURPIN I didn’t come to debate religion with a child scientist- VICTOR What was the insult there, “child” or “scientist-” TURPIN  I know your bloody type, Frankenstein , all sure of their theories and analysis,  you listen , my wife Claudia, bless her soul, she trusted in that poppycock and what’d it get her, dead, said it was appendicitis well look how far it got her knowing the name",
      "dialogue_count": 0,
      "word_count": 3318
    },
    {
      "scene_number": 4,
      "slugline": "INT. THE SEWER - CONTINUOUS Igor and Victor fall down into the muck, and Victor yanks Igor to his feet, both of them running, splashing through the grime. There’s a splash from behind them, and Igor looks back into the darkness; he can’t see anything. Victor leads Igor through the darkness, finally bursting out through a drainage ditch onto THE STREET They’re a block away from the house, crawling up onto the street.   A Finnegan coach, marked as such, is parked nearby. VICTOR  Come on, come on!  Igor falters, pulling away from Victor, but then sees someone coming up from the drainage ditch.   At this, he jumps onto the alongside Victor, and it speeds off up the street. As the carriage rounds the corner, Turpin, bloodied, burnt and shaking, one of his eyes milked over and blinded, pulls himself up out of the ditch; he gets a momentary look at the carriage, before he falls backwards, into the ditch. TURPIN (barely conscious)  F...Finnegan.  INT. FINNEGAN FAMILY HOME - OFFICE Finnegan is at the far end of the luxurious home office, playing darts.   He’s focused, intense- Victor bursts in, followed by Igor, who’s clearly still deep in thought. FINNEGAN Frankenstein, Igor, what an unexpected surprise- my god what’re you covered in- VICTOR Sewage. FINNEGAN -delightful- VICTOR The police have raided my home in search of Igor.   We managed to evade capture, but in the process we gravely injured several police officers. 87.",
      "characters": [],
      "action_text": "FINNEGAN ...Ah.   Why- why exactly did the police- you know on second thought, it doesn’t really matter.   I suppose now you’ll have no choice but to leave London, post haste. At the very least, get your sewage covered bodies out of my father’s office. VICTOR Yes, very good. Finnegan snaps. FINNEGAN My family has an estate, the Castle Erskine, in Belgium.   Quite rural and secluded, ideally suited to both your needs as a scientist and a, well- fugitive.   We could set up a new lab, with help from Dettweiler, and- VICTOR Yes yes, good, we’ll leave immediately. FINNEGAN Oh will you?   Ha, right, I’ll go prepare a coach. Finnegan heads out of the room.   Victor sighs. VICTOR This is your fault, I hope you know that.   Parading about town with the acrobat.   Still, all is forgiven; perhaps this change of scenery will- IGOR  I’m not going  ANYWHERE   with you.  VICTOR What? For the first time in our story, Igor is visibly ANGRY. IGOR  You amoral psychotic piece of shit-  Scratch that,   FURIOUS.  VICTOR Igor- IGOR How could you do that?   To keep from me for months that you had killed a man and given me his name- 88. VICTOR I didn’t kill him- you’re overreacting! IGOR No, Victor, enough is enough- VICTOR You have a chance here to be part of- IGOR Of what?   Being lied to, chased by monsters and hunted by police- VICTOR Oh, don’t focus on the dark side- IGOR  NO!   You’re- you’re a- a BAD FRIEND.  Victor is startled by the simpleness of the accusation, and maybe even hurt. VICTOR After all I did for you- IGOR You care for no one but Victor Frankenstein- VICTOR I told you I   didn’t kill Straussman - IGOR And why should I believe you!?   In my time with you I’ve seen you put lives in danger in pursuit of your dreams,   your experiments - VICTOR Straussman was a waste of space, this fanfare from you is more of a funeral than his own family would’ve given him- IGOR So he deserved to be toyed with like a puppet to help   you escape , to have his   eyes torn out of his head, w",
      "dialogue_count": 0,
      "word_count": 5847
    },
    {
      "scene_number": 5,
      "slugline": "EXT. THE WINDMILL Victor and Igor, bruised, battered and bloody, approach the massive Dutch Windmill on the side of the hill; the villagers are gathered around it. At first it appears they have the Prometheus trapped in the house portion, but then the Prometheus tromps out and takes a few people down, before going back in. APPROACHING THE CROWD Victor and Igor try to get through the crowd, and can’t; Victor draws and fires Finnegan’s gun. The crowd parts like the red sea, and Igor and Victor move through, with the gun still raised. VICTOR  Please remain calm.   We are unlicensed medical professionals.  INT. THE WINDMILL - FARMHOUSE Victor kicks in the door; Igor comes in through a massive hole in the wall next to the door.   They exchange a look. The farmhouse is sparse, and the inside is completely destroyed, broken furniture everywhere. LITTLE GIRL (DUTCH) Help me, please help me. Victor and Igor turn to see an adorable blonde girl standing nearby, petrified in fear. IGOR It’s alright, we’re here to- The   MONSTER SMASHES OUT OF A ROOM TO THEIR RIGHT, FLOORING IGOR.   Victor opens fire wildly as the creature crosses the room; he mostly misses, and the bullets that do hit have almost no effect. The creature  grabs the girl   in one of its massive hands, roars at Victor and crashes through a wall into the inside of the windmill. INT. THE WINDMILL - CONTINUOUS The interior of the windmill stretches out above them, the inside lit by torches.   There are a series of flimsy wooden platforms built around the central windmill machinery, connected by diagonal ladders, leading up to the top. The monster stands at the bottom, above a big well full of water, dunking the terrified little girl. 111.",
      "characters": [],
      "action_text": "Victor hurriedly picks up one of the long, sharp steel posts they use as bolts on the well, as Igor strafes around the monster. VICTOR HEY.   WANKER. The monster takes notice of Victor. VICTOR (CONT’D) I’m your creator.   I’m the one that brought you back to life, do you understand? The monster stares at him, that blank face again...  THEN ROARS  and flings one of the torches on the wall.   Victor dodges, and the torch hits a table full of unlit lanterns  WHICH EXPLODE INTO FLAME.  VICTOR (CONT’D)  Bloody hell-  The Prometheus charges, still holding the girl, and Victor is forced into a frantic, pulse pounding chase up the interior of the windmill, complicated in four ways:  NUMBER 1:   The monster’s weight is too much for the ladders and the platforms, which crumple mere moments after it climbs onto them. NUMBER 2:   The monster, still clutching the little girl, is swinging WILDLY at Victor, repeatedly smashing the windmill’s machinery, thusly destabilizing the entire structure. NUMBER 3:   The fire started at the base is rapidly spreading up the old, papery structure, engulfing everything, and starting to fill the interior with thick black smoke. NUMBER 4:   Igor is in hot pursuit, but he’s being forced to run, jump and climb up the platforms AS THEY COLLAPSE.  Victor, reaching the uppermost platform, abruptly turns, ducking around the central windmill milling-engine.   This outsmarts and surprises the Prometheus, and Victor  DRIVES THE STEEL ROD THROUGH ITS HEART.  The Prometheus falters, teetering over what’s now a straight drop nearly sixty feet down.   It looks down at the rod sticking out of its chest, and  DROPS THE LITTLE GIRL-  Victor dives and catches her hand, swinging her to Igor on the collapsing platform below them.   Igor catches the girl and rolls, putting her out through the one window, onto the passing fan of the windmill. WE SEE OUTSIDE 112. The girl is safely carried down to the ground, and then the  WINDMILL’S FAN CRACKS AND FALLS, BURNING, SCA",
      "dialogue_count": 0,
      "word_count": 1165
    },
    {
      "scene_number": 6,
      "slugline": "EXT. THE WINDMILL - CONTINUOUS The top level of the windmill drops in, collapsing, and then, with a series of ember filled explosions, the rest of the windmill collapsing down with it in a huge heap of wreckage. The villagers step back, in shock. WIDE SHOT: The rubble of the windmill burns. FADE TO BLACK. HOLD ON BLACK. Zzt.   Zzzt.   Electrical crackling.   Little spots of light filling the screen and  then ZAP SMASH TO: Turpin sits up, gasping in air, the Lazarus fork on his neck sparking wildly!  EXT. BELGIAN COTTAGE - SUNRISE The sun is rising over a mountain range.   The little cottage has clearly been abandoned for some time; Castle Erskine is in the distance, still leaking smoke up into the brightening sky.   From here we have a beautiful view of a rustic lake. Turpin, his chest bandaged, sits staring out over the water, at the sunset; he’s clearly deep in thought.   Igor slowly approaches him. Turpin speaks without looking at him. TURPIN My entire life I have strived in the pursuit of my beliefs.   Beliefs in God, in the law...in a world with rules, rules to preserve what matters in a world filled with anarchy, greed, and evil.   I suppose I needed them, the rules. Needed them so much I let them control my choices, my decisions, I... Turpin glances at Igor. TURPIN (CONT’D) I don’t know you, hunchback.   Don’t know Victor.   Maybe I thought I did... (beat) In those last moments, I wasn’t thinking about the law, or right and wrong, or even...even God. 115. (MORE)",
      "characters": [],
      "action_text": "All I wanted, all that mattered, is that I would see my daughter again. And you’ve given me that. (beat) I don’t imagine that I have much credence left at the yard, but...Should you return to England, I can see to it you won’t be troubled any further. Igor gives it a beat, and then smiles.   The two of them sit staring out at the water. EXT. BELGIAN COTTAGE - ROUND BACK Victor, heavily bandaged and clearly a bit weary from his wounds and considerably rough night, is readying two horses, packing his remaining equipment into the saddlebags.   Igor stands nearby. VICTOR Well, brilliant, good for him, but we’re certainly not going back to England. IGOR ...we’re not? VICTOR No, I’m through with Great Britain; nothing left for me there.   I think perhaps you’re quite right about my father, for now, and I’ve been expelled from school, hunted by the law, and betrayed by a power-hungry nobleman, thoroughly electrocuted and finally impaled by a monster of my own idiotic creation and nearly burnt to death in a Belgian windmill. (laughs) I think it’s time I started fresh, yes? IGOR But Victor- VICTOR America!   Now there’s a place that isn’t afraid of   progress ; I’m confident we’ll be able to flourish and thrive out in the colonies. You and I, back to working together with no interlopers, I now having a much better understanding of the technology as well as the proper way to treat my fellow man- IGOR Victor, I... 116. TURPIN (CONT’D) VICTOR  Yes?  Igor fidgets, nervous, unsure how to say what’s in his heart. Victor waits, looking oblivious. IGOR I can’t go with you. (quickly) I would, I- I can’t.   Lorelei is waiting for me back in London.   I love her, Victor, and there are- opportunities for me- I can have a life of my own, Victor.   A real life. Victor   stares at him .   Igor drops his eyes, terrified; he knows what’s coming. VICTOR Well...then.   I suppose that’s perfectly reasonable. IGOR ...what? VICTOR (haltingly) You have made incredible sacrifices in the purpose of ",
      "dialogue_count": 0,
      "word_count": 970
    },
    {
      "scene_number": 7,
      "slugline": "EXT. BARON BOMINE’S RESIDENCE - CONTINUOUS Igor comes out, signing for a parcel being delivered to him. As the messenger boy leaves, Igor inspects the parcel.   It’s small, addressed simply to “IGOR.” There’s a beat, and Igor tears open the brown paper.   He stops dead. It’s a mint condition, first edition copy of   THOMPSON’S ANATOMY.  Igor opens it, gently, lovingly.   In the front cover, the name   DR. CLAUS FRANKENSTEIN   has been written...and crossed out.   A note in familiar handwriting beneath this reads: “ I- Monument Valley, Utah. I have done something incredible. -F. ” Lorelei, at the front door, stands looking out at him; he’s staring down at the book.   She knows something’s up. ALORELEI Igor...what is it? Igor snaps the book shut, turning to face her.   He smiles; “wellllll.....”   Lorelei sighs, and then laughs, shaking her head... SMASH TO: MONUMENT VALLEY - UTAH - RACING THROUGH THE DESERT The insanely surreal and beautiful buttes of Monument Valley tower over the prairie. Atop one of the buttes,  a storm is raging; clouds swirling unnaturally, crackling with purple lightning.  LIGHTNING   CRASH TO CREDITS.  THE END 119.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 186
    }
  ]
}