{
  "slug": "vikings-101-rites-of-passage-2013",
  "title": "vikings 101 rites of passage",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 8,
  "characters_count": 1,
  "characters": [
    "RAGNAR"
  ],
  "total_words": 11120,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HOUSE - NIGHT Winter. The embers of the fire still glow in the centre of the floor. We are close again on the baby’s face...as he sleeps in the crook of Ragnar’s arm. Ragnar is awake, staring up into the darkness and the play of shadows across the rafters, a look of profound awe upon his face. EXT. HOUSE - DAY Now everything is in the fierce grip of the deepest winter. Icy winds blast across the fjord, heaping the water into wild, foaming waves, and the mountains above are thick with snow. Even at mid-day the sky is almost dark, like a perpetual twilight. But through this dark desolation a solitary FIGURE can be seen, a black smudge against the snow, wrapped in furs against the icy winds, struggling towards the hamlet. INT. HOUSE - DAY Lagertha plays with her two CHILDREN. Her son BJORN is about ten and daughter GYDA about eight years old. Ragnar appears, gestures to her. RAGNAR Come. Ragnar leads Lagertha into the main room. RAGNAR (CONT’D) Here is the man I told you of, Lagertha. He indicates the figure standing beside the fire: a tall MAN of uncertain age, his craggy face heavily lined, his hair and beard both long and matted, as if his journey has been long and arduous. LAGERTHA Welcome, stranger, to our house. The strange man bows a little. Lagertha pours a drink of sweet, strong mead and hands it to him. The stranger empties the cup.  5 .",
      "characters": [],
      "action_text": "LAGERTHA (CONT’D) Sit by the fire, warm yourself. The stranger nods again, and sits, Ragnar and Lagertha doing likewise. RAGNAR This man is a wanderer. He has been on a boat that travelled to the west. This is clearly a shock to Lagertha. She stares at the man. LAGERTHA Is it true? Once more the stranger nods, but does not reply. Lagertha suddenly realizes that he is glancing towards his cup, and she quickly re-fills it. And once more he empties it, then belches, and wipes his hand over his mouth. WANDERER We sailed north up the coast, to the rock formation which looks like a skull. And then, when we were out in the open sea, we turned due west. And I was frightened. LAGERTHA What happened to you? Where did you get to? Behind her, we see Bjorn and Gyda peeking into the room, and listening. WANDERER After two days and nights we saw land. Someone said it was a land called England, for they had been there before. But I don’t know if it’s true. I was only told that in this land there was great treasure. We went ashore, found a big house there, and took some things from it. From his bundle of discarded furs he retrieves an object: a small but very beautiful ivory crucifix.  6 . WANDERER (CONT’D) In England, they worship a strange god called Jesus Christ. They say he died in a tree. RAGNAR Like Odin. Only Odin came back to life. Lagertha examines the glittering prize. RAGNAR (CONT’D) Tell us how you crossed the open ocean - once you lost sight of land? How did you know you were sailing west, not north or south? WANDERER We had a board. It belonged to a Swede. LAGERTHA A board? What kind of board...? WANDERER A sun-shadow board. Here is one. Again he reaches into the thick pile of animal furs and this time produces a “solskuggerfol” board. It is a smallish wooden board with a pin or gnomon in the centre (which can be adjusted up or down) and with circles drawn around the pin. WANDERER (CONT’D) To show you how it works, I need to float it in a tub of water. Ragnar goes off ",
      "dialogue_count": 0,
      "word_count": 1132
    },
    {
      "scene_number": 2,
      "slugline": "EXT. HOUSE - DAY They look up at the sky - even now, around noon, it’s a leaden grey, with no sign of the sun. WANDERER Watch. He holds up the sunstone. A beat. (The calcite works by polarizing light). The sunstone glows faintly, and an equally faint beam seems to bounce back from it and illuminate a spot in the sky, behind the thick clouds. WANDERER (CONT’D) You see? There is the sun. It seems like a miracle. Neither Ragnar nor Lagertha can speak as they bear witness to it. EXT. SETTLEMENT - SPRING - DAY Time has passed. Watched by her ten-year old daughter GYDA, Lagertha draws water from the well. Despite her reputation as a shield-maiden, Lagertha remains a slim, slight figure, with long braided hair. It’s still cold enough for her breath to steam, but the icy blasts of winter are over and the landscape breathes and greens. As she carries the bucket back towards the house we see various animals in timbered pens, for this is a working farm. And down by the water, a couple of small wooden boats. Two large and hairy hunting dogs shamble around the yard. Lagertha looks over at a neighboring property, where the HOUSEHOLDER is leaving, riding a small, wiry horse up the steep trail behind the houses. Glances back at her daughter. LAGERTHA Gyda, feed the goats.  10 .",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 232
    },
    {
      "scene_number": 3,
      "slugline": "INT. RAGNAR’S HOUSE - DAY Lagertha, carrying the bucket inside, finds Ragnar putting a thick woollen coat over the shoulders of his son, BJORN, now twelve years old, and a handsome, strong-looking youth. Lagertha stops and looks at them. LAGERTHA What are you two doing? RAGNAR I’m taking Bjorn to the Thing. LAGERTHA Not yet. He’s not old enough. RAGNAR He’s twelve years old. LAGERTHA Take him next year. Next year is soon enough. Ragnar smiles at her. RAGNAR He’ll need a silk ribbon. INT. HOUSE - EVENING BJORN “spies” on his mother as Lagertha washes her long blonde hair in the tub of water. The water seems to flow in slow motion from the ends of her hair like mercury as she kneels over the tub. His eyes are full of love for her. BJORN (quietly) Mother. Lagertha looks up, flicks back her hair so she can see him, and smiles tenderly. INT. BEDCHAMBER - HOUSE - NIGHT Ragnar and Lagertha in bed together, cradled close after love- making. She stares into his eyes.  11 .",
      "characters": [
        "RAGNAR"
      ],
      "action_text": "LAGERTHA Don’t sleep with too many women in Kattegat. RAGNAR Are you crazy? I won’t sleep with any of them. I don’t want to. I can do without it for a few weeks. LAGERTHA Is that another way of saying you love me? She teases him. RAGNAR I always dream of you. Last night I dreamt you were feeding me blood pudding. LAGERTHA What does that mean? RAGNAR It means you were giving me your heart. And they close in, and kiss passionately. RAGNAR (CONT’D) I love you so much I could feed you the whole sky. EXT. YARD - HOUSE - DAY Father and son are ready to depart on their small, tough horses, both wearing heavy woollen coats, tight leather trousers, cloaks and leather boots. Lagertha and Gyda bring out some food for the journey, putting it into their saddle-bags. Bjorn kisses Gyda. BJORN Goodbye, little sister. GYDA Goodbye, big brother. Don’t get drunk.  12 . LAGERTHA Wait. I have something for both of you. She takes out two thin strips of colored ribbon, and ties one around Bjorn’s head and the other around her husband’s. LAGERTHA (CONT’D) There. Now everyone will know you are free men on your way to the Thing. Ragnar kisses her. RAGNAR Goodbye my shield-maiden. LAGERTHA Look after your son - and when you come back, just tell me the truth. I don’t care about anything else. And then she and her daughter watch Ragnar and Bjorn set off up the rough trail towards the trees, accompanied by one of the hunting dogs, Ragnar armed with a spear, a sword and knife and Bjorn with his hunting knife. Bjorn looks back once, and raises his arm in farewell, and then they are swallowed up into the trees. EXT. TRACK - DAY They ride slowly on together through a landscape of forest, scrub and rock. There is no-one else in sight, no farms or dwellings, for the rocky earth here is clearly unfit for agriculture or ploughing. Is even too barren for sheep. There are signs of spring everywhere, however, the trees a brighter green, the gorse in flower. BJORN What will happen at the Thing? RAGNAR Earl ",
      "dialogue_count": 1,
      "word_count": 1854
    },
    {
      "scene_number": 4,
      "slugline": "INT. GREAT HALL - DAY A large and impressive chamber with a lattice of high beams and some wall coverings. It’s crowded. On a raised dais at one end, sat on a carved chair, is EARL HARALDSON, late forties and still a formidable-looking warrior, dressed in wide trousers and fur-trimmed coat. The Earl is flanked by some of his HOUSECARLS - his private, elite bodyguard - by SLAVES and several (mostly male) members of his FAMILY. His striking WIFE wears a sleeveless dress which reaches to the ground, and over it a sleeveless cape which is thrown back, revealing the whiteness of her arms. She is adorned with necklaces and oval brooches. Filling the rest of the hall, and obliged to stand, are FREEMEN like Ragnar and Rollo. In the small space between them a rather pathetic FIGURE is standing, shifting from one foot to the other, his eyes downcast. He’s almost a figure of fun and everyone is grinning at him. EARL HARALDSON Olaf Anwend... OLAF Yes, sir. EARL HARALDSON You have pleaded guilty to the charge of stealing. Tomorrow you will run a gauntlet of stones and turf as punishment. OLAF Yes, lord. Thank you, lord. EARL HARALDSON Don’t thank me. And let it be known that a fine is to be paid by anyone who fails to throw something. There’s laughter - as Olaf is led away. Bjorn tries his best to peer through the men blocking his view of events. EARL HARALDSON (CONT’D) Bring in the next accused. Bjorn actually catches a glimpse of the YOUNG MAN brought into the hall in chains by the housecarls. The young man has a pleasant expression, keeps his head high and does not avert his eyes.  20 .",
      "characters": [],
      "action_text": "EARL HARALDSON (CONT’D) Eric Trygvasson, you are accused of the murder of Sigvald Strut this January. How do you plead? TRYGVASSON It wasn’t murder, lord. I killed him in self-defence. It was he who attacked me. WOMAN (shouting) LIAR! The WOMAN is part of the dead man’s family, standing in a group close to the defendant. EARL HARALDSON If it wasn’t murder, why did you not declare your crime to the first person you met afterwards, as the law obliges? In fact, you passed by several houses before you reported it. Trygvasson looks over at the woman and the dead man’s family. TRYGVASSON I...I thought the relatives of the dead man might be living in them. EARL HARALDSON The law allows you to pass two houses in such circumstances - but never a third. FAMILY MEMBER You felt guilty. You went to his house and murdered my brother in cold blood. Fresh uproar. Bjorn struggles to keep an eye-line on the accused. Ragnar notices, lifts him up. TRYGVASSON It’s not true. We argued about some land. He pulled out a knife... WOMAN You’re lying! You wanted that land for yourself. You’re a liar and a coward.  21 . TRYGVASSON Who says I’m a coward? I’m no coward. More people join in the shouting. The Earl bangs his fist on the table. EARL HARALDSON Silence! All of you - show some respect. They fall silent. Earl Haraldson looks at Trygvasson. EARL HARALDSON (CONT’D) As the normal procedures were not followed, this killing cannot be atoned for by compensating the victim’s family. The family shout their approval, raise their fists aggressively towards the defendant. EARL HARALDSON (CONT’D) Murder is a dishonorable act among our people, Eric Trygvasson, committed in secret, unacknowledged and very likely to set in train a cycle of revenge killings, which would also involve your own family. He looks up at the assembly. EARL HARALDSON (CONT’D) I ask all of you how you find the accused. If you think him guilty, raise your arms. Your decision must be unanimous. Quickly, everyone raises their hands",
      "dialogue_count": 0,
      "word_count": 1352
    },
    {
      "scene_number": 5,
      "slugline": "EXT. BAY - DAY They’ve pulled the boat onto a narrow beach in a hidden bay. There’s no sign of habitation. They walk up a steep path through the trees. When a FIGURE leaps out at them, wearing a fierce mask, and with a hideous screech. Bjorn is shocked...but still calm enough to draw out his hunting knife. Ragnar laughs. RAGNAR It’s all right. Put your knife away. (beat) Floki, meet my son. Bjorn...this is my dear friend Floki. FLOKI rips off his mask, and grins. He has a strange, mischievous, almost ageless face, ugly but animated, with bright, piercing eyes. FLOKI Hello. How are you? BJORN Well, thank you...sir. Floki stares at his face. FLOKI Let me see. You have your father’s eyes - unfortunately. RAGNAR Why unfortunately? FLOKI It means he will be like you. And therefore he will want to do better than you. And you will hate him for it. RAGNAR He’s only twelve years old.  26 .",
      "characters": [],
      "action_text": "BJORN How can you tell that by just looking at my face? FLOKI It’s the same with trees. BJORN With trees? FLOKI Yes. I can tell which trees will make the best planks just by looking at them. I can look inside the tree. RAGNAR Floki is a boat-builder. Bjorn stares around at the deeply-forested hill they are on. BJORN So - you could tell which of these trees would make the best planks for a ship? Floki grins...then abruptly walks off the path, and into the trees. They follow him. For their POV - and from ours - all the trees look the same, virtually identical. But Floki stares at them with a strange, bewitching intensity....touching the trunks of some of them, laying his cheek against the bark, staring up at the uppermost branches. Whatever amusement Bjorn might derive from seeing a man staring at trees is quickly confounded by the aura of spiritual intensity which surrounds Floki. He’s no ordinary mortal. It’s not possible to laugh at the way he examines the bark of tress, or caresses them, or simply just looks at them. Floki is different. Strange but compelling. Authentic. FLOKI (suddenly) This is one. He indicates a tree - to the others, just like the rest of the trees...and yet. Floki strokes the trunk.  27 . FLOKI (CONT’D) Inside this tree are two almost perfect planks. They will bend, then curve, like a woman’s body, from the thigh to the back. When I split the tree I will find them. He marks the tree with a couple of blows from his axe. Bjorn laughs. BJORN You can see that? FLOKI Do you think I’m joking? I joke about many things, son of Ragnar, but never about ship-building. Our boats are our souls. Bjorn looks abashed - embarrassed. RAGNAR So - how is our boat? Floki looks back at him. And grins. FLOKI Ah... CUT TO: INT. BOAT-YARD - DAY A secret, turf-covered shed close by the edge of the water. Gloomy - but slightly “religious” in the way the space is lit by tallow candles. Watched by Ragnar and Bjorn, Floki uncovers the skeleton of a a new boat. It’s still i",
      "dialogue_count": 0,
      "word_count": 3088
    },
    {
      "scene_number": 6,
      "slugline": "EXT. TREES - DAY They ride towards the temple, between the trees. There’s a strange atmosphere here. Hidden bells chime very softly, sweetly like a sighing wind. RAGNAR Keep to the path. The grove is sacred. Every nine years, here in the temple, the priests sacrifice nine of everything and hang them in the trees. BJORN Nine of everything? Nine sheep and nine hens? RAGNAR Yes. BJORN And nine horses? RAGNAR Of course. We love our horses. A beat. BJORN And nine of us? Nine humans? Ragnar looks back at his son, but doesn’t answer. Now Bjorn becomes aware of waif-like creatures flitting between the trees, dressed in pale colored robes. BJORN (CONT’D) Father, who are they? RAGNAR Priests, I expect. Or other things. Who can tell in a place like this? Look, here’s the   entrance. EXT. TEMPLE - DAY They dismount in front of two large wooden doors, studded with iron. A PRIEST appears, bows, silently opens the doors. He is a tall, thin, homosexual YOUNG MAN, dressed in a flowing robe  42 .",
      "characters": [],
      "action_text": "And they step inside. INT. PAGAN TEMPLE - UPPSALLA - DAY The golden glow from the roof generates a strange, almost unearthly light. There’s a water-source somewhere...for the sound of water running and splashing fills the great domed space. The space is dominated by three huge wooden statues, several metres high, made of highly polished wood. But the priest first takes them over to the stone altar on which there is a sacred Viking ring, a wooden bowl filled with blood and a twig. Ragnar kneels by the altar and Bjorn follows his example. The priest dips the twig into the blood of a sacrificed animal and shakes it over them, sprinkling them with blood. PRIEST (sing-song) Hail to the Aesir! Hail to the goddesses! Hail to the mighty, fecund earth. Wit and wisdom may you give us, and healing hands while we live! They move towards the statues, Ragnar once more sinking to his knees and making his obeisance. Bjorn looks confused and over-awed. But the priest, with a smile, gently guides him closer. PRIEST (CONT’D) My son, you have travelled a long way, but now at last you are face to face with our gods. He draws Bjorn gently towards the first statue: of a massive, muscle-bound, bearded, earthy-looking figure holding aloft his mighty hammer. PRIEST (CONT’D) This is Thor. You know him, of course. You hear him in the thunder, when he races across the clouds with his goats. He protects all of us. And when he goes forth with his hammer, Mjollni, in his hand, he is irresistible.  43 . CLOSE ON: Thor’s sculpted face, his exaggerated features, peasant-like, wide-mouth, bulbous nose - rather comic-book. The priest draws Bjorn towards the second statue: a figure with a disproportionately huge and erect phallus. PRIEST (CONT’D) You know who this is? BJORN (tentative) Frey? PRIEST Of course it’s Frey. Who else could it be? The god of sunshine and rain, of fertility, of children and crops. Of harvests. Of everything that grows new...but is cut down again each year. Then grows once more.",
      "dialogue_count": 0,
      "word_count": 2326
    },
    {
      "scene_number": 7,
      "slugline": "INT. RAGNAR’S HOUSE - EVENING Lagertha recites the saga to her children, who listen, like frozen things listening. LAGERTHA Balder’s horse, meanwhile, was galloping along the foreshore and worked into a streaming sweat. Then a servant plunged a short dagger into its throat. It gave a violent jerk and, without a sound, crumpled among the wrack.. EXT. FJORD - DAY Ragnar is out fishing with his son, Bjorn, in the deep soundless waters of the fjord. RAGNAR V.O. Now Odin strode through the shallows and gripped the gunwale. He climbed into the boat and stood over the body of his dead son. For some time he gazed at him... Ragnar gazes at the very alive, very animated face of his son. Then he speaks aloud: RAGNAR Then Odin bent down and put his mouth to Balder’s ear. Again he gazed at his son; then he left the boat. Ragnar looks over at the shore, and points out something to his son. Someone has kindled a fire on the far shore. LAGERTHA V.O. At a sign from Odin a servant stepped forward with a lighted brand. He set fire to the pyre and at once a steady plume of smoke, twisting and spiralling, rose into the calm air. And as father and son stare at the sight on the far shore, this is exactly what they see.  54 .",
      "characters": [],
      "action_text": "A boat has been set on fire - and the smoke, twisting and spiralling, rises into the calm air. INT. RAGNAR’S HOUSE - EVENING Ragnar goes on with the nighttime saga, as the children hover between wake and sleep. RAGNAR Thor raised his hammer. Slowly and solemnly he intoned the magic words to hallow the cremation. Then a dwarf called Lit came running along the water’s edge. He passed right in front of Thor, and Thor was so enraged that he put out a foot and tripped him. The dwarf flew threw the air and landed right on the licking and curdling pyre. In this way, he was burned to death beside Balder. Bjorn bursts out laughing at the thought of the dwarf flying into the fire. He laughs and laughs. And Ragnar smiles, and even his daughter is tickled. EXT. FJORD - DAY Father and son watch the boat, now completely alight, drift slowly across the water. It’s a fantastic, compelling image, the fire reflected in the water so it seems to spread out right across the fjord. RAGNAR V.O. The boat drifted across the water. Sea winds caught at her and tugged her away. First she was more boat than flame, but soon more flame than boat. She was a quivering shape, a farewell on the horizon, moving on under a great cloud of her own making. And so it is. And the boat burns on. INT. RAGNAR’S HOUSE - DAWN The first brightness in the night sky. A little rill of light.  55 . The moon is still in the sky, pale and diminishing. The camera travels through the house and its sleeping inhabitants. We see the colored shields, some weapons. The ashes of a fire, a slaughtered beast upon a hook. The children asleep, like any other children. But Bjorn still clasping his arm-ring in a deathless grip. The small statue of Freya. A sleeping cat. Ragnar and Lagertha naked and asleep, coiled together. Then Ragnar opens his eyes. And the first thing he sees is a horrifying mask. And then he hears laughter, and Floki rips off the mask as he stands over their bed. Ragnar stares up at him, covering his cock. FLOKI",
      "dialogue_count": 0,
      "word_count": 709
    },
    {
      "scene_number": 8,
      "slugline": "EXT. BOATHOUSE - DAY Floki, his assistant, Ragnar and Rollo pull and heave the finished boat, over wooden rollers, the short distance to the water. The boat glides into the water and the men climb in. Threading oars through the oarports they row the boat out into the deeper waters of the fyord, where a strong breeze ripples the surface and sends the clouds scudding across the sky. Floki is like a man possessed, grunting and groaning, sighing, swearing at, then encouraging the boat, listening intently to its creakings, watching for its listing. Ragnar ships his oar. RAGNAR Now the sail, Floki, the sail! FLOKI She’ll sink. Oh, what have I done? RAGNAR No she won’t. She won’t sink. FLOKI I shouldn’t have pretended to build such a boat. It’s beyond my humble capabilities. I’m a fool. He looks as if he’s about to cry. RAGNAR I’ll set the sail. Ragnar unfurls the large black sail. It falls. The others fasten the ropes. Nothing happens for a moment. The sail flaps rather uselessly. FLOKI I’m sorry, Ragnar. I’ve wasted all your money. It was all a joke. RAGNAR Shut up, man. A beat.  57 .",
      "characters": [],
      "action_text": "ROLLO Look! A breeze catches the sail and it swells out proudly. The boat starts to move. As it moves faster, the motion stabilizes, becomes less choppy. It glides on smoothly, still picking up speed. And now, suddenly, they’re flying! The boat, still sitting low in the water, cuts through it so easily that the frame doesn’t shudder on impact with the waves. It seems to ride over the waves. And, after a while, there’s an eruption of joy inside the boat, the men shouting, and hugging, and Floki going mad, laughing, leaping about, hugging them, trailing his hands in the water. FLOKI Ha! What did I tell you? Now it runs on its cool keel. It’s beautiful. Why didn’t you believe me? Then, as they speed on, they calm down. Sober up. Look at the shoreline racing past. Ragnar doesn’t say anything. He doesn’t need to, his expression says it all. He can see the future now. He is sitting on the edge of his dream. EXT. CLIFFS - DAY A HORSEMAN sits astride his horse, at the edge of the cliffs - and watches the black-sailed ship carving through the waves. We have seen him before. He has a livid scar that joins his mouth to his eye. He is one of Earl Haraldson’s housecarls. He stares as the boat flies on. END OF EPISODE 1 __________________________________________________________  58 .",
      "dialogue_count": 0,
      "word_count": 427
    }
  ]
}