{
  "slug": "vox-lux-2018",
  "title": "vox lux",
  "genre": "drama",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 17034,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. CLASSROOM - MORNING 2000  MEDIUM ON - MS. DWYER stands near the front door of her classroom welcoming students. STUDENT Good morning, Ms. Dwyer. MS. DWYER Welcome back. How was   break ? STUDENT Fine, thanks. Kids file in pulling off winter jackets and taking their seats off-screen.   CELESTE walks by unnoticed. Another student, THERESE, stops to chat with MS. DWYER. THERESE Morning.  SFX:   The bell rings. MS. DWYER Happy New Year.   Did you change your hair, Therese? THERESE My sister cut it.   She’s a hairdresser. MS. DWYER Does she work in town?   I’ve been wanting a cut like that. THERESE (flattered) Really?   She lives out of state. She was visiting us for the holidays but I can let you know when she’s back. MS. DWYER Would you mind? THERESE Sure, I can. MS. DWYER walks over to her desk and sorts through a few papers.  7.",
      "characters": [],
      "action_text": "MS. DWYER (enthusiastic) Welcome back, everyone. Did you have a good break? A few reply   “yes.”  MS. DWYER (CONT’D) I got some news yesterday about our computer appeal. EVAN What is it? MS. DWYER regards her watch. MS. DWYER I want to wait and share once everyone is here. We are just waiting on Adam and Elyse. EVAN Probably be awhile. MS. DWYER Why? EVAN murmurs something to the kid next to him. MS. DWYER (CONT’D) Evan, whatever you’re saying to him, save it for after class. Let’s please not start the year at odds. THERESE speaks up. THERESE I saw Adam 15 minutes ago. MS. DWYER Okay, then we’ll wait. STUDENT 2 Are they giving us desktops? MS. DWYER I said we’ll wait -- The YOUNG MAN from the school dance opens the door interrupting the flow of conversation.   MS. DWYER turns to address him... YOUNG MAN Excuse me.  8. MS. DWYER Yes? He asserts himself. YOUNG MAN My name is Cullen Active. MS. DWYER What? YOUNG MAN My name is Cullen Active. MS. DWYER Yes, Cullen, I know. The YOUNG MAN nimbly moves a handgun from the inner part of his jacket and   shoots MS. DWYER in the stomach   in a single shot. The class shrieks and rush in a panic towards the back of the class. One girl sits frozen in her seat. CLOSE ON - A light smatter of blood adorns   CELESTE’s   face.   Her mouth slacks agape. YOUNG MAN (O.S.) Celeste? Extended beat. YOUNG MAN (CONT’D) Celeste, go stand with the others. CELESTE doesn’t move a muscle. YOUNG MAN (CONT’D) Please, Celeste. She blinks. CELESTE Is she breathing- YOUNG MAN (O.S.) (deliberate) No.   (MORE)  9. Celeste, I need you to step away from the windows because in a few minutes there will be an explosion. There’s an audible gasp from the other students.   One girl begs off-camera. GIRL (completely distressed)  What are you doing?!   (beat)   Why are you doing this?  BACK TO - CULLEN, the YOUNG MAN, steps further inside revealing a machine gun. Everyone screams. CULLEN struggles lifting the heavy firearm but after a few moments manages to fire i",
      "dialogue_count": 0,
      "word_count": 1142
    },
    {
      "scene_number": 2,
      "slugline": "EXT. AERIAL VIEW OF THE SCHOOL - LATER  SFX: Berlioz’s choral piece “La Damnation de Faust” rings out... The rich orchestral score swells over the view of the school from a helicopter.  Bold FRONT CREDITS in primary hues   roll   up over the image in a scroll. INT. AMBULANCE - LATER  CREDITS SCROLL continues over the following...  SUPER WIDE ANGLE, HANDHELD ON - CELESTE is partially wrapped in foil, upside down on the gurney. An oxygen mask covers her face. The scene is frantic. Paramedics hover over her body. PARAMEDIC Celeste, you’re doing so good.   You just keep breathing, honey.   You’re gonna feel a pinch at the base of your spine. The piece of music Cullen hummed as he walked home alone before reprises over a NEW ANGLE ON CELESTE. ULTRA SLOW MOTION - She seems to hum along underneath the mask.  INT. REHABILITATION CENTER - DAY  AN EXTENDED SERIES OF VÉRITÉ STYLE CLOSE-UPS - Victims of the massacre exercise in pained, deliberate movements.   A few weeks have passed. Some victims seem more adapted to their new circumstances than others. ANGLE ON - CELESTE’s neck is heavily bandaged.   She slowly limps across the space with her   MOTHER   and   PHYSICAL THERAPIST   at her side. CELESTE’S MOTHER looks like she hasn’t slept in weeks. CELESTE suddenly stops.  14.",
      "characters": [],
      "action_text": "CELESTE’S MOTHER Tell us if you’re going to be sick again. CELESTE I’m sorry... CELESTE’S MOTHER Don’t be sorry. PHYSICAL THERAPIST I’ve seen much worse.   What are you feeling now? CELESTE I feel like I’m on a boat. PHYSICAL THERAPIST Nausea won’t subside? CELESTE It’s not just that.   I just feel like I’m spinning.   You think it’s in my head? PHYSICAL THERAPIST I don’t think it’s in your head at all.   I just don’t think this has to do with the spinal injury.   Are your ears ringing? CELESTE I need to sit. CELESTE’S MOTHER I’ll get your chair. CELESTE’s MOTHER leaves CELESTE who breathes hard. PHYSICAL THERAPIST Take another step with me while we wait for your mom. CELESTE takes another pained step. Moments later she returns with a wheelchair. CELESTE’S MOTHER Sit, my love. CELESTE sits sluggishly.  15. CELESTE Where’s dad and Eleanor? CELESTE’S MOTHER They went to get us some food. PHYSICAL THERAPIST Some of the other kids have complained about ringing in their ears from the gun blasts.   I’ll talk to your doctor.  INT. LAB ROOM - NIGHT  CELESTE’s body glides into a CAT scan.   Her skin appears translucent underneath the violet lamp.   Here, she looks like a cyborg.  INT. HOSPITAL ROOM - NIGHT  CELESTE’s older sister,   ELEANOR   (16), lies entangled in CELESTE’s embrace.   She cries for a long time holding onto her sister tight. The image is a kind of modern   chiaroscuro ; so dark that it resembles something like a Bill Henson photograph. ELEANOR I’m so sorry I was sick. I should have been there for you.   I’m so grateful you’re alive. I think I would have died - or just killed myself. I don’t think I could have standed it. I’m here now and I am never going to leave you - ever. CELESTE cries now too, smiles, and then breaks into a fit of laughter. CELESTE Oh, God, Ellie. I think I’ve done something terrible. ELEANOR’s face wrinkles in anguish. ELEANOR It’s not your fault. What more could you have done? You’re safe with me.  16. INT. HOSPITAL ROOM - AFTERNOON  ",
      "dialogue_count": 0,
      "word_count": 922
    },
    {
      "scene_number": 3,
      "slugline": "INT. PARK - NIGHT  One hundred persons walk in silence carrying candles beneath their chins. LOUDSPEAKER VOICE (O.S.)  Two sophomore students, Vanessa Cooke and Elyse Hanlin, remain in critical condition.   Hold them especially in your prayers and please join me in a moment of silence.  ANGLE ON - CELESTE’s MOTHER and FATHER who push CELESTE in a wheelchair. ELEANOR walks to the side.  INT. CHURCH - NIGHT  THREE QUARTER PROFILE ON -  FATHER CLIFF   preaches in front of his congregation.   He stops to cry occasionally without affectation.   His tone is direct and sincere.   He breathes evenly trying to gather himself. FATHER CLIFF You’ll have to excuse me. These   are not   only   tears of profound sorrow but of   profound joy , as well, because I see so many young faces here before me whom we helplessly feared for many hours forever lost. The audience is audibly moved by his frankness. FATHER CLIFF (CONT’D) We are here to honor your heroism and mourn the loss of your loved ones and peers. First, I have a difficult request to put forth but as I see it, it’s the only way we might begin to move forward... Heaving sobs ring out off-screen.  19.",
      "characters": [],
      "action_text": "FATHER CLIFF (CONT’D) Ferocious anger and hatred caused this and we can’t have any more anger around us this minute so I must ask you to include the perpetrator of these vicious attacks and his parents in our prayers tonight, as they too lost their child in January. ANGLE ON - Photographers stand at the side aisles.   Bulbs flash again and again. FATHER CLIFF (CONT’D) By this way of healing prayer, victims of the tragedy will be released from their own grief and rage in the afterlife, and they shall live forever in our hearts. Lives lost too young here on earth but with whom we all anxiously wait to be reunited.   They walk with God now... A SERIES OF PORTRAITS - VARIOUS PARISHIONERS weep...   The crowd largely dons their school colors and team jerseys. ANGLE ON - We finally reach ELEANOR and CELESTE who sit quietly like a couple of nuns with their eyes reverently closed. FATHER CLIFF (CONT’D) We’ll be inviting Ridgewood students to take my place - share their thoughts, memories, feelings with all of you.   To begin, please join me in welcoming a very brave young woman to the piano. She has prepared a piece of music for us all tonight.   Celeste? CELESTE uses a set of crutches to get herself to a piano that’s been set up with a microphone.   She slides onto the bench and clears her throat... She really looks very beautiful.   A necklace covers her bandaged neck. Everyone claps for her in support.  20. CELESTE (into the mic) Uh, I tried to prepare something to say but I couldn’t really put my feelings into words exactly so I thought I’d try and do this instead. My sister, Ellie, helped me. She starts meekly but after the first verse, her voice begins to rise up emotively. CLOSE ON - CELESTE.... CELESTE (CONT’D) (sings)  Don’t be afraid father, you raised us well. I heard your voice cry out with the day’s first bell. And the bells tolled and the sirens rang o-ut I can feel my chest tightening, squeezing on-to my he-art  The music moves through her.   Whatever of it’s ",
      "dialogue_count": 0,
      "word_count": 2607
    },
    {
      "scene_number": 4,
      "slugline": "INT. HOTEL ROOM - CONTINUOUS  CELESTE enters frame and cracks open the door... THE MANAGER i got a call from that- He whispers the next word. THE MANAGER (CONT’D) (whispers)  -bitch-  He continues in a normal voice. THE MANAGER (CONT’D) -we met with that you’ll want to know about. CELESTE Is it bad? THE MANAGER are you gonna let me in? CELESTE Ellie’s getting dressed. THE MANAGER stays in the doorframe. THE MANAGER they shopped it around to radio- CELESTE And what?! THE MANAGER (calm, collected) -and we did it.   Please Remember is  testing in the mid-nineties. CELESTE What about the other ones? THE MANAGER furrows his brow. THE MANAGER they did fine i think but we only needed one to work. Beat. THE MANAGER (CONT’D) you don’t seem very excited.  33.",
      "characters": [],
      "action_text": "CELESTE I am, I’m just overwhelmed, I guess. THE MANAGER A & R is gonna send through a list of their acts they think you can open for in the spring. CELESTE I can’t believe this. Oh my god. THE MANAGER listen, i’m gonna send you home for a week or two and i want you to rest up cause guess what? i’m taking you to stockholm after the break. CELESTE What?! THE MANAGER they want enough tracks for an album and i want you working with this guy. the best. you’d know his stuff if you knew he wrote it. he’s written everything - hits - and i told him to make space for you. he said okay if we come to him. CELESTE In Sweden? THE MANAGER whatever you got that’s half- written, ideas, whatever you got. let’s go lay it down. ELEANOR steps out of the bathroom, having washed all her make- up off. ELEANOR See, I told you you would get really big. ELEANOR smiles a half moon. HARD CUT TO:  34. SUPER FAST MOTION (8 FPS) DIGITAL VIDEO MONTAGE OF CELESTE AND ELEANOR’S TRIP TO SWEDEN SET TO THE SCANDINAVIAN CHILDREN’S SONG,   “DYRENE I AFRIKA.”  - The girls systematically test perfumes next to THE MANAGER at duty free in an airport. - Various shots of rain on the European motorway. - Eleanor and Celeste sleep inside the van. NARRATOR  Following a short visit home with their parents, Celeste’s manager had the girls’ passports expedited and the three of them set flight for an unfamiliar, if not particularly exotic, foreign city where they would go on to have many uniquely first experiences...  - The girls arrive at Tor Erik’s studio, THE MANAGER makes introductions. - A series of various recording sessions... - THE MANAGER sleeps on a couch. - The sun rises and sets and rises and sets. NARRATOR (CONT’D)  Producer, Tor Erik Romstad, was initially skeptical but grew increasingly infatuated with the inseparable sisters; and though he considered himself a beat up old atheist that had been “phoning it in” for some time in the pop music game”, he found the girls’ kind- hearted devotion to God, musi",
      "dialogue_count": 0,
      "word_count": 1580
    },
    {
      "scene_number": 5,
      "slugline": "INT. HOTEL ROOM - LATER SFX:   Shostakovich mournfully underscores the scene. CELESTE lies next to MUSICIAN.   The necklace which covers the scar on her throat gives her appearance a sci-fi quality: The  Woman   Who Fell to Earth. MUSICIAN is almost asleep in a dope haze.   It gives a casual air to the proceedings. CELESTE You make the same sort of music the boy who attacked me used to listen to. MUSICIAN Does that remind you of him? CELESTE It did just this moment. MUSICIAN I hope that doesn’t upset you too much. CELESTE It doesn’t. I think that when you meet someone who is going to become important to you that it forces us to look back at the past so we can get on with the future is all. MUSICIAN opens his eyes, thinks. MUSICIAN In our defense, maybe it was the thing that pushed that kid over the edge or maybe it was the only thing that could have saved him and all those other poor kids. CELESTE’s expression darkens. MUSICIAN (CONT’D) Anyhow, I’m glad you think I’ll be important to you. CELESTE I try not to think about it or talk about it.  42.",
      "characters": [],
      "action_text": "MUSICIAN Why would you? I mean, what is there to talk about? CELESTE smiles. CELESTE That’s what I love about pop music, I think.   I don’t want anyone to have to think too hard.   I just want them to feel good.... Put your hand between my legs. MUSICIAN responds. CELESTE (CONT’D) Inside. He nods. CELESTE (CONT’D) (whispers) Since last January, I have the same dream every night. MUSICIAN Tell me. CELESTE In my dream, I am speeding through a tunnel that won’t end. MUSICIAN You’re in a car? CELESTE No, it’s a motorbike - or maybe it’s not but I am wearing a helmet or something because my view is through some sort of a mask - and every time I turn these wide bends in the road, I drive past a body but I don’t stop for it. MUSICIAN A dead body?  43. CELESTE Not exactly but, lifeless - after some time I realize that they are these doubles of me, like clones, that I’ve tried to send down the tunnel in my place but they’ve never made it to the end. They’re not ever the same age and they’re always laid out in a different configuration. MUSICIAN That makes sense. CELESTE Does it? He wakes up a bit. MUSICIAN Sure - you almost died so now it’s easy to imagine yourself dead at any age. CELESTE But in the dream I know that I will never die. MUSICIAN pushes into her deeper and makes a crude joke. MUSICIAN What’s at the   end of the tunnel . She laughs. CELESTE I always wake up before I get there but I’m so frightened because I’m going somewhere where no one can find me and no one knows my name.  INT. HOTEL HALLWAY - EARLY THE NEXT MORNING  CELESTE exits an elevator and tiptoes down the hallway.   As she comes close to us, we see that tears stream down her face.   She looks pretty strung out. CAMERA pans and follows her to the end of the hall. She reaches her sister’s room and slips a key into the door.  44.",
      "dialogue_count": 0,
      "word_count": 547
    },
    {
      "scene_number": 6,
      "slugline": "INT. HOTEL ROOM - CONTINUOUS  She opens the door and freezes upon the sight of THE MANAGER, naked, sleeping next to ELEANOR. CELESTE stands a long beat looking at them then... CELESTE Guys, wake up. They don’t respond. CELESTE (CONT’D) Please, you gotta wake up. ELEANOR suddenly shoots up in bed. ELEANOR What are you doing in here? CELESTE I had your key.   Where’s the remote? CELESTE searches the room feverishly for a remote control. CELESTE (CONT’D) You gotta turn on the news. ELEANOR is completely out of it. She shouts... ELEANOR GET OUT OF HERE! CELESTE Where’s. the. remote? A plane just crashed into a building in New York.  EXT. TUNNEL - DAY  A motorcycle speeds through a tunnel. After some time... LOUDPSEAKER VOICE Now, slow to 40- NEW ANGLE - A camera crew in a follow car tries to keep a steady pace behind the motorcycle.  45.",
      "characters": [],
      "action_text": "CELESTE clutches a man on a motorcycle and she wears a very  distinctive mask . CLOSE ON - CELESTE’s face. She lip syncs through the open hole for the mouth. CELESTE (sings)  Take me by the hand to where no one knows my name. Make me feel different tonight or make me feel the same (as I used to...) But when I’m out on stage, it’s all for you When I can’t make the grade I know who’s out there to pull me through (through) I’m sick and I’m tired of this party (party) All I can think is you and your body (body)  INT. TUNNEL - LATER  For a new set-up, CELESTE now has her face revealed to camera while a group of back-up dancers now wearing different variations of the mask from the previous shot lunge towards the center of the lens. CELESTE (lip syncs to playback)  (I keep singing) One for the money! two for the show! on three we get ready and - on four we go! (I keep hearing) One for the money! two for the show! on three we get ready and - on four we go!  NEW ANGLE ON - In profile, we TRACK LEFT with the camera crew and dance troupe as they perform, lunging over and over again at the camera and track set up in front of them.   They each take turns vying for the front position.  46. From this angle each gesture seems lightly absurd. FADE TO BLACK: INSERT TITLE:  ACT II  EXT. BRAC BEACH RESORT - DAY  ULTRA WIDE PANORAMA ON - Due to the uniform aesthetic of the striped umbrellas it resembles the 1950’s but the beachwear suggests that actually some years have passed. After some time,   a row of men dressed in masks   enter the frame and begin shooting at civilians. It takes a moment for the crowd to react and understand. People begin running for their lives.   Most run directly into the sea.   Dozens are shot in the back and fall into the water. The scene is horrific, brutal.  INT. ATLANTIC CITY HOTEL - MORNING  STEADICAM ON - THE MANAGER, older now, even more disheveled, walks briskly down the hall of an upscale hotel. A stylist and a few PA’s exit a room and nod at him as t",
      "dialogue_count": 0,
      "word_count": 7922
    },
    {
      "scene_number": 7,
      "slugline": "EXT. ATLANTIC CITY STRIP - EVENING  A sign rotates advertising Celeste’s residence.   The advertisement boasts- “ CELESTE   &   THE   DIRTY   THIRTY   PRESENTS   VOX LUX:   LIVE”  EXT. BACKSTAGE LOT - CONTINUOUS SFX: Constant percussion rises and falls in the mix. Occasionally blending with the pre-show recordings inside the auditorium.  A security team awaits CELESTE’S arrival.   After some time, a van pulls up and CELESTE and her entourage exit the vehicle. JOSIE has to help CELESTE out of the sliding door. FRANTIC HANDHELD ON - A PA speaks up... PA Can I help you Ms. Montgomery? CELESTE No one calls me that. JOSIE, THE PUBLICIST Give her some space. Are there cameras back there? PA Not that I know of. JOSIE, THE PUBLICIST Tell your team if anyone is caught taking a picture of her, they’re fucking fired. JOSIE turns her attention to CELESTE JOSIE, THE PUBLICIST (CONT’D) What can we get you? CELESTE I’m so thirsty. JOSIE turns to the PA.  89.",
      "characters": [],
      "action_text": "JOSIE, THE PUBLICIST Get her some sparkling water and something to eat. PA Oh, sure, like what? JOSIE, ELEANOR, and THE MANAGER are nearly dragging her into the back entrance of the auditorium. JOSIE, THE PUBLICIST Something with sugar. CELESTE Where’s Albertine? ELEANOR She’s behind you. CELESTE Take her to get something to drink. ALBERTINE We’re not leaving you. I’m right here. CELESTE looks behind her to see ALBERTINE. CELESTE There you are. Don’t look so upset. Just go and get something to drink and get your seat.  INT. AUDITORIUM HALLWAY - CONTINUOUS  CELESTE’s LASER DIRECTOR greets her at the door. LASER DIRECTOR I just needed to quickly introduce myself. I’m stepping in for O’Malley tonight. CELESTE looks at him but doesn’t respond. JOSIE, THE PUBLICIST Now’s not a great time. The LASER DIRECTOR suddenly sees what terrible shape she’s in. LASER DIRECTOR Oh, sorry.  90. CELESTE’s eyes focus... CELESTE Who’s O’Malley? LASER DIRECTOR Your laser director. CELESTE I’ve never met him. What happened to him? LASER DIRECTOR He’s got a throat infection CELESTE -but this is the first show. JOSIE cuts him off.. JOSIE, THE PUBLICIST I said now isn’t a good time! They keep walking. JOSIE looks across to THE MANAGER who has yet to say a word. JOSIE, THE PUBLICIST (CONT’D) I need you to call this RIGHT NOW if she can’t go on. THE MANAGER she’s fine. (to Celeste) stop with the histrionics, baby. The PA walks ahead trying to make way for them. PA There’s a room prepared just here on the left. The PA dictates a door on the left. CELESTE (shouts) I KNOW! We’ve been here every day for a week. CELESTE shakes everyone loose. CELESTE (CONT’D) Let go of me. She braces herself against the doorframe. They enter the room.  91. CELESTE (CONT’D) Everyone thinks I’m an idiot. ELEANOR No one thinks you’re an idiot. CELESTE (slurs) Just, shut up- THE MANAGER don’t be a spoiled brat. you’re embarrassing yourself. CELESTE (shouts) Don’t call me   brat!  ELEANOR says to JOSIE. ELEANOR Get her o",
      "dialogue_count": 0,
      "word_count": 2314
    }
  ]
}