{
  "slug": "weird-city-101-the-one-2019",
  "title": "weird city 101 the one",
  "genre": "romance",
  "format": "series",
  "scenes_count": 2,
  "characters_count": 0,
  "characters": [],
  "total_words": 3074,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. DINER - LATER THAT NIGHT Stu and Burt talk and eat. STU So, since I grew up Below The Line I was never assigned a wife. That’s how I ended up going to The One. BURT Huh. I was assigned. But my wife... she passed away. STU Sorry to hear it. BURT It’s all right. It was a long time ago. STU Yeah... The Greek Waiter taps onto a screen in the table - a digital check is projected. Burt and Stu both try to zap it with their smart phone. BURT I got this. STU No, no I got it. BURT Stop it! I got it! CUT TO: EXT. DINER Burt and Stu leave the diner. STU Well, that was fun. BURT Definitely. STU If I need a new car I know who to go to.  17.",
      "characters": [],
      "action_text": "BURT Please. My days on the floor are over. I’m a desk jockey now. STU All rright, well, I’ll see you around. BURT Yep, bye. They slowly wander away from each other. INT. NEGARI LABS Stu stands at the front desk. No one is there. The same TV commercial plays on the screen. STU (to the beyond) Hello? It echoes back through the labs. It seems like no one is there. Stu walks back behind the desk and into the labs. He walks along lines of vials and beakers, computers and machines. The place is totally empty. He sees a couch in a break area. On it is Dr. Negari - dead asleep. Then he hears a voice behind him. BURT (O.S.) Hello! I’d like my money back! Burt comes around a corner. He and Stu both scream. STU Ahhhh! BURT Ahhhh! This wakes Dr. Negari from his nap, who also screams. DR. NEGARI Ahhhhh! They all scream for a beat.  18. STU Ahhhh! BURT Ahhhh! DR. NEGARI Ahhhh! Dr. Negari runs into a human size glass tube (kinda looks like a “beamer” from Star Trek). He shuts the door, pushes a button, and is sucked up into the tube. STU Wait! BURT Hey! STU What the hell? BURT I guess he didn’t want to give us our money back. STU Huh. Welp... lunch? BURT Sure, well, I had some work to do, but yeah... STU We could go back to my place. I can cook. I make a mean grilled cheese. BURT Yeah, yeah, sure. Both their eyes sparkle. SMASH CUT TO: INT. STU’S APARTMENT Burt and Stu lie in bed panting. STU That was insane. Had no idea that was gonna happen.  19. BURT Yeah. Me neither. STU Did you actually want that grilled cheese? BURT Nah, I don’t like grilled cheese. CUT TO: MONTAGE - BURT AND STU FALL IN LOVE EXT. CITY STREET - DAY Burt and Stu stand on a moving sidewalk as it rolls along, excitedly talking. EXT. JAPAN-IMATION PET STORE - DAY As if looking at puppies in a bin - Stu and Burt look through glass at digitally projected Japan-imation creatures playing with each other. INT. FUNHOUSE - DAY Stu rolls a virtual rolly ball up a virtual rolly ball game thing and wins a prize - a stuff",
      "dialogue_count": 0,
      "word_count": 2325
    },
    {
      "scene_number": 2,
      "slugline": "INT. FUNHOUSE - DAY Stu rolls a virtual rolly ball up the virtual rolly ball game thing and wins a prize - a stuffed bear. He throws it in the garbage. EXT. PIER - DUSK Stu eats an ice cream cone on the pier as the sun sets. He wipes some ice cream on his own nose and tries to lick it off. He can’t. INT. STU’S APARTMENT Stu and the Hot Waitress are in bed together. The Hot Waitress is super into it. Stu is not. END OF MONTAGE INT. YOU MUST EAT HERE RESTAURANT Stu is out to dinner with the Hot Waitress. He is eating his signature dish. STU What’s so great is I get to have the egg whites and also the yolks. HOT WAITRESS Ew. Why would you even think to do that? STU I don’t know... I just want the yolks too... HOT WAITRESS Weird. Stu takes some mashed potatoes from her plate and playfully smears them on her nose. HOT WAITRESS (CONT’D) What the fuck are you doing? Stu reflects on this. STU Nothing. I’m doing nothing. Stu drops his silverware. He stands up. And makes a choice.  32.",
      "characters": [],
      "action_text": "STU (CONT’D) And I should be doing something. He throws some money on the table and runs out. CUT TO: INT. AIRPORT A bunch of people line up to board a plane. EXT. STREETS It pours rain. Stu runs through the rain. STU Burrrrrrt! INT. AIRPORT The final passenger heads down the jet way. The STEWARDESS shuts the door. EXT. AIRPORT Stu runs toward the airport doors. STU Burrrrrrrrrrt! INT. AIRPORT Stu runs up to the boarding area - through the window he sees the plane take off. STU Burrrrrrrrrt! No! Why am I always late?! I’m always late! Stu cries. Then - a voice from behind him. BURT (O.S.) Good thing I’m always late too. Stu turns around - Burt is standing there with his bags. MUSIC: SOMETHING LIKE “EVERY TIME YOU GO AWAY” BY PAUL YOUNG  33. Stu runs into Burt’s arms. They kiss. BURT (CONT’D) Fuck science. STU Yeah, fuck science. They walk off, hand in hand. MONTAGE: HAPPY COUPLES/LOVE IN WEIRD CITY EXT. A HOUSE The Hot Waitress sets down some bags and knocks on a door. It opens. It is the Greek Diner Owner. They kiss. INT. NEGARI LABS - NIGHT The Technician is closing up. He turns the lights off. The door opens and the TV Pitchman walks in. He is indeed a different guy. They dance together in the dark lab by the light of a Bunsen Burner. They kiss. INT. WHITE VOID The weird Old Man and Woman dance together. They kiss. INT. STU’S PARENTS’ HOUSE Linda and Ron pet the owl. EXT. STREET Booj and Plisa stand in front a Therapy Machine (looks like a vending machine). Booj puts a dollar in the slot and then looks at the buttons. Each button is labeled with a psychological problem - “Anger Issues”, “Insomnia”, etc. Booj pushes a button labeled “Mom Stuff”. A piece of paper comes out of the machine. It reads “Your fixation on the past stops you from living in the present”. Booj weeps as Plisa rubs his back. EXT. JAPAN-IMATION PET STORE The Japan-imation projections happily play together.  34. INT. FUNHOUSE The Mean Dude that hit on Burt pulls the discarded stuffed bear out of",
      "dialogue_count": 0,
      "word_count": 749
    }
  ]
}