{
  "slug": "what-they-had-2018",
  "title": "what they had",
  "genre": "drama",
  "format": "film",
  "scenes_count": 16,
  "characters_count": 0,
  "characters": [],
  "total_words": 18822,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. OAK PARK CONDO - MASTER BEDROOM - NIGHT RUTH, now late 60s, sits on a chair, her leg silhouetted in the moonlit window as she pulls on silk knee-highs.   She is thinner now, but not frail.   She is still very beautiful. INT. OAK PARK CONDO - NIGHT ON THE TREE -- A series of early 80s wedding portraits: Bridget is a young   bride, in head to toe lace, smiles lovingly at EDDIE, handsome, top hat and tails. Bert bursts with joy as he gives his father-of-the-bride speech, scotch in one hand, cigarette in the other. INT. OAK PARK CONDO - MASTER BEDROOM - NIGHT Ruth selects pearl earrings from a jewelry box. A rosary is draped over the mirror, funeral cards tucked into it’s frame. In the bed behind her, BERT, now 70s, is sound asleep. ON THE TREE: 1990s. Bridget looks down at an INFANT of her own. 1990s. Her brother, NICK, graduation gown, stands on the lawn of a midwestern college, flanked proudly by Bert and Ruth. 1990s. Two Polaroids, framed side by side. In one, Nick sits in a canoe holding a huge rainbow trout. In the other, Bert is in the same canoe, holding a tiny minnow. INT. OAK PARK CONDO - HALLWAY - NIGHT In the moonlight, Ruth steps to a long antique mail table. She fluffs her hair in the mirror above it. ON THE TREE: 1990s. Bridget walks down a Chicago street, beaming at us, holding the hands of TWO LITTLE GIRLS. 2.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 252
    },
    {
      "scene_number": 2,
      "slugline": "INT. OAK PARK CONDO - HALLWAY - NIGHT Ruth pulls a short jacket from the hall closet and drapes it over her shoulders. She lifts her purse from the table and starts down the hall. ON THE TREE: 2005. Bert sits in a hammock, Ruth on his lap. She kisses him like she means it, dislodging his rose-tinted glasses. He grins at us like the Cheshire Cat. As the clock ticks, we pull slowly back, and back, and back. There are lights on this tree. A garland of stars. But no ornaments. Just the pictures we’ve seen and a dozen others. We pull back further. Sheer white curtains float in a breeze, framing SLIDING GLASS DOORS, open just wide enough for... Ruth to stand between them. She faces the snowy night. Her purse dangles at her side. Under the jacket, her white nightgown glows in the moonlight. In her sensible heels, she steps into the snow. EXT. OAK PARK CONDO - BACK ALLEY - NIGHT Ruth walks away from us, framed by the alley, through the immaculate blanket of snow. And then, slowly, the image of her fades from frame. Until her footprints are the only evidence she was there at all. TITLE CARD WHAT THEY HAD EXT. MENLO PARK SUBDIVISION - NIGHT Gray light is just beginning to crack over the horizon. BRIDGET, now 40s, in athletic gear, sprints down a street of basically identical houses, basically identically decorated for the holidays with tidy strings of white lights. She picks up her pace, racing now, faster and faster, hitting agony, pushing past it, around the corner into a cul-de- sac... 3.",
      "characters": [],
      "action_text": "She comes to a stop in front of another basically identical house, the only one with colored lights strung out front. Chest heaving, she puts her hands on her knees and recovers. INT. BRIDGET AND EDDIE’S HOUSE - KITCHEN - DAY EDDIE, now late 40s, in a bathrobe, pours himself cereal in their high-ceilinged, well-appointed kitchen. Bridget comes in with the newspaper. In silence, she pours coffee. They weave around each other, a chilly, well-practiced dance. They settle on either side of the counter with coffees and breakfast. He peruses the Business section, she the Arts. Without looking up from their papers: EDDIE You’re picking up Emma? BRIDGET Yep. INT. DORM - EMMA’S FLOOR - DAY At the end of a long, near-deserted dorm hallway, Bridget knocks on a door. There’s no answer. She knocks harder. Halfway down the hall, an RA stands with two GIRLS, who sit on a couch with suitcases, whispering in Bridget’s direction. RA Is she not answering? Bridget looks at her and shakes her head. The RA approaches and puts her master key in Emma’s dorm room door. INT. EMMA’S DORM ROOM - CONTINUOUS The curtains are closed; the room is dark. Bridget hurries in, past the tidy side belonging to Emma’s roommate, and into Emma’s filthy half of the room. Her suitcases are packed up. There’s a lump in bed. Bridget yanks away pillows, revealing EMMA, 20, sleeping in headphones. Bridget shakes her awake. BRIDGET Emma. Emma cracks open her eyes and blinks at her mother. 4.",
      "dialogue_count": 0,
      "word_count": 526
    },
    {
      "scene_number": 3,
      "slugline": "INT. EMMA’S DORM ROOM/HALLWAY - DAY Emma and Bridget pull a CART packed with Emma’s belongings into the hall. Bridget notices something written on the dry- erase board hanging on her door.  For a good time... KNOCK  Bridget moves swiftly to erase it, but Emma has already seen it. She stares, punched in the gut. Bridget marches down the hall toward the two girls. Emma follows, knowing exactly what her mother is about to do. EMMA Mom.   Mom.  Bridget ignores her and steps up to them, furious. She glares at the girls. They stare back at her. BRIDGET Shame on you girls. What is the matter with you? She turns toward Emma, who waits, mortified, by the elevator. As Bridget walks up, Emma glares at her. BRIDGET (CONT’D) What? You have to stand up for yourself, you have to fight back. Show some self-respect, don’t be a doormat -- EMMA Shhhhhh! BRIDGET Oh whatever, you’re kicked out of this stupid dorm anyway. Drug and Alcohol Free, it’s college for chrissakes. The elevator doors open. Emma ducks inside. Bridget struggles to push the cart in. The girls giggle from the couch. Bridget gives them the finger as the doors close. EMMA  Mom!  5.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 203
    },
    {
      "scene_number": 4,
      "slugline": "EXT. DORM - FRONT ENTRANCE - DAY Bridget pushes the cart out the door. Emma follows behind, furiously digging through her backpack. Emma stops to light a cigarette. Bridget whirls around. BRIDGET You should not be smoking. It is terrible for you. (then) What is going on with you? EMMA Nothing. Bridget watches Emma puff awkwardly on the cigarette. BRIDGET You look absolutely ridiculous. EMMA Thank you. INT. BRIDGET AND EDDIE’S HOUSE - MASTER BATHROOM - DAY Bridget changes into nicer clothes. Eddie brushes his teeth. EDDIE Maybe she shouldn’t go back. BRIDGET Don’t   even   go there , Eddie. EDDIE Why? She’s a mess, let’s take a semester off and regroup. BRIDGET Because she’ll never go back, that’s why, and then she’ll be kicking herself. Just encourage her, would you please? Bridget spots headlights in the driveway out the window. BRIDGET (CONT’D) That’s them. She hustles out of the room into -- 6.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 154
    },
    {
      "scene_number": 5,
      "slugline": "INT. BRIDGET/EDDIE’S HOUSE - HALLWAY/EMMA’S ROOM - CONTINUOUS Emma’s door has a NOTE on it that reads:  HOW IT WORKS YOU: Knock ME: “Come in” YOU: Enter  Bridget disregards these directions, knocking and entering in one fluid motion. INT. BRIDGET AND EDDIE’S HOUSE - EMMA’S ROOM - CONTINUOUS Emma is changing. She holds her shirt to cover her chest. EMMA Mom! BRIDGET Sorry. Mary and Daniel are here. EMMA  David .  BRIDGET David! David David David -- EXT. BRIDGET AND EDDIE’S HOUSE - FRONT DOOR - NIGHT Bridget heads toward MARY, her eldest, who is stepping away from her fiancee DAVID’S BMW, parked on the curb. A diamond sparkles on her finger. BRIDGET You made it! They embrace. As they pull away, Bridget’s eyes go straight for Mary’s hair. MARY Stop looking at my hair. BRIDGET I’m not. Behind Mary, David is pulling a SHOPPING BAG of gifts and a platter out of the trunk of the BMW. 7.",
      "characters": [],
      "action_text": "DAVID Merry Christmas, Bridget. BRIDGET Merry Christmas! Mary quietly reminds Bridget: MARY  David.  BRIDGET  I know.  (loudly, to David) David! Nice to see you! David approaches. She hugs him around the platter. DAVID Thanks for having me. I brought crab. BRIDGET (to Mary) He brought crab! DAVID Well but I know you’re a chef and everything so - BRIDGET Oh I’m sure it’s very good. MARY It is, it’s very good. BRIDGET Good! An beat, then: DAVID Shall we? BRIDGET Yes! Well. I’ll be - right there - I just have to grab something -- Mary and David head toward the front door as Bridget trots to her SUV, parked in the driveway and opens the driver’s door and leans across the driver’s seat. She fishes through the pennies in the cup holder, then: 8. BRIDGET (CONT’D) Shit. INT. OAK PARK CONDO - MASTER BEDROOM - NIGHT We are back in that condo with the ticking clock. Bert sleeps in bed. A distant train horn rouses him. His eyes open. He reaches for the other side of the bed. Feeling it empty, he sits up and reaches for his glasses. His gray comb-over stands on end. BERT Ruth. INT. OAK PARK CONDO - HALLWAY - NIGHT Bert flips on the light and squints into the brightness. A gold crucifix glints in his salt and pepper chest hair. He feels a draft and stiffens. Walks into the LIVING ROOM. The sliding door is open. The curtains wave in the breeze. BERT Goddammit! He sprints, panicked, for the door. EXT. CONDO BUILDING - BACK ALLEY - NIGHT Bert, in slippers and a robe, stands a few paces down the walkway, scanning the landscape urgently. He spots Ruth’s footprints in the blanket of snow. INT. NICK’S BASEMENT - NIGHT NICK, now 45, sleeps on an air mattress in a corner. On the floor beside it, his phone rings with the ALARM ringer, the one that sounds like an accident in a nuclear power plant. He pries himself awake and squints down at the phone on the ground, next to a stack of books and a bottle of booze. He reaches for the phone and answers it. 9. NICK Dad. INT. BRIDGET AND EDDIE’S H",
      "dialogue_count": 0,
      "word_count": 832
    },
    {
      "scene_number": 6,
      "slugline": "EXT. O’HARE AIRPORT/NICK’S RANGE ROVER - DAY It’s still snowing. Chicago news radio reports the snowstorm in Nick’s used Range Rover. He’s driving through O’Hare arrivals -- until he gets stuck behind an empty car. It’s OWNERS make out by it’s open trunk. Cranky, Nick lays on the horn, startling them apart. Nick pulls up to the curb and turns down the radio, spotting Bridget and Emma coming out of the airport doors. He leans out the open window. NICK Yo dickheads! INT./EXT. NICK’S RANGE ROVER - DAY Bridget sits in front, Emma in back. Nick hands out lattes. NICK Here’s your ten dollar coffees. Where’s Eddie? BRIDGET He had to work. Where’s Dad? NICK He’s looking for her, looking everywhere, every single place she’s ever been in her life. EMMA Did you check the hospitals? NICK Hospitals, St. Giles, the Rotary Club, even went by the nursing home in case she thought she was still working there. EMMA Did you call the police? NICK ‘Course I called the police. His tone is sharper than he means it to be. She makes a face. BRIDGET They have Dad’s number? 12.",
      "characters": [],
      "action_text": "NICK Dad’s, mine, yours, yours, the condo and Marion Down The Hall’s. (then; shaking his head) Dad’s goin’ outta his mind, Bitty, he’s white as a ghost. When he called I thought he was having another heart attack. Bridget looks out the window and sips her latte, taking in the gray of her hometown. It looks very, very cold. NICK (CONT’D) I knew this was gonna happen. Been tellin’ him for years, figure out what you wanna do with Mom when the time comes, ‘cause we all know it’s coming, we all know how this thing works. BRIDGET It’s hard for him. NICK You know what’s gonna be hard for him? Her turnin’ up next week in a goddamn block of ice. Emma and Bridget’s stomachs drop. NICK (CONT’D) It’s over. She cannot be at the condo anymore. She’s goin’ to a place and he’s gonna haveta let her. (then) If I hear one goddamn peep about freakin’   Florida , I swear to God. He fishes a pack of Pall Mall’s out of his parka pocket. BRIDGET What happened to quitting? NICK Life, Bitty. Life happened to quitting. BRIDGET Don’t smoke in here, I’m chemically sensitive. NICK You’re   who?  13. EMMA Chemically sensitive. NICK What kinda California bullshit is that? Nick’s phone rings. ALARM ringer. They all jump. BRIDGET That’s your   ringer?  NICK For Dad it is. (into the phone) Dad. INT. RUSH HOSPITAL - ER HALLWAY - DAY Bert is at a desk filling out paperwork. He looks up to see Bridget, Nick, and Emma scurrying down the hall. He scowls. BERT (to Nick) I toldja not to call her. (to Bridget) It’s Christmas Day, Bitty, you aughta be with your family. BRIDGET Is she all right? BERT She’s fine. Bert and Bridget kiss on the lips. It’s a midwestern thing. BERT (CONT’D) (to Emma) Hello Squeaks. EMMA Hi Gramps, you okay? As Emma and Bert embrace, he glares at Nick and waves his hand in front of his face. BERT Dammit, Nicholas, knew you’d be smokin’ again with that bar. 14. BRIDGET (to Bert) Are you okay? Have them check your blood pressure. NICK What’d the doctor say? BERT He hasn’t been in yet. ",
      "dialogue_count": 0,
      "word_count": 1096
    },
    {
      "scene_number": 7,
      "slugline": "INT. RUSH PARKING GARAGE - 2ND FLOOR - DAY Bert slams through the door of the garage and marches in. Bridget trots after him, followed by Nick, holding Ruth’s purse, and Ruth, wearing Nick’s parka and holding Emma’s arm. NICK Dad! Bert and Bridget stop and turn to them. BERT What! NICK I’m this way. BERT So go then! Nick heads off with Ruth and Emma. Bert marches down the aisle of cars. Bridget trots up along side him. BERT (CONT’D) Goddamn hospital. Goddamn teenage doctors. He pulls his keys out and approaches a black ‘59 4-seat Thunderbird Convertible and opens the trunk. Bridget gapes. BRIDGET What happened to the Camry? BERT I’m 75 years old, Bitty. Fuck the Camry. He pulls a down parka from the trunk and chucks it at her. INT/EXT BERT’S THUNDERBIRD - DUSK The top is down. Elton John’s   Amoreena   on the radio. They cruise downtown Chicago, lit elegantly for Christmas. Bridget, wrapped in the borrowed parka, watches her hometown pass. INT. OAK PARK CONDO - FOYER - NIGHT Bert and Bridget enter. Bert carries Chinese take-out. 19.",
      "characters": [],
      "action_text": "BERT Ho ho ho! Nick bee-lines around the corner into the foyer. His eyes are wide as saucers. BERT (CONT’D) Where’s your mother? NICK In with Emma. As Bert takes the bag into the kitchen: BERT Gotcha a loo mein, Nicholas. Bridget hangs the parka up in the coat closet. Nick stares at her, eyes huge, like he’s seen a ghost. BRIDGET Whassa matter with you? NICK (grave; quiet) She hit on me. BRIDGET What? NICK She - she - put her hand on my leg, batted her eyes, she - hit on me. BRIDGET Who? NICK  Who?  Like she even had to ask. BRIDGET  Mom?   What’d you do? NICK Whaddya mean, what’d I do, I just - kept callin’ her   Mom,   thanks   Mom,  had a nice time too   Mom , real glad you birthed me,   Mom --  Bridget can’t help it. She starts to laugh. Nick is appalled. 20. NICK (CONT’D) You’re   laughing?  Which makes her laugh harder. NICK (CONT’D) Don’t   laugh,   asshole, it’s not funny. I’m freakin’ traumatized. Bridget is dying. BRIDGET Your   face   -- when we walked in, you shoulda seen your   face --  Finally Nick can’t help himself. He laughs. NICK (through laughs) It’s not funny. BERT (O.C.) (from the kitchen; angry) Goddamn Oriental places, how you s’posed to eat rice with a stick? Which makes them both hysterical. INT. OAK PARK CONDO - GUEST ROOM - NIGHT Emma lays on one side of the antique double bed, headphones on, computer open in her lap. Bridget sticks her head in. BRIDGET Wanna come for a drive with Uncle Nicky? EMMA No. Uncle Nicky’s a dick. BRIDGET No he isn’t. Don’t say that. A beat, then: BRIDGET (CONT’D) Did you apply for a new dorm? EMMA Yeah. BRIDGET You did? 21. EMMA Yes. BRIDGET Oh. You’re okay here by yourself? Emma glares. BRIDGET (CONT’D) Well. I have my cell. EMMA Oh, you do? Really? Great, I’ll call you, we’ll chat. Bridget closes the door and steps into the -- INT. OAK PARK CONDO - HALLWAY - NIGHT Bridget heads down the hall toward the back door. She stops at the ajar bathroom door and peers in. BERT (O.C.) (in the bathroom; gently) Wait, hone",
      "dialogue_count": 0,
      "word_count": 4953
    },
    {
      "scene_number": 8,
      "slugline": "INT. OAK PARK CONDO - GUEST ROOM - DAY Grey light peeks over the curtains. Bridget, dressed in her running gear, sits on the edge of Emma’s side of the bed and shakes her awake. BRIDGET Emma. Emma squints at her. BRIDGET (CONT’D) Come for a run with me. Emma blinks at her, one hundred percent not having it. BRIDGET (CONT’D) You’ll feel great afterward, I’m telling you, you just have to -- Emma grabs one of Bridget’s pillows and whacks Bridget in the face with it as she turns and covers her head. Bridget gets up and goes for the door. Then she notices Emma’s computer laying on the floor by her bedside. She tiptoes over, grabs it, and carries it out of the room. EXT. OAK PARK STREET - DAY Bridget runs down Oak Park Avenue, picking up her pace, sprinting faster and faster, as fast as she can for as long as she can. Something catches her eye. She slows and stops. A HOFFSTEADER CONSTRUCTION pickup is parked at the curb. She stares at it a moment, looks around for its owner, then continues on at a jog. INT. OAK PARK CONDO - DINING ROOM - DAY Ruth sits at the table sipping coffee, a towel draped over her shoulders. A bottle of Ensure sits on the table. Bert is behind her, dying her roots, in a frilly apron. Road Runner cartoons play on a small TV in the corner. Bridget enters from her run. Ruth starts to get up. RUTH There’s my baby! 49.",
      "characters": [],
      "action_text": "BERT Sit down Ruth, you got dye all over you. Drink your Ensure. She sticks her tongue out at him. RUTH My boyfriend. Mr. Bossy. Bridget gets a mug from the cabinet and sits. She pours coffee from a carafe on the table. RUTH (CONT’D) Do you need anything? BERT She’s fine. Drink your Ensure. Bridget moves the Ensure closer to Ruth. BRIDGET Here, Mom. She drinks the Ensure. BERT See? Tastes just like a chocolate malt. RUTH You wouldn’t know a chocolate malt if it bit you in the tush. (to Bridget) See, I was a fountain girl, in... BERT Amboy. RUTH Amboy, and consequently... my Dad works on the trains, he’s a... BERT An engineer. RUTH An engineer, that’s right, he’d get off the trains and bring me chocolate malts ‘cause I was sick, I was very sick, I had... BERT Polio. 50. RUTH Polio, mm-hmm, and all I did was drink chocolate malts all day, and consequently... BERT You got fat. RUTH I got fat. BRIDGET Dad. BERT What? BRIDGET She was not fat. BERT She was too fat. RUTH No, I was, I was very fat. Bert pulls the gloves off and washes his hands. RUTH (CONT’D) And then I was a housewife, and consequently -- BRIDGET You were not. BERT You were a career woman, Ruth, two- time administrator of the year. RUTH (impressed) Holy shit. Bert sits down at the table and pours himself coffee. He grabs his paper. Bridget picks up the arts section. RUTH (CONT’D) (re: Bert and Bridget) And how do you two know each other? Bridget and Bert look up from their papers. 51. BERT (a touch sharp) She’s our daughter, Ruth. For chrissakes. Ruth blushes at his tone. Her face twists anxiously. RUTH Lemme get my purse. BERT Don’t touch anything. RUTH I’m not gonna touch anything, I’m gonna get my purse! Ruth exits. Bert goes back to his paper. BERT We’re going to Edna’s for supper. Bridget makes a face. Bert eyes her over his paper. BERT (CONT’D) Wanna do me a favor? INT. OAK PARK CONDO - MASTER BATHROOM - DAY The mirrors are fogged. Over the sound of the shower: BRIDGET (O.C.) Keep rinsing. A nightie ",
      "dialogue_count": 0,
      "word_count": 1958
    },
    {
      "scene_number": 9,
      "slugline": "INT. OAK PARK CONDO - MASTER BEDROOM - DAY Bridget, in her bra and jeans, shuffles through her mother’s closet. She pulls out a ivory blouse in a plastic dry cleaning bag. INT. OAK PARK CONDO - BOUDOIR - A MOMENT LATER Bridget buttons the blouse in the mirror. It’s sheer; her bra shows through. She rifles through her mother’s slips in a dresser drawer and pulls out an unopened TV dinner. The doorbell RINGS. BRIDGET Shit. She grabs one of her mother’s lipsticks and swipes it on her lips, then makes a horrified face at it’s brightness. She blots vigorously, pulls her hair out of it’s messy bun and races out toward the front door. INT. OAK PARK CONDO - FOYER - DAY Bridget, in the blouse, bra showing underneath, stands at the open door with Gerry, who is on a knee, examining it. BRIDGET I was thinking a lock with a key but the key on the inside, you know? GERRY Right, so you can lock it and hide the key from her. BRIDGET Exactly. GERRY Smart. Back door too? BRIDGET Yeah, if you have time, that’d be - good. GERRY For you? I got all the time in the world. An awkward beat, then Gerry covers nervously. 60.",
      "characters": [],
      "action_text": "GERRY (CONT’D) I mean ‘cause it’s an easy thing to do. Things. Two doors are things. With an s. Take me twenty minutes, half hour tops, so. BRIDGET Great. Another awkward beat, then: BRIDGET (CONT’D) Do you want some coffee? INT. OAK PARK CONDO - KITCHEN - DAY Bridget pulls the crock of corned beef out of the fridge and makes Gerry a sandwich as he pours coffee into mugs. GERRY Sorry about your mom. BRIDGET Oh, thanks. That’s okay. GERRY No. No it isn’t. His unwillingness to dismiss things people generally dismiss catches her off guard. GERRY (CONT’D) Dad’s been gone two years, Mom eleven Easter Sunday. Still not okay. (then) Doesn’t matter how old you are. Life is just harder when you don’t have parents. A beat, then: GERRY (CONT’D) Do you have sugar? BRIDGET Sugar? Sugar. She opens the cabinet to the left of the sink. A bag of sugar is high on a shelf. She jumps for it. GERRY Here. 61. He comes behind her and reaches over her for it, his other hand on the small of her back. There is nothing forward or inappropriate about this, but something about him behind her, his smell, his touch... Her knees begin to buckle. She literally swoons.  She steps away before her knees give completely, and fumbles, light-headed, to steady herself on the counter. GERRY (CONT’D) You all right? BRIDGET Mm-hmm! Utterly flustered, she pulls her blouse away from her chest. BRIDGET (CONT’D) Sorry, I just - got hot, is it hot? I have low blood pressure. Blood sugar. I think I’m starving. A beat, then Gerry points, obviously, at the sandwiches. She grabs a bagel from the plate from this morning and pulls the insides out and eats the edges. BRIDGET (CONT’D) I don’t eat... things. GERRY California girl. She nods, mortified. He picks up his coffee and smiles knowingly at her. GERRY (CONT’D) I get it, you know? I’m divorced too. BRIDGET What? GERRY I have a radar. Like gay-dar. Divorce-dar. Plus no ring, so. She waits for herself to correct him... but is suddenly mute. He blushes, thinking he’s o",
      "dialogue_count": 0,
      "word_count": 588
    },
    {
      "scene_number": 10,
      "slugline": "INT. OAK PARK CONDO - HALF BATH OFF KITCHEN - DAY The distant sound of drilling over Led Zeppelin. Bridget paces the small bathroom off the kitchen. BRIDGET (rehearsing) I am married, I lost my ring and. I’m still married. I’m actually still married. I’m... you have beautiful biceps but I’m... She slaps herself in the face. She’s stoic, then: BRIDGET (CONT’D) Ow.  (then) I’m married. It was a joke. (laughing) Gotcha! Funny! (sobering) No. Not funny. I didn’t say anything because I, I -- (to herself) You don’t need to   explain,   he doesn’t need to   know , who is he, he’s Dommie’s little brother, Dommie’s tubby little junior high brother, who cares what he thinks. (resolved) I’m married. Can I get you more coffee? She takes a deep breath, steps out into the foyer. INT. OAK PARK CONDO - GUEST ROOM - DAY - LATER Bridget, glass of scotch in hand, talking a mile a minute, is rifling through Emma’s suitcase, rambling loudly. BRIDGET ‘Cause he’s a wonderful guy, he really is, we don’t fight, we don’t cheat, we don’t - do   anything , actually, he’s just - She finds what she’s looking for: Emma’s cigarettes. She grabs them and heads out into the -- 63.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 208
    },
    {
      "scene_number": 11,
      "slugline": "INT. OAK PARK CONDO - HALLWAY - DAY Gerry stands by the back door, holding a scotch of his own and an afghan for her. Bridget comes out of the guest room, still rambling. BRIDGET He’s a   checklist   person, you know? College, check, corporate law, check, wife, kids, check check check. She pulls at the back door as he drapes the afghan over her shoulders. BRIDGET (CONT’D) Which is fine, it’s just that I’m not, I’m a   mess,   I’m   messy,   I’m - The door isn’t opening. BRIDGET (CONT’D) (re: the door) What is this, why is this... Gerry reaches over her shoulder and turns the new key in the lock at the back door. Bridget gets the door open. They head out the door and up the steps onto the landing. EXT. OAK PARK CONDO - PORCH - DAY - CONTINUOUS BRIDGET I was just so   young   when we got married, I mean, 20, God, Emma’s 20, she can barely tie her shoes, and Mary, at 20 Mary thought she was a lesbian, which - good for her! She should still be experimenting, she’s got the rest of her life to make sacrifices for - what’s his face - Daniel. David! David? David. David David David. She opens Emma’s pack of cigarettes. There are two left. She hands him one. BRIDGET (CONT’D) Anyway, what I’m trying to say is that - I’m... I’m... GERRY (reminding her) You’re a mess, you’re messy... 64.",
      "characters": [],
      "action_text": "BRIDGET I’m a mess, I’m messy, and I’m... GERRY (suggesting) You - work out? BRIDGET I work out, I work out, I run, I’m a runner, I run... He lights her cigarette for her, then his own. She inhales. BRIDGET (CONT’D) I haven’t smoked in twenty years. I don’t smoke. I don’t drink. I don’t eat things. (then) You know, everybody thinks being alone is so bad, so lonely, no, you know what’s lonely? Laying awake in the middle of the night thinking  this is it, this is the rest of my life, this is as good as it gets,  and then looking over at the man I spent twenty five years with, thinking - he must be awake too, thinking the same thing I am, he must be. (dragging on her cigarette) Looking over to see him sleeping like a baby? She exhales. BRIDGET (CONT’D)  That   is loneliest thing. That. There are tears in Gerry’s eyes. GERRY Jesus Christ, Bitty, goddamn. BRIDGET Alone? Alone is great!   I went from my father’s house to my husband’s house, I was never alone my whole life. You have your coffee in the morning, in your little - Victorian, with soul, with a porch swing, you have your coffee, do a little writing, a little meditating... 65. She drags on her cigarette. GERRY See, I knew you were a writer. BRIDGET I’m... a writer, a lover, a fighter, I’m a nurturer, I’m - I’m - GERRY You’re sexy as all get out. She blinks, rocketed back to planet Earth. BRIDGET What? He gets on his knees and comes to her. BRIDGET (CONT’D) Oh! No. No no no, listen I -- She leans back as he gets very close to her and...   sniffs.  GERRY God you smell good, you always smelled so fucking good. She did not think this through. She tries to push him back. BRIDGET Uhh... I’m sorry, I’m not, I’m still- Suddenly, he is kissing her. She freezes, paralyzed. And then... she lets herself have one second, just one tiny, tiny second before she pushes him away, just as: NICK (O.S.) Bitty! Bridget turns slowly toward the voice, praying it’s not Nick standing in the courtyard with a clear view. But it is, of cours",
      "dialogue_count": 0,
      "word_count": 3170
    },
    {
      "scene_number": 12,
      "slugline": "INT. OAK PARK CONDO - FOYER / LIVING ROOM - CONTINUOUS Bridget peers in, looking for Bert. Ruth is peering at pictures on the tree. She sees Bridget. RUTH Is that my baby? Bridget ignores her and heads around the foyer corner into the KITCHEN DOORWAY. Bert is pouring a cup of coffee. Bags of groceries sit on the counter. Bridget stands in the doorway and seethes at him. He holds the coffee out to her. BRIDGET I don’t want it. BERT It’s coffee. BRIDGET I   don’t want it.  BERT A course you want it. Here. She explodes. BRIDGET I am a grown-up! If I don’t want the coffee I   don’t want the coffee!  He plops the coffee on the counter and goes to his groceries. BRIDGET (CONT’D) What did you tell him? Ruth wanders in. RUTH Who? BERT Nobody. Go turn on the Road Runner. Ruth wanders out. BERT (CONT’D) I told him I bought you plane tickets and to pick you up at the airport, that’s what I told him. 81.",
      "characters": [],
      "action_text": "He unpacks his groceries angrily, shaking his head. BERT (CONT’D) Floozin’ around with some construction bozo, I don’t even know who you are. BRIDGET He put   locks   on, Dad, and you’re welcome by the way. Bert slams down a can of peas. BERT What am I, some horse’s ass? He returns to his groceries. BERT (CONT’D) Eddie is as much a son to me as your brother is. BRIDGET I think you like Eddie more than you like me.   And   my brother, for that matter. BERT Oh for chrissake, Bitty, what kinda thing is that to say? (then) Go get packed, we’re leavin’ in an hour. He exits the kitchen. She follows him down the HALL -- past the DEN, where Ruth watches the Road Runner -- and into the INT. OAK PARK CONDO - MASTER BEDROOM - DAY She shuts the door behind her. BRIDGET All my life you’ve been telling me, there’s no bells and whistles, there’s no bells and whistles. BERT There isn’t. BRIDGET How can you say that? You have more bells and whistles than   anybody.  82. She’s losing her mind and you still can’t live without her. Didn’t you want that for me? BERT Of course I wanted that for you, that’s   all   I want for you, why do you think I’m sending you home? (then) Love is commitment, Bit, you work  at it. BRIDGET I been working at it for 20 years. BERT Well you work at it 20 more if you want what we got. Go home and think about why you married him in the first place. BRIDGET I married him because you told me I couldn’t do better. BERT You couldn’t! Eddie’s a home run! Your wedding was the best day of my life, walking you down the aisle to a man who might deserve you. (then) You know what your problem is? California, that’s what, everybody out there flowin’ in the wind, re- inventing, what the heck is that? You are who you are. I’m a husband, a father, a Catholic, I know it ‘cause I am it and I never had to think about it. You go home to your husband or you go stay with your brother. There’s no reason to be unhappy in a perfectly good marriage. The only thing she can think of t",
      "dialogue_count": 0,
      "word_count": 2100
    },
    {
      "scene_number": 13,
      "slugline": "INT. BRIDGET AND EDDIE’S HOUSE - LIVING ROOM - NIGHT Bridget, Emma and Eddie sit on the couch, Emma between her parents. The ladies sip champagne. Eddie dozes with the remote in his hand. As the countdown hits midnight, Emma nudges Eddie awake. EDDIE Happy New Year. BRIDGET Happy New Year. Over Emma, they share a perfunctory kiss. INT. BRIDGET AND EDDIE’S HOUSE - MASTER BEDROOM - NIGHT Bridget reclines in bed with cookbooks, copying recipes into a notebook. Eddie comes in and begins to get ready for bed. EDDIE Who is Gerry Hoffsteader? Bridget looks up and catches her breath, caught. BRIDGET I don’t know. EDDIE You don’t know? BRIDGET I don’t know. Eddie turns to her. EDDIE You didn’t write him a check for 1500 bucks? BRIDGET Oh! Yes. Yes. He’s a construction guy. He did some work on my parents’ locks. Eddie stares at her. EDDIE What’d, he replace every lock in the building? He gets up and heads into his closet. Bridget breathes. He returns with a nicely wrapped box and hands it to her. 92.",
      "characters": [],
      "action_text": "EDDIE (CONT’D) Merry Christmas. She unwraps it. It’s a fancy cheese grater, packaged in it’s rectangular box. BRIDGET Oh!  (then) Um. I think you got me this already. EDDIE Did I? Open it, they said it was new. BRIDGET Oh. Maybe it has a new feature or -- She opens the lid of the box. Inside, nestled in tissue paper, is a sizable diamond ring in an open jewelry box. EDDIE Figured if I had the diamond upgraded you might stop leaving it with the pennies in the car. She’s speechless, eyes glued to the diamond. Then, incredibly moved: BRIDGET Thank you. EXT. STREET - DAWN Bridget jogs along her tree-lined path. She picks up her pace, speeding, sprinting -- And then, all of a sudden, she is crying. She stops, sits on a curb, puts her head down and lets it all go. INT. BRIDGET AND EDDIE’S HOUSE - MASTER BEDROOM - DAWN Eddie wakes. It isn’t until he sits up that he realizes Bridget is not in bed beside him. 93.",
      "dialogue_count": 0,
      "word_count": 354
    },
    {
      "scene_number": 14,
      "slugline": "INT. BRIDGET AND EDDIE’S HOUSE - DINING AREA - DAWN Eddie stops at the foot of the stairs. Bridget is sitting quietly at the table. EDDIE Are you all right? BRIDGET You are such a good man. That was one of the most romantic gestures I can imagine. (then) The problem is... what is so, so awful is... how much worse I feel now than before you gave it to me. Eddie shakes his head, endlessly frustrated. EDDIE I have no clue what to do for you. You are never happy, never. BRIDGET Do you want to leave? EDDIE No. I made a promise. I’m a loyal person. BRIDGET So am I. That’s the thing. There are such good reasons to keep the promise, to get up day after day, keep going the way we’ve been going, and that’s why I have this...   weight   on my chest, this... terror that next week or next year or five years from now, there’s gonna come a night where I lay in that bed next to you, wide awake long enough that I get up, walk out the door and disappear like a ghost. (then) How do I live with that? (then) Somewhere, there is a woman who would make you feel like such a good man without you having to do   a thing .  (then) How do I live with that? How do you? Don’t you want to find her? 94.",
      "characters": [],
      "action_text": "EDDIE I thought I did. BRIDGET  When?  (then) You married me for the same reason I married you. I checked the boxes. EDDIE I’m okay with that. BRIDGET I know. Bridget takes a deep breath. BRIDGET (CONT’D) And I’m not. INT. BRIDGET AND EDDIE’S HOUSE - KITCHEN - NIGHT Eddie, Bridget, Mary and Emma sit at the kitchen table in silence. Emma looks down, picking at a place mat. Mary is glaring from one parent to the other. She scoffs angrily. MARY You guys really have timing. Neither parent says anything. Mary gets up and leaves the table. A second later, the front door slams shut. Bridget looks at Eddie. He shrugs, angry. EDDIE Don’t look at me. EXT. BRIDGET AND EDDIE’S HOUSE - NIGHT Bridget hustles out the front door as Mary marches toward her Golf in the driveway. BRIDGET Mary. Mare! Mary stops and glares at her. MARY What? What? You want me to congratulate you? Way to go, Mom. 95. Way to   finally   deal with the elephant in the room, your timing is   impeccable.   I’m wearing your fucking wedding dress. BRIDGET I’m sorry. Mary starts toward her car, enraged. Bridget follows. MARY Yeah, well, put that in the divorce announcement. We’ll stick it in with the wedding invitations. Save a stamp. Mary starts to lose it. It’s not about her wedding or their divorce. She turns back to Bridget. MARY (CONT’D)  You’re   sorry?   I’m   sorry. I’m sorry you have   regrets   or whatever, I wish it were different for you, I really do. Mary opens the door to the Golf, gets in, and starts the ignition. Bridget opens the passenger door and gets in. IN THE GOLF -- MARY (CONT’D) What are you   doing?  BRIDGET  Listen to me.  (then) You have every right to be pissed at me. And you can be as pissed as you are for as long as you need to be. But do not   ever   question   that you and your sister are the best things that will ever   happen to me. I do not have a single regret. Not a   single one.   Do you understand? MARY Can you please just get out? Bridget takes that in, then opens the door",
      "dialogue_count": 0,
      "word_count": 627
    },
    {
      "scene_number": 15,
      "slugline": "INT. BRIDGET AND EDDIE’S HOUSE - EMMA’S ROOM - DAY Bridget knocks and enters. Emma is on her bed, with her computer, in headphones. A beat, then: BRIDGET Are you all right? EMMA I’m fine. BRIDGET Talk to me. EMMA Are you gonna tell me I’m wrong? BRIDGET No. Emma sighs and pulls her headphones off. EMMA Do you think this is some big shock or something? (then) You’ve been pleasing other people for 40 years. The next 40 years should belong to you. Bridget stands there, processing the wisdom of her daughter. EMMA (CONT’D) I wanna move to Chicago. Nicky needs a barback. And I need a life. INT. OAK PARK CONDO - MASTER BEDROOM - NIGHT That clock ticks. Ruth and Bert sleep. His eyes open. He blinks a few times, then looks over at Ruth. She is still. He watches her for a long moment. INT. OAK PARK CONDO - KITCHEN - NIGHT Bert sits in a kitchen chair in his bathrobe. With shaking hands, he dials 911 on the land line. 97.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 177
    },
    {
      "scene_number": 16,
      "slugline": "EXT. OAK PARK CONDO - FRONT ENTRANCE - NIGHT Bert walks into the vestibule, still in his bathrobe, holding the phone. He slides down the glass and sits on the ground against it and listens as sirens grow in the distance. INT. RACHEL’S HOUSE - BEDROOM - NIGHT Nick sleeps with Rachel beside him, her arm around his waist. His cell phone rings on the side table. Rachel moans. He grabs for the phone and sits up. NICK Hello. As he listens, he drops his head into his hands. INT. HOTEL ROOM - NIGHT Bridget is asleep. Her cell phone rings on the night table. She reaches for it. BRIDGET Hello? She lays for a long time, listening, expressionless, until: BRIDGET (CONT’D) Okay. She hangs up.   She slowly rises and sits at the edge of the bed, absolutely still for a very long moment. INT. FUNERAL HOME - VIEWING ROOM - DAY It’s a large viewing room, and it’s full. The whole family stands in front of a casket, receiving a long line of guests. At the end of the line is Ruth. She’s beautiful, in a black suit, greeting guests, truly remembering everybody or doing a darn good job of faking it. Nate scampers around with a LITTLE GIRL, both in Sunday best. Marion is nearby, holding court to a cleaned up Gerry Hoffsteader. Nick walks up and gives Gerry a stare-down. 98.",
      "characters": [],
      "action_text": "In a corner, a SCREEN plays OLD SUPER 8 FAMILY FOOTAGE. INT. FUNERAL HOME - VIEWING ROOM - NIGHT It’s later. Quieter. Bridget and Nick stand at the casket, greeting the stragglers. Eddie, Mary and David sit nearby. In a corner, Emma sits with Ruth, who stares down at a folded paper program. On the cover is a recent picture of Bert. Ruth looks up from the program and looks around, anxious. RUTH This looks like a wake. Is this a wake? EMMA Yes. RUTH See, that’s what I thought it was. She looks down at the program again. Bridget walks over. BRIDGET (quietly to Emma) How we doing? Emma shakes her head. Bridget sits on the other side of Ruth. EMMA (quietly to Bridget) Should we take her home? BRIDGET You ready to go, Mom? Ruth is concentrating on the picture of Bert on the program. RUTH I just - I can’t figure out for the life of me whose wake this is. She opens the program and puts her finger on the name inside. Traces along as she reads the words out loud. RUTH (CONT’D) Norbert. Ivan. Keller. She inhales sharply. She understands. RUTH (CONT’D) Oh. 99. She looks out distantly at the room. RUTH (CONT’D) How could I have forgotten that? EXT. FUNERAL HOME - PARKING LOT - NIGHT Bridget comes out of the funeral home carrying a flower arrangement. Nick sits on a curb, smoking a cigarette. She joins him. They sit quietly. And then Nick loses it. She puts her arms around him and holds him as he cries. INT. ST. GILES’S CATHOLIC CHURCH - DAY Bert’s casket is closed at the altar, American Flag draped over the top. Sunlight streams in the stained glass. Bridget stands at the podium. BRIDGET My dad grew up on a farm in a small town called Amboy. He met Ruth O’Shea at an ice cream social and had a thing for her ever since - even though she wouldn’t give him the time of day. After high school, Dad went off to Korea. When he came home on leave, his mother told him poor Ruthie O’Shea had gotten polio and hadn’t been out of bed in six months. Dad marched over there, picked her up out of ",
      "dialogue_count": 0,
      "word_count": 1624
    }
  ]
}