{
  "slug": "whiplash-2014",
  "title": "whiplash",
  "genre": "drama",
  "format": "film",
  "scenes_count": 12,
  "characters_count": 1,
  "characters": [
    "FLETCHER"
  ],
  "total_words": 22662,
  "total_dialogue": 1,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. GEHRING HALL - NASSAU BAND ROOM - DAY 8   8  The same room we saw Andrew practicing in at night -- only now  it’s full of musicians. Mostly male, mostly first- and second-  years. This is NASSAU BAND, one of Shaffer’s lower-level jazz  ensembles. Because it’s Shaffer, the players are still first-  rate. A few third-years are here, too -- including a red-head  drummer with the body of a linebacker. RYAN CONNOLLY.  Andrew looks up -- in time to see Ryan with a GIRL by the  doorway. Ryan’s girlfriend is gorgeous -- tall, all curves.  Ryan lets his hand slide down her shoulder. Andrew watches...  The GIRL waves bye to Ryan as he heads in. He’s all macho  confidence.  TRUMPETER  My man Ry! Shit, how you feeling?  RYAN  Stitched up at last, dude.  TRUMPETER  Things were hurting with Neiman on the kit--  Ryan taps him to stop. Andrew is within earshot -- and has  heard. Beat. Ryan moves over to Andrew, sits down at the set.  RYAN  You have a good weekend, bro?  ANDREW  Yeah. Definitely. Really good.  RYAN  Don’t worry about Greg. He’s a dick.  Andrew nods. Admires Ryan. Seems more diminutive now than ever.  RYAN (CONT’D)  You been practicing?  ANDREW  Yeah. All the time.  RYAN  My man.  Then -- the Nassau Band conductor appears: RON KRAMER.  MR. KRAMER  Morning, fellas. “Billie’s In”, bar 8.  Pink (9/10/2013)   7",
      "characters": [],
      "action_text": "Mr. Kramer CLAPS OFF in time -- and the band begins playing  FIRST NASSAU BAND REHEARSAL CHART . Mid-tempo. Ryan’s  confident, in control. Andrew turns his pages, watches...  MR. KRAMER (CONT’D)  Nice, Ryan... Woah, trumpets.  TRUMPETER #2   **  Yeah, yeah - sorry about that one.   **  MR. KRAMER   **  Just brass again.   **  To Ryan’s left, a whisper--   **  TRUMPETER  Ry...  Ryan turns. Visible as a silhouette through the frosted glass  of the main door...is   FLETCHER . Andrew turns and looks as  well. Tenses up.  Fletcher lingers outside. Then he walks on. Ryan turns back to  the Trumpeter.  RYAN  Not today.  INT. GEHRING HALL - NASSAU BAND ROOM - MOMENTS LATER 9   9  Rehearsal has ended. The MUSICIANS have just filed out --  except for Andrew, who’s hanging back...  MR. KRAMER  Are you learning from Ryan?  ANDREW  Yeah... He’s been great to me.  MR. KRAMER  Last week was a little overwhelming for you?  ANDREW  (is that a question?)  Yeah... (then, hesitant,)  I wonder...what you think about my progress?  MR. KRAMER  Your progress?  ANDREW  I just... I’m...practicing hard and...  Pink (9/10/2013)   8 MR. KRAMER  Andrew -- you’ve got a good attitude. You  always arrive on time.  Andrew nods. Waiting.  Pink (9/10/2013)   8A MR. KRAMER (CONT’D)  Yeah. Ok?  ANDREW  (beat)  Ok... Do you think... I know Fletcher’s  looking for players...for Studio Band...  MR. KRAMER  Yeah, Andrew... Lincoln Center looks out  for Fletcher’s top players. If it weren’t  for Ryan’s injury he’d have been in Studio  Band last year. He’s a natural player.  Andrew takes this in. Nods.  ANDREW  Ok.  MR. KRAMER  (this is awkward)  Look... I’m going to be candid. 90% of  our players will never make it into the  Lincoln Centers or the Collectives. The  question is -- who’s in that 10%?  A beat.  MR. KRAMER (CONT’D)  So I’d practice. You could start a rock  band.  Andrew takes it in. The implication is clear.  He turns -- and glimpses a poster on the wall: a DRUMMER  throwing a stick in the air m",
      "dialogue_count": 0,
      "word_count": 3586
    },
    {
      "scene_number": 2,
      "slugline": "INT. GEHRING HALL - STUDIO BAND ROOM - CONTINUOUS 20B   20B  --only to find the room   EMPTY . No one is there. Andrew checks  the time on his phone: 5:33.   Did he miss them...?  INT. GEHRING HALL - BASEMENT HALLWAY - CONTINUOUS 20C   20C  Andrew steps back into the hallway. Spots a SIGN-UP SHEET at  the door. Looks at it. Sees the words “STUDIO BAND” scrolled  down for each day. The listed start-time: “9AM”.  INT. GEHRING HALL - STUDIO BAND ROOM - MORNING 21   21  Andrew sits on the drum throne. A clock on the wall reads:  8:57. He’s dozed off, is out cold. His hand, cut from his fall  down the stairs, rests against the snare drum.  Suddenly -- the DOOR opens --  SAXOPHONIST #2  She told me to pull out, then wet the  whole fucking bed.  SAXOPHONIST  No , serious??  Andrew shoots up. Surges to his feet. The SAXOPHONISTS don’t pay  him any attention. They’re big guys, macho. Another DOOR opens.  MORE PLAYERS...  These are the CORE MEMBERS of Studio Band -- Shaffer’s cream  of the crop. Mostly third- and fourth-years. All male. A few  ALTERNATES follow, first- and second-years.  Andrew watches as the PLAYERS buzz their mouthpieces, whip  open their folders, pull out their instruments. A flurry of  chatter and activity...  One of the CORE MEMBERS heads to the drums: CARL TANNER, 22.  Andrew sees him, and--  CARL  You the new alternate?  ANDREW  Yeah -- I’m -- Andrew Neiman...  CARL  (couldn’t care less about his name)  Tune the set to a B-flat. Then you’ll  turn my pages during rehearsal.  Pink (9/10/2013)   23",
      "characters": [
        "FLETCHER"
      ],
      "action_text": "Andrew, nervous, sits back down at the drums and--  ANDREW  (to the PIANIST)  Excuse me?  (no answer)  Um -- sorry -- excuse me?  (the Pianist looks at him)  Could I have a B-flat please?  The Pianist plays a B-flat. Andrew tunes. By now the room is  filled: TRUMPETS, TROMBONES, SAXES.  ANDREW (CONT’D)  (to the Pianist)  Excuse me -- could I maybe have ano--  But Carl has already risen. Ushers Andrew back up. Sits down at  the drums, as Andrew sits down by the music stand.  SAXOPHONIST #2  Milk the cunt!!  The PIANIST plays a middle C, and the players start tuning to  it.  Andrew watches, listens -- the sea of sounds building, the clock  on the wall ticking, until -- it hits 9:00.  THE DOOR BURSTS OPEN.   Fletcher marches in, carrying a stack  of sheet music. Sudden tension -- and utter silence.  Fletcher sets his music down. Stares at the band. Dead-serious,  silently judging. A moment passes...  Then -- he SMILES. He’s switched all of a sudden to warm and  cuddly.  FLETCHER  We’ve got a squeaker today, people.  Neiman. (he pronounces it “Neeman”)  Nineteen years old. Isn’t he cute?  Laughs throughout the room. We can overhear a few snickers:  PLAYERS (O.S.)  Neee-man...  Andrew looks. Fletcher keeps his smile up... And then--  FLETCHER  Alright, gang. “Whiplash”.  Pink (9/10/2013)   24 The players get out the chart. Andrew catches a glimpse --  a messy clutter of notes and time signatures...  Fletcher raises his hand. Total silence. Then -- the  slightest move of Fletcher’s finger, and the band begins  WHIPLASH STUDIO BAND REHEARSAL CARL #1 . The chart’s named  “Whiplash” for a reason. It’s fast, frenetic, 7/4 time. This  fast, with this many polyrhythms, it’s   impossibly   hard.  CARL  Page ...   Page ...  Andrew turns the page. Carl glares. Shouldn’t have had to tell  him to turn it. But Andrew can’t follow. The band’s too fast..  FLETCHER  Stop. You. Barker.  (pointing to the THIRD  TRUMPETER’S horn)  That is   not   your boyfriend’s dick. Do   not  come early",
      "dialogue_count": 1,
      "word_count": 2647
    },
    {
      "scene_number": 3,
      "slugline": "INT. DORMITORY - ANDREW’S ROOM - DUSK 25   25  Andrew is curled in the corner, crying. We linger here.  Then, his PHONE rings. He looks at it. Hesitates...  ANDREW  ...Hello...?  JIM (O.S.)  You didn’t show.  And, finally, breaking down, can’t hold it in any longer--  ANDREW  He ripped me apart...  JIM (O.S.)  ...Who? (then,)  That asshole? You told me you were  transferring ...  Andrew looks at his desk. There, atop a pile of papers, is  his TRANSFER APPLICATION. All filled out. Ready to go. Next  to it, a BUDDY RICH CD...  ANDREW  (almost to himself)  ...I thought he liked my playing.  JIM (O.S.)  Who   cares   what he likes? Who   is   he to you?  When I started writing plenty of people  tried to put me down. You ignore them.  Andrew is silent.   When I started writing...  Those words seem to have the opposite effect Jim intended.  ANDREW  When you started writing...  JIM (O.S.)  Why don’t you come home tonight?  ANDREW  No, I -- I have to practice...  JIM (O.S.)  No, you have to take it   easy .  ANDREW  I need to go now...  Pink (9/10/2013)   36",
      "characters": [],
      "action_text": "JIM (O.S.)  Andrew--  ANDREW  I have to go... Sorry. I’ll call you  later.  He hangs up. Rises. Wipes his reddened eyes. And exits his dorm.  PRE-LAP KNOCKING --  FLETCHER (PRE-LAP)  Yes?  INT. GEHRING HALL - STUDIO BAND ROOM - FLETCHER’S OFFICE - DAY 26   26  Andrew steps into Fletcher’s office. Before Fletcher can say a  word--  ANDREW  I’m sorry to interrupt you. I just want to  tell you -- I’m so thankful to have been  accepted into Studio Band. And I’m going to  make sure I don’t disappoint you.  Fletcher, seated at his desk, just looks at Andrew. Andrew  nods, turns around. Marches back down the hall -- as PERCUSSION  begins... WE FOLLOW HIM, sticking close to his face, the  resolve now in his eyes.   Something has changed.  PERCUSSION grows louder and, as we move, hurdles us back...  ...to FLETCHER’S OFFICE. And to Fletcher, peeking out  through his doorway now.   Fletcher smiles...  INT. ANDREW’S PRACTICE ROOM - DAY 27   27  Andrew sits at his drum set, furiously practicing...  And just like that, moving fast,   DRUM PATTERN FOR MONTAGE  carrying us, we’re--  INT. GEHRING HALL OFFICE ROOM - DAY 28   28  CLOSE ON Andrew’s hand, Xerox-ing pages of music. The titles:  “WHIPLASH”, “ALEPH NULL”, “EASY SIX”... Pages dense with notes...  Pink (9/10/2013)   37",
      "dialogue_count": 0,
      "word_count": 398
    },
    {
      "scene_number": 4,
      "slugline": "EXT. NEW YORK STREET - SHAFFER CONSERVATORY - EVENING 29   29  Fletcher steps outside. It’s drizzling a bit. He slowly unfolds  an umbrella. Passes by a few other FACULTY MEMBERS on his way  to the sidewalk. Keeps walking. The DRUMMING continues...  INT. DORMITORY - ANDREW’S ROOM - EVENING 30   30  Andrew pulls the MATTRESS off his bed, drags it to the door  with his ALARM CLOCK. Heaves both out to the hallway...  INT. SUBWAY - NIGHT 31   31  Fletcher is seated, squished in between commuters, towered  over by other travelers. Looks diminutive in this setting...  EXT. NEW YORK SIDE STREET - NIGHT 32   32  Andrew marches down a side-street, wolfing down a McDonald’s  burger for dinner, earphones plugged into a METRONOME...  INT. ANDREW’S PRACTICE ROOM - NIGHT 33   33  Andrew lifts a 50-lb weight with his right arm. Then a 75-lb.  Then picks his stick up and plays his double-time swing...  EXT. FLETCHER’S APARTMENT BUILDING - NIGHT 34   34  Fletcher reaches a nondescript high-rise. With his folded-up  umbrella, his head hanging low, and the careful delicacy with  which he opens the door, he looks here like nothing so much  as a quiet, everyday man...  INT. ANDREW’S PRACTICE ROOM - NIGHT 35   35  Andrew sleeps, earphones still in and metronome still on.  He’s on the MATTRESS he brought down from his dorm, the ALARM  CLOCK by his side. Next to it, a suitcase of clothes. Above,  the poster of Buddy Rich. It’s as though he’s moved in.  INT. FLETCHER’S APARTMENT - DINING ROOM - NIGHT 36   36  Fletcher sets the table for dinner. He has nice porcelain  plates, and a glass of red wine. But the meal? A frozen ready-  made steak and vegetables. On the wall, a photo. In it, a  younger Fletcher, and a WOMAN, and a NINE-YEAR-OLD GIRL. All  smiles...  Pink (9/10/2013)   38",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 306
    },
    {
      "scene_number": 5,
      "slugline": "INT. ANDREW’S PRACTICE ROOM - MORNING 37   37  Andrew rises from the same mattress and slides onto his drum  seat. Starts playing, hands dotted with blisters, eyes crusty  with sand. The METRONOME still on...  ...because it was never turned off.  CUT TO:   Rides furiously, trying to beat his double-time  swing... The METRONOME reading 380... His muscles exhausted...  CUT TO:   The METRONOME adjusted up to 390... Blisters tearing...  CUT TO:   400.. Hands bleeding now, blood smearing the sticks...  CUT TO:   405... The METRONOME going crazy now... The DRUMMING so  fast it’s a wash, a wall of sound, blood on the cymbal--  INT. FLETCHER’S APARTMENT - DINING ROOM - NIGHT 38   38  Silence.   Fletcher finishes his meal. Puts the dishes away. Sits  down on a couch. Still alone.  The apartment, like his office, is small but elegant. Pictures  of icons on the walls. Monk. Holiday. Coltrane...  Fletcher reaches into a stack of LP’s: Chopin, Ravel... Pulls  one out with the most delicate touch, as though he were  handling a newborn. Sets it on a record player by his side.  A scratch, a hiss, and then --  --   FLETCHER’S SONG . Melancholy, lovelorn...  Fletcher just sits and listens, barely moves -- but you can  tell the music now playing means everything to him...  A moment, and then...  INT. DUNELLEN AUDITORIUM - STAGE - EVENING 39   39  Wild, feverish, absurdly fast BIG BAND JAZZ.   We’re on-stage.  An orchestra about the size of Studio Band is in full swing,  reaching the end of   RIVAL OVERBROOK BAND CHART .  The band FINISHES. No applause. A card:  First Competition of the Winter Season  Pink (9/10/2013)   39",
      "characters": [],
      "action_text": "INT. DUNELLEN AUDITORIUM - GREEN ROOM - HALLWAY - MOMENTS LATER 40   40  The RIVAL PLAYERS quickly shuffle into the green room, past  Andrew, who watches, awed. A VOICE--  TECHNICIAN (O.S.)  Terry!  Andrew turns, glimpses a CORRIDOR through the doorway. Out in  the corridor, he sees a TECHNICIAN welcome Fletcher. In the  Technician’s arms, a FOUR-YEAR-OLD GIRL -- the Technician’s  daughter --  FLETCHER  Mike!   (and, to the girl,)  I’m so sorry, can I have your autograph?  (she blushes, shakes her head)  Are you playing an instrument yet?  TECHNICIAN  She started piano this week.  FLETCHER  Ooo, I need pianists!  (to the girl)  What do you say, you ready for Carnegie  Hall?  The Technician smiles again, looks at the girl. She hides her  face in his chest, embarrassed. He and Fletcher laugh.  FLETCHER (CONT’D)  Alright, alright.  (looking up at her dad)  Great to see you, Mike.  He leans in. They hug.  FLETCHER (CONT’D)  See you after the show! Cheers!  He steps in, closes the door and addresses his PLAYERS, who  are busy sanding their hands, buzzing their lips, preparing:  FLETCHER (CONT’D)  Ok, you fucking cocksuckers. E Dorian.  (the non-percussion players  lift their instruments)  Hurry the fuck up!!   E Dorian.  (they play the Dorian scale)  Double it.  (they play it double-time)  Pink (9/10/2013)   40  (MORE) G Lydian.  (they play the Lydian scale)  D Lydian Augmented.  (they play it)  Double it.  (they play it double-time)  Get your music. “Irene” only for Set 1.  Rhythm section out first. Tanner, the kit  is a tonal catastrophe. Get it in tune.  Rhythm and soloists, we’re augmenting the  dominant in measure 45. Everyone else  sharp the nine at bar 106. Got it?  (beat)  Now remember. Lincoln Center and its ilk  use these competitions to decide who they  want. And I am not about to have my  record in that department stained by a  bunch of sour-note flexible-tempo flatter-  than-their-girlfriends   dipshits . And  another thing...  (he holds up a music folder)  ",
      "dialogue_count": 0,
      "word_count": 4639
    },
    {
      "scene_number": 6,
      "slugline": "INT. SUBWAY - NIGHT 56   56  A crowded subway car. Andrew is seated, poring over his sheet  music, running through the beats in his head...  INT. GEHRING HALL - STUDIO BAND ROOM - NIGHT 57   57  The PLAYERS sit silently. Ryan on the drum throne, Carl and  Andrew behind him -- Carl still humiliated, Andrew 100%  focused. The clock reads: 9:00. Not a word in the room.  Fletcher emerges. A CD PLAYER in his hand. He plugs it in.  FLETCHER  Ok... Um...  For the first time ever, he seems uneasy, unsure what to say.  FLETCHER (CONT’D)  We...we have a new player. Ryan Connolly.  Ryan nods, waves to the other PLAYERS. Chipper--  RYAN  Sup, dudes.  Andrew glares at him.   Seething now.   But, continuing, softly--  FLETCHER  But I...if you could just...put your  instruments down... Just for a second...  He turns to the CD player. Turns it on. A big-band ballad  swells. A muted trumpet takes the lead. It’s   CASEY’S SONG ,  and it’s a tender sound, full of melancholy...  For a few seconds, Fletcher doesn’t say a word. His thoughts  seem to be drifting. Then, hesitant, as the music plays...  FLETCHER (CONT’D)  Six years ago...I saw a kid practicing  scales in a band room here. He’d started at  Shaffer with a lot of hope, but the truth  was he’d barely squeaked in and he was  struggling. Everyone on the faculty told  him: “This isn’t for you.” But they didn’t  see what I saw...  (his voice croaking again,  emotional,)  ...this...this scared, skinny kid cursing  himself ‘cause he couldn’t get his scales  right... I saw a drive in him...  Pink (9/10/2013)   60  (MORE)",
      "characters": [],
      "action_text": "And I put him in Studio Band, and we  worked together for three years, and when  he graduated, Marsalis made him third  trumpet at Lincoln Center. A year later,  he was first. That’s who you’re hearing  now.   (then,)  His name was Sean Casey.  The name catches Andrew’s attention. The trumpeter Fletcher  mentioned to him... And the word “ was ”...  FLETCHER (CONT’D)  I found out this morning...that Sean died.  He died in a car accident yesterday...  (takes a moment, is having  trouble speaking)  I just wanted you guys to know that...  He was... Sean was a...  (and, almost dissolving into  tears on these next words)  ...beautiful player...  (breathes in, collects himself)  I just thought you all should know.  Beat. He leans back down and turns off the CD. Silence.  FLETCHER (CONT’D)  (another moment; then, still shaky--)  “Caravan”. From bar 142, please.  The PLAYERS open their folders, pick up their instruments.  Fletcher waits. Hesitates again... Then -- CLAPS. Just drums,  bass and trombone play the trombone solo section of   CARAVAN  STUDIO BAND REHEARSAL . Fast, precise -- but Fletcher waves to  Ryan to stop.  FLETCHER (CONT’D)  No, that’s...that’s not quite right,  Connolly... Sorry...  Andrew’s eyes instantly fill with hope.   Is this his chance?  FLETCHER (CONT’D)  I... I want to try Neiman on this... Ok?  Ryan nods, slowly slides off -- as Andrew   quickly   gets on.  Clutches his sticks tight.   This is it...   Fletcher’s still shaky--  FLETCHER (CONT’D)  Maybe...maybe   now ’s the time for Neiman  to earn the part...  Beat. He CLAPS off, Andrew starts, and, only ONE SECOND later--  Pink (9/10/2013)   61  FLETCHER (CONT’D) FLETCHER (CONT’D)  No, I guess not. Tanner.  An anger is creeping into Fletcher’s voice now. The  stammering fading away, bit by bit. Dismayed, Andrew gets  off, Carl gets on, Fletcher CLAPS him off -- and then,  SLAMMING his fist down on his table, the barely suppressed  grief giving way now to terrifying, full-out   rage --  FLETCHER (C",
      "dialogue_count": 0,
      "word_count": 803
    },
    {
      "scene_number": 7,
      "slugline": "INT. GEHRING HALL - BASEMENT HALLWAY - LATER 58   58  PLAYERS mull through the hall, stretching. A few yawns. You can  tell these guys have been here for hours already... And through  the wall, the kind of screaming that shakes you to your core:  FLETCHER (O.S.)  Motherfucking COCKSUCKER!!! Is--  INT. GEHRING HALL - STUDIO BAND ROOM - NIGHT 59   59  FLETCHER  --that the fastest you can go??   It is no  fucking wonder Mommy ran out on you, you  worthless acne-scarred fetal-position  Hymie   fuck .   GET OFF!!!  Andrew -- whole body shaking, had been playing for half an  hour straight -- gets off the kit, struggling for breath,  hands coated with torn blisters and blood. Fletcher’s rage is  unlike anything we’ve seen from him: pained, vengeful...  Carl gets on the kit. Fletcher CLAPS. The clock: 11:06.  FLETCHER (CONT’D)  Well what do we have here? Gay Pride  himself. This is not a Sinead O’Connor  concert, Tanner. I am sorry to inform you  we will not be serving Baked Alaska and  Cosmopolitans tonight. Now why don’t you  try playing faster than you give   fucking  hand   jobs ?? One! One! One! One!   OFF THE  FUCKING KIT!!!  Carl stops. Staggers back, dazed, as Ryan moves up and begins.  FLETCHER (CONT’D)  Now we got ourselves our mick fucking paddy-  cracker. Did you know you look like a  fucking leprechaun? I think I’ll call you  Flannery.  INT. GEHRING HALL - BATHROOM - NIGHT 60   60  PLAYERS rinse their faces. One looks at his watch, dead-tired.  It’s   very   late...  INT. GEHRING HALL - STUDIO BAND ROOM - NIGHT 61   61  Some players have now returned to their seats.  Pink (9/10/2013)   63",
      "characters": [],
      "action_text": "FLETCHER  Switch!  Carl stops playing. Almost falls as he gets off the kit. Ryan  takes his place -- just as worn out. As soon as he sits down  at the set he has to bend down to catch his breath.  FLETCHER (CONT’D)  It is not Saint fucking Patrick’s Day,  Flannery, there is not a pot of gold  under your fucking seat.   Play.  Fletcher CLAPS. Ryan plays, muscles cramping, can’t keep up--  FLETCHER (CONT’D)  Switch!  Ryan stops, gasping. Fletcher’s eyes land...  ...ON ANDREW. Face awash in sweat, hair dripping, muscles  throbbing, wrists red, hands caked in blood, T-shirt clinging  to his chest.   This is it...  ANDREW  (muttering to himself as he  gets on the kit)  Come on... Come on you   fuck ...  FLETCHER  Let’s see if we can finally bring this  home.  He CLAPS. Andrew begins.  FLETCHER (CONT’D)  Don’t slow down.  Andrew tries, the tempo slips... So fast, so loud...  FLETCHER (CONT’D)  Speed up!   God-fucking-damnit I said SPEED  UP!!!  Andrew’s arms are moving as fast as they possibly can, his  feet like triggers -- and his ears start RINGING now, the  RINGING cutting and almost drowning out the other sounds...  Fletcher, fire-eyed, turns around and goes into the nearest  CLOSET. Emerges with a COWBELL and a STICK. Comes closer and  BANGS ON IT in time . The SOUND slices through the RINGING,  startles Andrew, this stick whacking down inches from his head--  FLETCHER (CONT’D)  Don’t stop!!  Pink (9/10/2013)   64 Andrew doesn’t stop. Manages to glare forward, with what  almost seems like hatred in his tired, blood-shot eyes...  FLETCHER (CONT’D)  Faster! ...   Faster!!  (Andrew speeds up)  Do it! Do it! Do it! Do it! Do it! Do it!  One! One! One! One! One! One! One! One!  Andrew slips, almost loses the beat.   Fletcher GRABS the FLOOR  TOM DRUM and HURLS it through the air , against the nearest  wall. It RAMS into the concrete, handles buckling. But Andrew  stays focused. Doesn’t cry.  FLETCHER (CONT’D)  KEEP PLAYING!!  Andrew does. Fletcher raises the COWBELL now,",
      "dialogue_count": 0,
      "word_count": 1321
    },
    {
      "scene_number": 8,
      "slugline": "INT. DUNELLEN AUDITORIUM - GREEN ROOM - DAY 70   70  Andrew arrives, panting. Fletcher glares, the band behind him--  FLETCHER  Glad you could work us into your  schedule, darling.  ANDREW  I’m here. I’m ready to play.  FLETCHER  Too late. Connolly’s playing.  Andrew looks over to his left -- to Ryan.  ANDREW  Like fucking hell he is.  Fletcher looks at him.   Stunned.   The PLAYERS also look shocked.  FLETCHER  Come again?  ANDREW  It’s   my   part.  FLETCHER  Actually it’s   my   part. I decide who I  lend it to.  ANDREW  I   have the folder--  FLETCHER  I see the folder for a change, but I  don’t see the sticks.  Andrew is about to counter -- when he looks down. Looks back.  Thinks. Realizes... Skin paling, his heart racing...  ANDREW  They’re -- they’re in the car, I just  have to grab them--  FLETCHER  Nope. I’m warming the band up now.  ANDREW  I’ll use Ryan’s sticks.  FLETCHER  You lost the part, Neiman.  Pink (9/10/2013)   69",
      "characters": [],
      "action_text": "ANDREW  No I didn’t!! You can’t do this!  FLETCHER  I CAN’T?!?  He marches toward Andrew. Looms over him, seems about to hit him.  FLETCHER (CONT’D)  When did you become an authority on what I  can or cannot do you weepy-willow shitsack?  ANDREW  When I   earned   that part.  FLETCHER  Earned? You’ve never earned a thing. The  only reason you’re a fucking core is  because you misplaced a folder. The only  reason you’re in Studio Band is because I  told you what I’d be asking for in Nassau.  ANDREW  Bullshit. I’m in Studio Band because--  RYAN  Why don’t you back off, bro?  ANDREW  Fuck you, Johnny Utah.   Turn my pages.  FLETCHER  You realize I can cut you anytime I feel.  ANDREW  You would’ve cut me by now.  FLETCHER  Try me you   weasel . At 5:30, that’s in  eleven minutes, my band is on-stage. You’re  not there with your own sticks, or you show  up and make a single mistake --   a   single  one   -- and I’ll send you back to Nassau  Band to turn pages until you graduate or  drop out. For extra kicks, I’ll spread the  word on just how you became a Studio Band  core, and by the time my sewing circle is  done you’ll make your   dad   look like a  success story.  (lets that linger, then,)  Or I can give “Johnny Utah” the part and  we’ll leave it at that. Your choice.  Pink (9/10/2013)   70 Beat. Andrew catches sight of Carl, standing in the back,  watching -- and almost smiling. He turns back to Fletcher--  ANDREW  It’s my part. I’ll be on the stage.  FLETCHER  That’s 10 minutes 50 seconds left, you  pathetic pansy-ass fruit-fuck.  Andrew turns. Bumps into Ryan, PUSHES him out of the way, RUNS.  EXT/INT. DUNELLEN AUDITORIUM - RENTAL CAR - MOMENTS LATER 70A   70A  Andrew drives away. The clock changes from 5:20 to 5:21.  EXT/INT. CAR RENTAL AGENCY - RENTAL CAR - DAY 70B   70B  Andrew pulls up at the rental agency. The clock changes from  5:27 to 5:28.  INT. CAR RENTAL AGENCY - MOMENTS LATER 71   71  Andrew races into the rental agency. They’re still open... Grabs  the",
      "dialogue_count": 0,
      "word_count": 5476
    },
    {
      "scene_number": 9,
      "slugline": "INT. FLETCHER’S APARTMENT - BEDROOM - DAY 101   101  Fletcher slipping into his own suit. Elegant, fastidious. Looks  like an old-school bandleader. But there’s something melancholy  about the sight of him -- going through his pre-concert rituals  all alone...  He straightens his tie. De-lints the suit. He’s tidy, über-  careful. He passes by his piano, pauses to play a melody on  the keys. Grabs his music folder and heads to the door...  OMITTED 102   102  INT. ANDREW’S APARTMENT - BATHROOM - DAY 102A   102A  Andrew clips his nails, applies ointment to his hands, then  wraps each finger in a Band-Aid.  EXT. NEW YORK STREET - FLETCHER’S SUBWAY ENTRANCE - 103   103  EVENING  Fletcher ignoring several passing CABS, enters a SUBWAY  STATION...  EXT. NEW YORK STREET - CARNEGIE HALL - DUSK 104   104  Andrew emerging from a SUBWAY STATION. Murmuring to himself,  tapping on his knees. The clock’s ticking...  He checks his phone, picks up speed, almost breaks into a jog...  The DRUMMING BUILDS, he goes FASTER and FASTER, until,  finally --  -- as the DRUMMING CUTS OUT --  -- he comes to a   sudden stop .  He’s standing right in front of CARNEGIE HALL. A giant banner  hangs above the main steps: “JVC IN NYC: JAZZ!” And, keeping  out of sight --  -- Fletcher. Strolling up the side-steps around the corner,  hidden from the crowd. Andrew sees him. Follows.  Pink (9/10/2013)   94",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 233
    },
    {
      "scene_number": 10,
      "slugline": "INT. ZANKEL HALL - GREEN ROOM - NIGHT 105   105  The scene is more or less what we saw before Studio Band  competitions -- only taken to eleven. A rush of MUSICIANS,  STAGE HANDS and TECHNICIANS backstage, a swell of TUNING as  TRUMPETERS, TROMBONISTS and SAXOPHONISTS join in. Andrew  stands back. Checks his phone. 7:28.   It’s almost time.   He  gazes around.  INT. ZANKEL HALL - GREEN ROOM STAIRCASE - MOMENTS LATER 105A   105A  Andrew peers out through a door, catching a glimpse of the  MAIN HALL.  INT. ZANKEL HALL - LOBBY - CONTINUOUS 105B   105B  Andrew sees the AUDIENCE milling. Sees a face he recognizes in  the crowd, small in the distance. JIM.  INT. ZANKEL HALL - GREEN ROOM STAIRCASE - CONTINUOUS 105C   105C  Andrew smiles at the sight. Feeling confident, ready to prove  himself at last. He walks back down the stairs toward the green  room.  INT. ZANKEL HALL - GREEN ROOM - MOMENTS LATER 105D   105D  Andrew and the Studio Band listen to Fletcher’s speech.  FLETCHER  Alright, gang, listen up! 15 seconds to  get into places. For those of you who are  new to this, it’s very simple: do well  tonight, and the world will open up for  you. The folks out there, they make a  phone call and you’re a Lincoln Center  core. Or a Blue Note signee. Or an EMC  client. Drop the ball, and I’d suggest  switching careers -- because the other  thing about those cats is   they   never  forget .  Andrew takes this in. Beat. A STAGE HAND appears, waves. Time.  FLETCHER (CONT’D)  On that note -- break a leg.  The PLAYERS proceed on-stage. Andrew takes a deep breath,  tries to keep his cool, and, counting in his head, walks  forward --  Pink (9/10/2013)   95",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 292
    },
    {
      "scene_number": 11,
      "slugline": "INT. ZANKEL HALL - STAGE - CONTINUOUS 106   106  The stage is decked in blue lights. The instruments gleam.  Beyond it, a yawning expanse of black. The audience... And a  hush, an undercurrent of murmurs and whispers gathering  steam, as each PLAYER takes to the stage, one by one...  Then -- APPLAUSE. 1200 people’s worth of applause. Fletcher  appears, taking his spot, smiling. The applause swells up.  And then -- Fletcher turns around to face Andrew.   He stares  at him for what seems like a full minute.   Comes up to him,  making as though helping him position a microphone over the  drum kit, and, leaning in, quietly, discreetly, menacingly--  FLETCHER  It was you.  The lights shift. Blue to bright, harsh, near-blinding yellow.  It’s showtime. Andrew is completely still.  ANDREW  ...Was...was me what...?  FLETCHER  (then, leaning in even closer,)  Why do you think I invited you here? I’ve  known it was you all along.  Beat. He lets it sink in. Retreats to his spot, smiling at  Andrew. Then, off Andrew’s paralyzed stare, he turns to the  audience. They APPLAUD. A few seconds later...silence. Then--  FLETCHER (CONT’D)  Good evening, ladies and gentlemen. We’re  going to start things off with an old  favorite of mine.  Andrew, his heart in his throat, looks at his sheet music.  “WHIPLASH”. Holds his sticks tight, but his hands are now  slippery with sweat... Fletcher waits. More silence...  FLETCHER (CONT’D)  It’s called “Upswingin’”.  ON ANDREW.   What?  Andrew turns to his left and catches a glimpse of the  SAXOPHONISTS’ sheet music. Written on the top: “UPSWINGIN’”. He  turns right, sees the BASSIST’s music. Ditto. He looks ahead.  And there’s Fletcher -- staring right back at him. And   smiling .  Pink (9/10/2013)   96",
      "characters": [],
      "action_text": "Andrew turns around. Has to stop this. Can’t ruin it for the  other PLAYERS -- but Fletcher has already raised his hand for  the cue. Andrew rises from his seat -- when the BASSIST  glares at him:   What are you doing?   And just then -- within  that same split-second --  -- Fletcher’s index finger bends down.  The cue.  The BAND EXPLODES into   UPSWINGIN’ . Horns blasting, saxes  wailing -- fast, furious, half-Latin and half-swing. Andrew  doesn’t even play at first -- doesn’t want to destroy this. But  glares quickly follow, and he has no choice...  He plays. Trains his ears to try to stay on target... But the  time signature is impossible to get a firm grip on... He  misses a fill... Then the time signature changes... He can’t  keep up... Then the band gives way to rubato piano... He stops  late... Then the band surges back in... He comes in late...  He’s driving completely blind.  BASSIST  (clenched teeth to Andrew)  The fuck?!   Come on...  Andrew, desperate, tries to fix things -- but he can’t.  Sliding further and further behind. PLAYERS eying him. You  can almost hear MURMURS in the audience, rising in volume...  And, through it all, Fletcher seems serene.  Andrew misses yet another break, and--  BASSIST (CONT’D)  Are you fucking   kidding   me?  This hits Andrew like a knife. Tears well up in his eyes. This  performance is already so far beyond saving...  Another missed hit. More MURMURS in the audience, louder and  louder now, as the number veers, swerves, and sloppily  staggers to its close... A swell of horns, a misplaced crash  of cymbals, what seems like a fermata... Andrew stops -- just  as the band RESUMES. And just as Andrew resumes -- the band  STOPS.  Andrew’s playing alone. He quickly moves to silence his  drums.   The chart is done.  And now -- the deafening silence.  No applause. Just the sound softly rippling and settling from  Andrew’s last cymbal hit...  Pink (9/10/2013)   97 Andrew sits at his set, in tears. Fletcher stays still. Looks  at ",
      "dialogue_count": 0,
      "word_count": 844
    },
    {
      "scene_number": 12,
      "slugline": "INT. ZANKEL HALL - STAGE - CONTINUOUS 108   108  Back to Andrew... Retreating BACKSTAGE...  ...when he sees -- around the corner of the backstage entrance --  -- his father.  IN THE WINGS  Jim has just arrived at the entryway. Looks at Andrew. Hurries  toward him. Is going to put an end to this. Andrew looks at  his dad for a moment, approaching. Jim reaches him --  -- and HUGS him.  JIM  I love you. I’m so sorry this is  happening to you.  Andrew looks at his dad. Something seems to click inside him at  that instant.  He pulls back. The desperation in his eyes giving way to  something else. Jim watches Andrew as Andrew steps backward,  before...  ...a pair of STAGE HANDS arrive.  STAGE HAND  Sir, you can’t be here--  JIM  Yes I can, I’m taking him with me--  STAGE HAND  (to Andrew)  You know each other?  Andrew is silent for a moment. Still. As though it has just  dawned on him.  He takes in the sight -- his dad, dwarfed by the Stage Hands,  reaching out to him. Jim has never looked quite so small to his  son, quite so pathetic, as at this moment.  A beat. More silence. And then --  ANDREW  No.  Jim goes wide-eyed. Utterly shocked. Andrew steps further  back, as the STAGE HANDS move to pull Jim away--  Pink (9/10/2013)   99",
      "characters": [],
      "action_text": "STAGE HAND  Alright, sir, that’s enough--  JIM  My -- my son -- I need to get my son--  STAGE HAND  Let’s calm down--  JIM  (frantic now--)  Andrew!!  Andrew calmly turns his back to his father and coldly heads to  the stage.  JIM (CONT’D)  Andrew!!!  ON STAGE  Andrew grabs new sticks, makes as though he was just switching  pairs and never leaving, and, ignoring his father’s calls from  behind -- trains his eyes back on Fletcher.  Fletcher looks at Andrew. Seems pleased:   This will be fun...  But Andrew doesn’t look scared anymore. Instead, his eyes are  glassy, hollowed out -- and hungry... There’s a   rage   in them  that we haven’t seen before...   This will   not   be the end...  FLETCHER  (to the audience)  Thank you... For our final number we’re  bringing it back to Ellington. This is  “Caravan”.  But then, before Fletcher can even turn back around -- let alone  cue the band --   Andrew launches into a double-time Latin.  Alone, his stick beating away at the ride cymbal, setting the  tempo for the rest of the band. Everyone looks at him.   What  the fuck...?   He has started on his own, before any cue,  beating the drums as though   vengefully .  Fletcher glares at him.   Who the fuck do you think you are?   But  Andrew just keeps playing. Knows   exactly   what he’s doing and is  not about to be stopped. Building in his eyes -- that same  coiled rage... To the BASSIST--  ANDREW  Follow me on four.  Pink (9/10/2013)   100 The BASSIST has no choice. Andrew nods in time as a count-off,  and the BASSIST joins in. Now we’ve got the bass and drums  playing, laying out the beat. Andrew looks back at Fletcher.  Drills into him with his eyes -- the kind of look Fletcher has so  often given   him . And, subtly, so that only Fletcher can see it,  Andrew mouths out two words:  ANDREW (CONT’D)  Fuck .   You .  It hits Fletcher. Realizing he too has no choice, Fletcher eyes  the rest of the band. Raises his hands, re-assuming control --  or trying to make   as though   he",
      "dialogue_count": 0,
      "word_count": 2117
    }
  ]
}