{
  "slug": "whiskey-cavalier-101-pilot-2019",
  "title": "whiskey cavalier 101 pilot",
  "genre": "action",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 7135,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. AIRFIELD - MINSK - LATER Frankie, with Dmitri by her side, drives Will and Standish onto a remote airfield. A CIA plane touches down. Everybody exits the car. Frankie, gun out, nudges Standish and Will, still zip-tied, down the runway. She smiles at Standish. FRANKIE Say goodbye to your new friend. WILL So what’re you and Big D gonna do after this? Grab a little borscht, do some more kidnapping, drop me in a snowbank and leave me for dead? FRANKIE You’re bitter. I get it. First you lose your fiancee, now this. But I guess when it rains it pours. With that, Will twists his zip tie, BREAKING FREE. He whirls on her, ready to attack as an RPG WHIZZES past them toward the taxiing plane. The rocket hits and - BOOM!- THE PLANE BLOWS UP IN MASSIVE FIREBALL. The blast knocks Will, Standish and Frankie onto their backs as the CAMERA WHIPS AROUND to reveal: Dmitri, holding a rocket launcher. END ACT TWO WHISKEY CAVALIER - HEMINGSON - 3rd ABC REVISION - 1/12/18   26.",
      "characters": [],
      "action_text": "ACT THREE EXT. AIRFIELD - MINSK - CONTINUOUS Standish scrambles to his feet and runs desperately toward Dmitri, who has dropped the rocket launcher and is reaching for an Uzi. Frankie rises woozily to her knees, but she’s lost her gun - and it’s right in front of Will. Dmitri turns the Uzi toward Frankie. Before he can fire, Will grabs Frankie’s gun and takes him out, then he pivots to Frankie. WILL Hands where I can see them. This is an FBI operation now. FRANKIE Well your asset’s getting away. Behind them, we see a gasping Standish continue to “run”. WILL Yeah, I’m not worried. ANGLE ON STANDISH: sinking to his knees, not ten yards away. WILL (CONT’D) He’s easily winded. Standish collapses onto his face. Will, teasing, to Frankie: WILL (CONT’D) You’re loading him into the car. INT. FBI - NEW YORK OFFICE - INTERROGATION ROOM - SAME TIME Susan, wearing a headset, is on one side of a TWO-WAY MIRROR. On the other side is an AGENT wearing an earpiece. The Agent sits at a table across from a HARDENED KILLER. SUSAN (into headset, to Agent) He’ll break. Show him the photos. The Agent pulls out a file. Susan picks up her phone. Dials. INTERCUT: INT. U.S. EMBASSY - FBI BULLPEN - PARIS Ray, stressed, sits at his desk. His phone RINGS. He answers. SUSAN Agent Prince? Dr. Sampson, in the New York Office. WHISKEY CAVALIER - HEMINGSON - 3rd ABC REVISION - 1/12/18   27. RAY Oh. Susan, right? Will’s bestie. Nice to meet you over the phone. SUSAN Likewise. Listen, I know you and Will have been working together... On the other side of the mirror, the Agent splays PHOTOS on the table. The Killer SWEEPS them off and SPITS on the floor. SUSAN (CONT’D) (into headset, to Agent) Tell him we found his trophies. (then, to Ray) Anyway, Will’s not answering his phone, and-- RAY (too quickly) I don’t know where he is. SUSAN OK, you instantly pivoted from relaxed cordiality to hostile denial which tells me you’re lying. The Agent speaks to the Killer - who LAUGHS. The Agent glances toward Susan",
      "dialogue_count": 0,
      "word_count": 3057
    },
    {
      "scene_number": 2,
      "slugline": "INT. TRAIN TO PARIS - LATER Will steers Standish down the aisle. They pass a restroom. STANDISH Can I at least pee now? Will opens the door and looks: single-seater, tiny window. WILL You have 60 seconds. STANDISH You gotta cut me loose - unless you want to come in and lend a hand. Will cuts his zip-tie, shoves him in and shuts the door. A beat, then a YOUNG COUPLE squeezes past, laughing and nuzzling. It’s some serious PDA, and Will is forced to watch up close. Barf. He purposely shifts, BUMPING INTO THEM as they pass. Will lifts a stolen iPHONE into frame. He dials. INTERCUT: INT. U.S. EMBASSY - DIRECTOR’S OFFICE - PARIS - SAME TIME Ollerman is at his desk. His phone rings. He answers. WILL Whiskey Cavalier. I have Standish. OLLERMAN Chase? Give me your coordinates-- From inside the restroom we hear a THUMP and a STRANGLED CRY. WILL No time, sir. I’ve got a situation. OLLERMAN Agent, do not-- Will hangs up. Ollerman SLAMS the receiver down, frustrated. END INTERCUT. Will BARGES into the restroom. Standish has one foot in the toilet and his head out the tiny window, trying to escape. WILL Still glad I didn’t lend a hand. WHISKEY CAVALIER - HEMINGSON - 3rd ABC REVISION - 1/12/18   40.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 218
    },
    {
      "scene_number": 3,
      "slugline": "INT. TRAIN TO PARIS - DINING CAR - A LITTLE WHILE LATER Standish devours his third tiramisu. Will stares, disgusted. STANDISH What? If I’m going to prison, I might as well enjoy myself now. Will sighs. Leans away. Dials the stolen iPhone. INTERCUT: INT. FBI - NEW YORK OFFICE - SAME TIME Susan’s desk phone rings. It’s a foreign number. She answers. WILL I need some information. SUSAN “Hello, Susan. I’m fine. I know I’ve been AWOL for 36 hours and I’m sure you were worried sick...” WILL I’m so sorry. I got sandbagged by this CIA agent. She’s relentless. SUSAN Oooh. She? Name please. WILL Frankie Trowbridge. ANGLE ON: Standish, who sees a KID in front of him playing a PSP. The Kid puts it down. Standish glances at Will, who is engrossed in his conversation with Susan. SUSAN Francesca Trowbridge. Codename: Fiery Tribune. Only child. Family inseparable. Junior year, she studied abroad. Her parents were flying out to surprise her when they were killed in a terrorist attack. She disappeared for two years and re-emerged at Langley. (she stops; analyzes) OK. So: cataclysmic loss. Probably blames herself. Definite fear of intimacy and need for retribution... (scans the file) ...which has served her well.  (MORE)  WHISKEY CAVALIER - HEMINGSON - 3rd ABC REVISION - 1/12/18   41.",
      "characters": [],
      "action_text": "She’s got the highest kill or capture rate of any agent at the CIA. WILL Then it’s good thing I shook her. SUSAN Based on her profile, I have two conclusions: one, I kinda want her to be my new best friend. And two, I don’t think you shook her. WILL Wait, what? We’re heading into a tunnel and you’re breaking up... SUSAN I said I DON’T THINK YOU-- The line goes dead. END INTERCUT. Will stares at the phone, frustrated, as the train enters the tunnel. The dining car goes black. When the lights come back on seconds later, Frankie is sitting across from Will. END ACT THREE  SUSAN (CONT'D)  WHISKEY CAVALIER - HEMINGSON - 3rd ABC REVISION - 1/12/18   42. ACT FOUR INT. TRAIN TO PARIS - DINING CAR - DAY RESUME SCENE. WILL How? Frankie leans in very close. Runs her finger sensually along his collar. Produces a miniscule dot. Will glances at it. WILL (CONT’D) Micro-tracker. Very fancy. FRANKIE The CIA has all the coolest toys. WILL And here I thought we were just having a tender moment. Frankie discretely raises a pistol. Smiles. FRANKIE I got your “tender moment” right here. Now stand down. Standish is coming with me. WILL Yeah, no. ZOOM OUT TO REVEAL: Will’s pistol, under the table, is already drawn. The muzzle is pressed against her knee. WILL (CONT’D) That’s my gun, by the way. Frankie seethes as we hear a THUMP on the roof. A beat. Then 6 CHINESE ASSASSINS armed with QBZ-95 assault rifles CRASH THROUGH the windows. Passengers SCREAM and SURGE toward the exits as the Assassins unleash a hail of GUNFIRE. Standish scrambles for cover. Bullets obliterate crockery and tabletops. Will ducks and dodges, taking on these death-dealers hand-to-hand. Frankie empties her clip at the attackers, taking out 3 before she runs out of bullets. The lead Assassin stops to reload. Will grabs his gun and takes out 2 Assassins as 4 more pour in. As the battle escalates, Will and Frankie start working in unison and together they are brilliant! At one point, Frankie is cornered by an Assassin but",
      "dialogue_count": 0,
      "word_count": 973
    },
    {
      "scene_number": 4,
      "slugline": "INT. RAY’S COTTAGE - KITCHEN - REIMS - A LITTLE WHILE LATER Impossibly quaint. Ray, in t-shirt and pajama bottoms, cooks breakfast on an old gas stove. There’s a knock at the door. INT. RAY’S COTTAGE - FRONT DOOR - MOMENTS LATER Ray opens the door to find Will, Standish and Frankie there. RAY Will?! WILL Hey Ray. Sorry for the pop-in. INT. RAY’S COTTAGE - LIVING ROOM - CONTINUOUS Will pushes past him, carrying Frankie. Standish follows. RAY Is that-- WILL Edgar Standish. Cuff him to the radiator. Ray grabs a set of cuffs and does just that. STANDISH Is this because of the Chinese assassins? WILL Among other things. (then, re. Frankie, to Ray) And you remember my sexy British friend. She’d say “hi”, but she’s lost a lot of blood. INT. RAY’S COTTAGE - KITCHEN - CONTINUOUS Will sweeps all the breakfast dishes off the table. They CRASH to the floor.   Will hoists Frankie onto to the table. Opens her shirt. Examines the wound. WILL Well, the good news is it’s a through and through. FRANKIE And the bad news? WHISKEY CAVALIER - HEMINGSON - 3rd ABC REVISION - 1/12/18   46.",
      "characters": [],
      "action_text": "WILL There doesn’t always have to be bad news. Ray enters. RAY I called for a medic - and back-up. Will pulls him aside. WILL Can’t wait. A piece of her shirt went in with the bullet. It’ll go septic if I don’t get it out now. FRANKIE Did you say “septic”? RAY Kettle’s on. I’ll get some towels. Ray exits. Will crosses to Frankie. FRANKIE You told me there was no bad news. WILL I thought you’d be unconscious by now. (then) Stay frosty. During my last tour in Iraq, I had to step in for the corpsman when our unit got hit. FRANKIE Yeah, I know. That’s how you won the Silver Star. WILL Aw, you really did read my file. Flattered. Will picks up a 10-INCH KNIFE. Frankie grabs his hand. FRANKIE Wait, wait, wait, wait. Hard pass. You are not cutting into me with that thing. WILL What? You think I should use the vegetable peeler? WHISKEY CAVALIER - HEMINGSON - 3rd ABC REVISION - 1/12/18   47. FRANKIE Was that supposed to make me laugh? WILL Frankie, we both know this ends one of two ways. You stop me and the infection will kill you. You let me get in there-- FRANKIE And I could totally bleed to death. WILL Yeah, but I won’t let that happen. I mean, I’d hate to lose you just when things are getting interesting. FRANKIE Are you as scared as I am? WILL Yeah, but I’m trusting you not to bail on me. She looks at him. This is what’s up. For both of them. FRANKIE Make sure you give me a cute scar. WILL Don’t worry. It’ll be a conversation starter. (raising the knife) Now this is gonna hurt, so I need you Mountain Lion. FRANKIE Have I ever been anything less? Ray re-enters with towels. The tea kettle SCREAMS, drowning out the sound of Frankie’s agony as Will CUTS INTO HER. ANGLE ON STANDISH: who’s still cuffed to the radiator. He can see directly into the kitchen. The camera never goes back to Frankie. Instead, we let Standish be our eyes. STANDISH Oh that’s a lot of blo-oooh God. ANGLE BACK ON WILL: he pulls a tiny circle of fabric from the wound. Holds it to her blouse. It’s a match",
      "dialogue_count": 0,
      "word_count": 2887
    }
  ]
}