{
  "slug": "wind-river-2017",
  "title": "wind river",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 8,
  "characters_count": 0,
  "characters": [],
  "total_words": 21973,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. BUREAU OF LAND MANAGEMENT FIELD OFFICE -- DAY. BLM OFFICER TIM WINTER, late 30’s, big coat, bigger cowboy hat, stands beside USFWS ENFORCEMENT AGENT DALE BERTRAM, early 30’s. They stare at the coyotes in the bed of Corey’s truck. TIM Did you see Wyman’s sheep dogs near the flock? CORY Nope. TIM Told me he had six dogs watching over it. CORY He don’t have six dogs anymore. Those coyotes moved on that flock like they’ve been doing it all month. TIM Buggers are bad this year. We’ll be lucky if there’s a flock of sheep standing come April. Tim looks to the STORM CLOUDS that loom over the WIND RIVER MOUNTAIN RANGE like a reckoning. TIM (CONT’D) After this storm, I want you up in a chopper. Those mutt’s will be easy to spot with a coat of fresh snow. When can your boy fly, Dale? DALE We’ll see what kind of wind follows the storm. Maybe Wednesday. He looks at Cory. DALE (CONT’D) I got a call from BIA Police, the chief was asking for you. A mountain lion’s working through the flocks east of Boulder Flats. Tim can’t help but laugh.  5.",
      "characters": [],
      "action_text": "TIM You’d think folks would learn this isn’t sheep country. They all laugh at that. DALE Tore up a horse and some weanlings too. CORY That sounds like wolves. DALE Chief says it’s a cat, and they ain’t had no luck getting it. I offered Kenny and his hounds, but they don’t want a white man running around on the rez with a firearm. CORY They don’t want a white man out there period. I’ll call him. TIM I forget you’re part Indian. CORY Well ... I’m Indian enough to do favors, but not enough to pull a check. DALE Be careful out there. Half those boys are tweaked out of their minds. Cory doesn’t answer. TIM Shit, that junk’s everywhere now. I’m scared to let my daughter leave the house. As soon as Tim says it, he wishes he could have it back. Everyone looks to the ground. To the mountains. To the storm hovering. Anywhere but Cory, who stares at the coyotes’ corpses in the bed of his truck. Lifeless eyes stare back. CORY I gotta go.  6. DALE Okay. Drop those off at Fish and Game. CORY Yep. He climbs in his truck and starts it in one fluid motion. He pulls toward the road as the coming storm inches closer. CUT TO: INT. CORY’S PICK UP -- LANDER, WYOMING -- DAY. Cory drives through the town of Lander. Feed stores, fast food, and a Wall Mart pass by his window. He turns on a side street and pulls up to a small house. Parks. Gets out. EXT. WILMA LAMBERT’S HOUSE -- CONTINUOUS. Cory walks up the driveway past a faded, Silver Subaru. Reaches the door. Rings the bell. The door opens and WILMA LAMBERT, 38, full blood Shoshoni, gives Cory a terse smile. She was a beauty two kids and many heartaches ago, but bad food and cigarettes are winning the war against her looks. Still, effort went into her hair, and make-up was delicately applied. WILMA You got blood on your shirt. CORY I was at work. She nods, but doesn’t approve. WILMA Who was the victim today? Cory knows her well enough to sense her moods, and apparently she’s in one right now. CORY Looks like it’s gonna be me. She stares a",
      "dialogue_count": 0,
      "word_count": 2249
    },
    {
      "scene_number": 2,
      "slugline": "INT. CORY LAMBERT’S HOUSE -- CASEY’S BEDROOM -- NIGHT. The door creaks open. A shadow slinks in. Sits on the edge of the bed. A hand reaches out and rests gently on Casey’s chest. CORY Hey. The sheets move a little. CORY (CONT’D) Come on. Wake up, son. We gotta go. Casey bolts upright. CASEY I’M UP. The shadow rises, walks to the door. Turns on the light. CORY I’m making breakfast. Get dressed. We gotta feed the horses. Casey rubs furiously at his eyes and yawns. CASEY Waiting on you. CORY (Smiles)Yeah ... I can see that. Cory walks out as Casey rises, shaking off the night. CUT TO: INT. CORY’S PICK UP -- PRE-DAWN. Cory sips coffee. As they drive down the highway, PRONGHORN ANTELOPE walk parallel to the road. Following a path carved into these plains before man sparked his first fire. INT. CORY’S PICK UP -- DAWN. The sun has crested the horizon behind us. Ahead of us -- the Wind River mountains and the storm clouds that gather above them.  16.",
      "characters": [],
      "action_text": "CASEY How come the clouds just sit there? Why don’t they dump their snow and get it over with? CORY Mountains hold the clouds back with the winds that blows between ‘em. Makes a sort of suction. Sometimes they can suck the storm right out of the clouds. Sometimes they just make it worse, cuz a big storm will sit there and gather strength from the winds that hold it back ... Our ancestors believed the storms hold the spirits of vengeance, and the mountains are our protector. But when enough evil lives in our people, the mountains free the storm to punish the demons among us. CASEY That what you believe? Cory smiles. CORY No. Beat. CORY (CONT’D) Sometimes. Up ahead, we see a small, log cabin with a barn even worse off than Cory’s. TWO HORSES run and kick at the dropping pressure and the storm behind it. Cory drives up and parks. The front door is already open. An Indian man in his 70’s stands in long johns and boots with no regard for the sub- zero temperature. This is DAN CROWHEART, Casey’s grandfather. CORY (CONT’D) (Re: the horses) Sense the storm. CROWHEART Yep. That’s my cue to stick ‘em in the barn. But with a lion about, I don’t want ‘em stuck in a open stall. They gonna have to make their peace with the storm.(Opening his arms) Come here, grandson.  17. Casey is already doing that. He runs to him and the old man lifts him with a strength we didn’t credit him with having. CROWHEART (CONT’D) You’re Grandma made fry bread. You have breakfast? CASEY Just eggs. CROWHEART Go get some then. Casey disappears inside. Crowheart looks to Cory. CROWHEART (CONT’D) Hau, Munape. CORY Yep. CROWHEART Police chief called you to hunt the lion, eh? CORY He called me to hunt something. You lost a steer? CROWHEART I’ll show you where. It’s a lion. He grabs a coat from a rack and steps outside. They walk behind the house, past the horses and toward a large, fenced, field completely covered in snow. CROWHEART (CONT’D) How’s Wilma? CORY Headed to a job interview in Jackson. Some hotel",
      "dialogue_count": 0,
      "word_count": 1310
    },
    {
      "scene_number": 3,
      "slugline": "EXT. DAN CROWHEART’S CABIN -- DAY. Cory stands on the little porch with TRIBAL POLICE CHIEF BEN SHOYO, 50, kind, round face and large, heavy frame. They watch the storm throw snow at the earth like shrapnel. Barely visible to the left of the house are THREE TRIBAL POLICE TRUCKS. EMPTY FLAT-BED TRAILERS ATTACHED TO THE BUMPERS. AN AMBULANCE IS PARKED BESIDE THEM. Two snowmobiles sit in front of the house. Ben lights a smoke. CROWHEART FBI’s taking a while, eh. BEN Road’s bad out of Riverton. I hate to move her before they’ve had a look, but I’m not gonna try to pull her out after dark. We gotta get this show on the road. Cory steps out into the snow. Kicks at it with his boot. CORY We’re losing the tracks. BEN This ain’t letting up. Not for a while. CORY Oughta let me follow ‘em while I still can. BEN Can’t have you out there without the FBI’s okay, Cory. Cory looks back to the men on the porch. CORY You call her folks yet, Ben? BEN I want to get her to Lander first. It looks like Natalie, but I don’t want to call the wrong person. Not about this. Beat.  22.",
      "characters": [],
      "action_text": "CORY It’s Natalie. We look out from the porch and can barely make out -- A BLACK SUV, crawling through the snow on the main road. CORY (CONT’D) There’s your Feds. INT. BLACK SUV -- CONTINUOUS. FBI AGENT JANE BANNER, 28, struggles to see through the snow as her GPS directs her. GPS In seventy-five feet, turn right. JANE ... Where?! GPS Turn right ... Turn right. JANE Where do you want me to turn right?? WHERE!!! Dirty-blonde hair falls over a pretty face as she peers closer to the windshield in an attempt to see where the hell she’s supposed to go. EXT. DAN CROWHEART’S CABIN -- PORCH -- DAY. Dan, Ben, and Cory look at the SUV -- barely visible through the storm -- PULL TO A STOP on the highway. CROWHEART What are these fools doing? CORY Can’t see the road. Beat. BEN We don’t have time for this. CORY I’ll go get ‘em. Cory walks to his snowmobile.  23. INT. JANE’S SUV -- CONT. She can barely make out the house a quarter-mile away, and the police vehicles -- white themselves -- are completely invisible. Jane pulls a ROAD ATLAS out and studies it. Looks back out the window. Hears what sounds like the whine of a CHAIN SAW. Cory appears from the snow like a wraith, pulls up beside Jane’s window. Knocks on it. No idea a gun is now pointed at him on the other side of the vehicle’s door. She cracks the window, leery. CORY You FBI? JANE ... You Tribal Police? CORY No. But I’ll take you to them. This thing in four-wheel drive? JANE Are you kidding? CORY Alright, follow me. Cory whips the snowmobile around, spewing snow, then drives toward the house. GPS In fifty feet -- Jane pounds the power button with her fist. JANE Shut up. Jane puts the SUV in gear and follows. The police vehicles come into view, as does Ben, standing on the porch. His uniform is her first evidence this isn’t an ambush. Cory has already parked and is walking back to the protection of the overhang. She slams the SUV in park and opens the vehicle door.  24. EXT. DAN CROWHEART’S CABIN -- CONT. She tosses a coa",
      "dialogue_count": 0,
      "word_count": 1330
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SAGEBRUSH PRAIRIE -- DAY. Jane sits behind Cory on the snowmobile. They race through the white at 60 miles-per-hour. Jane presses her face into the back of this stranger -- her hands tucked under his ass -- as she experiences cold in a manner unexplainable to those who haven’t endured it. Up ahead, we see FOUR POLICE SNOWMOBILES, and FOUR OFFICERS huddling around a MOBILE PROPANE HEATER. TWO EMT’S huddle beside the body. Cory and Ben park. Walk toward them. Cory doesn’t wait for Jane to start asking questions. CORY I picked up her tracks about 300 meters to the south. Jane nods as she struggles to shake off the bone-breaking cold. They walk past the officers to NATALIE HANSON’S BODY, and an EMT holding a HEAT GUN -- basically a very powerful hair dryer -- that he waves along Natalie’s body where it meets the ice that holds her. Jane kneels next to her. JANE (Calls back to Ben)Got a positive ID? BEN Not positive, no. Cory, and three of the officers say in unison: EVERYONE It’s Natalie Hanson. BEN Haven’t found any identification, no one from the family has identified the body, but ... JANE We’ll call that positive for now. She live close? BEN Fort Wakashie. North a ways.  29.",
      "characters": [],
      "action_text": "JANE What’s ‘a ways’? BEN Thirty minute drive. JANE Okay, she didn’t run from home. Jane studies the gash. Touches the body. JANE (CONT’D) She’s frozen solid. She looks back at Ben. JANE (CONT’D) No one reported her missing? Her parents? BEN No. She takes that in. JANE Makes the parents rather suspect. No one likes the sound of that, but they all hold their tongues. Jane notices dried blood that has soaked and frozen to the crotch of her sweatpants. Notices her bare feet. JANE (CONT’D) (Softly) Who did this to you, honey? As out of place as Jane is in the wild, and this may very well be her first murder scene -- she ignores the cold and focuses. Patient. Observant. She looks up at Ben. JANE (CONT’D) How experienced is your medical examiner? The irony of this girl asking who’s experienced ... BEN He stays busy.  30. JANE Order a rape kit, When he’s done with his prelim, I want her sent to Cheyenne. Make sure her belongings go with her. I need them tested. I’m listing this as a homicide. One of the officers can’t help but mumble -- OFFICER Gee, you think? Jane stands, looks over the land -- covered in a foot of fresh powder. With more falling. JANE We’re not going to find the attack site if it’s out in the open. Not till spring, anyway. She turns to Cory. JANE (CONT’D) How well do you know this land? CORY Like it’s my job. Which it is. JANE Anywhere she could have been running from? Anything close? CORY Nearest homes are seven or eight miles southeast. BEN Sam Littlefeather’s house is out there. CORY Yep. BEN Those boys are worth looking into. JANE I’m no survivalist, but that’s too far to run in the snow -- she’s dressed no better than I was and I almost froze to death in your front yard.  31. CORY You’re not from here. JANE There’s no structures closer? CORY Drill rigs maybe five miles from here. There’s trailers for the workers. But they shut it down in the winter. JANE So why would a teenage girl be out here? BEN Kids come out here on snowmobiles. Have a big party",
      "dialogue_count": 0,
      "word_count": 1118
    },
    {
      "scene_number": 5,
      "slugline": "INT. JANE’S SUV -- NIGHT. SNOW pounds the windshield as the wipers work frantically to remove it. Snow swarms in the headlights like locust. Jane leans forward, chin almost resting on the steering wheel, straining to see the road. GPS In half a mile, turn left on East Main Street. The GPS may be right, but there is no way to know -- Jane can’t see ten feet in front of her. She slows down even more -- barely going 30. Turns on her hazards ... GPS (CONT’D) In three hundred feet, turn left on East Main Street. She slows a little more, but still sees nothing -- no road. Nothing. GPS (CONT’D) Turn left. Turn left. She looks to the left, then back to her right -- A TRUCK HORN BLARES. She slams on her brakes and begins sliding as a SEMI whips by, mere feet from her bumper. She slides to a stop in the middle of the intersection, now facing the direction of the Semi. She struggles to slow her beating heart as she watches the brake lights of the truck that almost killed her. The TRUCK DRIVER gets out, runs back to her. She rolls her window down. JANE I’m sorry, I can’t see anything. TRUCK DRIVER IF YOU DON’T KNOW HOW TO DRIVE IN THIS YOU SHOULDN’T BE ON THE ROAD. JANE Who the hell knows how to drive in this??  35.",
      "characters": [],
      "action_text": "TRUCK DRIVER Pull up behind me and follow me close. Don’t slam your brakes. Stay in second gear -- and you pull your ass into the first motel we come to. JANE That’s where I’m headed anyway. TRUCK DRIVER Well I guess it’s your goddam lucky day. He turns and runs through the storm back to his truck. She rolls up her window. JANE (To no one) I’m really sorry we never had blizzards in FUCKING FLORIDA!!! I’d like to see one of you bastards in a hurricane. He begins slowly moving forward. Mad as she is -- she obeys, and pulls up right behind him. EXT. SILVER SPUR LODGE -- LANDER, WYOMING -- NIGHT. The parking lot is completely empty and covered with snow. The truck driver points out his window at the motel -- wildly gesturing for her to go there. Jane turns into the lot, slamming the curb, and spinning her wheels in a furious attempt to reach the safety of the covered entrance. She parks. Draws in a deep breath, opens the door and steps into the fury of the storm. INT. SILVER SPUR LODGE -- LANDER, WYOMING -- NIGHT. The decor is old west meets late 80’s -- wagon wheels, black leather couches, and watercolors of mountains, cowboys, and horses. Behind the counter is INGRED, late 30’s, horribly obese, and watching some version of CSI on a small TV. Jane approaches the counter. INGRED You look a little frazzled.  36. JANE Quite a storm out there. INGRED Yeah, you could’ve picked a better day to travel. JANE Could I get a room? INGRED How many nights? JANE I don’t know. A week, maybe. INGRED Smoking? JANE No. INGRED Pets? JANE No. INGRED If you have a pet, now’s the time to tell me -- a whining dog at 3am puts you both back in the storm. JANE No pets. Ingred slides over a large index card. INGRED Mastercard, Visa or cash. Fill out your home address and vehicle information. I need to make a copy of your license. Jane lays her FBI ID and badge out. JANE Do you give a government discount? INGRED Government’s never given me one. JANE ... So that’s a no.  37. INGRED And how, lady. ",
      "dialogue_count": 0,
      "word_count": 2635
    },
    {
      "scene_number": 6,
      "slugline": "INT. HANSON HOME -- FORT WASHAKIE, WYOMING -- DAY. We are inside a house that screams poverty. Furniture is old and broken to the point of barely being functional. Faux-wood siding of the manufactured home is fraying at the edges. Still, extreme care has been given to make it into a home. Photos of Natalie and a handsome TEENAGE BOY are pasted on every wall. We hear Ben’s voice as we look over the home. BEN (O.S.) So you never met him. MAN (O.S.) No. BEN (O.S.) And she never talked about him? MAN (O.S.) Not to me. The man’s voice is soft, deep, almost soothing. As we push in on a photo of Natalie and the handsome young man, who is clearly her brother, we hear -- JANE (O.S.) Why would you let her stay with a man you’ve never met. A man whose name you don’t even know. I look around, see all these photos -- MARTIN (O.S.) She was an adult. JANE Barely. We see the man now -- Natalie’s father, MARTIN HANSON, 40’s, every bit of 6’2”. Long, black hair pulled in a braided pony tail. Dark, heavy face. But those eyes -- a hawk’s eyes. A warrior’s eyes. Which are burning into Jane. He looks at Ben. MAN Wyuksa psi wasichu. JANE What does that mean? BEN ... It’s not good. She looks at the big man, apologizing without backing down.  49.",
      "characters": [],
      "action_text": "JANE I don’t mean to offend you. I’m trying to understand the dynamic, Mr. Hanson. I’m trying to help. MARTIN Why is it whenever you people try to help, it starts with insults. He steps toward her, furious eyes and all. She resists the temptation to draw her weapon. MARTIN (CONT’D) I don’t know why she wouldn’t tell me. But she was eighteen. I chose to trust her. I chose wrong. He looks her over. JANE How about your wife, did your daughter talk to her? MARTIN Do you talk to your mother? Beat. JANE It’s Annie? Is she here? MARTIN She’s in the bedroom. JANE I’d like to speak to her. His hawk eyes narrow. He says, almost like a dare -- MARTIN Be my guest. JANE Thank you. (Points down the hall) Bedroom this way? BEN Jane. Ben shakes his head ‘no’. JANE (To Martin) You don’t mind?  50. MARTIN Hey, you don’t need my permission. You’re an adult. Barely. Point made. She walks down the hall. Comes to a closed door. Knocks softly. No answer. She opens the door and sees -- ANNIE HANSON is 50, heavy, and COVERED IN BLOOD. She sits on the edge of her bed, sobbing, mumbling, and rocking back and forth gripping a KITCHEN KNIFE. Cuts run up and down her arms. She never notices the open door. Jane doesn’t give her a chance to -- she closes the door quickly. Jane stands a moment in the hall -- she is in no way prepared to navigate this world, and she knows it. She dreads walking to the living room and facing Martin, but does it anyway. When she reaches the living room, Martin stares hell at her. She has it coming. JANE I’m sorry. There is a knock at the door. Martin opens it. It’s Cory. The two men stare at each other. Don’t speak. Martin’s lips tighten. Cory gives him a sad smile. Martin’s tight lips begin to quiver. Cory steps back onto the porch. Martin follows him. Cory kicks the door and we glimpse Martin fold into Cory’s arms as it closes, shutting us out. Through the door, we hear the man heaving enormous sobs that seem to shake the house’s flimsy foundation. Ben and Jane stan",
      "dialogue_count": 0,
      "word_count": 6621
    },
    {
      "scene_number": 7,
      "slugline": "EXT. HIGHWAY -- CONT. Cory pulls over in front of Sam Littlefeather’s place, now surrounded in YELLOW POLICE TAPE. He begins unstrapping his snowmobile as the other vehicles push farther down the highway. He puts on his white camo as the whine of rubber on frozen road fades into the distance. EXT. HIGHWAY 789 -- DAY. WE PULL OVER. STOP. EVERYONE GETS OUT. In the distance, DRILL RIGS and TRAILERS can be seen. Though miles away, they stand out like blisters in this white world. Snowmobiles are unloaded and mounted. Engines scream as they are started. Ben fires his snowmobile, looks back at Jane. BEN Get on. She looks at him. JANE Getting really tired of these things. BEN Oh, come on. You’re a Florida girl, right? Just like those jet-skis, ain’t it? She climbs on behind him. BEN (CONT’D) If there was an easier way to travel snow, we’d be doing it. JANE Let’s get it over with. (Looks at her bare hands) Shit. Forgot to bring gloves ... You mind? He rises out of the seat. She places her hands down and he sits on them. Smiles. BEN See? All sorts of perks to this deal.  80.",
      "characters": [],
      "action_text": "JANE ... Yeah. She tries not to, but can’t help smiling either. All six snowmobiles take off toward the rigs, blowing smoke and spitting snow. EXT. -- WEST-CENTRAL DRILL STATION, TWENTY-TWO -- DAY. A DOZEN DRILLS rise from the earth. ENORMOUS GALVANIZED PIPING undulates above and below the snow, like a steel serpent. TELEPHONE POLES have been sunk every thirty feet. WIRES criss- cross from them. SURVEILLANCE CAMERAS are mounted to each. Four MOBILE HOMES are lined one after the other away from us. TWO GIANT, CYLINDER TANKS sit to our left. Beyond them is a larger Mobile Structure -- all wires lead here. A MAN ON A SNOWMOBILE APPROACHES US. As he gets closer, we can see he wears a NAVY PARKA WITH A BADGE ON THE RIGHT CHEST POCKET. He stops. His name is CURTIS. 40’s, burly but clean cut, professional and very friendly. He has a large bruise on his cheek. CURTIS Good morning. Can I help you? BEN Matt Rayburn work here? CURTIS Yeah, do you know where he is? BEN ... Bout to ask you the same question. CURTIS He had a fight with his girlfriend a few days ago, she ran off and he went after her. We haven’t seen him since. JANE When was that?  81. CURTIS Three days ago. Heck, we didn’t know what to do -- waiting to hear back from corporate about whether to write up his termination papers or call you guys. Jane and Ben look at Curtis who seems genuinely concerned. Another snowmobile pulls up carrying another security officer. He steps up -- we can’t help but notice the scratches that run down his face. SECURITY OFFICER Everything okay? CURTIS They’re here about Matt -- SECURITY OFFICER You find him -- is he okay? JANE What happened to you guys? SECURITY OFFICER What’s that? JANE Pretty torn up. CURTIS Hit a pine branch doing sixty and see what happens to you. SECURITY OFFICER We run the property line twice daily. Comes with the territory. BEN You should try a face shield. CURTIS Oh, I requested helmets. My supervisor said, “But snow’s soft, ain’t it?” Corporate’s in Texas, wha",
      "dialogue_count": 0,
      "word_count": 2009
    },
    {
      "scene_number": 8,
      "slugline": "EXT. MOUNTAINS NEAR DRILL STATION TWENTY-TWO -- DAY. Cory has dropped down from the mountains. Stops his snowmobile. Looks through binoculars at the camp. Sees the tension-filled mass ambling toward the last trailer in the camp. Cory pulls his two-way radio from his coat. CORY (Into the radio) Ben ... Ben, you copy? He’s a little more than a mile away. He takes the rifle from his shoulder and steps off the snowmobile. Begins racing toward the camp ... EXT. MATT’S TRAILER -- WEST-CENTRAL STATION -- CONT. Everyone stops before the trailer. No one trusting anyone. CURTIS This is his trailer. BEN Did he bunk with anybody? CURTIS Yeah ... Me and Pete Mickens. Cory’s voice filters through Ben’s radio. He steps away as he speaks into it. JANE Is Pete in there now? CURTIS He’s sleeping. He has night shift. Beat. Jane steps up on the aluminum steps that rise to the door. She knocks, then steps down. INT. MATT’S TRAILER -- WEST-CENTRAL STATION -- CONT. WE ARE IN THE TRAILER’S BATHROOM. STEAM FROM THE SHOWER HAS CLOUDED THE MIRROR. We hear knocking. Push open the bathroom door. We move through the trailer, through the kitchen, and toward the front door. A HAND REACHES FOR THE DOOR LATCH. TURNS IT.  90.",
      "characters": [],
      "action_text": "The hand pulls it open ... WE ARE IN A FLASHBACK -- We look out and see, standing outside the trailer: NATALIE HANSON, DRESSED IN WHITE SWEAT PANTS AND A BABY-BLUE COAT. Her beautiful face smiles back at us. FROM HER POV WE SEE -- Matt Rayburn, 26, handsome, wearing only a towel. MATT Can I help you? NATALIE Yes, I’m looking for my knight in shining armor. I believe this is his trailer. He smiles. MATT I’m a bit short on armor at the moment. She snaps her feet out of a pair of SNOWSHOES, climbs up the stairs, and wraps her arms around him. NATALIE I don’t mind. MATT I didn’t hear your carriage outside. NATALIE Yes, well ... My carriage wanted to catch the eight o’clock show in Lander, so she dropped me off at the turn-out. He drops out of character for a moment. MATT You walked that far in the snow? She leans into him. NATALIE You’re worth it.  91. He kisses her. Pulls her inside and slams the door closed. INT. MATT’S TRAILER -- BEDROOM -- LATER. Matt traces his finger over her breasts. She stares up at him as if nothing else on earth exists. His hand slips out of frame. She cranes her head back -- loves the way he touches her. She closes her eyes. MATT (Soft) No. Look at me. She does. He rolls on top of her. She fights to keep her eyes open as he enters her. NATALIE Tell me how you’ll take me away from here ... He gently thrusts into her. She moans. MATT A little house ... a little porch where we sit ... He moves back, then pushes gently into her again. MATT (CONT’D) I tell you about my day and you tell me what I forgot to buy at the store -- She laughs. Which makes her contract, which makes her moan. NATALIE And you love me, still. MATT I do. WE PUSH IN CLOSER. CLOSER. Their bodies become one -- he gently moves inside her, and the pleasure of it -- the love that drives it, pushes a tear from her eye. We follow it down her cheek and watch it creep behind her. INT. MATT’S TRAILER -- BEDROOM -- LATER. Natalie rests her head on his chest. They stare at the ceiling.  9",
      "dialogue_count": 0,
      "word_count": 4701
    }
  ]
}