{
  "slug": "wonder-woman-2017",
  "title": "wonder woman",
  "genre": "action",
  "format": "film",
  "scenes_count": 20,
  "characters_count": 7,
  "characters": [
    "HIPPOLYTA",
    "ANTIOPE",
    "YOUNG DIANA",
    "STEVE",
    "DIANA",
    "GENERAL HAIG",
    "ETTA"
  ],
  "total_words": 28623,
  "total_dialogue": 11,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. LOUVRE MUSEUM - DIANA’S OFFICE - MINUTES LATER 4   4 The CRATE is delivered to Diana -- a wall-mounted COLLECTION OF ANCIENT WEAPONRY and GREEK ANTIQUITIES behind her. She eyes the WAYNE ENTERPRISES LOGO warily. Now alone at her desk, Diana opens the crate and looks inside, stunned. REVEAL THE ORIGINAL DAGUERREOTYPE of Diana from   BvS   -- She’s in her WONDER WOMAN ARMOR, surrounded by a band of SOLDIERS -- her friends -- from long ago. DIANA (V.O.) I learned this the hard way.   A long, long time ago.   And now I will never be the same. She holds up the unsigned note accompanying the photo: “I found the original.   Maybe one day you’ll tell me your story.” She contemplates the faces of her friends long dead.   Her eyes focus in on a man we’ll soon know as STEVE TREVOR. She lingers on him, and then drifts to herself. Surrounded by HISTORY, Diana is overwhelmed by the memory of how this photo -- and Wonder Woman -- came to be -- CUT TO: EXT. ARMY TRAINING GROUNDS (THEMYSCIRA) - DAY 5   5 THE PAST.   Flashes of AMAZONS as they train for COMBAT on VARIOUS PLATEAUS extending from the edge of the CLIFFS of Themyscira. The Amazons train with WEAPONS, CLASHING and TESTING one another to their limits. DOZENS of ARMORED FEMALE WARRIORS -- AMAZONS -- engage in a dazzling array of training exercises.   Every Amazon is an ageless beauty, between 30 and 50.   They spar with BO STAVES, KNIVES, SWORDS.   Practice ARCHERY, SPEAR THROWING, and LASSO from HORSEBACK.   It’s breathtaking -- -- and YOUNG DIANA (8), Princess of Themyscira, watches it all from the edge of the field.   Her eyes blaze with admiration.  2. (CONTINUED)",
      "characters": [
        "HIPPOLYTA"
      ],
      "action_text": "ANTIOPE, the demanding GENERAL, oversees the Amazons. She wears a distinctive HELMET.   At her side, the Amazon PHILIPPUS (African, regal). Diana fixates on one Amazon in particular, FIERCE and POWERFUL -- ARTEMIS.   She sends her opponent to the GROUND, then SPINS to face another! ANTIOPE Yes, the blow was strong, but Eliana’s footwork betrayed her!   A battle is like a river-crossing, every step must find a safe spot -- Diana REHEARSES Artemis’ moves, her young face set in a fierce scowl.   She stabs at imaginary enemies, then looks up to find -- Antiope STARING AT HER from across the grounds.   She’s caught!   But instead of hiding -- she looks back to Antiope:   I’m ready to fight!   LET ME TRY! Antiope shakes her head but smiles -- Diana smiles back. MNEMOSYNE (O.S.) Diana! Diana freezes, then BOLTS, before MNEMOSYNE (Diana’s long- suffering tutor) can push through the crowd. MNEMOSYNE Diana, I see you! EXT. PUBLIC SQUARE (THEMYSCIRA) - CONTINUOUS ACTION 6   6 Diana dashes through the crowded marketplace, hoping to lose Mnemosyne, but every Amazon whose path she crosses greets her with a smile or “Good morning, Princess!” “Hello, Diana!”   We realize that Diana is the ONLY CHILD in this world. Diana races past a MURAL in the public square of QUEEN HIPPOLYTA, Diana’s mother, triumphantly leading the Amazons. MNEMOSYNE Diana, come back! A young AMAZON GUARD sees Diana coming, holds out her hand, STOP!   Diana sees up a narrow stairway, grins -- an escape!   She darts up it and back down another straight into a DEAD END.  3. CONTINUED: 5   5 (CONTINUED) Looking for a way out, she sees a long jump she just might make.   There’s a big fall, but Diana loves a challenge!   She smiles mischievously, runs and LEAPS -- -- but she’s NOT GOING TO MAKE IT!   Diana stretches out, her face falling as she realizes she’s missed the jump, when -- A hand grabs her wrist! EXT. OTHER BRIDGE (THEMYSCIRA) - CONTINUOUS ACTION 7   7 Dangling, Diana’s pulled up to see:   QUEEN HIPPOLYTA",
      "dialogue_count": 1,
      "word_count": 1324
    },
    {
      "scene_number": 2,
      "slugline": "EXT. PALACE (THEMYSCIRA) - NIGHT 9   9 YOUNG DIANA (8) sneaks out of the palace, past her GUARDS.   Pleased with herself, she runs off into the night! EXT. SECRET TRAINING LOCATION 1 (THEMYSCIRA) - NIGHT 10   10 Antiope and Young Diana (8), now dressed for training, raise their BO STAFFS.   Antiope strikes, gently at first, but not for long.   Diana works hard to defend herself. OMITTED -- INCORPORATED INTO SCENE 8, 8A 11,12   11,12 EXT. BATTLEFIELD (PAINTING) 13   13 APHRODITE, Goddess of Love, stands beside Zeus and the other gods at the shore of a turbulent sea, waving her hands as the ocean churns. From out of the sea rises:   HIPPOLYTA, ANTIOPE, and countless other figures -- WARRIOR WOMEN. HIPPOLYTA (V.O.) So the gods made   us , the Amazons, to influence men’s hearts with love and to restore peace to the world. Standing behind Aphrodite on the shore, MEN watch the women approach in awe, lowering their weapons. HIPPOLYTA (V.O.) For a brief time, there   was   peace, even a unity among the world, as the gods and man fought side-by- side against a great evil. An ancient war is subtly depicted, but not lingered on. If one looks close you’ll see:   THREE ARMIES -- The gods, Amazons, and Atlanteans battling JACOB.   Each army in possession of a LOTUS. ARES cleaves Jacob, then he looks to the LOTUS the humans have discarded.   He reaches for it -- ANTIOPE (V.O.) But it did not last. ARES’ ARMY OF MEN swing a barrage of weapons at Hippolyta and the Amazons, led by the God of War himself.  8. (CONTINUED)",
      "characters": [
        "ANTIOPE"
      ],
      "action_text": "HIPPOLYTA (V.O.) With Zeus’ dying breath, he created this island to shield us from the outside world.   Somewhere Ares could not find us. EXT. SECRET TRAINING LOCATION 2 (THEMYSCIRA) - DAY 16   16 Antiope attacks!   Young Diana (8) tries to keep up -- and to Antiope’s surprise and satisfaction -- she does! ANTIOPE (V.O.) But in the event he did, Zeus left us a weapon, one powerful enough to kill a God... to destroy Ares before he could destroy mankind... and us... with an endless war. EXT. SCENIC OVERLOOK (THEMYSCIRA) - DAY 17   17 Hippolyta and Young Diana (8) look across their island home. Hippolyta smiles, ending her story... But Diana looks out across the oceans, wondering if Ares is still out there... HIPPOLYTA We give thanks to the gods for this paradise. YOUNG DIANA (8) And the Godkiller? Hippolyta isn’t sure what Diana is referring to... HIPPOLYTA The Godkiller? YOUNG DIANA (8) Yes.   The weapon that can kill Ares if he ever finds us.   May I see it, Mother? Hippolyta’s conflicted by Diana’s excitement.   A beat. Then she nods, Diana elated.  10. CONTINUED: 15   15",
      "dialogue_count": 1,
      "word_count": 677
    },
    {
      "scene_number": 3,
      "slugline": "EXT. ARMORY - DAY 18   18 Hippolyta and Young Diana (8) ride their HORSES to the ARMORY, a heavily guarded keep at the top of Themyscira’s hillside.   The QUEEN’S GUARDS follow.   Diana’s eyes drift up at a HIGH TOWER with a single window. INT. ARMORY - CONTINUOUS ACTION 19   19 Young Diana (8) follows Hippolyta down a torch-lit tunnel and into the open-air center.   One high window. HIPPOLYTA This is where we keep all the gifts the gods have given us. Diana’s eyes drift past a dazzling array of items, including a glowing GOLDEN GIRDLE, LASSO, and at the center, an ornately-crafted SWORD.   Diana gently touches the hilt of the sword, in awe. YOUNG DIANA (8) The Godkiller... It’s beautiful... Hippolyta watches her carefully. YOUNG DIANA (8) Who would wield it? HIPPOLYTA I pray there will never come a time when it is called to arms. But only the   fiercest   among us even could... And that is not you, Diana. She takes Diana’s hand away from the sword. HIPPOLYTA So you see, my daughter, you are safe.   And it is nothing for you to concern yourself with. But Diana is determined to prove her mother wrong -- EXT. SECRET TRAINING LOCATION 3 (THEMYSCIRA) - DAY 20   20 SWORDS clash!   Young Diana (now 12) continues to train with Antiope -- more skilled, stronger -- but not yet the warrior she will one day be.   As Antiope pushes her -- ANTIOPE You’re doubting yourself.  11. (CONTINUED)",
      "characters": [
        "YOUNG DIANA"
      ],
      "action_text": "ANTIOPE  You think I don’t wish that were true?!  (beat) You feel it in your bones, just as I do.   Ares is still alive... He is out there... and it’s only a matter of time before he returns. HIPPOLYTA The stronger Diana gets -- ANTIOPE Nobody wants this less than I.   I love her as you do. (beat) But this is the only way to truly protect her. Hippolyta’s pained eyes look away, pause for a beat, and then return to meet Antiope’s with a steely stare. HIPPOLYTA She is to never know the truth about what she is and how she came to be. (beat) You will train her harder than every Amazon before her. ANTIOPE Hippolyta -- HIPPOLYTA Five times harder -- ten times harder. (beat) You will train her until she is unconquerable. A beat.   Then Antiope nods. SMASH CUT TO: EXT. TRAINING GROUNDS (THEMYSCIRA) - DAY 21   21 An AMAZON rolls across the ground with a BOW AND ARROW, rising up and letting an ARROW fly!   It’s DIANA!   She’s now fully grown, striking and formidable, with a sly smile -- the arrow HITS the target DEAD CENTER and she moves on --  13. CONTINUED: (2) 20   20 (CONTINUED) Antiope nods to Diana to look across the audience of Amazons and up to the hillside -- where Hippolyta has arrived on HORSEBACK.   Diana grins, drawing her sword. Diana moves THROUGH and OVER obstacles, where she faces off against one of ANTIOPE’S GUARDS (African), using her SHIELD, BRACELETS and SWORD -- then ARTEMIS joins.   Diana now taking on TWO AMAZONS -- and excited for the challenge. Diana dispatches Antiope’s guard. The Amazons’ brawler -- Artemis -- bares her teeth and attacks with no mercy, striking Diana hard!   Artemis is fierce, revered by the other Amazons. Diana blocks the next blow, then sends Artemis crashing to the muddy ground at the feet of the other Amazons! The Amazons step back from Artemis.   Humiliated, Artemis scowls.   Diana, grins -- Then Antiope and Diana go into battle!   Warriors in violent, graceful combat.   Antiope feels her holding back. ANTIOPE Come on, Diana. ",
      "dialogue_count": 1,
      "word_count": 1404
    },
    {
      "scene_number": 4,
      "slugline": "EXT. SURFACE (AEGEAN SEA) - CONTINUOUS ACTION 24   24 Diana surfaces with the Pilot, swimming effortlessly to shore, unaware that behind them a WWI GERMAN BATTLE-CRUISER and its THREE LANDING CRAFT head towards the island. EXT. GERMAN BATTLE-CRUISER - DECK - CONTINUOUS ACTION 25   25 A GERMAN COMMANDER stares into the THICK FOG with FIELD GLASSES.   His LIEUTENANT at his side, bewildered. GERMAN LIEUTENANT Where did this fog come from? GERMAN COMMANDER Find the plane. EXT. GERMAN LEAD LANDING CRAFT 1 - CONTINUOUS ACTION 26   26 GERMAN SOLDIER #1 spots something, pointing -- GERMAN SOLDIER #1 (to ship’s tillerman) It’s there! Landing craft 1 steers through the FOG toward the Fokker’s TAIL SECTION, still afloat. EXT. GERMAN LANDING CRAFT 1 - CONTINUOUS ACTION 27   27 German Soldier #1 REACHES OUT over the side and HIS HAND disappears in a BLINDING REFLECTION, like fractal SHARDS of LIGHT hitting a mirror. He briefly sees a flash of a beautiful island -- startled, he jolts back, the image vanishing into fog. He leans back out and there it is again!   Beyond the protective RING of FOG and reefs -- AN ISLAND!   And Diana swimming the Pilot toward the beach! Stunned, he leans inboard, once again enshrouded in a foggy, cold, gray day. GERMAN SOLDIER #1 (stammering) The pilot.   He’s... there? The tillerman is skeptical but slowly turns the boat.  17.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 228
    },
    {
      "scene_number": 5,
      "slugline": "EXT. BEACH (THEMYSCIRA) - CONTINUOUS ACTION 28   28 Diana drags the Pilot onto the beach, his bag around his shoulder. She gently lays him on the sand and gets her first real look at the FIRST MAN SHE’S EVER SEEN.   His mouth, lips, jaw, hair, stubble -- captivating. This is CAPTAIN STEVE TREVOR (30s), rugged, handsome.   An American fighter pilot undercover for the British. Steve wakes, squinting in the sun, surprised to discover Diana’s not a hallucination.   He takes in the strange surroundings, blown back by her breathtaking beauty. STEVE (PILOT) Wow. She backs away as he sits up, surprised by the timber of his voice.   Diana studies his eyes.   They’re so blue. DIANA You are a... man? STEVE Yes, I mean -- (lowering his voice) Yeah.   Do I not look like a... where am I? DIANA You are on Themyscira. STEVE Thema-- say it again? DIANA Who are you? They’re cut off by the ear-splitting SOUNDS OF SCRAPING METAL.   Diana and Steve turn to see the GERMAN BATTLE-CRUISER running aground on the protective REEF around Themyscira. STEVE I’m one of the good guys, and those are the bad guys. The wounded battle-cruiser sinks, but her THREE GERMAN LANDING CRAFT steam towards the beach. STEVE Y’know...   Germans .  18. (CONTINUED)",
      "characters": [
        "STEVE"
      ],
      "action_text": "DIANA Germans? STEVE We gotta get out of here. HIPPOLYTA (O.S.) Diana! Diana and Steve look up to the cliffs to see -- Battle-ready HIPPOLYTA on HORSEBACK, with the QUEEN’S GUARD, all with ARROWS pointed directly at Steve. HIPPOLYTA (to Steve; enraged) Step away from her!   NOW! STEVE Where are their guns? ANOTHER WAVE OF GUARDSWOMEN arrive behind Hippolyta on HORSEBACK, aiming ARROWS at the German ships. STEVE Do they only have arrows?   We need guns.   Because the Germans have guns.   Lots and lots of -- A torrent of FLAMING ARROWS sail from the cliff top, over Diana’s and Steve’s heads, hitting all three landing craft. The Germans FIRE back in retaliation! STEVE Get down! Steve pulls Diana behind a ROCK FORMATION, out of sight of the invading Germans now fanning out across the beach. MORE AMAZONS join the others on the cliff, led by ORANA. Orana shoots a GRAPPLING ARROW into the rock wall of the opposite cliff.   She swings down the attached line toward the beach, firing ARROW AFTER ARROW at the Germans. ON THE BEACH:   Diana and Steve watch her, stunned. Diana turns as a soldier lifts his rifle and FIRES.   She sees the BULLET leave the gun, heading straight for her in SLOW MOTION -- Steve TACKLES DIANA, pushing her to the ground as the BULLET just misses her.  19. CONTINUED: 28   28 (CONTINUED) Diana’s heightened senses allow her to see the bullet sailing past -- she’s confused by what she’s seeing -- until it HITS ORANA! Diana is aghast as Orana falls slack on the grappling line, her lifeless body swinging against the cliff wall. DIANA NO!   STEVE Keep your head down! The Germans continue to FIRE at the Amazons atop the cliff, several of whom plummet to their deaths on the beach below. Orana’s slayer squints down his rifle’s eyesight -- WHUNK!   An arrow now sprouts from the rifle barrel. A STAMPEDE OF HORSEWOMEN ride through a massive STONE ARCHWAY onto the beach.   The AMAZON CAVALRY, led by ANTIOPE. Antiope, MENALIPPE and ARTEMIS at her side, BLOCKS BULLETS",
      "dialogue_count": 3,
      "word_count": 3631
    },
    {
      "scene_number": 6,
      "slugline": "EXT. HARBOR (THEMYSCIRA) - DOCK - CONTINUOUS ACTION 43   43 Diana and Steve on HORSEBACK emerge from the forest at the edge of a harbor.   Diana and Steve turn to the front of a not-very-modern-looking (by 1918 standards) AMAZON SAILING VESSEL. STEVE (skeptical) I’m leaving in that? DIANA  We   are. STEVE  We’re   leaving in that? DIANA Do you not know how to sail? STEVE (a touch of bravado) Of course, I know how to sail. Why wouldn’t I be able to sail? (beat) Just haven’t since I was a kid -- She nods, motions to the boat with encouragement. DIANA Then there’s nothing to be afraid of. Steve hesitates. DIANA What? Steve nods at the valley behind them, where HIPPOLYTA and the QUEEN’S GUARD thunder in on their horses. Hippolyta raises her hand, ordering her GUARDS to halt. She approaches Diana ALONE. Diana takes a breath, reluctantly meeting her mother’s eyes, dreading this. DIANA (defiant; strong) I can’t stand by while innocent lives are lost.   If no one else will defend the world from Ares, I must.   I have to go --  35. (CONTINUED)",
      "characters": [],
      "action_text": "HIPPOLYTA I know. Diana finds not fury on her mother’s face, but sadness. HIPPOLYTA Or at least I know that I cannot stop you.   There is so much... so much you do not understand. DIANA I understand enough.   That I’m willing to fight for those who cannot fight for themselves.   Like you once did... HIPPOLYTA You know that if you choose to leave us, you may never return. Once you leave this island, its location will fade from your memory... Hippolyta relents, nodding.   She climbs down from her horse, taking something from the saddle.   She presents Diana with ANTIOPE’S HEADBAND. HIPPOLYTA This belonged to the greatest warrior in our history -- make sure you are worthy of it. DIANA I will. She hands it to her daughter. HIPPOLYTA Be careful in the world of men, Diana, they do not deserve you. Hippolyta tries to memorize her daughter’s face, believing it’s the last time she’ll ever see it. HIPPOLYTA You have been my greatest love. Today you are my greatest sorrow. Diana WALKS AWAY from her mother, and the only home she’s ever known, towards Steve and the ship. The weight of this good-bye doesn’t go unnoticed by Steve.  36. CONTINUED: 43   43",
      "dialogue_count": 0,
      "word_count": 387
    },
    {
      "scene_number": 7,
      "slugline": "EXT. THEMYSCIRAN SAILING VESSEL (AEGEAN SEA) - NIGHT 44   44 Diana looks back towards the island, her whole world until now. EXT. SHORELINE (THEMYSCIRA) - NIGHT 45   45 Menalippe approaches, joining Hippolyta’s side. MENALIPPE Should you have told her? HIPPOLYTA The more she knows, the faster he will find her. EXT. THEMYSCIRAN SAILING VESSEL (AEGEAN SEA) - NIGHT 46   46 A BREEZE moves through Diana’s hair as she takes a breath, watching the island drift away, and in a SUDDEN FLICKER of fog -- it is gone.   Bittersweet.   She eyes Steve at the TILLER.   He looks at his WATCH, still ticking, then pockets it. DIANA How long until we reach the war? STEVE The war?   Well, which part?   The Eastern Front in France is 400 miles long -- from the Alps to the Atlantic.   Then there’s the Dolomites in Italy, Turks in Arabia -- there used to be a Russian Front but they quit last year so they could kill the Tzar and have a revolution. DIANA Where the fighting is the most intense then.   If you take me there, I am sure I will find who I’m looking for. STEVE Who’s that? DIANA Ares. STEVE Ares?   As in the God of War?  37. (CONTINUED)",
      "characters": [],
      "action_text": "DIANA The God of War is our responsibility.   Only an Amazon can defeat him.   With this. Diana points the SWORD at Steve, he holds his hands up. DIANA And once I do, the war will end. Steve gently pushes the sword away from him.   He would normally refute this outright, but after all he’s seen today, he’s turned upside down -- STEVE Look,   Princess , I like your spirit, and maybe you know something I don’t, but this war is so sprawling, there’s nothing the two of us can do about it.   But we  can   try to get to the men who can. DIANA You’re looking at the person who can.   And after I find and destroy Ares, the German armies will be freed from his influence -- and they will be good men again. STEVE (as she’s nuts) I’m starting to understand why your mother didn’t want you to leave. (beat) How much do you really   know   about the rest of the world? DIANA The world of   men ?   I know all there is to know about them -- from the great books. Steve can’t tell whether she’s joking or not. STEVE The great books.   Those books explain why there are no men on that island?   Or kids? DIANA I was raised on the island.  38. CONTINUED: 46   46 (CONTINUED) STEVE Just you? (off her nod) Sheltered upbringing. DIANA My mother sculpted me from clay. I was brought to life by Zeus. STEVE Oh.   Well, that’s not how babies are made where I come from. Diana turns to Steve, moving closer.   The tension between them palpable.   Diana gets close -- DIANA You refer to reproductive biology. STEVE I refer to more than that. DIANA Ah.   The pleasures of the flesh. Steve gets closer. STEVE (pleasantly surprised) You know about that? DIANA Of course.   I’ve read all twelve volumes of Clio’s Treatises on Bodily Pleasure. STEVE All twelve, huh? (off her nod) You bring any of them with you? Steve moves closer to Diana.   She grins -- DIANA You would not enjoy them.   They came to the conclusion that men are essential for procreation, but when it comes to pleasure... unnecessary. Steve gives Dian",
      "dialogue_count": 0,
      "word_count": 605
    },
    {
      "scene_number": 8,
      "slugline": "EXT. HANGAR (BELGIUM) - DR. MARU’S LABORATORY - DAY 47   47 GENERAL LUDENDORFF marches toward a HANGAR that’s become Dr. Maru’s new FACTORY.   He’s followed by a CAPTAIN and his GUARDS.   Ludendorff does not look happy, despite the hustle and bustle of workers. LUDENDORFF How long until we are operational? CAPTAIN Two days, sir. LUDENDORFF You have until tonight, Captain. CAPTAIN Sir, the men have had no food.   No sleep. LUDENDORFF Do you think I’ve had food or rest, Captain?   Do you hear me making excuses?   Your men are weak.   Complacent.   You’ve spoiled them.   You’ve let them forget that an attack can come at any time -- from any quarter -- so let’s you and I remind them, shall we? Ludendorff SHOOTS the Captain, making an example of him. His body THUDS to the ground. INT. HANGAR - DR. MARU’S LABORATORY - CONTINUOUS ACTION 48   48 Ludendorff walks into Maru’s new lab in mid-construction. BARRELS of CHEMICALS and EQUIPMENT line the hangar. INT. HANGAR - DR. MARU’S LAB - DAY 48A   48A Maru furiously works, looking at the chemicals, her formulas, writing in a NEW NOTEBOOK -- she’s at a crossroads.   She stops, stuck -- when Ludendorff approaches. LUDENDORFF Doctor.   Are you making progress? MARU Not enough... It is over, General. Germany is giving up.  40. (MORE) (CONTINUED)",
      "characters": [
        "STEVE",
        "DIANA"
      ],
      "action_text": "Von Hindenburg has recommended the Kaiser sign the armistice.   We have run out of time. LUDENDORFF Once the Kaiser sees your newest weapon, he will never sign the armistice. MARU But without my book... Ludendorff turns to Maru, gazes at her. LUDENDORFF We will get your book.   But I believe in you, not it.   I KNOW that you CAN and you WILL succeed. (beat) It is what you were put on this Earth to do. The way he says it, as if he were God himself. MARU Something did come to me last night.   For you... LUDENDORFF (ALT) It has been a long journey. I need... Doctor Maru pulls out a METAL CASE, produces a GLASS CAPSULE full of BLUE GAS. MARU A different type of gas. (beat) To restore your strength. General Ludendorff takes the capsule, examines it. MARU And make you into the god you are. He breaks the capsule under his nose, inhales -- his veins GLOW as he breathes in.   He stands taller, re- energizes, confident, his hand holds a GUN -- and CRUSHES it. A STRANGE WIND BLOWS across Maru... she turns, as if she can hear a VOICE.   Then she grins. MARU General... I have it.   And if it is what I think... it’s going to be...   terrible .  41. CONTINUED: 48A   48A MARU (CONT'D) (CONTINUED) LUDENDORFF And our war will swallow this world... Forever. PRE-LAP -- The HORN and BELLS of a STEAMSHIP. EXT. THEMYSCIRAN SAILING VESSEL (OCEAN) - MORNING 49   49 Diana wakes to find an enormous STEAM SHIP, its HORN BLARING, towing their boat into the harbor.   She blinks, never having seen anything like it. STEVE (O.S.) Good morning. (beat) We got lucky, caught a ride.   Made good time. Over Steve’s shoulder, Diana gets her first eye-popping view of industrialized LONDON (circa 1918). STEVE Welcome to jolly ol’ London. Diana, awestruck, takes in the city’s skyline. DIANA It’s hideous. STEVE Eh.   It’s not for everyone. EXT. PICADILLY CIRCUS (LONDON) - DAY 50   50 Diana, eyes-wide, takes in the COBBLESTONE STREETS. OVER-DRESSED PEOPLE, a HORSE-DRAWN CARRIAGE, NEWSSTANDS shout out headlines",
      "dialogue_count": 2,
      "word_count": 2711
    },
    {
      "scene_number": 9,
      "slugline": "INT. WAR OFFICE BLDG. - LOBBY - CONTINUOUS ACTION 60   60 An agitated and embarrassed Colonel Darnell makes his way to Steve and Diana, glancing at others watching him. Colonel Darnell makes his way to Steve and Diana. COLONEL DARNELL Trevor?!   What the hell were you thinking bringing a   woman   into the council chamber? Diana looks at Steve, indignant.   He holds his hand up, calming Diana -- STEVE (to Darnell) I’m sorry, sir, but the intel I’ve brought back is very time sensitive.   We were attacked by men looking for it on the way here.   One of Maru’s notebooks. STEVE We need to get it to Cryptography. And I need an immediate audience with the Generals -- COLONEL DARNELL You don’t just rush in here, like this, and demand an audience with the   cabinet .   Cryptography takes time and -- SIR PATRICK (O.S.) Captain Trevor! Sir Patrick emerges from the auditorium, making his way over to the threesome. SIR PATRICK I’d heard you were lost on one of your missions, yet here you are. And you’ve brought a friend. Sir Patrick smiles sweetly at Diana, she smiles back, noticing his cane. COLONEL DARNELL Our   deepest   apologies for the interruption, sir -- SIR PATRICK Nonsense.  53. (MORE)   (CONTINUED)",
      "characters": [
        "GENERAL HAIG",
        "STEVE",
        "ETTA"
      ],
      "action_text": "Thanks to this young woman, the room was finally quiet enough for me to get a few words in. (a humble bow) Sir Patrick Morgan, at your service. Diana bows her head in return. DIANA Diana, Princess of -- STEVE (over) Prince, Diana Prince.   We... she and I... we work together.   She helped me get this notebook here. From Maru’s lab -- Steve presents the notebook.   Sir Patrick takes it, understanding the implications immediately. SIR PATRICK ‘Dr. Poison’ herself?   My God... (to Darnell) I suggest we assemble the war cabinet so they can tell us more. Darnell hesitates, then nods.   Steve and Diana grateful for the assist -- INT. HANGAR - DR. MARU’S LABORATORY - DAY 60A   60A TIGHT ON:   a GAS CANISTER.   Maru turns a valve on it, adjusting the pressure. She screws the canister onto the side of a small GLASS CHAMBER containing a GAS MASK.   She locks the canister in place, then releases the gas into the chamber. Ludendorff and Maru watch as the NEW GAS hisses in, creeping towards the gas mask, enveloping it. The mask begins to disintegrate -- thin cracks in the glass, wear on the straps, corrosion on the metal.   It’s just as it was before. Maru, filled with anticipation, wonders:   Will it work this time?   It does.   The gas continues, eating away at the mask -- the glass cracks apart, the straps sever, the metal breaks.   A sign of the pain and horror it will soon inflict.   It is Maru’s greatest achievement -- then even the glass chamber itself starts to shudder -- and crack!  54. CONTINUED: 60   60 SIR   PATRICK (CONT'D) (CONTINUED) Maru grins, waiting until the last possible second before unleashing a SINGLE SPARK into the chamber, causing the highly flammable gas to COMBUST in a burst of FLAME! Elated, Maru looks to Ludendorff.   He nods with approval. LUDENDORFF Congratulations, Doctor. OFF the steaming, rotting gas mask... INT. WAR OFFICE - WAR ROOM - LATER 61   61 Steve, Darnell, Sir Patrick, GENERAL DOUGLAS HAIG, and the BRITISH WAR CABINET crowd in a room,",
      "dialogue_count": 3,
      "word_count": 5048
    },
    {
      "scene_number": 10,
      "slugline": "EXT. WESTERN FRONT (BELGIUM) - CONTINUOUS ACTION 77   77 -- onto the BATTLEFIELD. DIANA stands in her WONDER WOMAN ARMOR with THE GODKILLER SWORD in her hand, THE SHIELD on her back, and THE LASSO SHINING at her side. She surveys the battlefield.   It’s quiet.   Empty.   She takes a step forward... IN THE GERMAN TRENCH A SOLDIER takes AIM at Diana -- and FIRES! ON THE BATTLEFIELD The bullet moves towards Diana.   With her heightened perception, she watches it in SLOW MOTION, swatting it aside with her bracelet.   She blocks another -- IN THE ALLIED TRENCH Everyone watches Diana with awe.   Even Charlie has to admit -- CHARLIE How the hell’d she   do   that? ON THE BATTLEFIELD Diana continues walking across the battlefield, step-by- step, blocking bullets.   Her pace begins to quicken -- and then she starts to RUN. IN THE ALLIED TRENCH Steve’s heart pounds as he watches Diana.   He motions to the team.   He can’t believe he’s about to do this, but -- STEVE She’s drawing their fire!   Let’s go! Steve and his team climb over the trench, leaving the hesitant British soldiers behind!  79. (CONTINUED)",
      "characters": [],
      "action_text": "THROUGH A GERMAN SCOPE Diana races TOWARDS them, knocking bullets aside! IN THE GERMAN TRENCH GERMAN SOLDIERS react, unsure of who or even what Diana is.   One of the soldiers motions to others -- they lift a MORTAR, bringing it forward as the others continue to FIRE.   Soldier after soldier joins in. ON THE BATTLEFIELD Diana runs, more bullets ricocheting off her bracelets. IN THE GERMAN TRENCH They FIRE a mortar into the air! ON THE BATTLEFIELD Diana uses her SHIELD to bat aside the MORTAR SHELLS -- they EXPLODE around her! With her shield, Diana blocks the increasing barrage of bullets coming at her!   ONE of TWO MACHINE GUN NESTS fires at Diana -- IN THE ALLIED TRENCH Inspired, the British soldiers SURGE OVER THE TRENCH WITH A CHEER! ON THE BATTLEFIELD The SECOND MACHINE GUN NEST fires at Diana -- She does her best to repel the machine gun fire, but together the two are SLOWING HER DOWN, taking a toll. Diana falls to one knee, then turns, grateful to see behind her -- Steve, the team -- and the allied soldiers!   Steve raises his rifle and takes out some of the shooters, giving Diana some relief. Charlie lays down cover fire as The Chief tosses Sameer a GRENADE.  80. CONTINUED: 77   77 (CONTINUED) Sameer lobs it at the NEST ON DIANA’S RIGHT.   The EXPLOSION knocks the machine gun off its base. The second nest continues to fire on Diana! Diana leaps up into the air, jumping down into the second nest!   She lands inside behind the soldiers, spinning around -- slamming into them.   She raises her shield and smashes it onto the machine gun, breaking it apart! Steve, the team, and the Allies POUR INTO THE GERMAN TRENCH, battling the soldiers within! Diana looks at the village of Veld ahead of them.   Grits her teeth. DIANA We’re not finished yet. While the allies clear the trench, Diana takes off through the rain and the mud toward the village!   The team heads after her! EXT. VELD - SECONDS LATER 78   78 Diana and the team reach the village, taking cover as they’re ",
      "dialogue_count": 0,
      "word_count": 3142
    },
    {
      "scene_number": 11,
      "slugline": "EXT. FOREST/CHÂTEAU (BELGIUM) - DAY 86   86 Through the trees, still on HORSEBACK, Diana and the team see the WELL-GUARDED fortress that is German High Command.   Steve uses FIELD GLASSES to survey the scene. Chauffeured LIMOUSINES go through a HEAVILY-GUARDED CHECKPOINT at the gate, behind it, a long line of cars delivering well-dressed GUESTS to the ENTRANCE of the château, a SINGLE SENTRY stationed there. STEVE How the hell are we gonna get in? THE CHIEF The way in is through the gate. CHARLIE (sarcastic) Thank you, Chief, for that ancient tribal wisdom, that’s very helpful. The Chief gets off his horse, hands the reins to Sameer, then wanders off into the forest. Charlie looks through his scope:   several guards at the gate, but only one at the door. CHARLIE If you could get through the gate I only see one guard at the door to distract. STEVE It won’t look at all suspicious when I come sauntering out of the woods on foot -- DIANA I could get in. STEVE You’re not going in.   It’s too -- DIANA Dangerous? STEVE I know how to do stealth -- been doing it my whole life.   I’ll follow them to wherever they’re working on the gas or better yet find out where it is.  94. (MORE) (CONTINUED)",
      "characters": [],
      "action_text": "(beat) Plus, we can’t make a scene. DIANA I can be stealthy. STEVE Diana, what you’re wearing doesn’t exactly qualify as ‘undercover.’ SAMEER (attempting humor) I don’t know, I’d say she was pretty under covered. Only Charlie laughs. STEVE (to Diana) There’s no way to get you in.   Let me scout it and report back. Worse case, we follow Ludendorff when he leaves and you can use that magic lasso of yours to get him to tell us where it is. DIANA But as long as he’s still alive -- STEVE You can’t go into German High Command and kill anyone!   You have to trust me, Diana. Suddenly, a gleaming, ROLLS-ROYCE LIMOUSINE pulls into the forest, The Chief in the driver’s seat. STEVE (to The Chief) Where did that come from? THE CHIEF Field over there is full of them. SAMEER Can I drive it?   Lemme drive it. I’ll be your chauffeur! Steve looks at Diana. STEVE (pointedly) Diana.   Please, stay put.  95. CONTINUED: 86   86 STEVE (CONT'D) (CONTINUED) Steve climbs into the back seat and Sameer drives the limo off. CHARLIE We should scout the area.   In case we need to beat a hasty retreat. What do you think, Diana? But when they look for her, Diana isn’t there. CHARLIE Uh-oh. EXT. CHÂTEAU - GERMAN HIGH COMMAND - MOMENTS LATER 87   87 A CAR rolls past the CHECKPOINT GATE, another stops. GUARDS take an INVITATION from the driver, then wave the car on. IN THE NEXT CAR Sameer, wearing a TEA TOWEL AS A TURBAN on his head, watches the exchange, alarmed. SAMEER (talking through his teeth to Steve) Steve... Steve in the back, decked out in his GERMAN UNIFORM. SAMEER ... they have invitations. Sameer has no choice but to pull up to the guards.   One of them holds out his hand, waiting for an invitation -- but Sameer takes the surprised guard’s hand with both of his! SAMEER  Dhanyavaad, Sahib.   The Colonel and I wish many blessings and all manner of other things to fall upon your head --  Thinking fast, Steve belligerently yells at Sameer, startling the guards. STEVE And your head’s empty!   H",
      "dialogue_count": 0,
      "word_count": 2436
    },
    {
      "scene_number": 12,
      "slugline": "EXT. FOREST (BELGIUM) - CONTINUOUS ACTION 93   93 Steve avoids the security post, tearing through the woods. EXT. COUNTRYSIDE (BELGIUM) - MOMENTS LATER 94   94 The last wash of sunlight FADES as NIGHT takes over. Diana rides on horseback through the countryside at amazing speed -- driven, possessed by rage. She heads towards Charlie, Sameer, and The Chief -- who are all at a FIRE Chief has set, used to create the SMOKE SIGNALS.   He points to the top of a hill.   She rushes past them and up the hill! Cresting the hill, we see an AIRFIELD -- she heads down towards it. Steve isn’t far behind her, racing past the team! EXT. OUTSIDE THE AIRFIELD (BELGIUM) - CONTINUOUS ACTION 95   95 As Diana storms towards the airfield, her eyes land on the CONTROL TOWER, where she sees -- LUDENDORFF on the balcony, looking out over the airfield, a hive of activity. She charges the tower, flipping off her horse and over a BARBED WIRE FENCE -- she takes out more Germans -- slashes through a SECOND BARBED WIRE FENCE -- fights to the tower and -- Diana lassos a soldier on the balcony, yanking him down then leaping up to the tower herself! OMITTED 96,97   96,97 INT. CONTROL TOWER - CONTINUOUS ACTION 98   98 Ludendorff turns as Diana arrives, wielding the GODKILLER.   He smirks, scoffing -- LUDENDORFF Nice to see you again.   This is a surprise. He aims his GUN at her --  106. (CONTINUED)",
      "characters": [],
      "action_text": "LUDENDORFF But I have things to do. -- Ludendorff FIRES at Diana!   She blocks the bullet with her bracelet, ricocheting it back at Ludendorff’s gun! It explodes in his hand!   He cries out in pain, shocked! Diana lowers her smoking bracelet, looking him in the eyes -- assuming he knows who she is now after that display of power. DIANA You   know   why I’m here.   I am Diana of Themyscira, daughter of Hippolyta. Ludendorff turns away from Diana, cracking open a BLUE CAPSULE.   He inhales -- it’s painful but powerful, veins bulging. OMITTED 99   99 EXT. CONTROL TOWER - WALKWAY - CONTINUOUS ACTION 100   100 Diana sees Ludendorff’s veins bulging, almost supernatural -- her eyes widen with confirmation. Diana moves quickly, thrusting the Godkiller at him.   He dodges it.   She strikes him in the face with her fist. They trade blows. He grabs a BAYONETTED RIFLE mounted on the wall. Ludendorff uses the rifle as A GUN, A SPEAR, and A SWORD. He HITS Diana again and again -- but Diana strikes back with such FORCE that he flies backwards through the WINDOW and onto the narrow walkway outside. Ludendorff struggles to his feet -- EXT. CONTROL TOWER - CONTINUOUS ACTION 101   101 Diana CHARGES AGAIN.   Ludendorff manages to escape being gored by CLIMBING UP TO THE TOWER ROOF. Ludendorff stands, holding his bayonet, as Diana LEAPS up on the roof to join him -- and the BATTLE RAGES on, SWORD AGAINST BAYONET, both so close to plummeting to the ground with every volley. But then Ludendorff lands a BLOW that sends Diana and his bayonet sliding over the roof’s edge.   She manages to grip the ledge but loses the Godkiller.  107. CONTINUED: 98   98 (CONTINUED) Pulling herself back up with incredible effort she sees that LUDENDORFF HAS THE GODKILLER. LUDENDORFF As magnificent a creature as you are, you are no match for me. WITH VEINS PULSATING BLUE, LUDENDORFF SWINGS THE SWORD DOWN TO DELIVER THE KILLING BLOW -- But Diana BLOCKS it with her bracelets! DIANA We’ll see about that. Ludendorf",
      "dialogue_count": 0,
      "word_count": 2043
    },
    {
      "scene_number": 13,
      "slugline": "EXT. AIRFIELD - CONTINUOUS ACTION 107AA   107AA Sameer boards the plane while Steve moves to the front wheel, trying to get a better look at the plane’s position. The Chief spots soldiers examining a MAP just inside the hangar.   As they walk away, The Chief sneaks in -- INT. CONTROL TOWER - CONTINUOUS ACTION 107E   107E The lasso is still tight around Sir Patrick, crackling. Diana holds it, still unsure what to think -- SIR PATRICK/ARES I am not the God of War, Diana.   I am the god of truth... All I ever wanted was to show my father how evil his creation was.   But he refused. As Sir Patrick runs his finger along the lasso, a SURGE of energy runs from his hands and down towards Diana -- into her, causing her to see FLASHES OF THE PAST.   Each is like a pulse that fades and returns us to the scene at hand. FLASHBACKS - EXT. NO MAN’S LAND - DAY 107EA   107EA We PUSH THROUGH the bleakness of the world. SIR PATRICK/ARES (V.O.) Mankind stole the world from us. They ruined it, day-by-day. EXT. MOUNT OLYMPUS - NIGHT 107EB   107EB Ares falling to the Earth... His armor falling off... SIR PATRICK/ARES (V.O.) And I, the only one wise enough to see it, was left too weak to destroy them myself... EXT./INT. TBD - NIGHT 107EC   107EC Somewhere dark, ARES shivering, powerless... the remnants of his armor CRACKING and BREAKING APART around him.  115. (CONTINUED)",
      "characters": [],
      "action_text": "SIR PATRICK/ARES (V.O.) All these years, I’ve struggled. Whispering into their ears... INT. HANGAR - DR. MARU’S LAB - DAY 107ED   107ED Maru at her workbench.   The SPECTRAL FORM of SIR PATRICK whispering silently to her, unseen by anyone.   A STRANGE WIND passes as he does.   Her eyes light up.   She starts mixing chemicals frantically. SIR PATRICK (V.O.) Ideas.   Inspiration.   For weapons. Formulas.   But I don’t make them use them... they start these wars on their own. END FLASHBACKS. INT. CONTROL TOWER - NIGHT 107EF   107EF The FLASHBACKS FADE and we RETURN TO Diana’s stunned face. SIR PATRICK/ARES (enjoying the revelation) All I do is orchestrate an armistice I know they will break, in the hope they will destroy themselves.   But it’s never been enough... (beat) When you first arrived I was going to end you, Diana.   Then I felt something I haven’t for thousands of years.   Stronger. Sir Patrick clenches his fists.   His neck pulses. SIR PATRICK/ARES It was your power.   Healing me more than you could ever hurt me. Diana’s eyes narrow, trying to understand.   Sir Patrick’s hands begin to FLICKER with FIRE -- SIR PATRICK/ARES And I knew that if only you could see what the other gods couldn’t...  116. CONTINUED: 107EC   107EC (CONTINUED) Sir Patrick runs his finger along the lasso, energy arcing down the lasso and into Diana!   As it hits her -- VISION - EXT. NO MAN’S LAND - DAY 107EG   107EG -- they are transported to the barren, war-torn No Man’s Land SIR PATRICK/ARES (V.O.) All the suffering.   All the pain and destruction they create.   You would join me. Diana looks around her. SIR PATRICK/ARES (V.O.) With out powers combined, we could finally end this. SIR PATRICK/ARES (V.O.) (ALT) With our powers combined, we could finally end them. The barren no man’s land transforms into a lush, “Garden of Eden” -- like Themyscira itself! SIR PATRICK/ARES We could return the world to the paradise it was before them. (beat) And there would be absolute   peace , Diana.   ",
      "dialogue_count": 0,
      "word_count": 634
    },
    {
      "scene_number": 14,
      "slugline": "EXT. AIRFIELD - HANGAR - CONTINUOUS ACTION 107D   107D Steve tries to pry open a panel on the plane, looking for a way to sabotage it somehow -- when a German soldier approaches Steve, suspicious.   The German is about to yell when -- THUMP! Charlie lowers the butt of his rifle onto the German. Steve nods in appreciation then -- notices a CHILL as the wind starts to rise. Steve looks over, his face grows tense -- DR. MARU approaches the plane for inspection with MORE SOLDIERS. They retreat to the shadows! INT. BOMBER PROTOTYPE - CONTINUOUS ACTION 107B   107B Sameer moves past ROWS OF BOMBS already loaded.   He spots something -- a TIMER wired to the bombs! INT. AIRFIELD - HANGAR - CONTINUOUS ACTION 107C   107C The Chief examines the map, horror covers his face when he sees the plane’s target:   LONDON. INT. CONTROL TOWER - CONTINUOUS ACTION Sir Patrick looks angered -- he almost had her.   His eyes narrow. SIR PATRICK/ARES Oh, Diana... my dear sister... I don’t want to fight you -- (beat) -- but if I must... He quickly GRABS the lasso -- and a VIOLENT ERUPTION OF ENERGY ERUPTS -- AND THE CONTROL TOWER EXPLODES!!! EXT. AIRFIELD - CONTINUOUS ACTION 107F   107F A DEAFENING explosion erupts across the airfield, demanding everyone’s attention! It’s overwhelming and chaotic, putting the soldiers in panic mode:   They’re under attack! Steve and the team react, unable to see what caused it, retreating to the shadows to find out --  118. (CONTINUED)",
      "characters": [],
      "action_text": "CHARLIE Hurry up!   They’re onto us! STEVE Sammy, let’s go! Dr. Maru turns to A THREE-MAN CREW -- PILOT, CO-PILOT, and the BOMBARDIER.   She calls out -- DR. MARU Forget about them!   Come on, move! (they hesitate) Go now! EXT. CONTROL TOWER - CONTINUOUS ACTION 107G   107G Diana lands on the ground, rolling across it. EXT. AIRFIELD - RUNWAY - CONTINUOUS ACTION 108   108 Steve and the team race across the airfield, searching for cover. EXT. CONTROL TOWER - CONTINUOUS ACTION 107G   107G Diana pushes herself up off the ground, gazing over at Sir Patrick, who simply floats down -- burning debris all around them. Getting to her feet, Diana runs towards Sir Patrick. CLOSE ON SIR PATRICK calmly looking out at the DESTRUCTION and Diana, he flicks his hand -- through his sheer force of will, Sir Patrick lifts the TOWER DEBRIS around Diana! Girders rise, toppling over on either side of Diana as she races towards Sir Patrick!   Diana dodges them, running through the gauntlet -- gazing up as a LIGHT shines down, toppling towards her -- Diana leaps out of the way! EXT. AIRFIELD - RUNWAY - CONTINUOUS ACTION 108   108 Steve and the team take cover behind SEVERAL CRATES.  119. CONTINUED: 107F   107F",
      "dialogue_count": 0,
      "word_count": 459
    },
    {
      "scene_number": 15,
      "slugline": "EXT. CONTROL TOWER - CONTINUOUS ACTION 107G   107G Diana throws her lasso at Sir Patrick, but he holds his hands up and blasts it back! SIR PATRICK/ARES Oh, my dear.   You have so much to learn. Diana lassos a GIRDER, swinging it back at Sir Patrick -- but he hovers above it!   The debris smashes into a gas tank, exploding! EXT. AIRFIELD - CONTINUOUS ACTION 109   109 Fighting through the growing storm, Diana races towards Sir Patrick -- he raises his hands like a conductor, ripping chunks of the tarmac up! Diana avoids one -- smashes through another -- then leaps in the air as a MASSIVE CHUNK OF THE EARTH rises -- Diana leaps into the air, towards Sir Patrick -- EXT. AIRFIELD - HANGAR - CONTINUOUS ACTION 109A   109A Hidden behind the crates, Steve and the team remove their masks and see Diana and Sir Patrick battling!   Steve reacts to Sir Patrick levitating! CHARLIE What are we going to do? STEVE There’s not much we can do... if that’s what I think it is. Steve looks to the plane. STEVE But we can stop that plane. EXT. AIRFIELD - CONTINUOUS ACTION 109AA   109AA Diana leaps at Sir Patrick, but she blasts her back under the hovering CHUNK OF EARTH! Sir Patrick motions, SENDING the chunk CRASHING DOWN TO THE GROUND -- but Diana zips out of the way -- in a blur, she slams into Sir Patrick, sending him flying --  120. (CONTINUED)",
      "characters": [],
      "action_text": "CLOSE ON SIR PATRICK catching himself, gazing up, crackling with LIGHTNING. EXT. AIRFIELD - HANGAR - CONTINUOUS ACTION 109B   109B Charlie peers through is SCOPE at the plane... CHARLIE If we radio ahead?   We can ask Air Corps to shoot her down. STEVE No, if it crashes, it’ll wipe out everyone for fifty square miles. We gotta ground it. SAMEER Bad news.   It’s on a timer.   If we ground it here, same thing. Steve looks over at Diana then the plane -- and he realizes what he has to do... STEVE Is it flammable, Chief? THE CHIEF Yeah, she said it was hydrogen? It’s flammable. STEVE I need you guys to clear me a path to that plane. CHARLIE No, Steve! SAMEER Steve! But Steve is already running towards it.   The team go into action! INT. AIRFIELD - HANGAR - CONTINUOUS ACTION 109C   109C Diana grabs a LARGE WOODEN CRATE and throws it up at Sir Patrick. Sir Patrick raises his hand -- and the crate appears to hit an INVISIBLE WALL, breaking apart, revealing HUNDREDS OF GRENADES INSIDE!  121. CONTINUED: 109AA   109AA (CONTINUED) The grenades hover for a SPLIT SECOND -- then Ares sends them down towards Diana! Diana grabs a LARGE BOMB nearby and THROWS it into the air towards the GRENADES -- causing a MASSIVE EXPLOSION! The explosion sends Diana and Ares FLYING backwards across the AIRFIELD! EXT. AIRFIELD - HANGAR 109D   109D Steve sees Diana smashing across the airfield.   He rushes to her side! The team watches as the truck moves the plane forward. Charlie aims his gun -- shooting straight into the engine!   The truck SMOKES and HALTS, the plane stopped for a brief moment as -- Steve helps Diana up -- He starts to talk, but Diana’s ears are RINGING.   She can see him, but not hear him. DIANA What? IN THE FIRE - CONTINUOUS ACTION ACROSS THE AIRFIELD, within the BURNING FIRE... CLOSE ON ARES’ HAND awakening, clutching the EARTH. EXT. AIRFIELD - CONTINUOUS ACTION Steve talks to Diana, but her ears are still ringing. THROUGH CHARLIE’S SCOPE Watching as the truck moves the plane",
      "dialogue_count": 0,
      "word_count": 838
    },
    {
      "scene_number": 16,
      "slugline": "EXT. AIRFIELD - RUNWAY - CONTINUOUS ACTION 111   111 On the WING, Steve pulls himself to the DOOR, opens it. Steve’s confronted by the BOMBARDIER as he enters.   They grapple, Steve throws him out! EXT. AIRFIELD - CONTINUOUS ACTION 111A   111A Diana turns towards a burning fire. CLOSE ON DIANA gazing into the fire. INT. BOMBER PROTOTYPE - CONTINUOUS ACTION 115   115 Steve fights with the BOMBARDIER, throwing him out of the plane. IN THE FIRE - CONTINUOUS ACTION 111A   111A SIR PATRICK SUMMONS scraps of METAL all around him.   One piece slams against his body.   Then another.   And another.   Faster and faster. ANGLE ON SIR PATRICK using the FIRE to FORGE the METAL on his body -- recreating ARES’ ICONIC ARMOR he wore in “The History Lesson!” CLOSE ON ARES’ HAND wrapped in metals, forming a FIST. CLOSE ON ARES’ FINGERS digging into the MELTING METAL on his head, creating the shape of his HELMET. EXT. AIRFIELD - CONTINUOUS ACTION Walking out of the fire, WE REVEAL Sir Patrick now in his ARES ARMOR. Diana sees ARES -- and runs straight at him.  124. (CONTINUED)",
      "characters": [],
      "action_text": "Ares calmly walks towards Diana.   He creates TWIN SWORDS out of thin air -- his power growing thanks to Diana, Ares is able to conjure any MAN-MADE WEAPON at will -- and throws the swords at Diana! Diana blocks the swords, falling back to the ground. CLOSER ANGLE ON DIANA a BLOODY GASH at her side. ANOTHER ANGLE Ares charges Diana -- he conjures a SPEAR, throwing it at Diana.   She blocks it, but again is thrown back as the weapon combusts -- slamming into a TRAIN CAR. Ares does not relent, conjuring TWIN SWORDS -- swinging them at her -- she dodges the blades, BLOCKS them with her bracelets -- OMITTED 112-114   112-114 INT. BOMBER PROTOTYPE - CONTINUOUS ACTION 115   115 Steve moves deeper into the bomber to the PILOT and CO- PILOT.   The CO-PILOT gets UP, pulling his GUN.   The pilot cautions him, motions to the GAS BOMBS -- PILOT You hit that, we all go up. The co-pilot nods, puts his gun away -- spots another weapon.   The co-pilot rips a FIRE HATCHET off the wall, swinging it hard.   Steve dodges the hatchet -- then slams his fist into the co-pilot, sending him back against the GAS BOMBS -- Steve wrestles the hatchet away from the co-pilot.   Steve slams his fist into the co-pilot -- and he crumples to the ground. Steve fights the Pilot, tossing him back, taking the controls.   Steve pulls a lever -- OMITTED 116,117   116,117  125. CONTINUED: 111A   111A",
      "dialogue_count": 0,
      "word_count": 433
    },
    {
      "scene_number": 17,
      "slugline": "EXT. AIRFIELD - RUNWAY - CONTINUOUS ACTION 118   118 As the bomber lifts up off the runway into the air, BOMBER DOORS open, dumping out the Pilot and co-pilot. INT. HANGAR - DR. MARU’S LABORATORY - CONTINUOUS ACTION 118A   118A Charlie, Sameer, and Chief enter the hangar. GUNSHOTS ring out as Dr. Maru desperately gathers her NOTES, trying to save her work! The team looks out across the lab, seeing DIFFERENT DRUMS OF CHEMICALS -- ready to be MIXED to create the gas. They start kicking over the drums, dismantling the lab, setting CHARGES -- EXT. AIRFIELD - RUNWAY - CONTINUOUS ACTION 118AB   118AB ARES conjures a HOOK and CHAIN, throwing it at Diana, wrapping it around her arm -- he throws her across the airfield! Diana slams into a tank, denting it.   She stands up -- just as ARES swings a MASSIVE SWORD, the power of the blade SLICING everything in its path -- Diana dodges it as the power SLICES the TANK in two! EXT AIRFIELD - RUNWAY - CONTINUOUS ACTION 118AC   118AC Diana leaps up at Ares as he conjures a HATCHET, tackling him -- they crash onto the top of a HANGAR!   Diana digs her hand into the roof, stopping herself. INT. HANGAR - DR. MARU’S LABORATORY - CONTINUOUS ACTION 118A   118A The team moves out across the lab, The Chief setting CHARGES -- -- while Dr. Maru escapes out of the hangar with her notebooks, turning back for one last look before disappearing. EXT. AIRFIELD - HANGAR - ROOF 118AD   118AD ON THE HANGAR ROOFTOP -- Diana THROWS HER LASSO around Ares’ arm, yanking him forward --  126. (CONTINUED)",
      "characters": [],
      "action_text": "Diana throws her KNEE into Ares, knocking him UP -- and then throws her elbow, knocking him DOWN. Ares barely moves out of the way as Diana SMASHES her foot onto the roof, narrowly missing his head. Ares conjures a LARGE HAMMER, Diana dodging it as he swings.   She wraps her lasso around him, tossing him over her head. CLOSE ON DIANA her rage growing. ANOTHER ANGLE Ares conjures a LARGE SWORD, stabbing the roof, stopping himself. Ares launches at Diana, grabbing her by the neck, lifting her into the air off the hangar. SIR PATRICK/ARES Is that all you have to offer me? EXT. AIRFIELD - CONTINUOUS ACTION 122   122 Ares THROWS Diana across the airfield.   She slams into TANKS and VEHICLES, springs back onto her feet. Ares uses his GROWING POWER to throw TANK TREADS at Diana. The tread wraps around Diana, slamming her to the ground! LIGHTNING CRACKLING across them as they TIGHTEN around her. Pinned, Diana is overwhelmed by a feeling of desperation. INT. HANGAR - DR. MARU’S LABORATORY - CONTINUOUS ACTION 119   119 Charlie lights a trail of alcohol poured from his flask, leading to a STICK OF DYNAMITE.   They run out -- EXT. HANGAR - DR. MARU’S LABORATORY - CONTINUOUS ACTION Outside the lab, Charlie covers Sameer and Chief while they throw GRENADES in and -- THE LAB EXPLODES!  127. CONTINUED: 118AD   118AD",
      "dialogue_count": 0,
      "word_count": 504
    },
    {
      "scene_number": 18,
      "slugline": "INT. BOMBER PROTOTYPE - CONTINUOUS ACTION 120   120 In the cockpit, Steve uses all his strength to fight the G-FORCE pulling against his body -- EXT. HANGAR - DR. MARU’S LABORATORY - CONTINUOUS ACTION 121   121 For a brief moment it’s victorious, but DOZENS OF SOLDIERS come at the team from all directions!   BULLETS whizzing by, the men take cover!   The team returns fire! EXT. HANGAR - DR. MARU’S LABORATORY - CONTINUOUS ACTION 123   123 Charlie fires and -- CLICK -- his face falls - he’s out of ammo.   They’re all out.   Trapped.   They know it’s over -- EXT. AIRFIELD - CONTINUOUS ACTION 124   124 Trapped by the treads, Diana turns, seeing the team on the ground, out in the open... Ares hovers over Diana, tightening the treads around her with the movement of his hand. SIR PATRICK/ARES It is futile, sister.   But keep trying. Diana hears the sound of a plane and she looks up into the sky -- the plane soaring up into it... DIANA Steve... INT. BOMBER PROTOTYPE - CONTINUOUS ACTION 124A   124A Steve breathes, flying the plane high.   He looks back at the burning factory, LAUGHS... soars higher into the air... then he looks back at the GAS BOMBS filling the plane. Steve pries his GUN from his holster, pointing it backwards towards the GAS BOMBS. EXT. AIRFIELD - CONTINUOUS ACTION 124B   124B Diana is suddenly overwhelmed by a feeling -- almost otherworldly -- a connection -- to Steve -- absolute dread on her face --  128.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 252
    },
    {
      "scene_number": 19,
      "slugline": "INT. BOMBER PROTOTYPE - CONTINUOUS ACTION 124C   124C STEVE’S jaw is set, determined.   He shuts his eyes... thinks of Diana... and then -- HE FIRES HIS GUN! EXT. AIRFIELD - CONTINUOUS ACTION 124D   124D DIANA Steve... -- and the BOMBER EXPLODES!   Enveloped in a cloud of GLOWING GAS that burns itself up in the explosion. A HORRIBLE SCREAM, emanating from deep within Diana! DIANA NO!!!! CLOSE ON A LOW PROFILE OF DIANA struggling with the tank treads. She explodes with grief and anger -- freeing herself from Sir Patrick’s hold.   He stumbles back! IN A RAGE, Diana turns to Ares -- jumps into the air at Ares, slamming her foot down across him.   Diana tackles him, leaps up -- they crash through a hangar, GERMAN SOLDIERS watching, scattering as Diana slides Ares across the ground. Ares punches Diana off him, motions towards a TANK -- it turns, FIRING at Diana!   She rolls out of the way and catches the shell, throwing it back at the tank!   As it explodes, German soldiers RUN -- until Ares sees them -- and using his growing power, takes them over.   They all freeze in place. CLOSE ON A GERMAN SOLDIER THROUGH his GAS MASK we see his eyes turn black. ANOTHER ANGLE The soldiers AIM their guns at Diana, firing dozens and dozens of BULLETS -- she blocks them, charging towards Ares.   As the soldiers move in all around her, blocking her way --  129. (CONTINUED)",
      "characters": [],
      "action_text": "CLOSE ON DIANA her eyes begin to DARKEN. She’s lost in Steve’s death, transformed into a VIOLENT MACHINE!   In a brutal, stunning move, Diana attacks the soldiers in a fit of rage.   She decimates the soldiers! One after the other!   Tearing through them! She spins through the crowd, slamming into the soldiers -- building to a SUPER SPIN that blows them all back! Diana charges Ares, flipping over and around him, dodging his sword, kicking him, leaping away, landing, and throwing her LASSO around his leg. She wraps her lasso around her own leg, flipping him over her head, slamming him down onto the ground! Diana leaps into the air, smashing her elbow into his back.   Breathing heavily, full of anger, Diana pulls Ares up, getting close enough to realize -- ARES IS SMILING.   She’s almost his. SIR PATRICK/ARES (enjoying every second) Yes, Diana.   Don’t stop... Diana pauses, breathing heavy like a wild animal.   But resists.   Ares blasts Diana back into a TANK.   Trying to anger her into fighting. SIR PATRICK/ARES Do it... fight. Diana lifts up the tank! SIR PATRICK You came here with such hope and determination and look at you now. Mankind did this to you.   Join me in the fight... and we can destroy them forever! But still Diana resists, the darkness in her eyes flickering, Ares sneers with disgust, he turns towards -- THE RUNWAY. -- using the winds to take hold of a MILITARY VEHICLE Maru is desperately trying to escape in.  130. CONTINUED: 124D   124D (CONTINUED) The vehicle SPIRALS towards Diana, spinning end-over-end and breaking apart.   MARU tumbles out -- lying in front of Diana BENEATH THE UPHELD TANK. SIR PATRICK/ARES Look at her and tell me I’m WRONG. SIR PATRICK/ARES (ALT) Take her.   And then take them all... Diana looks at Maru, the anger boiling in her.   Maru cowers.   Her METAL MASK FLAPPING OFF in the wind, grotesque and pathetic. SIR PATRICK/ARES She is the perfect example of these humans.   And unworthy of your sympathy in every way. CLOSE ON DIANA",
      "dialogue_count": 0,
      "word_count": 1513
    },
    {
      "scene_number": 20,
      "slugline": "INT. LOUVRE MUSEUM - DIANA’S OFFICE - AS BEFORE (PRESENT 126   126 DAY) THE PHOTOGRAPH:   Diana, in WONDER WOMAN ARMOR, and her TEAM. DIANA (V.O.) To end war and bring peace to mankind. She contemplates the faces of friends long dead, her eyes linger on STEVE TREVOR. DIANA (V.O.) But now I’ve touched the darkness that lives in between the light. Seen the terrible things men do to each other in the name of hatred... and the lengths they’ll go to for love. (beat) And now I know that only love can truly save the world. (beat) So I stay and I fight and I give for the love I know can be.   This is my mission now.   Forever. Diana takes Steve’s watch from her pocket, turns it over in her hand twice, feels its smoothness. The watch has stopped -- and has been stopped since the moment Steve died. She places the watch beside the photograph. AT HER COMPUTER:   Diana is typing an e-mail, BRUCE WAYNE’s name the recipient: “Thanks for bringing him back to me.” Just as Diana presses SEND, a news alert pops up on her screen.   A fire has broken out in a downtown building, people trapped. SMASH CUT TO: EXT. ROOFTOP - DAY 127   127 Diana in her WONDER WOMAN ARMOR stands atop a building, smiles --  136. (CONTINUED)",
      "characters": [],
      "action_text": "Then she leaps right AT us, into action! SMASH CUT TO BLACK. FADE IN: EXT. THEMYSCIRA - NIGHT 128   128 POST-CREDITS SCENE. [NOTE:   This is a POST-CREDITS SCENE, leading to   JUSTICE LEAGUE .] On the SAME CLIFF where Diana saw Steve’s plane, HIPPOLYTA stands on the shore, looking out over the ocean, thinking about her daughter. A beat.   Then Hippolyta turns -- as if she hears something -- just as VENELIA rides up to her.   Venelia dismounts. VENELIA My Queen -- HIPPOLYTA I know.   The Mother Box... it has awoken.   Alert everyone. INT. PENETRALIUM - NIGHT 129   129 In the center of the PENETRALIUM -- PUSH IN ON:   THE MOTHER BOX... IT GLOWS. HIPPOLYTA (V.O.) Something terrible is coming. SMASH CUT TO BLACK. THE END  137. CONTINUED: 127   127",
      "dialogue_count": 0,
      "word_count": 354
    }
  ]
}