{
  "slug": "work-it-2020",
  "title": "work it",
  "genre": "romance",
  "format": "film",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 18171,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. QUINN’S BEDROOM - AFTERNOON Quinn enters, focused and fired up, lugging dance theory books. They replace science and cello books on her shelves. She moves to her bulletin board. Stares at a picture of Neil deGrasse Tyson. Then replaces his pic with Beyonce’s. She pulls out her laptop and watches some clips of last year’s GHH state competition. The dancers are professional, mesmerizing, and intimidating. The Birds in competition mode are stunning. Uh-oh. Quinn’s worried, but holds it together. Gives herself a pep talk-- QUINN They’re not that good! You can do this. It’s like, angles and numbers and pattern symmetry. Fun stuff! INT. QUINN’S GARAGE - LATER Quinn, dressed in athletic gear, stands in front of her laptop, watching a Youtube dance tutorial, excited, hopeful.  YOUTUBE DANCER Hey beginners, first we’re gonna do a basic “step and drop your shoulder.” This is a great move for beginners because it’s something anyone can do.  He demonstrates. Quinn attempts-- She’s awful. Like robotic. No rhythm. This is... a problem. INT. QUINN’S LIVING ROOM - LATER Quinn’s engrossed in   Step Up , taking detailed notes--   “Action Item: Improve dance skills.”   Maria watches Quinn from the doorway, looking concerned. INT. LIBRARY - DAY Headphones on and sitting at a desk filled with papers, Quinn’s watching old GHH competitions on her laptop. Measuring angles, keeping time. She’s taking notes with the precision of a scientist, analyzing styles, moves, and scores. She’s having a blast. 23.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 243
    },
    {
      "scene_number": 2,
      "slugline": "INT. QUINN’S LIVING ROOM - DAY Quinn’s stuffing TAMPONS in care packages while (badly) dancing around her living room. INT. BUS (MOVING) - AFTERNOON Quinn’s watching another clip as she rides the bus home. She looks up-- something outside catches her eye. It’s a YARD SALE. A bunch of shitty old full-length MIRRORS for sale. She quickly PULLS THE CORD and runs off the bus. EXT. NEIGHBORHOOD - LATER Quinn struggles down the sidewalk, lugging the mirrors home. INT. QUINN’S GARAGE - LATER Quinn moves her cello and sheet music out of the way. Sets up the mirrors against the wall, lined up next to each other, different sizes and shapes-- a makeshift dance studio. She pulls out her phone and presses PLAY on another Youtube tutorial. Now she can watch herself in the mirrors. She tries a sequence again. And again. And again. Slight improvement from before. This girl does not give up. INT. HOSPITAL HALLWAY - AFTERNOON Quinn’s in a candy striper uniform, listening to MUSIC on her headphones, pushing a FLOWER CART. INT. QUINN’S BEDROOM - LATER Quinn slips a ticket to Global Hip Hop’s State Competition into an envelope. Addresses it to VERONICA ROSENBERG. She glances at her calendar. On tomorrow’s date-- “AUDITIONS!!” INT. HIGH SCHOOL HALLWAY - AFTERNOON Quinn, in workout gear, nervously walks down the hall. 24.",
      "characters": [],
      "action_text": "QUINN You can do this. Are you the best dancer in the world? Of course not. But you’ll work hard. Passes a sign--   “Birds of Prey Auditions”   with an arrow. QUINN (CONT’D) You are Beyonce before the “Single Ladies” video. And the “Formation” video. And “Lemonade” and also the Superbowl. You are all Beyonces. Quinn rounds the corner and sees a ton of high schoolers there to audition. Everyone seems to know each other. Quinn’s starting to panic. But she takes a breath, gets in line, listens in on the GUY and GIRL behind her. They see Jas up ahead at the table, signing dancers in. GIRL Why’s Jas doing grunt-work shit? Make a freshman do it, they’re hardly people. GUY Classic Foster’s Freeze. GIRL But they’ve been besties forev. GUY Then Jas shouldn’t have pissed her off. You don’t stand up for the freak who tries to Tonya Harding your principal dancer and expect to go back to being BFFs. Quinn frowns. The Girl looks around. Coast is clear-- GIRL (mouthing, barely audible) Jas’s isolations are tighter. Guy reacts, looking around suspiciously. GUY Shut up! Anyone could tell her you said that! They notice Quinn suddenly, who quickly pretends she wasn’t listening. But Quinn’s a nobody to them, and they don’t recognize her as the “freak.” 25. GUY (CONT’D) I’m not jinxing anything. Twenty- five-K prize for state and it’s the Birds, baby girl. I’d do anything to get on this crew. I’d kill you. Girl LAUGHS, but he doesn’t. She’s weirded out. Quinn’s feeling uneasy. Looks around at all the professional-type dancers. Maybe this was a mistake. She’s maybe about to bolt, but it’s her turn to sign in. Jas sees her, reacts-- JAS You need to leave. Now. The fighter in Quinn perks up. QUINN I have just as much right to be here as anyone. JAS Foster’s gonna disagree. QUINN She can’t deny my effort. JAS You met her, right? QUINN If you know she’s so terrible, why do you put up with her? JAS (uncomfortable) We’re the best. She makes us the best. GUY Hellooo, what’s the hold-up? Jas qui",
      "dialogue_count": 0,
      "word_count": 2025
    },
    {
      "scene_number": 3,
      "slugline": "INT. CAFETERIA - DAY Quinn looks up from her phone, having just watched the videos. She’s mesmerized by Drake. Then she sees Jas across the way, coming down the aisle. Jas passes Foster’s table. She and Foster briefly make painful eye contact, but JAS KEEPS WALKING. She plops herself down across from Quinn and starts eating. Quinn hides a little smile-- she has a friend! Foster watches them, pissed. Between bites-- JAS So. Dancers. Quinn flips through her phone, then hands it over. QUINN One step ahead of you. I posted on the school listserve about auditions. JAS What’s that? QUINN Uh, the official online school information portal. You don’t check it? Jas shakes her head no. QUINN (CONT’D) How do you know when they’re repaving the parking lot? JAS Does it look like I give a shit about repaving the parking lot? QUINN So what’s your brilliant idea then? Jas stands up. JAS Follow me. Quinn hesitates. Off Jas’s look-- 34.",
      "characters": [],
      "action_text": "JAS (CONT’D) You’re a rules girl. Got it. But I’m not. You wanna find the best dancers, you gotta trust me. Reluctantly, Quinn follows. INT. HIGH SCHOOL HALLWAY - MOMENTS LATER Quinn trails Jas who moves quickly down the hall. QUINN At least tell me-- They turn the corner, and Jas stops at a window into a classroom. Inside, we see it’s a MUSIC CLASSROOM filled with INSTRUMENTS and MUSIC PRODUCTION EQUIPMENT. A few students are spread out, working on various projects. JAS There. She’s pointing to   LEO , 15, headphones on, working at a DJ CONTROLLER. He’s a little awkward and unassuming, not your typical DJ type. QUINN What does this have to-- Suddenly, Leo starts BREAKING. Moving to the music, eyes closed, in his own world. He’s fabulous. QUINN (CONT’D) Whoa. INT. MUSIC CLASSROOM - MOMENTS LATER Quinn and Jas now talk to Leo, but he doesn’t look happy. JAS Come on, Leo. It’s 25k. LEO If you win. Which you won’t. QUINN I have a fail-proof algorithm. LEO (sarcastic) Ohhh, an algorithm. Of course! (MORE) 35. (then) What’s an algorithm? Quinn prepares to launch into a lengthy explanation-- JAS It means, we’re building a dream team. And you’re the best breaker I know. LEO Then you know I don’t dance in front of people. And why would I go looking for trouble from Foster? JAS To show her up. She’d be crushed if we beat her. This kind of intrigues Leo. Quinn seizes on this. QUINN Devastated. You’d finally get back at her for... (guessing) Humiliating you in elementary school? Leo nods. LEO She changed my yearbook picture to a hedgehog. (explaining) She said I looked like a hedgehog. QUINN But you’re not a hedgehog. LEO I’m not. (then, to Jas) And you really quit? Just like that? JAS Yeah, and I didn’t do it to sit on my ass. I’m coming to win. Leo thinks this over. LEO If we swing at Foster, we can’t miss. LEO (CONT'D) 36. JAS We’re gonna stomp her. Leo smiles. LEO Then when do we start? INT. CLASSROOM - LATER Quinn’s in class, slyly reading article after article on her pho",
      "dialogue_count": 0,
      "word_count": 11898
    },
    {
      "scene_number": 4,
      "slugline": "INT. QUINN’S GARAGE - DAY The TBDs are practicing, with Drake at the front of the room. They’re clicking. Totally on point. Quinn keeps up. But Maria enters, interrupting, smiling. MARIA (to Quinn) I need to talk to you. INT. QUINN’S GARAGE - MOMENTS LATER The crew listens through the garage door as they hear the slightly muffled conversation between Quinn and Maria. QUINN (O.S.) ...Mom, you can’t barge in... EXT. QUINN’S DRIVEWAY - SAME Quinn, unhappy, listens. MARIA Quinny... I got you a new interview! QUINN What? MARIA I didn’t know if it would work out! But you know Dr. Agarwal in radiology? She knows the dean... you have a new interview with the Dean of Admissions, Ms. Rosenberg’s boss. You can start over! QUINN Wow... MARIA Wow is right! We’ll prepare you better this time. Dr. Agarwal thinks with some work-- QUINN When is it? MARIA --She’ll put in a good word, so you’re as good as in-- 99.",
      "characters": [],
      "action_text": "QUINN (suspicious) When is it. MARIA Next Saturday. QUINN Mom! MARIA This was a huge favor. They’re fitting you in last minute-- QUINN --Mom, that’s State! MARIA I know, but Quinn, you did this to get into Stanford. QUINN You picked this date on purpose. INT. QUINN’S GARAGE - SAME The crew hears this, worried. MARIA (O.S.) Why would you do something riskier to get maybe the same result? Do you honestly think you can win? Quinn thinks this over, reeling. She’s clearly torn. QUINN (O.S.) I don’t know! But everyone’s counting on me. MARIA (O.S.) So? EXT. QUINN’S DRIVEWAY - SAME MARIA This is your future we’re talking about. Everything you’ve worked for. Are you going to throw it away for people who won’t even be on your radar when you start your real life? Quinn storms out. 100. INT. QUINN’S GARAGE - MOMENTS LATER Quinn enters, trying to calm down. QUINN Hey guys, I need to-- She realizes everyone is silent, packing up their stuff. REESE You think we’re gonna lose? QUINN I didn’t say that. DRAKE But you’re thinking about the interview. Her silence is telling. She’s getting defensive, upset. Sputters out-- QUINN I’d be crazy not to consider! LEO What about us? QUINN You can reconceive the dance, if you had to. Drake could step in. The rules stipulate this close to the competition, an alternate-- DRAKE You’re serious. QUINN It’s just off the top of my head. Come on, I’m the weak link anyway. JAS Yeah. And we stuck by you anyway. But you were just using us. It’s like a gut punch. They all look at her, disgusted, then storm out. Drake lingers. QUINN Wait! 101. DRAKE Foster tried to recruit me. I turned her down without considering. I lost my job. Jas didn’t hesitate sticking up for you. We all gave up a lot for this, because you were so sure. And now you’re okay dropping us, just like that? Quinn reaches out to him, but he pushes her off. DRAKE (CONT’D) Don’t. He leaves. INT. QUINN’S BEDROOM - DAY Quinn’s back in her bed, disheveled, moping. She’s clutching her microscopes",
      "dialogue_count": 0,
      "word_count": 651
    },
    {
      "scene_number": 5,
      "slugline": "INT. REESE’S BEDROOM - DAY Reese tries to sketch some designs, but the pages are blank. INT. MUSIC ROOM - NIGHT Leo’s working on his music. Not dancing. INT. A/V BOOTH - AFTERNOON The Birds perform at the pep rally. Quinn’s running the spotlight while glancing at her interview practice note cards. Suddenly, the audience CHEERS even louder. She’s shocked to see Jas is DANCING WITH THEM. She’s rejoined the Birds. Only now as punishment, Jas doesn’t get the solo. INT. FAST FOOD KITCHEN - AFTERNOON Drake’s at his new job-- working the cash register at the drive-thru. Into the mic-- DRAKE Welcome to Eddie’s Gyro Shack. Would you like to try our new Gyro Hero Taco   for only $1.29? QUINN (O.S.) Drake, is that you? Can we talk? DRAKE What can I get you, ma’am? QUINN (O.S.) Drake, it’s me. Quinn. Ackerman. Drake’s BOSS, a dick, now stands behind him. DRAKE That’ll be $9.50, please pull up. Through the window Drake sees Quinn-- NOT IN A CAR. On foot. QUINN I know I am supposed to be in a car. But I don’t know how to drive, because I’ve spent my whole-- The Boss doesn’t care and walks away. 103.",
      "characters": [],
      "action_text": "DRAKE Quinn, what are you doing here? QUINN I got you your job back. I told them it was my fault. DRAKE I didn’t ask you to do that. QUINN I wanted to. Drake, we’re good together. One, we inspire each other-- DRAKE Stop, Quinn. Quinn’s falling apart. QUINN It’s just, I think... I think I love you or something. (realizing) I feel... My heart races, my eyes dilate... She hears how terrible this sounds, and stops herself. QUINN (CONT’D) Let me start over. You don’t understand how hard it is for me-- DRAKE --Your life is easy. You want to learn to dance, boom, you learn to dance! You’re charmed. QUINN I’m not. I work hard. DRAKE Everyone works hard, Quinn. But you wouldn’t know. You’re so busy in your own head doing your own shit. You barely let me in. He looks her right in the eyes. DRAKE (CONT’D) It’s a good thing you never feel anything. Because this feels like shit. 104. He turns away, leaving her heartbroken. INT. HIGH SCHOOL HALLWAY - DAY Quinn’s walking the halls alone. Passes a flock of Birds and Jas. But then Quinn spins around. QUINN (to Jas) You shouldn’t be in the Birds. TRINITY What did you just say? QUINN I know I fucked up, but you’re better than this, Jas. You could still win. This gives Jas pause. FOSTER Let’s go, Jas. They walk away, but Jas is thinking. Knows what she has to do. INT. QUINN’S BEDROOM - MORNING It’s still dark. Quinn’s in bed, staring at the ceiling, wide awake. Desperately-- QUINN Today is the day all of your dreams come true. Quinn nods to herself. She has to make it happen. Gets up and starts getting dressed. INT. THEATER - DAY Crowds of people. A huge audio set-up. Nervous energy. A sign that says “2019 Global Hip Hop State Championship.” TECHIES are preparing the stage. The TBDs enter the back of the theater. All of them-- Jas and Drake included. But they’re scared. 105.",
      "dialogue_count": 0,
      "word_count": 540
    },
    {
      "scene_number": 6,
      "slugline": "INT. QUINN’S KITCHEN - DAY Quinn, dressed in her business best, clutching her note cards, passes through the kitchen. MARIA I can drive you. Quinn doesn’t answer and keeps walking. INT. BACKSTAGE - DAY The TBDs stretch backstage and eye the Birds. Foster cranes her neck, looking for Quinn. Wonders where she is. INT. STANFORD ADMISSIONS OFFICE - SAME Quinn sits across from MR. GREYFIELD, the scary Dean of Admissions. Quinn’s confident, prepared. QUINN ...I’m a National Merit Scholar and president of student council. And I feel that Stanford would give me the arena to explore my passions. MR. GREYFIELD (nodding) And what are those passions? QUINN Jewelry making. The way the gemstones fill my soul, the way the spring clasps light my heart on fire... it’s magical. Mr. Greyfield nods again. She’s nailing this. MR. GREYFIELD Fascinating. Though, my colleague mentioned you were doing some sort of dance project...? Quinn brushes this aside. QUINN Oh yes. That... turned out to be nothing. She wants to say more. 106.",
      "characters": [],
      "action_text": "MR. GREYFIELD Okay, well great. It sounded from what she said, sort of a lark. (chuckling) How challenging could it even be? She doesn’t think. Blurts out-- QUINN Very challenging. MR. GREYFIELD Excuse me? QUINN I didn’t think so at first but... I was terrible at it. MR. GREYFIELD Oh. QUINN I tried. I failed. That’s never happened to me before. She kind of LAUGHS to herself. He’s supremely weirded out. MR. GREYFIELD Well, it was wonderful meeting you-- QUINN You know, after a while I didn’t even care? Me. Quinn Ackerman! It was okay failing, because I was feeling it. You know what I mean? He doesn’t. But Quinn’s getting into it. Mr. Greyfield starts shuffling papers, trying to get her to leave. QUINN (CONT’D) All that stuff deep down that you buried, that you pretended didn’t matter, that you hid from even yourself. It has to come out. You just let it out. You don’t think. She sort of heaves her body, demonstrating. QUINN (CONT’D) That’s dance. But I let them down. I was so busy being stuck inside my own head I couldn’t see what was all around me. And now, I feel... 107. She pauses. A revelation. QUINN (CONT’D) ...I feel horrible. She lights up. QUINN (CONT’D) Do you see?! I feel horrible! Quinn jumps out of her seat. QUINN (CONT’D) I know what my passion is now! And I have to get it back! I have to go! She runs out of the room. INT. OUTER ADMISSIONS OFFICE - CONTINUOUS The staff are so jazzed to see Quinn again! She rushes past-- QUINN No time! I HAVE TO GO!!! They cheer her on. The Admissions Woman though quietly tucks her unused post-its back into her drawer, disappointed. EXT. PARKING LOT - MOMENTS LATER Quinn’s sprinting out of the building, requesting an Uber. She runs to the corner. Waits wildly impatiently. Paces. INT. THEATER - SAME On stage, the Birds begin their routine. It’s sexy, feverish. Stunning. Better than anything we’ve seen from them. INT. UBER - LATER Quinn jumps into the Uber. The UBER DRIVER turns to her-- QUINN --DRIVE! INT. THEATER - SAME Th",
      "dialogue_count": 0,
      "word_count": 539
    },
    {
      "scene_number": 7,
      "slugline": "INT. UBER (MOVING) - LATER Quinn’s barking orders as they move through the streets-- QUINN You missed it! Jesus, Krystal! UBER DRIVER Hey, I’m not dying today! You want to get us there, then YOU DRIVE. QUINN FINE I WILL! She CLIMBS into the front seat, on top of Krystal-- KRYSTAL What the hell!!?? I wasn’t serious. Krystal’s smushed over to the passenger seat, totally freaked out. It’s a messy/insane transition but Quinn keeps DRIVING. KRYSTAL (CONT’D) What the fuck are you doing?! QUINN I’m driving!! Truthfully, I’ve been so scared to learn. There’s so much out of your control! But you can’t live inside your head, you know? You have to feel the road! Quinn HITS THE CURB accidentally. Horrified, Krystal frantically CLICKS her seat belt. INT. THEATER - SAME The Birds build to the FINALE as the TBDs watch backstage, completely overwhelmed. The Birds give this dance everything-- FLIPS, ROBOTTING, POPPING/LOCKING, CHEER STUNTS. It’s like everything but the kitchen sink of dance. They launch into a wild WAACKING piece that devastates the TBDs, especially Sophie-- that’s her thing. INT. UBER (MOVING) - SAME Quinn’s a crazy person. QUINN I’m doing great! 109.",
      "characters": [],
      "action_text": "She DRIVES OVER A TRAFFIC CONE, then SLAMS on the brakes, NEARLY HITTING A PEDESTRIAN CROSSING THE STREET. After a beat- QUINN (CONT’D) Did you know most accidents occur due to sleep deprivation rather than simple negligent driving-- KRYSTAL Get. The. Fuck. Out. QUINN Fair enough! She flings open the door. RUNS OUT OF THE CAR. EXT. STREETS - CONTINUOUS Quinn BOOKS IT down the sidewalk. She’s in good shape now, so she moves quickly and isn’t hyperventilating. TURNS A CORNER-- And now she sees the cause of the traffic. A GIANT PARADE is in front of her. Crowds of PEOPLE line the streets, watching, as floats pass by. QUINN Seriously?! What’s this even for? But Quinn needs to get to the other side. Sees a group of DANCERS performing their routine in the parade-- Quinn takes a breath, then BURSTS into the parade route. DANCING HER WAY THROUGH IT seamlessly-- Then pops out the other side! She keeps running. Now runs smack dab into a CONSTRUCTION SITE. QUINN (CONT’D) Okay, are you fucking kidding me?! But she LEAPS over a DITCH-- BALANCES across a BEAM-- DROPS DOWN under a frame of a building-- A handful of CONSTRUCTION WORKERS watch this in disbelief-- CONSTRUCTION WORKER She could have just like, gone around... But nothing’s stopping Quinn! She keeps moving, turns another corner. Sweat pooling down her fancy business suit. She checks her watch. She’s running out of time. Looks around, panicked. Then she looks up ahead. 110. Sees the HOSPITAL. Pulls out her phone, dials. QUINN (into the phone) Mom? Can you pick me up? INT. CAR (MOVING) - MOMENTS LATER Maria drives fast, not happy, but speeding for her kid. They sit in silence for a moment, until-- MARIA So you want to be a dancer now? QUINN No. But I want a life. Can’t you understand that? MARIA No, I’m an idiot-- QUINN (sarcastic) --Yeah, I think you’re an idiot-- MARIA --Maybe I just want to protect you-- QUINN No. She suddenly waves her hand, regrouping. QUINN (CONT’D) We’re not doing bratty teenage daughter/overbearin",
      "dialogue_count": 0,
      "word_count": 2275
    }
  ]
}