{
  "slug": "x-men-days-of-future-past-2014",
  "title": "x men days of future past",
  "genre": "sci-fi",
  "format": "film",
  "scenes_count": 17,
  "characters_count": 0,
  "characters": [],
  "total_words": 23320,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. HIGH SECURITY BUILDING - PAST - DAY 21   21  The Private moves down a hall to a DOOR where a HEAVILY ARMED   *  GUARD stands. The word “QUARANTINE” on the door.   *  GUARD  You the one come to collect these  freaks?  The Private nods.  GUARD (CONT’D)  Good, just having them here gives  me the heebie-jeebies.  The Private pushes through the door into--  INT. HIGH SECURITY BUILDING - MAIN AREA - PAST - DAY 22   22  A dark lab where a handful of MUTANT SOLDIERS are being held.  One of them has green skin like a TOAD.   *  ARMY DOCTORS run tests, wearing surgical masks. The Private   *  looks around, his eyes wide, seeing--  Work stations with medical reports, vials of blood. He passes   *  a DOCTOR, his voice low--   *  PRIVATE   *  What is all this?   *  DOCTOR   *  Lab reports. Blood tests.   *  The Private looks at the intricate reports.   *  PRIVATE   *  Where’s it all going?   *  DOCTOR   *  Same place they are.   *  He motions to the mutants. The Private sees a FILE with an   *  insignia on it, the same insignia for the guns in the future--   *  PRIVATE   *  (reading)   *  Trask Industries. What’s that...?   *  The Doctor looks at him, sensing something off about this   *  guy, as--   *  The doors swing open. Four SOLDIERS enter, they have that   *  same INSIGNIA on their sleeves. They work for Trask.   *  17.",
      "characters": [],
      "action_text": "The leader is a sharp faced CAPTAIN named BILL. He nods to   *  the doctors, who file out. Then he turns to the mutants.   *  BILL   *  Let’s go, on your feet, we’re   *  taking you out of here.   *  The mutant soldiers look happy, relieved. We see a familiar   *  face among them: ALEX “HAVOC” SUMMERS. He steps up.   *  ALEX   *  We’re shipping home?   *  BILL   *  You’re being transferred to another   *  base. A secure facility where we   *  can run a few more tests.   *  Alex and the other mutants darken, disappointed.   *  PRIVATE   *  No, actually, they’re going home.   *  Bill and his men turn to the YOUNG PRIVATE.   *  BILL   *  I’m sorry, Private, did you say   *  something?   *  PRIVATE   *  I said they’re not going to another   *  lab. They’re going home, sir.   *  Real tension in the air now.   *  BILL   *  Is that right? On whose order...?   *  The Private steps toward Bill. 22   22   *  PRIVATE  On   yours .   *  With that, the Private TRANSFORMS INTO BILL. There’s only one   *  person in the world with this power:  RAVEN .   *  Everyone stands shocked for a moment. Then Bill reaches for   *  his gun, but she LEAPS AT HIM.  They spin, struggle. The other soldiers raise guns, but--  They don’t know which Captain is real .  18. Raven uses his body for a SHIELD as she ATTACKS the troops, a   *  blinding whirl of motion, a hardened assassin.  She finally KNOCKS DOWN Bill with the butt of his own gun. He   *  stirs, reaches for another weapon, but--   *  Raven transforms and KNOCKS HIM OUT with a BLUE FOOT to the   *  face. She stands over him,   completely blue now .   *  ALEX  Raven.   *  RAVEN  That’s not my name.  (to mutants)   *  Let’s go, move out. Security will  be here in seconds.  She passes a work station, grabs a file.   *  ALEX  I thought you were working with   *  Erik.  RAVEN  Erik’s gone, they got him. I’m on   *  my own.   *  (to the mutants)   *  I said LET’S MOVE.  As they move toward a back door, Bill stirs, semi-conscious.   *  He pulls h",
      "dialogue_count": 0,
      "word_count": 732
    },
    {
      "scene_number": 2,
      "slugline": "EXT. MILITARY BASE TARMAC - DAY 24   24   *  An MP (Raven) leads the troops across the tarmac. Behind   *  them, MPs are searching the base, locking it down.   *  MP/RAVEN   *  Keep moving, head down, keep   *  walking.   *  She leads them toward a TRANSPORT CHOPPER which is starting   *  to seal up. They pass a COLONEL, keep going and--  RAVEN TURNS INTO THE COLONEL, calling out to the chopper--   *  COLONEL  Hold that door!  The doors stay open. Soldiers salute the Colonel.  COLONEL (CONT’D)  Wouldn’t want to leave these poor  boys in this godforsaken country.  They load the mutants into the chopper.   *  TOAD  You’re not coming with us?  He looks at the Colonel.  COLONEL  My war’s not over. 24   24  The Colonel walks away. As the chopper shuts behind him, we   *  see his face TRANSFORM into--  RAVEN. An Army Nurse. For the first time, we see her human   *  face, the rain falling on her.   *  As she keeps moving, she looks down at the scrap of paper  from the lab, the insignia and address for:   *  TRASK INDUSTRIES.   *  She disappears into the rain, one step closer to her destiny,   *  and   we CUT TO--   *  EXT. XAVIER MANSION - 1973 - PAST - DAY 25   25  The familiar mansion. A car comes up the driveway, Logan at  the wheel. He looks out, notices the garden is dead, weeds  growing. A sign reads: PRIVATE PROPERTY, KEEP OUT.  20.",
      "characters": [],
      "action_text": "And we see a faint outline where another sign once stood. The  sign for Xavier’s school. Now gone.  Logan pulls up to the front of the house. He gets out, looks  around. Silent. Empty. He walks up to--  The front door. He rings the bell. He hears it chime off-key,  like it hasn’t been rung in years.  He goes to a window, thick with dust. He wipes it clear to   *  get a look inside: minimal furniture, no signs of life. His   *  eyes narrow, sniffing the air, and--  VOICE (O.S.)   *  Can I help you?  Logan turns to see: YOUNG HANK MCCOY in the doorway.  LOGAN  Yeah, what happened to the school?  HANK  The school has been shut for years.  Were you a parent?  Logan just looks at him.  LOGAN  No. Who are you?  HANK  I’m Hank, Hank McCoy. I look after 26   26  the house now.  LOGAN  You’re...Beast? Guess you’re a late  bloomer.  Hank tenses. He hasn’t heard that name in years.  HANK  I don’t know what you’re talking  about, but I’m going to have to ask  you to leave.  He starts to close the door, but Logan STOPS it. They hold  the door from opposite sides, muscles tense.  LOGAN  Pretty strong for a scrawny little  kid. You sure there’s not a little  Beast in there...?  We see something FLICKER in Hank’s eyes as he strains.  21. HANK  Please...just....go....  Hank’s grip tightens, his hand looks like it might be  SHIFTING slightly, skin rippling.  LOGAN  Not till I see the Professor.  HANK  There’s no...Professor...here.  LOGAN  We’ll see about that.  WHHHM. Logan pushes the door open and blows past Hank into--  INT. XAVIER MANSION - FRONT HALL - PAST - DAY 27   27  Logan gets a few steps into the house but--  A hand grabs him from behind. Not a hand. A BLUE PAW.  HANK  I told you to LEAVE!  On the last word, Hank GROWLS. Logan turns and sees--  Hank transforming into the big, blue, furry BEAST.  LOGAN  There he is. 27   27  Hank LEAPS at Logan. Logan ducks it, and HURLS Hank into a  wall. Logan heads up the stairs, but--  Hank gives chase. He CLIMBS quickly up the baniste",
      "dialogue_count": 0,
      "word_count": 1487
    },
    {
      "scene_number": 3,
      "slugline": "EXT. XAVIER MANSION - PAST - DAY 30   30  Logan heads for his car. Hank watches him go, he wants to   *  follow. A hard beat. And...   *  CHARLES (O.S.)  She won’t listen to me.  They turn, see CHARLES emerging from the house.  CHARLES (CONT’D)  Even if I go with you, even if we  find her, I can’t convince her to  stop any more than I could convince  her to stay.  LOGAN  You won’t have to convince her.  Magneto   will.  Hank and Charles share a glance.   *  HANK  It won’t be easy to get to him.  LOGAN  Why not? Where is he?  CHARLES  Where he belongs .   *  INT. UNDERGROUND HALL - PAST - DAY 31   31  BUZZZZZ. A secure door buzzes open. We notice the door is  made of white NASA-grade PLASTIC. A GUARD moves through the  hall, carrying a plastic tray of food. He stops at--  A METAL DETECTOR. Body CLEARED. He checks his TEETH at an X-  RAY MACHINE. No metal fillings. Another airlock hisses open.  He moves through a CONCRETE MAZE OF HALLS, passing more  GUARDS. Perhaps we notice none of them are wearing METAL. No  buttons, no zippers, all plastic guns.  INT. UNDERGROUND PRISON - PAST - DAY 32   32  He makes it to the last door, which slides open revealing...  A single shadow. A MAN sits with his back to us. 32   32  ERIK LENSHERR.  The Guard DROPS the tray of food onto the floor, spilling it.   *  27.",
      "characters": [],
      "action_text": "GUARD  Oops.  The Guard starts to leave but--  ERIK  Tuna...swordfish....mackerel.  The Guard turns back, motions to the food--  GUARD  Think it’s mostly beans and  whatever slop they had left in the  trash.  ERIK  Not me.   You . You had fish for  dinner last night...  The Guard tenses, how did he know that...?  ERIK (CONT’D)  Trace amounts of iron in seawater,  you might want to watch what you  eat.  The Guard’s STOMACH shifts, rumbling, shivering unnaturally.  Freaked out, he backs away and SLAMS the DOOR behind him.  GUARD  Goddamn freak of nature.  EXT./INT. PENTAGON COURTYARD - PAST - DAY 34   34  As he scrambles away, we pull UP THROUGH THE CONCRETE  CEILING, and we hear a voice:  HANK (V.O.)  ...it’s a hundred feet deep, with  only one access point...  We PULL ALL THE WAY UP through the GROUND, revealing the  prison is under a GRASSY CLEARING.  HANK (V.O.) 34   34  ...surrounded on all sides by the  most heavily secured building in  the world.  And we see this is the INNER COURTYARD FOR THE   PENTAGON . The   *  image transitions into a MAP in--   *  28.",
      "dialogue_count": 0,
      "word_count": 430
    },
    {
      "scene_number": 4,
      "slugline": "INT. XAVIER MANSION - XAVIER’S OFFICE - PAST - DAY 35   35  Hank stands with Charles and Logan, looking at a map of the  Pentagon.  HANK  The Pentagon was built in World War  II when there was a shortage on  steel, so the foundation is pure  concrete and sand, no metal, the  perfect place to hold him.   *  LOGAN  What’s he in jail for, this time?   *  CHARLES  He didn’t tell you?  Logan shakes his head.  CHARLES (CONT’D)  You may have heard about a “magic  bullet” that killed a President in  1963.  LOGAN  JFK...  CHARLES  What else would explain a bullet  that curved in the air? Erik always  had a way with guns.  Logan stands there, processing.  CHARLES (CONT’D)  You sure you want to break him out  of there? We’re talking about the  most dangerous man in the world.  I’ve seen the damage he can do.  Logan looks at Charles, level.   *  LOGAN  So have I. But we don’t have a  choice. We need him to persuade   *  Raven.   *  Logan turns back to the map.   *  LOGAN (CONT’D)   *  Now, how we getting in there? We   *  gotta blast through a hundred feet   *  of concrete.   *  29.",
      "characters": [],
      "action_text": "We PUSH IN on Hank, a thought forming.   *  HANK   *  I might know a guy.   *  Charles looks at him, with trepidation, as we CUT TO--   *  EXT. XAVIER MANSION - TENNIS COURT - PAST - PRE-DAWN 67   67   *  An old, ratty tennis court with sagging net, flat tennis   *  balls. Suddenly, the balls start to shake, rolling away as   *  the ground opens. And...   *  A new X-JET RISES. Hank pilots the plane, soaring away from   *  the house, as we hear a CROWD start to CHANT:   *  JUGGER-NAUT! JUGGER-NAUT!   *  EXT. FOOTBALL FIELD - PAST - DAY 36   36  A high-school FOOTBALL GAME. A hulking RUNNING BACK takes the   *  ball, lowers his HELMET and PLOWS through the defensive live,  blasting his way to the end zone. The crowd goes wild.  The player takes off his helmet to celebrate, and we see it  is CAIN MARKO, aka JUGGERNAUT, 18 years old.   *  In the stands, we find: Logan, Charles, and Hank.   *  LOGAN   *  Not bad.   *  HANK   *  He’s holding back. When he was at   *  the school, he took out the whole   *  west wing without breaking a sweat.   *  Charles shakes his head, remembering--   *  CHARLES   *  Cain always had...disciplinary   *  issues.   *  LOGAN   *  Perfect.   *  EXT. FOOTBALL STADIUM - PAST - DAY 37   37  Cain emerges from the tunnel with his pads strung over his   *  shoulder. He slows when he sees CHARLES, HANK, and LOGAN.   *  CAIN   *  What are you doing here? Thought   *  you shut down the school.   *  30. Logan steps forward.   *  LOGAN   *  This isn’t an academic visit. We   *  need your help, Cain.   *  Cain keeps his eyes on Charles.   *  CAIN   *  Why would I help you? You threw us   *  all back in the street when you   *  were done with us.   *  Charles looks away. Hank defends him.   *  HANK   *  We placed all the students in new   *  schools.   *  CAIN   *  Public school in Poughkeepsie.   *  Yeah, thanks for that. You know   *  what it’s like to play this game   *  with only one percent of your   *  power? To have to hide all the   *  time...?   ",
      "dialogue_count": 0,
      "word_count": 2052
    },
    {
      "scene_number": 5,
      "slugline": "INT. PENTAGON - HALLWAY - PAST - DAY   *  DING. The doors open back upstairs where Charles cleared the   *  soldier. Erik, Charles, Logan and Cain emerge. Erik now wears   *  military garb.   *  As they step out, the metal panel DROPS back into the shaft,   *  clanging down a hundred feet. They move on.   *  A couple passing WOMEN look down the shaft, see it’s   *  strangely EMPTY. They look back toward our crew, but--   *  Our guys disappear into the crowded halls.   *  EXT. X-JET ON LANDING STRIP - PAST - DAY   *  The jet is parked. Cain is saying goodbye to Charles.   *  CAIN   *  Well, that was fun. Hey Chuck, let   *  me know if you get the school up   *  and running again. Those kids in   *  Poughkeepsie, they’re not in my   *  league.   *  Charles nods, distant.   *  CHARLES   *  Good luck, Cain.   *  Cain looks toward the plane, where Erik waits.   *  CAIN   *  Yeah, you too, Professor.   *  Cain walks away. Charles watches him for a moment, then turns   *  back toward the plane, and we CUT TO--   *  EXT/INT. SMALL PLANE - PAST - DAY 49   49  Hank flies. Charles sits alone, looking out the window. Erik   *  sits close, watching him for a beat.   *  ERIK  What happened to your powers?  Charles keeps his eyes out the window.  ERIK (CONT’D)   *  How did you lose them?   *  CHARLES  The treatment for my legs, it 49   49  affects my DNA.  38.",
      "characters": [],
      "action_text": "ERIK  You gave up your powers so you   *  could walk...?  Charles slowly looks at Erik.  CHARLES  You don’t know what it’s like to  lose a part of yourself.  ERIK  I’ve lost my fair share.  CHARLES  And you think that justifies what  you’ve done?  Erik hardens.  ERIK  You have no idea what I’ve done.  CHARLES  I know you put me in that chair, I  know you took the things that meant  the most to me--  ERIK  Well maybe you should’ve fought  harder for them.  CHARLES  You want a fight, Erik, I’ll give  you a fight--  LOGAN  Sit down--  ERIK  No, let him come--  Charles keeps coming.  CHARLES  You think you’re the only one with  pain and anger, you think you’re  the only one who’s suffered--  LOGAN  I said SIT DOWN--  ERIK  Come on, let’s see what you can do 49   49   *  without your powers--  39. WHAM! Charles HITS Erik. They start to fight.   *  LOGAN   *  Goddamnit.   *  As they fight, the walls shake on the metal plane.   *  HANK   *  Guy! You’re messing up my   *  aerodynamics!   *  Warnings flash in the cockpit, and finally--   *  Logan rips them apart. He pushes Charles to a chair, and   *  snaps a BONE CLAW at Erik, holding him at bay.   *  LOGAN   *  Enough!   *  Erik lowers his hands. Logan looks at them both.   *  LOGAN (CONT’D)   *  When this is over, you can go back   *  to hating each other, spend the  rest of your lives fighting, for  all I care. But right now, you  gotta come together, because like   *  it or not   you need each other . The   *  whole world hangs in the balance,   *  and it’s up to you two jackasses to   *  save it.   *  Erik slows, surprised.   *  ERIK   *  What does that mean?   *  (a beat)   *  Why did you break me out of that   *  prison?   *  As the question hangs there, we CUT TO--   *  EXT. TRASK INDUSTRIES HEADQUARTERS - PAST - DUSK 50   50   *  A sprawling industrial complex. As we get closer, the   *  building and factory turn into--   *  INT. TRASK INDUSTRIES HEADQUARTERS - PAST - DUSK   *  A miniature of the complex sits in th",
      "dialogue_count": 0,
      "word_count": 658
    },
    {
      "scene_number": 6,
      "slugline": "INT. TRASK INDUSTRIES - TRASK’S FLOOR - PAST - DUSK 52   52   *  Trask approaches his office. His SECRETARY is waiting.   *  SECRETARY  We weren’t expecting you, sir.  TRASK  Just wanted to grab a couple files.  Is that a new dress? It’s nice.  SECRETARY  (surprised, confused)  ...thank you.  INT. TRASK OFFICE - PAST - DUSK 53   53  Trask enters his massive office. He shuts the door behind   *  him, and moves fast,   TRANSFORMING INTO RAVEN .   *  She checks the office, rifles through the desk, drawers,   *  papers. She slows when she notices:   *  A large PORTRAIT on the wall. She steps toward the picture,   *  which has TRASK giving a prosthetic robotic leg to a LITTLE   *  GIRL missing a leg. Raven darkens, disgusted.   *  She reaches out, and pulls back the painting, revealing--   *  A SAFE IN THE WALL. It has a FINGERPRINT PAD.   *  Raven smiles, reaches out, her hand TRANSFORMS into TRASK’S   *  HAND, touching the pad, which reads her ID and--   *  The SAFE POPS OPEN. She enters the safe, finds FILES full of   *  data, research from Saigon and around the world. She flips   *  through the files, stops on a file marked WEAPONS TEST.   *  She opens it and freezes, looking at the face of--  ALEX “HAVOC” SUMMERS. 53   53  She flips the pages, seeing results and photos from the   *  weapons test, and we FLASH TO--   *  EXT. WOODS - PAST - NIGHT 54   54  ALEX running in the woods, scared, hunted. Something is  coming in the sky, casting a shadow over the trees. As it  gets closer, we FLASH BACK TO--  INT. TRASK OFFICE - PAST - NIGHT 55   55  Raven looks at the photos, flashing between the file and--  41.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 291
    },
    {
      "scene_number": 7,
      "slugline": "EXT. WOODS - PAST - NIGHT 56   56  A bright light flares through the trees, like a searchlight.  Alex spins, breathless, nowhere to hide. He FIRES a BLAST   *  from his chest, burning through trees, hitting--  The massive shadow. But it doesn’t stop. It reaches through  the trees. A crude BEAM OF ENERGY generates in its MASSIVE  HAND, and BLASTS forward, HITTING ALEX, as we SMASH TO--  INT. TRASK OFFICE - PAST - DAY 57   57  Raven stares at a photo of Alex’s DEAD BODY. An AUTOPSY.  Raven grips the report, emotional. A tear forms in her eye,  and suddenly--  SECRETARY (O.S.)   *  Dr. Trask?   *  The voice startles Raven.   *  RAVEN   *  One second--  (changing her voice)  ONE SECOND.  She transforms back into Trask, steps out of the safe, goes   *  to the door where the Secretary stands with a piece of paper.   *  SECRETARY  We added some names to the list for   *  tomorrow.   *  He takes the list, looks at the names. Russian, Chinese.   *  TRASK   *  Thank you.   *  The Secretary notices the tear on Trask’s cheek.   *  SECRETARY  Is something wrong, sir?  Raven wipes away the tear, hardens.  TRASK 57   57  No. Nothing.  (a beat, then)   *  Would you mind typing up my   *  itinerary for tomorrow? I don’t   *  want to miss anything.   *  42.",
      "characters": [],
      "action_text": "The Secretary nods, heads away. Trask watches her go, his   *  eyes darken, a flicker of YELLOW in the iris, as we CUT TO--   *  EXT. XAVIER MANSION - PAST - NIGHT 58   58  Dark, quiet. We push toward the house...  INT. XAVIER MANSION - DINING ROOM - PAST - NIGHT 59   59  Charles, Erik, Logan, and Hank sit around a table, eating  dinner. Erik gulps down food, ravenous. Mid-conversation--  HANK  We know she’ll be at the summit,  but she could be anyone there. How  do we find her?  LOGAN  She’s coming for Trask. We stay  close to him, we’ll be there when  she makes her move.  Hank considers. A beat.  HANK  And then what?  LOGAN  Then we get her out of there, and I  go back to a future with no  Sentinels, no war.  Hank keeps pushing, a little embarrassed--  HANK  No, I mean, what happens to   Raven ?  Where does she go?  LOGAN  That’ll be up to her.  Hank looks down at his plate of food.  HANK  She’d be safest here.   *  ERIK  And you think that’s what she  wants?  From the other side of the table, they hear-- 59   59  CHARLES  It’s what she   needs .  43. Erik looks at him, that strident tone.  ERIK  I can’t begin to imagine why she  left.  HANK  She left because you got in her  head, messed with her mind.  ERIK  That’s not   my   power, Hank. She left  because she didn’t want to hide  anymore. She didn’t want to pretend  to be someone she’s not.  The words are aimed at Hank. He grips the table. Logan looks  around, realizing...  LOGAN  You   all   had something with this  girl, didn’t you?  Hank pushes his chair back, walks out.  LOGAN (CONT’D)  Guess it makes sense. She’s the  only girl in the world who could be  all things to all guys.  Erik looks down the table at Charles.  ERIK  You should be proud of her,  Charles. She’s out there fighting   *  for our cause.   *  CHARLES   *  You mean   your   cause.   *  ERIK   *  I mean   mutants . You’re still one of   *  us, aren’t you? Or do you consider   *  yourself more human now?   *  Charles tightens.   *  LOGAN   *  ",
      "dialogue_count": 0,
      "word_count": 1107
    },
    {
      "scene_number": 8,
      "slugline": "INT. XAVIER MANSION - OFFICE - PAST - NIGHT 64   64  Charles is pouring himself another glass.   *  ERIK (O.S.)   *  Make that two?  Charles sees Erik emerge. Charles walks away from the bottle.  CHARLES  Make it yourself.  Erik controls the metal top of the bottle, tipping it over to  pour himself a glass. He motions to the CHESS BOARD.  ERIK  Fancy a game? 64   64   *  CHARLES  I’m not in the mood for games,  thank you.  Erik takes a sip of his drink, savors it.  ERIK  Haven’t had a real sip in ten  years.  CHARLES  You’re lucky you weren’t executed  for what you did.  Erik lowers his glass, looks at Charles.  ERIK  I didn’t do it, Charles. I didn’t  kill the President.  CHARLES  No? You weren’t there? You didn’t  make that bullet move?  ERIK  Yes I was there. And yes I made the  bullet move...because I was trying  to stop it. I was trying to   save  him.  Charles slows, surprised.  ERIK (CONT’D)  There were ten shots taken. I  stopped nine of them. But it only  takes one...  47.  (MORE)",
      "characters": [],
      "action_text": "(a beat)  You of all people should know that.  Charles looks at Erik, not sure what to believe.  CHARLES  Why would you want to help him?  ERIK  Because he was going to help   us . He  was one   of us, Charles.  CHARLES  Kennedy was...?  Erik nods. 64   64  ERIK  A mutant. That’s why they killed  him.  CHARLES  Who?   Who   killed him?  ERIK  Your man Trask. He set me up. It   *  was all part of his plan to turn  the government against us. It’s how  he got his program started...  Charles darkens.  CHARLES  And now we know how it ends. You   *  were right, Erik. They do away with   *  us.   *  ERIK   *  Not if we change things tomorrow,  not if we change history.  Charles looks at him. Erik steps closer.   *  ERIK (CONT’D)  We’ve been given a second chance,   *  you and me. Together, tomorrow, we   *  can change our fate, we can   *  determine our own destiny.   We can   *  decide how this ends .  Charles slows, the words resonate. Erik is the one inspiring   *  Charles now. A beat. Then--   *  48.  ERIK (CONT’D) CHARLES  It’s been a while since I played.   *  He motions to the chessboard. Erik smiles softly.   *  ERIK  I’ll go easy on you.  He goes to the board, starts setting up the pieces. Charles  goes to get another drink. This time--  He pours two glasses. 64   64   *  As he sits down with Erik, we PULL OUT of the room, down the   *  dark hall, watching these two old friends play chess.   *  We hear FRENCH MUSIC on the CUT TO--   *  INT. PARIS CAFE - PAST - NIGHT 65   65  A crowded cafe. A pack of NORTH VIETNAMESE SOLDIERS are  getting drunk. The loudest among them is GENERAL LUONG.  VIETNAMESE CAPTAIN (SUBTITLED)  General, maybe you should slow  down, we have a big day tomorrow.  GENERAL LUONG (SUBTITLED)  We’re celebrating, son. It’s not  every day you win a war, let alone  against the American devils.  (rising, unsteady)  I’m getting another bottle.  He stumbles toward the bar, elbows through the crowd, and--  KNOCKS into a woman, spilling her drink.  GENERA",
      "dialogue_count": 0,
      "word_count": 968
    },
    {
      "scene_number": 9,
      "slugline": "EXT. MAJESTIC HOTEL - PAST - DAY 71   71   *  A crowd surges outside the hotel. Flags flap -- Russian,   *  American, Vietnamese. REPORTERS flock, cameras roll.  REPORTER  ...diplomats from around the world  will be gathered here today to  officially end all United States  military involvement in Vietnam.  This is a historic day for peace...  Motorcades pull up. Generals and Dignitaries pile out.  A dark sedan arrives. Doors open. TRASK emerges with that   *  familiar captain from Saigon: BILL. They head up the red   *  carpet into the hotel.   *  INT. MAJESTIC HOTEL - MEETING ROOM - PAST - DAY 72   72  A handful of FOREIGN GENERALS are waiting. Among them, we see   *  GENERAL LUONG. They all turn as Trask and Bill enter.   *  TRASK  Good afternoon, everyone, hello.   *  Thank you for taking the time to   *  meet. I know you have hands to   *  shake and pictures to take  downstairs, so I’ll get right to  the point: your side won this   *  war...but you’ll need a new weapon  for the new enemy.  He looks to Bill, who clicks a MICROFILM REEL into a  projector, casting images onto a screen--  TRASK (CONT’D)  These are top secret files from the  US Defense Department, evidence of  a threat far deadlier than anything  you’ve ever faced. A new species  with powers that could render your  arsenals useless, your armies  powerless.  They look at images of Havoc, Toad, other mutants flickering   *  on screen.  TRASK (CONT’D)   *  We’ve rounded up these subjects   *  from around the world, but there   *  are far more out there...   *  General Luong leans forward, as we CUT TO--   *  52.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 275
    },
    {
      "scene_number": 10,
      "slugline": "EXT. MAJESTIC HOTEL - PAST - DAY 73   73  A car pulls up to the rear entrance, which is blocked. TWO  FRENCH SOLDIERS step to the car, flanking it. Logan sits at  the wheel. He rolls down his window.  SOLDIER (FRENCH, SUBTITLED)  Turn around. There’s no access past 73   73  this point.  ERIK (FRENCH, SUBTITLED)  Step away from the car please, and  raise the barrier.  The soldier steps closer, hand on his gun.  SOLDIER (FRENCH, SUBTITLED)  I’m not going to ask you again.  ERIK (FRENCH, SUBTITLED)  Nor am I. Now let us through.  LOGAN  You might want to do what he says.  The soldiers look at each other, pulling guns.  SOLDIER  Why would we do that? We have guns  pointed at you.  ERIK  Actually, you have guns pointed at  each other .  With that, Erik CONTROLS THE GUNS so they aim at one another.  The triggers COCK, fingers tighten.  CHARLES  Erik...  ERIK  I know the rules, Charles.  WHAM! The guns WHIP UP, SMASHING into the soldiers’ faces,  knocking them out. Erik moves the metal barrier with a wave  of his hand, and they drive forward toward the hotel.  INT. MAJESTIC HOTEL - MEETING ROOM - PAST - DAY 74   74  The Generals look at Trask’s presentation.  53.",
      "characters": [],
      "action_text": "RUSSIAN GENERAL  You would betray your country by  selling this weapon to us?   *  TRASK  I’m a man of the world, General. 74   74  The world I see is not a world of   *  nations and borders, but a world of  man and mutant. And there’s only  one way to retain our place atop  that world...  The image on the screen clicks to BLUEPRINTS for SENTINELS.  TRASK (CONT’D)  I call them Sentinels. Named for  the ancient guardians who stood at  the gates of the citadel. They have  the aeronautic abilities of a  Harrier Jet, and fire a particle-   *  beam that can burn through ten feet   *  of concrete. Their skin is   *  lightweight, made of the same   *  indestructible polymer that NASA  uses for their space program, not   *  an ounce of metal in it...   *  The Generals look impressed. Trask continues--  TRASK (CONT’D)  But   none   of that is what makes the  Sentinel so special. Size, power,  speed, you can find that at  Lockheed or Boeing. No, what makes  the Sentinel so special is the  ability to   target the Mutant X  gene . A genetic guidance system...  He pulls out a small, handheld GUIDANCE SYSTEM.   *  TRASK (CONT’D)  ...that can lock onto a mark from  half a mile away, and won’t trigger  unless it identifies the target. So   *  there won’t be any human collateral  damage, the system couldn’t even  activate in here...  But suddenly -- BEEP BEEP BEEP. The device is FLASHING. Trask  slows, looks up.  TRASK (CONT’D)  ......unless there was a mutant.  54. It targets: GENERAL LUONG.   *  As Trask steps toward him, the beeps get louder. General   *  Luong looks around, trapped.   *  GENERAL LUONG   *  There’s been some kind of mistake.   *  Trask glances at Bill, who pulls out that familiar TASER   *  WEAPON from Saigon.   *  TRASK   *  My machines don’t make mistakes...   *  The beeps turn into a flatline.   *  TRASK (CONT’D)   *  What are you...?   *  The General glances around, makes a decision, and--   *  TRANSFORMS INTO RAVEN. Blue scales, yellow eyes.   *  RAVEN   *  ",
      "dialogue_count": 0,
      "word_count": 2046
    },
    {
      "scene_number": 11,
      "slugline": "INT. MAJESTIC HOTEL - MEETING ROOM - PAST - DAY   *  Charles braces, as Logan reaches the shattered window, the   *  sun hits his face, and--   *  His eyes come back into focus, his older consciousness   *  restored. He sees the wreckage outside. Then looks back.   *  LOGAN   *  We need to get out of here,   *  Charles.   *  Charles nods, realizes Logan is back. As they leave together,   *  we hold on the window, the wreckage, a city, a world that   *  will never be the same again.   *  INT. MONASTERY - INNER SANCTUM - FUTURE - DAY   *  Kitty looks up at the group, weakened.   *  KITTY   *  I...I don’t know how much longer I   *  can...hold him.   *  Bishop stands with Xavier and Magneto, his voice low--   *  BISHOP   *  If he wakes up, history is set, and   *  we’re done.   *  They all look back at Kitty. Storm changes the tourniquet,   *  the cloth heavy with blood.   *  Magneto looks at Xavier, their fate more uncertain than ever.   *  REPORTER (V.O.)   *  Today was meant to be an historic  day, the end of a long war. But  history was made for another reason  altogether...  NEWS FOOTAGE PLAYS, IMAGES OF RAVEN, BEAST, ERIK.   *  REPORTER (V.O.)   *  The Paris Peace Summit was rocked  by the appearance of unidentified  assailants, the likes of which this  world has never seen...  INT. FAMILY HOME - PAST - NIGHT 93   93  A FAMILY huddles around a TV in China.  62.",
      "characters": [],
      "action_text": "REPORTER 2 (SUBTITLED)  Some experts are saying we may be  looking at a new species of  primate, perhaps the missing link  between monkey and man...  EXT. CITY STREET - PAST - DUSK 94   94  A CROWD gathers around a screen in Madrid.  REPORTER 3 (SUBTITLED)  Others are claiming this may be  some kind of extra-terrestrial.  EXT. PARIS STREETS - PAST - NIGHT 95   95  The REPORTER stands outside the hotel.  REPORTER  Here in Paris, the police have told 95   95  everyone to stay off the streets  until they have more information.  And so a day that was meant to be a  celebration of peace, hope, and  security...has turned into a day of  fear, terror, uncertainty. All of  us asking the same question: what  did we witness here today? And are  there more of them out there...?  The images FREEZE on a screen in--  INT. WHITE HOUSE - OVAL OFFICE - PAST - DAY 96   96  The room is PACKED with the nation’s most powerful men. At  the desk sits: PRESIDENT RICHARD NIXON. He looks tired,  stressed, it’s been a rough year.  NIXON  Fuck   me . What the hell are we  dealing with here?  SECRETARY OF DEFENSE  Two days ago, this man, Erik  Lensherr, escaped from a maximum  security prison inside the  Pentagon.  IMAGES flicker of ERIK in Paris, and the aftermath of the  Pentagon.  63. SECRETARY OF DEFENSE (CONT’D)  The official statement is that we  had a gas leak under the courtyard  with no major injuries. We managed  to contain the story--  NIXON  But not the threat.  In the shadows, we see TRASK.  SECRETARY OF DEFENSE  No sir. We believe this woman is a  former associate of Lensherr’s.  They were in Cuba together the day  of the Crisis in ‘62, and he was  implicated in Kennedy’s killing.  GENERAL  We don’t know what they’re planning 96   96  but we do know conventional weapons  are not enough.   *  Nixon motions to an image of BEAST.  NIXON  And what about this thing?  GENERAL  We don’t know what that   thing   is,  sir.  Nixon sits back in his chair, shakes his head.  NIXON   *  So what ",
      "dialogue_count": 0,
      "word_count": 5779
    },
    {
      "scene_number": 12,
      "slugline": "INT. XAVIER MANSION - BLUE HALLWAY - FUTURE - NIGHT 139   139  Magneto and Bobby emerge, dropping into the old, familiar   *  BLUE HALLWAYS. Only now the halls are dark, spooky, with  panels missing and wires dangling from the ceiling.  Magneto and Bobby march down the long hall, past the  elevator, reaching the familiar doors of   CEREBRO .  Magneto raises his hand, OPENS the metal doors, and--  INT. XAVIER MANSION - CEREBRO - FUTURE - NIGHT 140   140  They enter the massive chamber to see it has been transformed   *  into a high-tech LAB.  ROGUE lays on an operating table at the end of the walkway.  Wires and sensors cover her body. A few DOCTORS are gathered  around Rogue. They turn to see--  Magneto and Bobby entering. Magneto darkens.  MAGNETO  I’ve been on that slab before. Let  me show you how it feels.  He raises a hand. ALL THE MEDICAL SUPPLIES AND TOOLS WHIP UP   *  TOWARD THE DOCTORS, drills and saws flying at them and--   *  WHHM. They FREEZE in mid-air. Millimeters from their faces.   *  Blades shimmering, hanging, with Magneto beyond them.   *  BOBBY   *  You should leave.   *  The doctors flee. The metal tools drop to the ground.   *  Bobby rushes to Rogue, pulls the plugs from her. Her eyes   *  flutter, semi-conscious. She looks up and sees--   *  ROGUE  Bobby...am I...dreaming...?  BOBBY  Nightmare’s over, Rogue.  He wraps her in the operating sheet so he can carry her  without touching her skin. They head out to--  INT. XAVIER MANSION - BLUE HALLWAY - FUTURE - NIGHT 141   141  Magneto leads Bobby and Rogue down the hall toward their   *  exit. As they pass the elevator, we see:   *  88.",
      "characters": [],
      "action_text": "It is MOVING, HEADING DOWN.   *  INT. X-JET - FUTURE - NIGHT 142   142  Xavier’s eyes narrow, sensing--   *  XAVIER  Erik. Erik, get out of there now.   *  INT. XAVIER MANSION - BLUE HALLWAY - FUTURE - NIGHT 143   143  DING! Magneto, Bobby, and Rogue turn to see--   *  The elevator opens, and...a DARK MASS emerges. Black scales  unfold, twisting into the form of--   *  THREE SENTINELS.   *  Magneto rushes Bobby and Rogue toward their escape, as--   *  The Sentinels come loping toward them, picking up speed.   *  Magneto, Bobby, and Rogue race through the hole in the   *  ceiling. Magneto reaches back and FUSES THE HOLE SHUT.   *  The Sentinels SMASH into it, BANGING from the other side. The   *  floor CRACKS, starts to buckle, as--   *  INT. XAVIER MANSION - OLD TUNNELS - FUTURE - NIGHT 144   144  Magneto, Bobby, and Rogue race down the old tunnels, heading  back the way they came. Behind them--  BANGBANGBANG! The Sentinels SMASH THROUGH THE FLOOR. They   *  rise up into the tunnel, giving chase.   *  Bobby reaches back and FIRES,   FILLING THE TUNNEL WITH ICE  BEHIND THEM .  The Sentinels CRASH into the wall of ice, CRACKING IT, but  Bobby keeps firing, putting up more and more layers.  BOBBY  Take her!  Bobby extends Rogue toward Magneto. Magneto takes her. He 144   144  keeps moving toward the end of the tunnels, as--  Bobby keeps firing ice the other way, but--  The Sentinels CRASH through the ice faster than he can fire.  He uses all his strength to hold up the wall.   *  89. Magneto and Rogue reach the end of the tunnel, the ladder.  They look back and see--  Bobby has fallen behind. He strains to hold the ice wall   *  solid. The Sentinels FIRE their ENERGY into it, MELTING it.   *  It’s just a matter of seconds till they come through.   *  ROGUE  Bobby!  He looks back, too far to reach. He smiles, with one arm  still firing ice.  BOBBY  Go.   Finish   this.  Rogue’s eyes fill with tears, as--  The Sentinel BEAM comes through the ice. Bobby goes FULL   *  ICE",
      "dialogue_count": 0,
      "word_count": 1097
    },
    {
      "scene_number": 13,
      "slugline": "INT. XAVIER MANSION - HALLS - PAST - NIGHT 150   150  Two feet move through the halls...into the elevator...down  underground to...CEREBRO. The door scans the figure.  CEREBRO VOICE  Welcome Professor.  INT. XAVIER MANSION - BLUE HALLWAY - PAST - NIGHT 151   151  The doors open, revealing: CHARLES. Standing again.   Walking .  But as he enters Cerebro--  HE TRANSFORMS INTO RAVEN. She goes to the controls for  Cerebro. She opens them up, pauses for a moment.  RAVEN  I’m sorry, Charles.  And she DESTROYS CEREBRO, ripping the cables apart,  SHATTERING THE HELMET. It crashes to pieces.  Raven walks away, with Cerebro dying, sparking behind her. As   *  she departs--  EXT. MONASTERY - FUTURE - DAWN 152   152  The X-JET returns, landing in the courtyard.  INT. MONASTERY - INNER SANCTUM - FUTURE - DAY 153   153   *  Magneto, Xavier, and Rogue move fast. Storm and Bishop turn,   *  see them. Kitty looks up weakly.   *  KITTY  Where’s...Bobby...?  Rogue looks back at her, emotional.  ROGUE  I’m sorry, Kitty.  Kitty sinks back, all her energy starts to fade, but--  Rogue grabs Kitty’s wrist. Kitty’s skin goes pale, veins 153   153  bulging, as   ROGUE TAKES HER POWER .  The energy surges through Rogue into Logan. We PUSH INTO his  face as the light flares around him and--   *  INT. XAVIER MANSION - LOGAN’S ROOM - PAST - DAWN 154   154  Logan takes a huge gasp, as he snaps awake. He rises from  bed, gathers his senses. And hears:  92.",
      "characters": [],
      "action_text": "FOOTSTEPS pounding down the hall. He goes out to see--  INT. XAVIER MANSION - HALLWAY - PAST - DAWN 155   155  Hank moves quickly down the hall, clearly troubled.  LOGAN  Hank... Hank? What’s going on?  He trails Hank, who pushes through the door to--  INT. XAVIER MANSION - XAVIER’S OFFICE - PAST - MORNING 156   156  Hank enters. Charles looks up, immediately sensing--  CHARLES  She’s gone.  INT. XAVIER MANSION - CEREBRO - PAST - MORNING 157   157   *  The door opens, the wheelchair rolls in, with Logan and Hank  behind Charles. They go to Cerebro and see:  It is destroyed.  Hank tries to turn on the power, but it’s dead, wires still  sparking. Charles looks around.   *  CHARLES   *  We can’t track her now.   *  But Logan steps up.   *  LOGAN   *  We know where she’ll be.   *  They look at him.   *  LOGAN (CONT’D)   *  Washington. Trask will be there.   *  Out in the open. That’s where   *  she’ll make her move.   *  Charles nods, quiet--   *  CHARLES   *  In front of the whole world.   *  LOGAN   *  Hank, get the jet ready.   *  But Hank doesn’t move.   *  93. HANK   *  What if Erik’s there?   *  LOGAN   *  I’ll take care of Erik. Just get   *  the jet.   *  Hank shakes his head.   *  HANK   *  It’s made of   metal . If he sees us   *  in that thing, he could crush it   *  like a tin can.   *  LOGAN   *  Fine. I’ll drive. Five minutes,   *  outside.   *  INT. XAVIER’S ROOM - BATHROOM - PAST - DAY 161   161   *  Charles splashes water on his face, readying himself. He runs  a hand through his hair, notices--  A few strands of hair coming out, he sees more in the sink.   *  He looks into the mirror, a little unnerved.  LOGAN (O.S.)   *  Things will change.   *  Charles looks back, sees Logan stepping into the doorway.   *  LOGAN (CONT’D)   *  After today, the future is gonna be   *  different.   *  He takes a step closer.   *  LOGAN (CONT’D)   *  But I want you to promise me   *  something. No matter what happens   *  today. Promise me one thing   won’t   *  change..",
      "dialogue_count": 0,
      "word_count": 2084
    },
    {
      "scene_number": 14,
      "slugline": "EXT. CAPITOL BUILDING - PAST - DAY   *  FIVE SENTINELS COME FLYING OVER THE CAPITOL.   *  The crowd looks up, seeing these massive machines:   *  EIGHTEEN FEET TALL. Polymer bodies. Deadly.   *  The SENTINELS fly toward Erik, but when they reach him, they   *  suddenly--  FREEZE . Hovering around him.  EXT. WASHINGTON DC NATIONAL MALL - PAST - DAY 177   177  Trask and Bill are rushing with the Secret Service toward the  motorcade, but Trask slows, confused.   *  TRASK  What are they waiting for?! Why   *  aren’t they firing?!   *  BILL   *  They should have fired already! I  don’t know what’s wrong!  The Sentinels TURN OUTWARD, toward the crowd, the city.  Erik gives a cold smile.   *  ERIK  They answer to a higher power now.  He controls them .   *  Trask sees it, stunned. Charles, Logan, and Hank watch.  CHARLES  Don’t do this, Erik.  But Erik can’t hear his voice. He controls a NEWS CAMERA, 177   177  which floats toward him. He looks into the camera.  ERIK  I have a message for your  President: these weapons you built  to destroy us will bring about your   *  own destruction. Your monuments  will soon make way for ours.  (a beat)  We are the future now. Not you.  101.",
      "characters": [],
      "action_text": "With that, he controls the Sentinels in the sky,   turning them   *  against the humans . As the crowd flees, the President and  Trask are pushed into the motorcade, racing away.  Charles looks up, as the Sentinels begin their attack on   *  Washington. And we CUT BACK TO--   *  EXT. MONASTERY - WALLS - FUTURE - NIGHT 179   179  Storm’s eyes are white, the wind blows, but--   *  The SENTINELS start to push through the hurricane, too strong   *  to stop. The mutants all brace for battle.   *  BISHOP   *  READY! HOLD THIS WALL!   *  The first line of Sentinels ATTACKS, clashing with the mutant   *  army as we CUT BACK TO--   *  EXT. DC NATIONAL MALL - PAST - DAY   *  The Sentinels attack the city, all orchestrated by Erik.   *  Logan and Hank move through the mayhem. Charles searches   *  faces and minds, but there’s too much chaos.   *  In the action, we see a couple familiar faces:   *  A few of the MUTANT SOLDIERS FROM SAIGON. They use their   *  powers against the Sentinels, try to help people.   *  As the attack continues, we INTERCUT--   *  THE MONASTERY IN THE FUTURE   and   NATIONAL MALL IN THE PAST .   *  Both under siege by a deadly pack of Sentinels.   *  Logan sees SHRAPNEL flying toward a pack of people. He steps   *  in the way, takes the shrapnel to his back, saving them. He   *  winces, healing, and he catches a glimpse of--   *  A SECRET SERVICEMAN rushing to a follow-vehicle for the   *  Presidential motorcade. The Serviceman has a familiar LIMP.  He sees Logan through the crowd. Their eyes lock for a  moment, and the Serviceman’s eyes FLICKER YELLOW. It’s RAVEN.  He leaps into the car with the other Serviceman, and they  take off, trailing the motorcade toward the WHITE HOUSE.  LOGAN  I got her!  102. Logan makes his way back to Charles. Hank joins them.  LOGAN (CONT’D)  She’s in the President’s motorcade. 180   180  They’re heading to the White House.  ACROSS THE MALL:   *  Erik sees the motorcade taking off. He gathers the Sentinels   *  into form",
      "dialogue_count": 0,
      "word_count": 2191
    },
    {
      "scene_number": 15,
      "slugline": "EXT. MONASTERY - COURTYARD - FUTURE - NIGHT 197   197   *  Magneto hits the ground with bone-crushing impact. He tries   *  to rise, as the Sentinels swarm forward.   *  EXT. WHITE HOUSE - PAST - DAY   *  Erik focuses on Hank, hanging there with arms and legs drawn   *  apart by the cuffs.   *  ERIK   *  I’ll never understand it. You fight   *  for your own extinction.   *  Hank strains, pained, just able to say--   *  HNK   *  I’m...fighting...for...her.   *  The words resonate with Raven. She looks at Hank. She sees   *  Charles sitting helpless. She looks at the gun in her hand.   *  Erik starts to pull Hank apart, his blue flesh stretching.   *  ERIK   *  You think there’s a world where you   *  two could live the way you were   *  made? You think they’ll ever see   *  you as anything but a Beast...?   *  Hank can’t answer, too pained, dying. But they hear--   *  VOICE (O.S.)   *  Yeah, I do.   *  It’s RAVEN’S VOICE.   *  She’s right behind Erik. He turns as--   *  RAVEN RIPS HIS HELMET OFF HIS HEAD, EXPOSING HIM TO--   *  RAVEN   *  CHARLES!   *  Erik reaches for her throat but--  Charles reaches out from the ground--   *  FREEZING ERIK.  Hank drops, the cuffs fall lifeless, and--  Charles focuses his power on Erik’s mind, using Erik to--  109.",
      "characters": [],
      "action_text": "CONTROL THE SENTINELS .  CHARLES MAKES THE SENTINELS RAISE THEIR HANDS-- 207   207   *  AIMING AT EACH OTHER . They blast each other, EXPLODING,   *  raining down to the ground, landing harmlessly around the   *  White House Lawn. As they crash to earth--   *  INT. MONASTERY - INNER SANCTUM - FUTURE - NIGHT   *  Magneto crashes through the doors. The mutants look up.   *  He HURLS everything metal against the doors. It all goes   *  flying into the doors, fusing together to form the FINAL   *  BARRIER. As the Sentinels start BANGING on those doors--   *  EXT. WHITE HOUSE - PAST - DAY 209   209   *  The Sentinels lay in smoking ruins. Sirens blare, soldiers   *  surface, incoming. Erik has just enough power to speak--   *  ERIK  If you let them...have me...I’m as  good as dead.  Charles nods, knows it’s true. He looks out and--  FREEZES EVERYONE IN THE MALL . The soldiers, civilians. The  entire mall is frozen around them.  CHARLES  Unlike you, I don’t kill my  enemies.  ERIK  Is that what we are now? Enemies..?  Charles looks at Erik, and UN-FREEZES him.  CHARLES  That’s up to you, Erik.  (motions to helmet)  But we’ll hold onto that, just in   *  case.  Erik steps toward Charles, as--   *  INT. MONASTERY - INNER SANCTUM - FUTURE - NIGHT 212   212   *  Xavier comes to Magneto, holds him in the corner. His old   *  friend is dying. The Sentinels keep banging on the doors.   *  110. MAGNETO  All those years fighting each  other. What I wouldn’t give for a  precious few of them back.  Xavier looks at his old friend, emotional. 212   212  XAVIER  Perhaps we’ll have a second chance.   *  Perhaps we all will.   *  He looks toward Colossus, Kitty, Rogue. And--   *  BOOM. The Sentinels CRASH THROUGH THE DOORS. They attack the   *  last lien of mutants.   *  EXT. WHITE HOUSE - PAST - DAY 213   213  With the world frozen around them, Erik steps up to Charles.   *  Hank and Raven are there.   *  ERIK   *  How do you know they won’t come for   *  her? How do you know she won’t ",
      "dialogue_count": 0,
      "word_count": 1152
    },
    {
      "scene_number": 16,
      "slugline": "INT. HALLWAY - FUTURE - DAY 221   221   *  The hallway is instantly familiar. The wood panelling of--  THE XAVIER MANSION. 221   221  Logan walks down the hall, the world hazy around him. He  drifts forward, the house teeming with life, students.  He passes STORM, alive. She is going over a textbook with a   *  STUDENT. Logan keeps moving, reeling, trying to focus.   *  He passes a CLASSROOM, where he sees a grown-up BEAST  teaching biology class with MYSTIQUE. Both of them blue.  Logan keeps going, catching a glimpse of KITTY and COLOSSUS  walking hand-in-hand. And he sees...  BOBBY and ROGUE, just a hazy shot from behind. Perhaps we  notice that Rogue no longer has the white streak in her hair.  Logan is finally snapped into focus by a voice, a voice he  hasn’t heard in many years--  VOICE (O.S.)  Logan...Logan...?  He turns, sees--  JEAN  Logan, are you okay...?  JEAN GREY stands there, alive.  LOGAN  Jean...you’re...here.  JEAN  Where else would I be?  He has no answer. He just drifts toward her, raises a hand to  her face, as if to make sure she’s real, and--  Logan’s wrist is GRABBED by--  SCOTT  Whoa, easy pal.  Logan turns, sees SCOTT “CYCLOPS” SUMMERS, territorial as  always. Logan gathers himself.  LOGAN  Guess some things never change.  114.",
      "characters": [],
      "action_text": "He smiles.  LOGAN (CONT’D)  It’s good to see you, Scott.  Scott is surprised by the sentiment. 221   221  JEAN  Logan, is everything alright...?  Logan looks at her, looks at the school.  LOGAN  Yeah...yeah...  (with meaning)  I think it is.  A moment, a look between them, and--  XAVIER (O.S.)  Let’s get to class, people.  They turn. PROFESSOR XAVIER comes down the hall.  XAVIER (CONT’D)  Wouldn’t want to be late. Time   *  waits for no man...or mutant.  They head to their respective classes. Logan watches them go,   *  the X-MEN back together. He smiles, quietly--   *  LOGAN   *  You made good on your promise.   *  Charles looks over at him.   *  XAVIER   *  Logan, don’t you have a class to  teach?  LOGAN  A class. To teach.  XAVIER  History.   *  Logan gives a wry smile.  LOGAN  Actually, I could use a little help   *  with that.  XAVIER  What exactly do you need help with?  115. Logan looks at him.  LOGAN  Pretty much everything after 1973.  Xavier slows, looks at Logan, seeing into his mind. FLASHES  of another life, another path.   *  XAVIER   *  That’s quite a lot to cover.   *  LOGAN   *  I’ve got time.   *  Xavier gathers himself, nods.   *  XAVIER 221   221  Well then, let’s begin...   *  They start to head off together, these two silhouettes moving   *  away from us. As they walk into the sunlight--   *  XAVIER (CONT’D)  What’s the last thing you  remember...?  We transition back to SUNLIGHT SLASHING THROUGH TREES IN--   *  EXT. DC WOODS - PAST - DAY 222   222  Logan’s body lays in the woods. A pack of SOLDIERS finds him.  They check his vitals.  SOLDIER  We got him. He’s alive, sir.  They turn to see: BILL emerge. He looks at Logan.  BILL  Amazing...the damage he took...just  amazing.  Logan’s eyes flutter open, semi-conscious, in pain. Bill   *  leans over him, shines a light in his eyes.   *  BILL (CONT’D)   *  Do you know where you are?   *  LOGAN   *  No.   *  BILL   *  Do you have any idea what happened   *  to you...?   *  116. Logan looks up, hazy.",
      "dialogue_count": 0,
      "word_count": 821
    },
    {
      "scene_number": 17,
      "slugline": "EXT. CRASH SITE - PAST - NIGHT 227   227  Erik moves toward the crash site. He looks down into the  smoking crater, and sees--  An ALIEN FORM rising out of it. Towering, terrifying, with a  twisted metal face and dark pits for eyes. This is:  APOCALYPSE.  APOCALYPSE  I have crossed rivers of time to  find you.  Their faces are close. Erik is stunned.  ERIK  Who are you?  Apocalypse leans forward.  APOCALYPSE  I am...your future.  Apocalypse MERGES with Erik, power coursing through his body.  Erik SCREAMS, the energy blasting out of him, shockwaves  slamming into the mountains in every direction--  LEVELLING THEM   with a power greater than any we’ve witnessed.  Erik slowly looks out, sees he’s standing in the middle of a  BLAST RADIUS that stretches for   MILES .  His eyes flicker, sensing the possibilities. A smile starts   *  to curl his lips, as we--  CUT TO BLACK.   *  118.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 150
    }
  ]
}