{
  "slug": "yellowstone-101-daybreak-2018",
  "title": "yellowstone 101 daybreak",
  "genre": "thriller",
  "format": "series",
  "scenes_count": 7,
  "characters_count": 0,
  "characters": [],
  "total_words": 16032,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. CORY’S TRUCK -- LATER. TRUCK’S POV -- CHICKENS. Run single file across the road toward a rotted, plywood coop beside a house that’s been abandoned for years Cory looks out the window at the reality of reservation life: -- A mobile home sits bent and twisted like a plastic cup tossed in a fire. Old appliances, rusted vehicles, and broken farm equipment litter the land around it ... -- A house with no roof, its walls covered in graffiti ... Cory passes three TEENAGE BOYS. Two ride OLD BICYCLES, one rides bareback on A SKINNY PAINT HORSE. They’re dressed like gangbangers from LA: baggy pants, OAKLAND RAIDERS caps cocked to the side. The boy on the horse holds a radio the size of a toolbox, HIP HOP blaring through blown speakers ... Up ahead is a SINGLE-WIDE MOBILE HOME. MEN stand shirtless in the yard, tending to a large fire with shovels. Beside the fire is A SWEAT LODGE COVERED IN BLANKETS. Beside the sweat lodge is A FLAG POLE REACHING 30 FEET IN THE AIR -- AN AMERICA FLAG whips in the breeze, flying UPSIDE DOWN. The men look at Cory as he passes, the trailer rocking back and forth as the stallion tries to kick his way to freedom. Cory glances at the upside down flag in his rearview mirror -- the international symbol for distress ...   *  Cory slows and turns down a gravel road, pulls to a stop in   *  front of a single-wide trailer.   Across from it -- a small barn, couple of corrals, and a round pen. Beyond that -- buffalo grass and sagebrush. Cory swings open the back of the horse trailer, leads out his ranch horse. Ties him to the fence. Looks in the trailer... CORY’S POV -- AN ALUMINUM DIVIDER hides the stallion. The horse raises its head over the divider -- a wild eye makes contact with Cory. TATE (O.S.) DADDY!!! Cory’s son TATE(4) explodes from the house, runs toward him. Cory scoops him up. Tate’s eyes are blue like his daddy, but his hair is dark and skin the color of caramel. Like the woman now standing on the porch ...  Blue (mm/dd/yyyy)   7.",
      "characters": [],
      "action_text": "MONICA(25) Fierce eyes in a kind face and a calm, easy   *  demeanor in stark contrast to the harsh land that surrounds them. HOOVES EXPLODE INTO METAL. Her attention goes to the trailer. The noise attracts CHILDREN from the neighboring homes ...   *  MONICA Bet it was fun putting him in the trailer. CORY Like hauling a tornado. All the neighborhood children now stand around the trailer.   *  MONICA   *  How are you going to get him   out ? Cory hands Tate to Monica. CORY I’m making this up as I go, babe.   *  Walks to the round pen and swings the gate open.   *  CORY (CONT’D) I’d step back a bit further. Monica steps back. The children rush back like scared dogs,   *  then slowly creep forward, too fascinated to stay away.   *  Cory climbs in the trailer, walks SLOWLY TOWARD THE DIVIDER   *  AND THE WILD EYE LOOKING OVER IT ... CORY (CONT’D) It’s okay. I know it don’t feel   *  that way. But it is ... Cory reaches over the divider and grabs the halter with one hand. Other hand unties the lead rope. He unlatches the divider, swings it open and all hell breaks loose ... MONICA’S POV -- The trailer rocks so hard it almost flips over. The sound of 1200 pounds stomping toward the back of the trailer thunders toward her. One leg appears, then another, then the horse backs out and rears up on its hind legs and screams. Cory swings the rope in a fast loop inches from the horse’s nose. It drops to all fours and backs away wildly.  Blue (mm/dd/yyyy)   8. Cory drives the horse into the round pen. Slides his hand beneath the horse’s chin and in an instant, lead rope is disconnected from halter. The horse bolts for the opposite side of the pen. Cory walks out and closes the gate ... TATE Can I pet him? MONICA Sure, son. In about a year. Cory laughs. CORY No fear in this one. He got that from you. MONICA You mean no common sense. He got that from you.   *  TWO NATIVE AMERICAN MEN walk over. ROBERT LONG(35), built   *  like an NFL safety, with hard, uncaring eyes. And SAM YELLOW ",
      "dialogue_count": 0,
      "word_count": 2148
    },
    {
      "scene_number": 2,
      "slugline": "EXT. YELLOWSTONE LODGE -- DAWN. Across from the lodge is a barn. HORSES STAND TIED TO HITCHING POSTS. COWBOYS SADDLE THEM. BOOTS FIND STIRRUPS. COWBOYS MOUNT. ADJUST THEIR TACK. ADJUST THEMSELVES IN THE SADDLE. A HELICOPTER SITS ON A PAD. ITS ROTORS WHIRL TO LIFE ... Jamie steps out on the porch as his father walks toward the chopper. JAMIE DUTTON I told them no. I said you wouldn’t consider it ... Should you consider it? Absolutely. We could use the money, and the leverage that comes with it. LEE DUTTON(45) WALKS TOWARD JOHN DUTTON. 6’3” if he’s an inch. The man looks hard, but somehow still kind. LEE DUTTON You’re not coming?   *  JOHN DUTTON I got a meeting in Bozeman ... Wear   *  your badge. Take a rifle. LEE DUTTON They won’t give us any trouble over strays. Hell, they usually help us round them up ... JOHN DUTTON Badge is for the ranchers riding with you. It’ll keep them from bringing home any extras. Lee heads for the house. Walks past Jamie who is still staring at his father. JAMIE DUTTON ... Did you hear me? JOHN DUTTON Leverage is knowing if someone had   *  all the money in the world ... This is what they’d buy. JOHN DUTTON walks to the chopper. Climbs in. It rises ... EXT. CENTRAL MONTANA PLAINS -- DAY. SUNLIGHT reflects off the WINDSHIELDS OF CARS filling the parking lot of THE PRAIRIE CASINO AND HOTEL ...  Blue (mm/dd/yyyy)   15.",
      "characters": [],
      "action_text": "CAMERA HOVERS OVER THE PARKING LOT -- TENTS AND TEEPEES form a giant square. Inside the square, NATIVE AMERICAN DANCERS bounce and spin WEARING OUTFITS comprising every color in the spectrum. Looks like a rainbow tornado swirling angrily on the asphalt ... DANCERS SWIRL AND SPIN AND CHANT IN A FRENETIC CIRCLE. MEN SIT AROUND DRUMS THE SIZE OF BIG SCREEN TV’S AND POUND THEM WITH 3 FOOT LONG DRUMSTICKS ... Chants and drums and shrill singing create a chaotic, almost violent sound that can’t really be called a song. More like a riot with rhythm ... INT. INDIAN CASINO OFFICE -- CONT. PLUSH COUCHES. MAHOGANY DESKS. A WALL OF GLASS overlooks the floor of a CASINO, offering a view of countless truckers and tourists losing money by the millions. THOMAS RAINWATER(38), NATIVE AMERICAN, short hair perfectly parted, wears a ZEGNA SUIT. Looks more like an investment banker than Chief of an Indian Nation. He stares through tinted glass at the Pow Wow three stories below ... TRIBAL COUNCIL MEMBERS huddle together. Speak in whispers, glance at Rainwater and nod in unison -- as if his very presence is the answer to every question they ask. A TRIBAL POLICE OFFICER stands in the corner swinging a SMUDGE POT -- a coffee can with wire handles filled with burning cedar, spreading smoke that keeps the devil away ... A KNOCK AT THE DOOR ... A TRIBAL OFFICER opens it -- US   *  SENATOR DIANA HUNTINGTON(45), perfect suit and hair of a politician, face hardened by decades of indignation, stands with an army of aides. HUNTINGTON Sorry for being late. I wanted to   *  see the reservation first. Rainwater shakes her hand, guides her to a long, leather sofa. She sits. He removes his jacket and lays it across the back of a chair. He stands across from her as two NATIVE AMERICAN WOMEN carry over a WAR BONNET, TWO ROWS OF EAGLE FEATHERS DRAPING TO THE GROUND. He lowers his head and they fit it to him. RAINWATER Did you enjoy the tour, Senator?  Blue (mm/dd/yyyy)   16. HUNTINGTON No, I did not. RAINW",
      "dialogue_count": 0,
      "word_count": 2237
    },
    {
      "scene_number": 3,
      "slugline": "INT. BOZEMAN CONVENTION CENTER -- EVENING.   *  AN AMERICAN FLAG FILLS THE FRAME. A chorus of CHILDREN’S   *  VOICES sings the National Anthem.   *  WIDEN TO REVEAL --   *  A stage filled with a CHILDREN’S CHURCH CHOIR. Beyond the   *  stage is a dirt arena. The stands are scattered with   *  RANCHERS, grey hair and bald heads exposed as they hold hats   *  to hearts and mouth the words ... Anthem ends. An AUCTIONEER   *  walks to a podium. Leans into a microphone.   *  AUCTIONEER   *  Lot 1 of the 2015 Spring Sale is a   *  satellite offering from the King   *  Ranch. 1000 replacement heifers   *  located in Dillon.   *  A VIDEO FEED OF CATTLE APPEARS ON MONITORS.   *  JOHN DUTTON YANKS OPEN CONVENTION CENTER DOORS, WALKS INSIDE. AUCTIONEER (CONT’D)   *  They come 5-way and Bangs   *  vaccinated. Average weight is 600.   *  Bidding starts at 1100 ...   *  John Dutton marches toward GIANT OAK DOORS in the center of the coliseum. SIGN ABOVE THEM READS -- CATTLEMEN’S CLUB. John Dutton yanks that door open as well ... INT. CATTLEMAN’S CLUB -- CONT.   *  The stands are for the ranchers, but the club is for the   *  cattlemen. Leather sofas and chairs. MONITORS display the   *  auction. WAITERS weave through the packed room of the   *  ranching world’s elite -- Technology giants, oil men, and   *  celebrities dressed in their cowboy-best crowd the room, but   *  the front row is filled with men who look like they should be   *  herding cattle rather than buying them.   *  John Dutton blasts through the doors. JAMIE sits at the bar with a gaggle of POLITICIANS. Leaps from his barstool and rushes to his father as he walks ... JOHN DUTTON We have any legal recourse on Reservation land?  Blue (mm/dd/yyyy)   24.",
      "characters": [],
      "action_text": "JAMIE DUTTON Civil maybe. But if you’re talking prosecution we need friends in the US Attorney’s office. JOHN DUTTON Then make some. John Dutton walks to the front row. Finds a seat marked RESERVED. Tears away the tape and sits. Beside him is TRENT   *  WILLETT(55), sun-cracked face, beat-to-shit hat.   Looks at   *  John Dutton and shakes his head ... WILLETT   *  I wouldn’t wish the week you’re having on my mother-in-law. JOHN DUTTON   *  (Nods) And it’s only Tuesday ... A MURMER rises from the crowd. GOVERNOR LYNELLE PERRY(55)   *  moves through the club, shaking hands and emitting an   *  infectious laugh that energizes the room. John Dutton watches   *  as she reaches a gaggle of young POLITICIANS, Jamie among   *  them. He shakes the Governor’s hand and points to his father.   *  Governor Perry leaves her entourage and walks toward him.   *  DIRK (O.S.)   *  John?   *  John Dutton looks to the voice: DIRK HERSTROM(75). Decades of   *  kneeling over crops have curled his spine the shape of a   *  question mark. He stares at John Dutton, wrinkled hands   *  crushing the brim of his hat.   *  JOHN DUTTON   *  This is NOT the day, Dirk.   *  DIRK   *  But word is your hiring -- JOHN DUTTON   *  Cowboys. Not criminals. Dirk looks like he may break down in tears.   *  DIRK I can’t stop him. You can. The favor’s to me, not him.   PLEASE.   *  John Dutton looks at the desperate old man and the attention   *  he’s drawing, grabs Dirk’s shirt and pulls him close ...   *  Blue (mm/dd/yyyy)   25. JOHN DUTTON   *  It’s gotta be my way.   *  Relief washes over Dirk. DIRK I remember when your way was the only way. And the world was better for it. Dirk walks off as the Governor reaches John Dutton. Cheeks   *  are kissed affectionately. She sits beside him.   *  GOVERNOR PERRY   *  Jamie did well at the hearing.   *  JOHN DUTTON   *  Easy to do well when the outcome’s   *  been decided.   *  GOVERNOR PERRY   *  I couldn’t hit it if he didn’t tee   *  it up. My offer still sta",
      "dialogue_count": 0,
      "word_count": 1805
    },
    {
      "scene_number": 4,
      "slugline": "INT. JIMMY’S TRAILER -- LATER.   *  Looks like what you’d expect from a 25 year-old career   *  criminal: beer cans litter the ground around a filthy sofa   *  facing a 5000 dollar television. UNOPENED BOXES OF ELECTRONIC   *  EQUIPMENT -- COMPUTERS, COFFEE MAKERS, POWER TOOLS, are stacked along the wall ... Jimmy sits handcuffed in the   *  ‘dining room’ while Rip DOES SOMETHING in the kitchen. Rip   *  walks back in the room, stands over him.   *  RIP   *  You’re a two time loser, Jimmy. One   *  more felony and they toss the key.   *  Rip grabs his face, studies it for a moment.   *  RIP (CONT’D)   *  I’m sure you’ll do just fine in   *  prison. You got the lips for it.   *  Rip walks back in the kitchen. Jimmy’s leg shakes   *  uncontrollably, lip quivers ...   *  JIMMY   *  You’re either a servant or a king   *  in this place, and I ain’t no   *  fucking servant.   *  RIP   *  No, you’re a thief.   *  Rip stands over a gas stove, heating a BRANDING IRON OVER A   *  BURNER. As the iron reaches an angry orange, he walks back to   *  the dining area. One look at the branding iron and Jimmy   *  levitates off the chair and scrambles into the living room.   *  JIMMY   *  WHAT THE FUCK MAN!!??   *  RIP   *  You got two choices: one is I drive   *  you and all this shit to the   *  Sheriff and good riddance to your   *  sorry ass. Or prove you deserve   *  another chance. From what I see,   *  you don’t. But it ain’t up to me.   *  Jimmy looks at the brand -- A Y ENCASED IN A CIRCLE.   *  JIMMY   *  You’re from the Yellowstone?   *  RIP   *  It’s getting cold.   *  Blue (mm/dd/yyyy)   31.",
      "characters": [],
      "action_text": "Beat.   *  RIP (CONT’D)   *  Fuck it, I’m taking you to the   *  sheriff’s --   *  JIMMY   *  WAIT, JUST ... Why would John   *  Dutton give a shit about me?   *  RIP   *  He doesn’t.   *  Rip pulls at the snaps of his shirt, reveals a faded scar of   *  the Yellowstone brand burned into his chest.   *  RIP (CONT’D)   *  But he will.   *  Jimmy stares at the brand, closes his eyes and nods.   *  RIP (CONT’D)   *  Be a man about it. Don’t scream.   *  Jimmy sucks short, fast breaths, grits his teeth, and closes   *  his eyes as the brand presses into his chest. Tears funnel   *  from his eyes as the smoke from his flesh rises into them,   *  but he doesn’t make a sound ... Rip removes the brand and   *  Jimmy falls to the floor. Pulls a jar of BURN CREAM from his   *  pocket, tosses it beside him.   *  RIP (CONT’D)   *  Know where the ranch is?   *  Jimmy manages a nod.   *  RIP (CONT’D)   *  You start Monday.   *  Rip walks out the door without looking back ...   *  EXT. YELLOWSTONE RANCH -- NEXT MORNING.   *  A PICKUP TRUCK inches its way down a muddy two-track road   *  along the river, steam rising from it like smoke.   *  INT. PICKUP TRUCK -- CONT.   *  Lee drives, John Dutton rides shotgun. They sip coffee and   *  study cattle -- Newborn calves stand beneath cows, sucking   *  breakfast. ONE COW STANDS ALONE. No calf beneath her ...   *  Blue (mm/dd/yyyy)   32. JOHN DUTTON   *  Look her up.   *  Through binoculars, Lee studies the yellow tag in the cow’s   *  ear -- 1524, then thumbs through a ledger.   *  LEE   *  Lost one last year too. She’s an   *  old gal. Just turned 11.   *  JOHN DUTTON   *  Get rid of her.   *  Lee makes a note in the ledger, then continues driving.   *  JOHN DUTTON (CONT’D)   *  I needed you at the auction.   *  LEE   *  I was   at   the auction.   *  JOHN DUTTON   *  I don’t mean checking brands.   *  LEE   *  I stand in bullshit 12 hours a day,   *  I won’t listen to it at night.   *  That’s Jamie’s job.   *  JOHN DUTTON   *  You ca",
      "dialogue_count": 0,
      "word_count": 2497
    },
    {
      "scene_number": 5,
      "slugline": "INT. JOHN DUTTON’S OFFICE -- DAY. John Dutton patiently listens to EMMETT WALSH(60) vent. Big Belly, bigger hat. Behind him are A HALF DOZEN WORRIED RANCHERS. Jamie leans against the wall behind his father, arms crossed. WALSH They’re holding our families’ future hostage!! If we lose those cattle -- JOHN DUTTON You won’t lose them. WALSH What’s the governor say? JAMIE DUTTON The dispute is on federal land -- WALSH DISPUTE?! IT’S THEFT! AND IT’S YOUR JOB TO STOP THEM. John Dutton stares at Emmett until the fire leaves his eyes. WALSH (CONT’D) Sorry, John. I just ... JAMIE DUTTON We have livestock agents posted on every road leaving the reservation. Your cattle aren’t going anywhere. JOHN DUTTON They don’t want your cattle. They want to be heard, that’s all. So, we’ll listen. JAMIE DUTTON We invited the tribal council out for a hunt. WALSH ... They steal our cattle and you take them on a ... (Laughs in spite of himself). If you give these bastards an inch, John ... JOHN DUTTON I’m not giving an inch. I’m giving respect. And reminding them we aren’t the enemy.  41.  (MORE)",
      "characters": [],
      "action_text": "In the meantime, hay is being brought to your cattle daily. They will come back fatter and happier than when you turned them out. A KNOCK AT THE DOOR. LEE LEANS IN ... LEE DUTTON We’re ready. John Dutton and Jamie stand. JOHN DUTTON Your cattle are coming back even if I have to go get them myself. You have my word. EXT. ENTRANCE TO THE YELLOWSTONE RANCH -- DAY. Cory’s pickup idles just outside the gate. He stares at the log posts that form the entrance -- A GIANT, IRON ‘Y’ is embedded in the log above the road. TATE What’s the matter, dad? CORY Just hoping I don’t regret this. Cory let’s out a sigh and drives through. EXT. YELLOWSTONE RANCH -- CONTINUOUS. John Dutton, Jamie, and Lee march to saddled horses where Rip and a small army of wranglers wait. The whole Dutton clan freezes at once when they see Cory and Tate standing in the driveway.   *  CORY   *  Thought I’d bring the fix to you.   *  John Dutton does something he never does -- he smiles. Walks to them. Scoops up Tate. JOHN DUTTON Know how to ride a horse? TATE Course I do. I’m Indian.  Blue (mm/dd/yyyy)   42.  JOHN DUTTON (CONT'D) JOHN DUTTON You’re a cowboy today. (To Cory) Thank you for this. John Dutton carries him off. Lee looks at Cory, hard. LEE DUTTON I’ve dated women with shorter hair. CORY You sure they were women? Lee’s hard face cracks into a smile. He turns back to the horses. Jamie grabs Cory’s shoulders, gives them a good shake, turns and walks after Lee ...   *  Cory looks over the ranch -- the pain of seeing it etched on   *  his face. Looks at the lodge and the pain fades into the   *  smile. CAMERA finds the smile’s source -- Beth. She buries   *  him in a hug. Runs her hands across his face, as if she’s   *  trying to re-learn it.   *  BETH   *  Last time I saw you this was high   *  and tight. I knew you’d come back   *  without a scratch.   *  CORY   *  How’s Richard?   *  Beth gives him a look that says: ‘No more Richard’   *  CORY (CONT’D)   *  Good for you.   *  BETH   *  You’re th",
      "dialogue_count": 0,
      "word_count": 5608
    },
    {
      "scene_number": 6,
      "slugline": "EXT. BACK PORCH -- YELLOWSTONE LODGE -- MORNING. John Dutton and a dozen LIVESTOCK AGENTS stand on the porch. Most on cellphones -- damage control in full force. Jamie walks to his father. JAMIE DUTTON State Police are sending out a chopper to look for him. John Dutton looks to the horizon ... JOHN DUTTON I found him. John Dutton is off the porch and on a horse in an instant. Racing in their direction ... John Dutton slides to a stop in front of Cory. Cory looks at his father, sucks pains breaths. Seems more boy than man for just a moment ... John Dutton rides close, says gently -- JOHN DUTTON (CONT’D) Give me the reins. Cory hands the reins to his father. Dismounts. JOHN DUTTON (CONT’D) Go straight to Jamie. Tell him everything. While it’s fresh. Cory walks toward the house. John Dutton looks at Lee slung over the saddle. JOHN DUTTON (CONT’D) Come on, son. Let’s go pick a spot. John Dutton leads Lee’s horse toward a meadow surrounded by ASPEN TREES -- TWO DOZEN DUTTONS HAVE BEEN BURIED HERE. Tombstones from 1869 to just a few years ago are scattered   *  through the meadow. John Dutton pulls Lee’s body from the   *  saddle. Carries him to a nearby tree, lays him down -- cradles his head in his lap ... JOHN DUTTON (CONT’D) We’ll just rest here a bit, how’s that sound ... John Dutton looks over generations of dead. Looks for a spot to plant his oldest son. Sees a YELLOW FINCH, a tiny yellow bird with black wing tips and face. It lands on a carpet of green grass and begins the hunt for bugs. John Dutton looks at. Yes, that’s the place ...  Blue (mm/dd/yyyy)   65.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 295
    },
    {
      "scene_number": 7,
      "slugline": "EXT. PARADISE VALLEY DEVELOPMENT -- MORNING.   *  Dan Jenkins marches through a field that has been dissected WITH SURVEY MARKERS ... BULLDOZERS, EXCAVATORS, AND ROCK TRENCHERS SIT IN PERFECT ROWS. He walks toward them, panic etched on his face. He can’t take it anymore -- panicked walk becomes a run. Reaches the bank of AN EMPTY RIVER -- Pools of stagnant water and dead fish are all that remain. Dan clenches his jaw so tight his teeth might break ... INT. JOHN DUTTON’S OFFICE -- DAY. John Dutton stares at the television, Jamie by his side. A   *  CNN REPORTER GIVES DETAILS OF THE CHAOS AS THE CNN CAMERA   *  MOVES OVER THE BODIES OF DEAD CATTLE AND BODY BAGS ... CNN REPORTER   *  A dispute over cattle between   *  Tribal Police, BLM officers and   *  members of Montana’s Livestock   *  Association turned deadly last   *  night, leaving three men dead. The   *  FBI and Bureau of Indian Affairs   *  agents are investigating two of the   *  deaths as murders, and though   *  jurisdictional issues will   *  certainly complicate the   *  investigation, the US Attorney’s   *  office is pledging every available   *  resource ...   *  John Dutton mutes the TV.   *  JOHN DUTTON   *  What did Cory tell you?   *  JAMIE DUTTON   *  The usual. Nothing.   *  JOHN DUTTON   *  I should’ve seen this coming. JAMIE DUTTON How could you know he wanted the cattle that bad. JOHN DUTTON He didn’t want cattle. He wanted   *  this ...  Blue (mm/dd/yyyy)   66.",
      "characters": [],
      "action_text": "CAMERA PUSHES IN ON THE IMAGES OF DEAD CATTLE AND DEAD MEN ON NATIONAL TELEVISION ... INT. INDIAN CASINO OFFICE -- DAY. THE TRIBAL COUNCIL sit and watch the same aftermath on CNN, whispering opinions and solutions. Senator Huntington watches horrified, hand covering her mouth. Looks at Rainwater. HUNTINGTON I will have a Senate hearing on this next week. You have the full weight of my office behind you. RAINWATER Thank you, Senator. We’ll need it. Rainwater looks at the TV, tries to hide the thin smile curling his lips ... EXT. YELLOWSTONE RANCH -- NEXT DAY. John Dutton sits on the porch, dressed in a suit, watching Tate and a small army of YOUNG BOYS run and play in the yard. Jamie steps out on the porch. JAMIE DUTTON It’s time ... John Dutton walks off the porch where HUNDREDS OF PEOPLE STAND, DRESSED IN BLACK. As John Dutton moves to them, they turn in unison and walk toward the Aspen grove and the precious meadow it guards. EXT. ASPEN MEADOW -- LATER. A MINISTER reads from the Bible as solemn faces stare at the casket hovering over a deep hole. CATTLEMEN, NEIGHBORS, FRIENDS, AND EVEN THE GOVERNOR BOW THEIR HEADS AS THE CASKET IS LOWERED. John Dutton scans the crowd for Cory. Doesn’t find him ... John Dutton closes his eyes, and faces them to the sky. Opens them -- A BLANKET OF BLUE LOOKS BACK. He searches, but finds no answer in it. People move to John Dutton and offer condolences. Their emotions slam against him like glass hitting stone. Nothing shakes him. Not Beth collapsing into his arms, not even Monica holding Tate out for a hug. John Dutton looks at her --   *  even at the funeral, there is no sympathy in her eyes.   *  Blue (mm/dd/yyyy)   67. JOHN DUTTON Where is he? She offers no answer, just grabs Tate and walks off.   *  EXT. YELLOWSTONE RANCH -- MOMENT LATER. MOURNERS file toward the house and the feast that awaits them. John Dutton spots something in the distance -- The blue- gray stallion, grazing in the field. Cory sitting in the grass beside it. ",
      "dialogue_count": 0,
      "word_count": 1442
    }
  ]
}