{
  "slug": "you-101-pilot-2018",
  "title": "you 101 pilot",
  "genre": "romance",
  "format": "series",
  "scenes_count": 4,
  "characters_count": 0,
  "characters": [],
  "total_words": 11164,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. THE HIGHLINE - ANOTHER NIGHT Beck and SOME GIRL FRIENDS WE’LL MEET SOON, happy-tipsy and carrying a wine bottle in a brown paper bag. JOE’S THOUGHTS Candidly, it’s the least appealing thing about you, Beck. Beck is drawn to the edge, peering out.   A FRIEND (LYNN, Asian-American,   just   pretty/smart/rich enough to slide by in life, affects a perpetual bored deadpan) calls to her-- LYNN Hurry up, Beck, we told them we’d be there an hour ago. Beck types a Tweet on her phone.   We hear HER VOICE: BECK’S VOICE  “We are t-minus-ten to karaoke Katy Perry.   This is your final warning, humans with ears.”  INT. THE SUBWAY - EARLIER THAT DAY Beck on the subway right after meeting Joe. JOE’S THOUGHTS You posted this hours after our encounter. She looks down at the book cover of   Desperate Characters , SNAPS a PICTURE for INSTA, types: BECK’S VOICE  Most of my favorite people are books.  INT. JOE’S APARTMENT - SAME TIME Joe studies the Instagram.   Almost offended. JOE’S THOUGHTS For a second I was concerned you didn’t mention that cute guy in the bookstore. He scans THROUGH more PICTURES.   We do too.   A super fast SLIDESHOW of A YOUNG HAPPY-GO-LUCKY GIRL IN THE CITY. JOE’S THOUGHTS (CONT’D) Then I realized, your online life isn’t real, it’s an artistic collage and you want it all to seem so carefree. (MORE)  11.",
      "characters": [],
      "action_text": "So you paste this Beck up everywhere, this together, lovable, cute, bendy creature. Joe stops on ONE PHOTO in particular.   Beck and Lynn in front of a BUILDING SHOVING a COUCH up the STAIRS. JOE’S THOUGHTS (CONT’D) If anything, the fact that you didn’t share me with your followers only confirms we really connected. Joe COPIES AND PASTES A PHOTO into A SEARCH ENGINE.   He searches IMAGES.   Something comes up.   He smiles. JOE’S THOUGHTS (CONT’D) The next thing our friend the internet gave me was your address. REVEAL the SCREEN is a CLEAR PICTURE OF A BUILDING in the West Village.   The address listed right below. EXT. 51 BANK STREET - DAY On a real life shot of the SAME BUILDING FROM THE PHOTO. ACROSS THE STREET Joe stands, tucked unobtrusively by a stoop with a big brick staircase.   You’d walk right by without noticing. JOE’S THOUGHTS There it is, with its big naked windows. From across the street, Joe has a private, relatively UNOBSTRUCTED VIEW of the slightly elevated FIRST FLOOR APARTMENT.   Windows are uncovered.   Everything on view . JOE’S THOUGHTS (CONT’D) Definitely more than you could afford. I’m thinking subsidized school housing. BECK walks by, NAKED except for a towel. JOE’S THOUGHTS (CONT’D) Jesus, Beck.   It’s like you’ve never seen a horror movie.   Or the news. Joe looks around at the PEDESTRIANS coming and going outside.   They stroll past, not seeming to care. JOE’S THOUGHTS (CONT’D)  12. JOE’S THOUGHTS (CONT’D) But you want people to watch, don’t you? I plan on asking you about this quality when we get to know each other better. Inside Beck heats a microwaveable dish for dinner.   Takes out her phone, scrolls while she eats.   Types something. JOE’S THOUGHTS (CONT’D) A proposal.   Why don’t we spend the day together tomorrow.   Just you and me? As if on cue, Joe’s PHONE CHIRPS alerting him to a TWEET: BECK’S VOICE  To everyone out there chasing their dreams, don’t give up.   And in the meantime, Mac N Cheese!  JOE’S THOUGHTS Okay, Beck.   It’s ",
      "dialogue_count": 0,
      "word_count": 5912
    },
    {
      "scene_number": 2,
      "slugline": "INT. BECK’S APARTMENT - SAME TIME And now we’re with Joe as he sees these same texts come up REAL TIME in a box on her computer-- BENJI’S VOICE  PS. I still smell like your pussy. ;)  Off Joe’s unimpressed face-- EXT. CAMPUS - OUTSIDE LEAHY’S OFFICE - SAME TIME Back to Beck, who looks happy enough for the meager attention.   She pockets her phone.   Continues walking. JOE’S THOUGHTS But none of this matters because of my third and greatest discovery... INT. BECK’S APARTMENT - BEDROOM - DAY JOE’S lying comfortably on BECK’S BED now, reading her COMPUTER and SMILING the WIDEST SMILE we’ve seen yet. JOE’S THOUGHTS February 5th, 11:06 AM, an hour after our encounter at the bookstore, amidst a group text with friends about the merits of vaginal detoxing, you wrote: On the SCREEN.   In her CHAT HISTORY: BECK’S VOICE  Wow.   Just met a human male who actually reads.   Alert the media.  (and then)  What if it’s finally time for me to date someone good for me?  There it is.   For Joe this is the ultimate confirmation. JOE’S THOUGHTS Thank you for letting me know I wasn’t crazy after all. In a moment of sheer enthusiasm he does a silent cheer. JOE’S THOUGHTS (CONT’D) I was so excited I almost didn’t hear your key in the door. SUDDENLY there is the SOUND of A LOCK. The FRONT DOOR. Luckily for Joe THE LOCK STICKS (worst in the building).  37.",
      "characters": [],
      "action_text": "Joe carefully CLOSES the COMPUTER, buries it in sheets. BECK (O.C.) Yes I remember what you said when you sent money last time.   Yes I’m grateful. BECK walks into the bedroom, kicking off shoes, on cell. REVEAL the WHOLE ROOM.   Joe’s gone.   Phew. BECK (CONT’D) (into phone) ...I’m working constantly.   No, I’ve looked, there’s no place cheaper to live. INT. BECK’S APARTMENT - BATHROOM - SAME TIME Joe looks for a window, no luck.   Quietly, he steps into the shower, painstakingly pulls the curtain shut. JOE’S THOUGHTS I wasn’t worried.   I’ve seen enough romantic comedies to know guys like me are always getting in jams like this. Beck walks into the bathroom, still on the phone-- BECK I did and he basically offered to sleep with me.   No, I can’t report him, that’s not how it works.   Not the school, the world.   That’s not how the world works. Beck reaches through the still-closed curtain, and turns on the water.   Joe’s HIT BY ICY SPRAY, can’t make a sound. BECK (CONT’D) (into phone) I know this was all my choice.   I know how much you’ve helped me, it’s just-- hard here.   Harder than I thought. As she listens, she deflates.   It’s a no.   Quietly-- BECK (CONT’D) (into phone) I’ll figure it out.   I gotta go.   Talk to you this weekend-- Oh right, when you get back from the cruise.   Have fun with Aunt Donna.   Tell her I said hi.   Bye, Mom. Beck HANGS UP.   She’s standing at the mirror taking in her whole day, week, life.   And she begins TO CRY.  38. Beck meets her own eyes in the mirror, grips the sink. Really crying now.   Shower pelting him, Joe listens. JOE’S THOUGHTS (softly) It’s okay, Beck. He raises a hand, as if to send consolation.   Looks like she might get in the shower and end this whole pilot when- HER FACETIME BUZZES. Beck answers.   LYNN and PEACH ON SCREEN.   Having fun. LYNN (ON SCREEN) BITCH, where are you at, come play! BECK Guys, it’s not even six. LYNN (ON SCREEN) Why they call it happy hour! BECK I can’t go out, I just had the worst day",
      "dialogue_count": 0,
      "word_count": 1640
    },
    {
      "scene_number": 3,
      "slugline": "INT. SUBWAY ENTRANCE STAIRS - LATER Joe stands, dejected.   The station is empty but for him and a HOMELESS MAN, SINGING to himself. HOMELESS MAN  Engine engine number nine, on the New York transit line....  JOE’S THOUGHTS I was considering this with my new friend Mr. Insane Homeless Person when the second luckiest thing that happened to me this week happened... Joe sees A DRUNK, UPSET WOMAN descending the stairs. JOE’S THOUGHTS (CONT’D)  Could it really be?  Joe looks a little closer at the DRUNK WOMAN. JOE’S THOUGHTS (CONT’D) It feels like I’m dreaming. It’s BECK.   She’s in her own world. JOE’S THOUGHTS (CONT’D) I’m not. Joe MOVES behind a PILLAR.   Beck walks to the platform. JOE’S THOUGHTS (CONT’D) You’re too drunk to be alone.   What if some sicko had followed you down here? Joe watches Beck.   She takes out her PHONE and is DRUNK TEXTING as she STUMBLES a little TOO CLOSE to THE TRACKS. JOE’S THOUGHTS (CONT’D) And you’re too wasted to be standing so close to the tracks. HOMELESS MAN  Engine engine number nine on the New York Transit line, if my train runs off the track--  Beck throws a glare at the MAN.   Moves away.   Closer TO THE TRACKS.   Then: a new thought that MUST BE TEXTED. JOE’S THOUGHTS Beck.   Stop texting that arrogant, club soda, no show dickhead.  44.",
      "characters": [],
      "action_text": "Beck’s PHONE PINGS.   She LAUGHS at a RESPONSE. JOE’S THOUGHTS (CONT’D) You want Benji.   You need Benji.   You hold that phone like it   is Benji   cause it’s your only means to stay connected. She begins to TEXT BACK and WALKING as she does.   Unaware that she’s walking... CLOSER TO THE EDGE. JOE’S THOUGHTS (CONT’D) Forget Benji and To Hell With That Phone. Beck goes to pocket her PHONE but it PINGS AGAIN, she goes to look at the response and accidentally DROPS IT. The PHONE FALLS.   And SLIDES RIGHT NEXT TO THE EDGE. Beck bends down to PICK IT UP when SUDDENLY -- HOMELESS MAN  Engine engine number nine, on the New York transit line!!! STARTLING HER -- BECK STRAIGHTENS - And FALLS OFF THE PLATFORM ONTO THE TRACKS WITH A SCREAM!  For a second, Joe stares with such impassivity that we expect him to turn and leave her there.   When: BECK (O.C.) OH MY GOD!   HELP! Joe looks to the Homeless Man, nervous what to do -- BECK (O.C.) (CONT’D) HELP ME!   SOMEONE HELP ME! Joe thinks, then finally races to the edge--   Joe looks down-- and BECK, in a total panic, sees him there-- BECK (CONT’D) HELP ME, PLEASE-- JOE Hey!   Stay still.   Half that shit down there can electrocute you. She LOOKS DOWN the DARKNESS of THE TUNNEL -- BECK A train’s coming--   I’m gonna die!  45. JOE A train’s not coming.   You’re okay. HOMELESS MAN  If my train runs off the track, pick it up pick it up pick it up!  BECK I’m gonna die because of his stupid fucking singing!   That’s why I fell! JOE Give me your hand.   HOMELESS MAN  Pick it up pick it up pick it up!  JOE Sir?   Please! Joe lies belly down on the platform, reaches out a hand. JOE (CONT’D) You’ll be okay.   Just take my hand! HOMELESS MAN  If my train runs off the track--  JOE (CONT'D) (to the homeless guy)  Sir, shut the fuck up!  BECK It’s coming, I hear it coming-- Now we do hear a train coming.   She’s right.   Shit. JOE YOUR HAND.   NOW! Something in Beck snaps lucid.   She goes, reaches up-- And Joe PULLS BECK TO SAFETY. They lie si",
      "dialogue_count": 0,
      "word_count": 3086
    },
    {
      "scene_number": 4,
      "slugline": "INT. MOONEY’S RARE AND USED BOOKS - DAY POV THROUGH SHELVES: a customer enters.   We see only a sliver of her... as we track her through the stacks. JOE’S THOUGHTS It’s two o’clock when the door chimes and I am ready.   You told your girlfriends you would come by around this time.   I know this because I have your phone. REVEAL the CUSTOMER is BECK.   She walks towards the counter where... Joe rubs his sore shoulder absently as he sorts receipts. Ethan stacks books nearby. BECK (O.S.) Hey. They both look up.   Beck is holding a BROWN BAG.   Joe looks surprised.   Ethan smiles privately.   Looks away. JOE Hi... BECK Remember me?   From almost dying on the train tracks? JOE Rings a bell. BECK I wanted to thank you. JOE You already did. BECK Well I wanted to thank you again.   And say sorry for running off so, you know, hastily. JOE You had a guest. BECK (so over Benji) Hardly. (subject change; brighter:) So, I brought you a present. She hands him the bag.  59.",
      "characters": [],
      "action_text": "JOE Thanks, you didn’t need to--   BECK (CONT'D) Shut up, just look at it. He pulls out... a DAN BROWN NOVEL. JOE From a competitor? BECK No I actually owned this one.   Open it. He opens it.   It’s inscribed: JOE “Engine engine number nine on the New York transit line, if your girl falls on the track, pick her up pick her up pick her up.” JOE’S THOUGHTS We already have in jokes. A beat.   They stand there.   Joe smiling, friendly but a little reserved.   She’s expectant.   Finally... BECK So... anyway... that.   I better... JOE Hey, maybe if you’re not too busy sometime we can grab a drink. BECK Sure.   I still can’t find my phone. So -- JOE I know.   Email you. BECK That’s right.   See ya Joe. Beck smiles and exits with the subtle swagger of a girl who knows she’s wanted.   Joe watches her go. JOE See you soon, Beck. As she leaves, Ethan rounds the corner, arms full of books, to shoot a significant look Joe’s way. ETHAN Well played, sir.  60. JOE’S THOUGHTS I’m not always right.   I’m human.   I make mistakes all the time, Beck.   You’ll see. JOE I’m gonna deal with the shipment downstairs.   Watch the register? Ethan gives him a nod.   Joe heads to the backroom and DOWN THE STAIRS and into-- INT. MOONEY’S RARE AND USED - THE BASEMENT - CONTINUOUS A series of LOCKS UNLOCK.   The DOOR CREAKS OPEN.   LIGHTS FLICKER ON. JOE’S THOUGHTS Hell, maybe I’m just a fool in love, but I swear I’m right about you, Beck.   I know how special you are.   And I’m going to help you get the life you deserve. Joe eyes something in front of him.   He’s looking at THE CAGE, and more specifically BENJI, forehead bruised and caked with dried blood, sitting huddled in the corner.   Locked in. BENJI Please... whatever you think I’ve done, I haven’t.   You have the wrong person. JOE (quietly) No I don’t. Benji shuts up.   He’s terrified of Joe.   Joe smiles. JOE’S THOUGHTS You’re welcome, Beck.   See you soon. SNAP TO BLACK. END OF PILOT  61.",
      "dialogue_count": 0,
      "word_count": 526
    }
  ]
}