{
  "slug": "you-were-never-really-here-2017",
  "title": "you were never really here",
  "genre": "thriller",
  "format": "film",
  "scenes_count": 31,
  "characters_count": 0,
  "characters": [],
  "total_words": 16541,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "INT. TITLES SEQUENCE 1   1  Close-up: An adult man’s mouth under water (Joe). He gulps in water. E.C.U: A CLEAR PLASTIC BAG, filled with air, stretched smooth. The inside surface mists - droplets of moisture form - break into miniature rivulets... O.S. The whisper of a BOY’S VOICE (Young Joe) counting down - ‘...1001, 1000, 999, 998, 997...’ With a sharp inhale the clear plastic inverts. The face of A MAN (Joe) as the bag is suddenly sucked hard onto his skin, distorting his features into an inhuman mask. O.S. The boy’s counting suspends.   The faint beat of a pulse rises to replace it. The man exhales.   The bag balloons again, clouding with his breath.   The man breathes again, slowly, the plastic bag balloons and inverts. O.S. The boy’s monotone whisper resumes - ‘...996, 995, 994...’ The man never blinks beneath the plastic, eyes unseeing, its rise and fall around his mouth and nose the only sign of life. TITLES END. INT. HOTEL ROOM, CINCINNATI - NIGHT 2   2  MONTAGE - glimpses of a methodical process. Camera tight, sounds heightened...  A GIRL’S FACE, filling the frame - a passport style photograph... ...16-years-old, smiling, a hint of lip gloss and eye shadow, lightly Latin features.   The image appears to dance and flicker with an inner light. Slowly at first the picture darkens, then rapidly distorts and blackens.   With a HISS fire and smoke erupt through the  girls face as the photograph curls up in flame.",
      "characters": [],
      "action_text": "WIDER: The burning shards of photograph drop into a small metal trash can.  Goldenrod Pages - 8.29.2016   1A. The rising smoke is staunched with a heavy bound book dumped onto the rim of the trash can -  HOLY BIBLE  QUICK CUTS:   A man’s hands, pries open a cell phone - pink case, appliqué plastic gemstones, dangling charm - removing the battery and SIM card. Large tacky gold earrings slide into a zip-lock plastic bag. A cheap gold necklace follows; the pendant reads ‘SANDY’. The bag is sealed. The hands hold open a white plastic laundry bag.   Items laid out on the bed are   scooped into the bag one by one:- A baseball cap... A roll of silver duct tape... A bundle of heavy duty black plastic zip ties... CLOSE ON: A ceiling smoke detector as the condom that has been stretched over it is pulled free. The blackened scraps from the trash can are shaken into the laundry bag. A flip form prepaid cell phone as it strains between gloved hands.   With a CRACK the hinge shatters. The two halves go into the laundry bag. A BALL PEEN HAMMER, lying the length of a bathroom hand towel. FRESH BLOOD on its head. The hammer is wiped with the towel and both items drop into the laundry bag. The bag is closed tight. INT. HOTEL CORRIDOR, 2ND FLOOR, CINCINNATI - NIGHT 3   3  Low angle on the man’s torso as he emerges, the laundry bag dangling at his hip. CLOSE ON the bag as he makes his way stealthily down the dingy corridor. Rounding a corner a WOMAN hones into view.  Goldenrod Pages - 8.29.2016   2. The man hangs back.   With her back to him the Woman tweaks down the hem of her barely there skirt, then struts away to the waiting elevator. CUT TO: A hotel cleaning service trolley, left by the door to the service stairwell.   The man dumps the bag in the trash and slips through the door. INT. HOTEL LOBBY, CINCINNATI - NIGHT 4   4  The check-in desk is unmanned. O.S. The 10 O’clock headlines on WKRC Local 12 news. The man moves silently from the stairwell fire door, his head shrouded by h",
      "dialogue_count": 0,
      "word_count": 812
    },
    {
      "scene_number": 2,
      "slugline": "EXT. CINCINNATI HOTEL FIRE EXIT, BACK ALLEY - NIGHT 6   6  HIGH ANGLE as the fire exit swings open and the man slips out. CLOSE ON: His impassive face - hard, mask-like, mournful eyes. This is JOE (35-45), plaid shirt, jacket, baseball cap under raised hood. JOE’S POV of the ground, dozens of dead birds litter the alleyway around the exit. Ahead of him a BLACK SUV eases across the mouth of the alleyway, slowing to a halt. Joe turns in the opposite direction... Out of the shadow of a doorway, a MAN steps out behind him, arm aloft, brandishing a blackjack. Joe senses something behind him... The presence of life... The coming of violence... He turns in time to catch the blackjack on his left shoulder instead of taking a brutal blow to the head. Joe grabs his assailant’s wrist. Joe brings his forehead down like a brick into the bridge of the man’s nose... The sickening sound of splintering bone. Blinded by red pain the man begins to double up.   Joe brings his knee up hard into his jaw. He goes down, strings cut, paralyzed by fear. Joe swings his head from left to right, shakes out his left arm, trying to get life into it.  Goldenrod Pages - 8.29.2016   4.",
      "characters": [],
      "action_text": "The assailant alone in the alley, vomits. EXT. CINCINNATI STREET - NIGHT 7   7  The passenger door of a yellow cab slams shut to reveal its emblem;  G&Y Cab of Cincinnati.  JOE (O.S.) Airport. INT. CINCINNATI TAXI - NIGHT 8   8  CLOSE ON: the tired lined mouth of the ELDERLY CAB DRIVER as he replies with a grunt. CUT TO: Joe stares ahead. Joe’s POV in the rear view mirror as the cab driver’s lips dip in an out of view in the strobing streetlights. The driver appears to silently mouth.  “You” “Were” “Never” “Really” “Here ”... Each word appears on screen as a title, then fades, as the driver appears to speak them.  Goldenrod Pages - 8.29.2016   5.",
      "dialogue_count": 0,
      "word_count": 333
    },
    {
      "scene_number": 3,
      "slugline": "INT. NYC AIRPORT ARRIVALS HALL - NIGHT 9   9  CLOSE ON the spinning pad of a floor polisher - its DRONE reverberates around the empty arrivals hall. CUT TO: WIDE on a lone TEENAGE GIRL asleep on a bench, her head propped on her knapsack. Bent double at a water fountain, Joe watches her from across the gleaming concourse, his face shaded under the brim of his cap.   He takes a mouthful of water. CUT TO: INT. LA GUARDIA AIRPORT ARRIVALS HALL - MOMENTS LATER 10   10  Joe’s fingers tapping digits on a pay phone. CUT TO: Joe’s mouth pressed to the receiver. JOE It’s done. He hangs up. EXT. KENSINGTON, BROOKLYN - NIGHT 11   11  The suburban neighborhood sleeps through the dead of night. Joe steps out of an NYC Yellow Cab and waits on the kerb; watching till it turns out of view at the far intersection. With his head down he walks to the other end of the avenue before slinking a footpath between blocks. EXT. MOTHER’S HOUSE - NIGHT 12   12  Joe approaches the back entrance to the house on the end of a row and stoops down, removing a THIN WOODEN BATON from under the door sill.   He slips it behind the drainpipe.  Goldenrod Pages - 8.29.2016   6.",
      "characters": [],
      "action_text": "Taking care to make no sound he turns his key in the lock and eases the back door open.  Goldenrod Pages - 8.29.2016   6A. O.S. The faint METALLIC SOUND of footsteps and the clink of glass. His hand still on the door Joe’s attention is on the fire escape of the block overlooking his house. CUT TO: A SKINNY TEENAGE BOY (MOISES, 14) crouches on the 3rd floor fire gantry, his body frozen as he holds down smoke from the joint in his hand.   A 2nd BOY is climbing through an open apartment window to join him - two beer bottles in one hand. Moises and Joe’s looks hold. A beat - Moises’ expression melts from recognition to fear as he lets go of his lungful of marijuana. Joe turns away, closing his back door behind him. INT. MOTHER'S HOUSE - NIGHT 13   13  Joe stands in the doorway to the living room as cold light dances on his face. O.S. TV sound blaring -   The Bad and the Beautiful   on TCM JOE’S MOTHER (80s) - in house dress and slippers - is asleep in a chair. On the wall above her a framed photograph of JOE’S LATE FATHER in Marine Corps dress uniform.   The TV reflects on the glasses slumped on the bridge of her nose. Joe flicks off the TV plunging the room into stillness. He removes her glasses with care, setting them down on a table beside her HEARING AID. INT. UPSTAIRS HALLWAY, MOTHER’S HOUSE - NIGHT 14   14  Joe stands at the foot of the stairs.   His mother is obscured from view by the bannister. JOE’S MOTHER (O.S.) I’m not a baby. She steps into view as Joe steps back to let her pass.   She takes the stairs, moving at a snail’s pace, one step to the next. ON Joe as he watches her tedious progress upstairs.  Goldenrod Pages - 8.29.2016   7.",
      "dialogue_count": 0,
      "word_count": 530
    },
    {
      "scene_number": 4,
      "slugline": "INT. BEDROOM, MOTHER’S HOUSE   - NIGHT 15   15  Joe places his mother delicately on her bed, drawing up the covers. The window is ajar. The curtain billows as a chill blows through the room.  Goldenrod Pages - 8.29.2016   7A.",
      "characters": [],
      "action_text": "CLOSE ON: Joe as he pulls the window to. O.S. A sharp creak from the bed. JOE It’s freezing Mom... He turns back to the window.   His hand rests on the handle. A beat. In one fell swoop Joe fastens the window shut and breaks from the room, never looking back over to his Mother’s bed. OMITTED 16   16  INT. JOE’S BEDROOM, MOTHER’S HOUSE   - NIGHT 17   17  Joe lies rigid on top of his bed covers.   His eyes pop open, he cannot move, he tries to scream, no sound comes out, an episode of night terrors. (o.s) The sound of dripping water. He struggles to let out a moan. He is now awake, sweating. Joe sits up in bed, we see a vicious bruise on his left shoulder. His body, a network of scars.  Goldenrod Pages - 8.29.2016   8. O.S. Water POURS and SPLASHES insistently In one clean move Joe bolts from the bed to the door. INT. HALLWAY, MOTHER’S HOUSE - NIGHT 18   18  Behind Joe as he watches his mother from his bedroom. The bathroom door is ajar. The Mothers pewter hair, reaches her waist. She is wrapped in her robe, giving herself a shampoo in the hand basin.   She rinses, then throws her head back, like a young woman. The hair snaps out in an arc, like a long silvery rope. OFF Joe’s look - the floor of the bathroom is awash with soapy water. Joe sighs at the sight of the soapy water cumulating on the floor. INT. BATHROOM, MOTHER’S HOUSE - NIGHT 19   19  Joe on his hands and knees, works a towel to soak up the soapy water from the tile. INT. KITCHEN, MOTHER’S HOUSE - DAWN 20   20  The radio is on - very loud -   a 40’S CROONER. Joe stands in the kitchen, wearing a suit and tie. His mother’s frail wrinkled hands smooth out his unkempt hair, her hands move to his beard which she also attempting to groom. JOES MOTHER’ Why do you hide that beautiful face? She then straightens and adjusts his tie. Joe’s face, mildly annoyed. CUT TO: Joe’s mother’s frail hands crack two eggs into a frying pan, the sizzling oil mute beneath the drone of the radio.   Her deaf ears oblivious to the no",
      "dialogue_count": 0,
      "word_count": 730
    },
    {
      "scene_number": 5,
      "slugline": "INT. LIVING ROOM, MOTHER’S HOUSE - DAY 22   22  TCM blares from the TV.   Joe’s mother watches from her armchair. Joe sits on a couch close to his mother, he is falling asleep. His tie is undone, his suit jacket resting on a chair. O.S. OLD WESTERN ON TV - COWBOYS AND INDIANS GUNFIRE.  Goldenrod Pages - 8.29.2016   10A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 60
    },
    {
      "scene_number": 6,
      "slugline": "EXT. DUSTY GROUND - DUSK   (JOE’S MEMORY) 23   23  CLOSE ON: A pair of girl’s BARE FEET lying on dusty ground. Her heels intermittently kick at the earth beneath her. A miniature ditch dug in the sand. INT. LIVING ROOM, MOTHER’S HOUSE - DAY (LATER - BACK TO 24   24  PRESENT)  Blinding sunlight glints off a framed photograph of a YOUNGER JOE in ceremonial military dress. Sunrise touches the living room walls. Joe’ Mother is in her armchair in front of the TV. EXT. JOE’S MOTHER’S HOUSE - DAY 25   25  Through the LIVING ROOM WINDOW - Joe’s Mother stares past the TV to the street. A smile on her face, turns to a darker past memory... INT. JOE’S BEDROOM, MOTHER’S HOUSE - DAY. 26   26  Joe sits upright on a chair that he’s dragged into the open doorway of the walk-in cupboard.   DRY CLEANING covers hang by his head. CLOSE ON - Joe’s feet.   His shoelaces are untied.   He uses one foot to lever off a shoe.   He places a socked foot onto the floorboards ahead of him - the floorboard creaks as he places his weight. A bare patch of skin above Joe’s sock reveals an old but pronounced scar. Joe has a belt looped around his neck, the end of the belt is looped over a clothing rail, he pulls tightly on the belt. INT. DINING ROOM, MOTHER’S HOUSE - DAY 27   27  Late afternoon sun. Joe & his Mother are sat across the corner of the dining table.   Open in front of them is a large mahogany CUTLERY CASE.   They are both engrossed in polishing its contents. Joe’s mother sings “A you’re adorable” as they clean, they both sign out each letter of the alphabet.  Goldenrod Pages - 8.29.2016   11.",
      "characters": [],
      "action_text": "The Mother’s frail hands move slowly.   Joe buffs like a machine. He holds a silver SOUP SPOON right in front of his mother’s mouth.   She exhales onto the back of the spoon.   Joe gives it a finishing rub.  Goldenrod Pages - 8.29.2016   11A.",
      "dialogue_count": 0,
      "word_count": 338
    },
    {
      "scene_number": 7,
      "slugline": "INT. DINING ROOM, MOTHER’S HOUSE - DAY (LATER) 28   28  CLOSE ON - JOE prizes open a tin of BICARBONATE OF SODA. Heavily tarnished silverware lies in a baking tray on the dining table - larger items, serving spoons, a ladle. Joe scatters BICARBONATE onto them. He unscrews the cap of a bottle of white vinegar and passes it to his mother. With trembling hands she pours it over the cutlery.   The Bicarbonate foams up impressively. INT. DINING ROOM, MOTHER’S HOUSE - AFTERNOON. 29   29  CLOSE ON: Joe Mother’s hearing aid, tucked behind her ear. She is back in front of the TV - a blanket across her knees. At the dining table Joe fits the last of the immaculately cleaned silver back into its case. JOE’S MOTHER (O.S.) How’s Janice? CLOSE ON: a FORK slots into it’s place. JOE We broke up in High School Mom. The MAHOGANY CASE in closed and latched. EXT. ANGEL’S BODEGA -   NEXT MORNING 29A   29A  Joe stands caddy corner looking towards the window of a bodega. He checks his watch; 9AM. INT. JOE’S BEDROOM, MOTHER’S HOUSE - LATER 30   30  Joe sits on the edge of the bed, he is wearing jeans and sleeveless T-shirt, his hands wrapped around his own neck, pressure applied to his throat, his face, beat red. JOE’S MOTHER (O.S.) Joe... Joe.. Joe lets out a deep sigh, Joe on the verge of tears. LATER:  Goldenrod Pages - 8.29.2016   12.",
      "characters": [],
      "action_text": "Joe sobbing like a baby.  Goldenrod Pages - 8.29.2016   12A.",
      "dialogue_count": 0,
      "word_count": 252
    },
    {
      "scene_number": 8,
      "slugline": "EXT. REAR ENTRANCE, MOTHER’S HOUSE - DAY 31   31  Joe takes the baton from its hiding place behind the drainpipe and stoops to carefully position it under the door sill - tucking it out of casual view - then slips into the deserted alley. He has a way of moving quickly, invisibly. Hardly anyone has seen him enter this house, ever. EXT. SIDE STREET ACROSS FROM SIXTY THIRD DRIVE - DAY 32   32  Joe leans against a wall. He watches the store across the street. ‘ANGEL’S BODEGA’... ‘24/7 ’ALWAYS OPEN!’ EXT. APARTMENT ABOVE ANGEL’S BODEGA - DAY 33   33  Joe’s POV - a STOUT MAN comes to the upstairs window.   He peeps through the dirty net curtains, then moves out of sight. EXT. SIDE STREET ACROSS FROM SIXTY THIRD DRIVE - DAY 34   34  Joe checks his watch (black, analogue dial, Military issue). ...a few seconds till 10 a.m. Joe’s POV - in the Bodega window, a sign reading:  Egg and Bacon Sandwich $1.50 . In removable letters, like a cinema sign. The silhouette of the same stout man from upstairs reaches into the window display and removes the sign. Beat. The man replaces the sign.   The letters now read:  Egg and Bacons Sandwich $1.50  Joe registers the misspelled sign - his cue from the dead drop.   He heads across the road to the Bodega.  Goldenrod Pages - 8.29.2016   13.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 231
    },
    {
      "scene_number": 9,
      "slugline": "INT. ANGEL’S BODEGA - DAY 35   35  The shop is empty of customers. O.S. A crude bell ring from the opening door. Moises, the tall skinny kid who spotted Joe entering his Mom’s house, busies himself rearranging goods on the shelf beside the counter. He immediately averts his gaze from Joe. His hands are shaking. The loud clatter of a stack of tomato cans falling to the floor. They roll asunder in an aisle. ANGEL, a stout middle-aged man, emerges from the stock room with an angry look to Moises. Joe quickly moves towards the stockroom, Angel follows. INT. ANGEL’S BODEGA, STOCK ROOM - DAY 36   36  Angel grabs a small step stool and places it on the floor, he climbs up and reaches into a broken ceiling tile. His hand fishes around for a moment, he pulls out an envelope that he hands to Joe. Joe opens the envelope, takes out a bound $5000 wad.   He skims $500 and hands it back to ANGEL, who immediately pushes it into his shirt top pocket. ANGEL The man called... He wants to see you.   Right away. A small army of cockroaches scoot across the chipped floor tiles between the two men. JOE Did your son tell you he saw me? ANGEL (like a military response) He was with friend, just a coincidence. JOE Did he tell you where he saw me? Angel hesitates. ANGEL No, I knew you wouldn’t want me to know... (a beat)  Goldenrod Pages - 8.29.2016   14.  (MORE)",
      "characters": [],
      "action_text": "Moises didn’t mean to see you, he’s a good boy.... Joe eyes bore into Angel, it is clear he isn’t lying. Joe gives a slight shrug of resignation and closes his eyes slowly and gently, almost as if he is falling asleep whilst standing. He skims another $500 from his wad and hands it to Angel. There’s a looks of sadness in Angel’s eyes as he takes it - this is severance pay and he knows it.   His days as Joe’s dead drop have been terminated. Joe exits the back room without speaking, moving in the liquid way that is his custom. INT. QUEENS PLAZA SUBWAY STATION, F LINE PLATFORM - DAY 37   37  Joe stands sentinel on the platform edge, his baseball cap pulled low. Further up the platform a YOUNG WOMAN with a bruise under her eye stares impassively toward Joe. O.S. The rattle of an approaching train rises in volume. CLOSE ON Joe’s feet as he begins to step across the yellow line that marks the platform safe zone.   Mid stride his foot hovers momentarily over the precipice... CUT TO: The train strobes onto the platform with a deafening battle of brakes and metal.   Joe is gone. INT. MIDDAY. MANHATTAN, 38TH STREET AND 8TH AVE - DAY 38   38  From the end of the corridor lobby Joe walks towards us. Elevator doors begin to close around our view until a suited arm appears in the field of vision and holds them back.   The doors shiver then begin to slide open again.   Joe ignores them and steps neatly off to one side - out of view. CUT TO: A BEIGE ACCOUNTANT TYPE slouched in the elevator - The man who held the closing doors back. He scowls at his gesture being ignored.  Goldenrod Pages - 8.29.2016   15.  ANGEL (CONT'D) Joe shades his eyes under his baseball cap, hits the bottom of the stairwell.   The Accountant shrugs, the elevator doors push shut.  Goldenrod Pages - 8.29.2016   15A.",
      "dialogue_count": 0,
      "word_count": 579
    },
    {
      "scene_number": 10,
      "slugline": "INT. MCCLEARY’S OFFICE, 8TH FLOOR - MORNING 39   39  A man has his head tipped back, a blood soaked tissue clamped to his nose.   He breathes methodically through his mouth...   *  He lifts the blood soaked tissue for Joe to see. MCCLEARY How are you?   *  JOE I didn’t try to kill myself today. WIDER - The room is cluttered with ornate floral displays parked up on the floor and filing cabinets. MCCLEARY (laughing)   *  The Cincinnati kid... Parents   *  are... florists...   *  Joe rubs his bruised shoulder. And smiles. He reaches forward and grabs some candy from McCleary’s desk, his tone shifts...   *  JOE Get rid of Angel’s number I’ll find a new service.  Goldenrod Pages - 8.29.2016   16.",
      "characters": [],
      "action_text": "MCCLEARY (a little thrown) Okay no problem... McCleary reaches for the Rolodex and scoots it to the middle of the desk.. A big fat drop of blood splashes onto the white index cards. MCCLEARY (CONT’D) ...You could just call me directly. Joe, eyes still closed. JOE Why am I here?   *  McCleary sighs. MCCLEARY. State Senator Albert Votto... Joe plays with the candy as McCleary continues.   *  MCCLEARY I ran his father’s security in   *  the 80s?... Lost touch with him   *  after the arraignment, then -   *  poof - aneurysm burst in his brain... McCleary wipes the last of the blood from his nose.  Goldenrod Pages - 8.29.2016   17. Joe now half asleep, closes his eyes again. MCCLEARY (CONT’D) The wife, Votto Jr’s wife,   *  kills herself a couple of years   *  ago. Not a good look in   *  politics. Their daughter’s been   *  running away from home ever   *  since. Picked up by the Albany   *  police every time. A ‘problem   *  child’.   *  (beat) Are you fucking going to sleep again on me you bastard? Joe now awake. MCCLEARY (CONT’D) Votto calls me this morning,   *  she’s been missing all weekend.   *  Doesn’t want the cops involved -   *  now that he’s in Senator   *  Williams camp. Too much heat   *  from the press.   *  JOE ...What’s the lead?   *  MCCLEARY He got an anonymous text...   *  Joe, barely listening.   *  JOE Uh, Uh. (beat)  Goldenrod Pages - 8.29.2016   18. MCCLEARY (beat)   *  He wants to meet you in person.   *  McCleary reaches out a sealed brown envelope. JOE   *  You’re fucking kidding... why?   *  MCCLEARY Five grand. That’s ten percent   *  of your cut. McCleary catches Joe’s look as he slides the envelope forward... He consults a sheet of paper on the desk. MCCLEARY (CONT’D) [His Club] Be there at 2 P.m... And   *  try and behave. Remember Joe, 4 out   *  of 5 people enjoy Gang Rape.   *  Where shall I have your flowers sent? JOE You keep them John, they really tie the room together. McCleary references the photo of his [deceased] wife.   *  MCCL",
      "dialogue_count": 0,
      "word_count": 1827
    },
    {
      "scene_number": 11,
      "slugline": "EXT. RENTAL CAR, MIDTOWN BASEMENT CAR PARK - DAY 51   51  Joe’s RENTAL CAR drives down the entrance ramp, turns at the bottom and weaves in amongst parked cars. INT. PHARMACY - DAY 52   52  Joe, basket in hand.   He drops in surgical adhesive tape and plastic bottle of rubbing alcohol. CUT TO: On another aisle Joe picks up a tube of glue. CUT TO: The CASHIER rings up Joe’s items, make up removal wipes, a box of sanitary napkins.   Last out of the basket, a can of Coke and bottle of mineral water. Joe grabs a Hershel Bar from the rack beside the cash register and adds it to the other items. EXT. CHINATOWN RESTAURANT - NIGHT 53   53  Joe slips down the steps of a basement entrance in front of a restaurant window. (Several beats) Joe ascends the basement steps.   He carries a plastic bag emblazoned with CHINESE CHARACTERS and the logo of an electrical goods vendor. INT. MIDTOWN APARTMENT BUILDING CORRIDOR - NIGHT 54   54  Joe exits the service stairwell. INT. MIDTOWN APARTMENT BUILDING CORRIDOR - NIGHT 55   55  A PREPPY UPSCALE COKE DEALER’s hands. A clear plastic vial with a printed prescription label -   Phyceptone   - containing 5 white pills is passed to Joe’s hand, in exchange for $100 cash. INT. HARDWARE STORE - NIGHT 56   56  He picks out a roll of DUCT TAPE, a BOX CUTTER and CABLE TIES. ANGLE ON: a BALL PEEN HAMMER.   Joe glances at the hammer.  Goldenrod Pages - 8.29.2016   28-28A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 252
    },
    {
      "scene_number": 12,
      "slugline": "EXT. MIDTOWN STREET - NIGHT 57   57  Manhattan bustles.   Gaudy lights silhouette people moving each and every way like ants along the side walk. The street lights play across Joe’s face - green, blue, yellow... He carries the hardware store bag. His eyes, shaded under the baseball cap, occasionally catch a glint of colored light but never blink. INT. MIDTOWN BASEMENT CAR PARK - NIGHT 58   58  OFF BLACK: The trunk of the rental car swings open, revealing Joe standing over it. He dumps his ‘tools’ in the trunk. ANGLE ON: all of Joe’s shopping, laid out neatly inside. The lid of the trunk slams shut. INT. RUSSIAN BATHS LOWER EAST SIDE, STEAM ROOM - NIGHT 59   59  NAKED MEN are shadows in the heavy fog of steam and greenish light, heads bowed, eyes closed - sweating it out -   a Romanesque mist of pot bellies, muscles, tattoos. Joe, his eyes half open, half closed, like a cat. He stares at the naked bulb on the tiled wall opposite him. O.S. A low rumble CLOSE ON the bulb as it’s enveloped in steam. CUT TO: INT. COLD ROOM, RUSSIAN BATHS LOWER EAST SIDE - NIGHT 60   60  Joe lies on the surface of the pool.  Goldenrod Pages - 8.29.2016   29.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 211
    },
    {
      "scene_number": 13,
      "slugline": "EXT. US MILITARY BASE, KUWAIT - DAY   (JOE’S MEMORY) 61   61  The searing midday sun. A young Afghan girl is walking towards the camera, hand outstretched. A younger, Joe (20s fresh-faced, dressed in army fatigues) is on the other side of a chainlink fence. He sits on a crudely made bench, drinking coffee, eating an MRE. Beyond Joe 6 soldiers mill about and dance together to a 1991 Pop Hit playing from a parked vehicle in the background. He takes note of the girl, reaches into his pocket and pulls out a bar of chocolate. EXT. KUWAIT DESERT 62   62  The girl smiles, candy bar in hand, turns from Joe and runs away. EXT. KUWAIT - LATER 63   63  Joe looks up to the lone tree where the girl is sitting in the shade. A TEENAGE BOY (15) has approached her - he is standing above her, holding his hand out. The girls shakes her head, “ No” . The boy shouts something inaudible at the girl, his face suddenly aggressive.   She shakes her head again, trying to hide the chocolate in the folds of her skirt. The boy pulls a makarov pistol from his pocket - he shoots the girl in the stomach, snatches the chocolate from her hand and runs off. A slow pool of blood forms around the girl as her bare heels kick fast and furtively at the dusty ground. EXT.   US MILITARY BASE, KUWAIT - LATER STILL 64   64  Joe’s POV - the girl’s legs are still kicking through the dust but with increasing sluggishness. CLOSE ON: the girl’s heels intermittently kick at the earth beneath her - a miniature ditch dug in the sand with her effort to retain life.  Goldenrod Pages - 8.29.2016   30.",
      "characters": [],
      "action_text": "CLOSER STILL: The movement of her heels begins to falter. INT. LOCKER ROOM, RUSSIAN BATHS LOWER EAST SIDE - NIGHT 65   65  Joe washes his hands in the sink, in the mirror he notices a ghost like figure crossing behind him. Water runs from the faucet. We notice the pulse in his shoulder.  Goldenrod Pages - 8.29.2016   30A.",
      "dialogue_count": 0,
      "word_count": 350
    },
    {
      "scene_number": 14,
      "slugline": "INT. RENTAL CAR, MIDTOWN BASEMENT CAR PARK - NIGHT 66   66  Joe is wearing a new WORKMAN’S JACKET.   A sales tag hangs from the sleeve.   He yanks it off. His hands open the centre console between the driver and front passenger seat - he neatly stashes the duct tape, cable ties and a box cutter. CUT TO: The glove compartment flips open - rubbing alcohol, surgical tape, make up wipes and sanitary napkins are placed inside. CUT TO: The bottles of water and can of Coke are slotted into the dash mounted drinks holders. CUT TO: Through the car windscreen: Joe, focused, is sat in the drivers seat. He unsheathes the hammer and weighs it up in his hand.   It sits well. Joe slides it into his left hand inside jacket pocket. EXT. MIDTOWN BASEMENT CAR PARK EXIT - NIGHT 67   67  Joe’s rental car exits the parking garage. INT. RENTAL CAR, MIDTOWN STREET - NIGHT 68   68  Joe’s eyes are dark and inscrutable in the shadow of his baseball cap. Rainbow hued illumination plays across his set jaw. CUT TO: Joe’s POV - Manhattan streets - late night NYC.  Goldenrod Pages - 8.29.2016   31.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 196
    },
    {
      "scene_number": 15,
      "slugline": "EXT. 38TH ST - NIGHT 69   69  Joe’s rental car turns into the end of the road. The street is book ended by modern apartment buildings, one at 3rd Avenue and one at 2nd Avenue. INT. RENTAL CAR - NIGHT 70   70  The engine note drops as Joe slows to a crawl. CUT TO: Joe’s POV - A 3-storied brownstone on a street of brownstones. All the windows are sealed shut by metal curtains, insuring total privacy. A young TOWEL BOY carrying a laundry sack up the stairs, punches in a code into the door and disappears inside. OMITTED 71   71  OMITTED 72   72  Goldenrod Pages - 8.29.2016   32.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 110
    },
    {
      "scene_number": 16,
      "slugline": "INT. RENTAL CAR - NIGHT, LATER 73   73  CLOSE ON: Joe’s wristwatch - the minute hand ticks by... CUT TO: THE REAR VIEW MIRROR - we see a high end black town car pull up outside the brownstone. A WELL DRESSED MAN in a high end suit walks down the stairs. The driver of the town car steps out and opens the door for him. The driver gets back in the car and it pulls away. CUT TO: LATER STILL - Joe sat in the car in a fugue state, simultaneously alert and peaceful. INT. FBI SURVEILLANCE CAR, NYC DOCKS - NIGHT   (JOE'S 74   74  MEMORY)  A younger Joe is wearing a standard issue FBI nylon jacket. He sits behind the wheel of his cruiser, rains bears down on the windscreen. CUT TO: Joe’s POV - beyond a chain link fence, A refrigerated truck with   SUNFLOWER MEAT CORP   and Chinese characters emblazoned on its flank stands on the quay side. Its cab door is open, the engine is running.  Goldenrod Pages - 8.29.2016   33.",
      "characters": [],
      "action_text": "There are two parked cars between Joe and the truck, TWO PAIRS OF MEN are standing beside them in discussion - a deal is going down. Joe checks his watch... The men’s discussion appears inscrutable and ongoing TASK FORCE COMMANDER (V.O.) (broken by bursts of radio static) Wait... Wait....Nobody moves ...see the money .... CUT TO: JOE’S HANDS grip the steering wheel, his knuckles whiten in frustration and anger... The distant sound of the truck engine running over rises in volume. Joe’s eyes shrouded in darkness. The sharp sodium street light throws sad shadows of raindrops onto Joe’s rigid face, his jaw tenses. Fumes continue to plume from the truck’s exhaust... INT. RENTAL CAR, 38TH ST - NIGHT   (BACK TO PRESENT) 75   75  CLUNK - the windscreen wipers kick in automatically.   With a JUDDER they clear the shadow of accumulated raindrops from Joe’s face. CLOSE ON: Joe’s eyes - the crawling retreat of distorted water patterns in the wiper’s wake.   His 1000 yard stare draws into closer focus. Rear-view mirror: Joe watches as... The TOWEL BOY, in jeans and a thick hooded sweat shirt, emerges from the brothel front door - sent out on an errand. Joe studies him - he’s clearly not a ‘John’ or security. He darts from the car. OMITTED 76   76  Goldenrod Pages - 8.29.2016   34.",
      "dialogue_count": 0,
      "word_count": 395
    },
    {
      "scene_number": 17,
      "slugline": "INT. RENTAL CAR, 38TH ST - NIGHT 77   77  The towel boy is shoved into the back seat of the car. Joe makes quick work with the cable ties, duct tape. He binds Towel Boy’s wrists behind his back with a cable tie, then fastens his legs together at the ankles and the knee. Towel Boy’s eyes start to focus, he gasps a little less audibly. Joe eases off the back seat, exits the rear door and returns to the drivers seat.   He faces forward, eyes locked back on the rear view mirror. JOE How many security inside? Towel Boy is too scared to answer. Joe’s hand lowers to rest on the box cutter, his thumb poised over the blades sliding mechanism. JOE (CONT’D) Two?  Goldenrod Pages - 8.29.2016   35.",
      "characters": [],
      "action_text": "TOWEL BOY (whispers) Two. JOE Where are they? Towel Boy hesitates... JOE (CONT’D) (refining the question) Where in the house are they? TOWEL BOY You promise you won’t kill me. JOE Yes. Towel Boy hesitates, not out of cunning, just fear. TOWEL BOY (speaking quickly, half gasping) One guy guards the first floor, with the cameras, and one guy on the second floor.   He sits in the hallway. Joe takes the picture of Nina from his shirt breast pocket and hits the overhead light.   He holds the snapshot in front of Towel boy’s face. JOE Do they have a ‘playground’? Is this girl inside? TOWEL BOY Playground? JOE Underage girls. JOE (CONT’D) Is the girl in the picture inside? Towel Boy is mute. JOE (CONT’D) (quietly, forcefully) She’s not the same as the others... American... Well spoken.  Goldenrod Pages - 8.29.2016   36. JOE (CONT’D) (pushing the photo closer to TB’s face) She might look different. Her hair... TOWEL BOY Maybe... Thinner... blonde hair, cut short? I don’t know... ...I’m not lying to you mister. I swear I don’t know! Joe let’s this terror hang. JOE Where is she... TOWEL BOY Third floor. JOE Any other men? TOWEL BOY Rich guys. JOE Do you carry any keys? TOWEL BOY No... JOE What’s the code for the front door? TOWEL BOY 3-4-9-2... Joe nods. In one movement he is out of the driver’s seat.   He crosses the front of the car and reappears at the rear passenger door.  Goldenrod Pages - 8.29.2016   37. CLOSE-ON: Towel Boy’s eyes widen at the betrayal. EXT. BROTHEL STEPS - NIGHT 78   78  (The following sequence is shot from CCTV Point of view until otherwise stated) Joe walks up the brothel steps, his eyes shaded by his baseball cap, he punches in the code to the door. CUT TO: INT. BROTHEL HALLWAY - NIGHT 79   79  A LARGE SEATED MAN sits reading a magazine. Joe is immediately on him. The hammer strikes the Guard on the cheek bone sending him into the wall. INT. BROTHEL STAIRWAY - NIGHT 80   80  Joe - he takes two steps at a time.  Goldenrod Pages - 8.29.2016   38. A SE",
      "dialogue_count": 0,
      "word_count": 1354
    },
    {
      "scene_number": 18,
      "slugline": "INT. BROTHEL, 1ST FLOOR - NIGHT 86   86  The EMPTY STAIRWELL. Joe’s feet step over the sprawled body of the first Guard as he marches to the front door, seemingly in step with the dull thud of techno music from the P.A.   Nina’s tiny socked feet follow a pace behind. EXT. BROTHEL - NIGHT 87   87  At the top of the stoop Joe peers down the street - no cop cars.  About six minutes have elapsed since Joe entered the brothel.  With the girl light in his arms, he moves quickly to his rental.   In one delicate move he has Nina in the front seat. She is all but out of it; but not completely. Stepping around the trunk of the car Joe flings open the rear passenger door and drags Towel Boy out by the shoulders and dumps him on the sidewalk. CLOSE ON: A storm drain opening.   Joe crouches by the kerb as he fits the bloodied hammer through the opening, dropping it as deeply as his arm will reach inside.   The cell phone jammer from his inside jacket pocket follows the hammer into the storm drain. EXT. 38TH ST - NIGHT 88   88  Joe’s rental car pulls away.   Towel Boy lies motionless on the sidewalk. Silence reigns... EXT. RENTAL CAR, MIDTOWN - NIGHT 89   89  CLOSE ON: Nina through the passenger window.   A cascade of reflections and rainwater play across the glass as she stares into the middle distance. A cop car passes sirens and lights blaring. CLOSER - her lips as they murmur.   She continues her counting down.  Goldenrod Pages - 8.29.2016   43.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 268
    },
    {
      "scene_number": 19,
      "slugline": "INT. BASEMENT CAR PARK - NIGHT 90   90  A squeal of wet tires reverberates around the near empty car park as the rental pulls in and cruises to a quiet corner. The engine’s killed. INT. BASEMENT CAR PARK - MOMENTS LATER 91   91  Joe relaxes his grip on the steering wheel. Nina’s gaze is fixed on him... on his right arm. She reaches forward and touches him with her fingertips. There’s a 2” knife cut through his shirt and blood is soaking through.   Joe hasn’t noticed till now. Nina stares at her fingertips, mesmerized by the scarlet blood coating them. Joe unbuckles his seat belt and flips open the glove compartment.   He removes a sanitary napkin and rubbing alcohol, he pours some on the napkin and places it over his wound. CLOSE ON: in the rear view mirror, Joe’s mouth clenches tight against the searing pain, jaw set as his teeth grit hard. She continues to watch with fascination as Joe goes through the process of attending to his wound. NINA What do I call you? Joe hands her a make-up wipe to remove the blood from her fingers.  Goldenrod Pages - 8.29.2016   44.",
      "characters": [],
      "action_text": "Joe reaches for the can of Coke and chocolate and hands them to Nina. NINA (CONT’D) Where are we going? CLOSE ON: Nina’s fingernails as they strain to open the ring pull.   She abandons it half cocked and hands it back to Joe. He pops it open. JOE I’m taking you home Nina. NINA How do you know my name? JOE Your Father told me your name. Nina alternates sips from the Coke can with squares of chocolate. NINA Is he angry at me? O.S. The sound of an approaching car - the clump as it takes the entrance ramp to the car park, the dry echo of tires on concrete... Joe’s eyes fix on the rear view mirror as the headlights of an anonymous sedan sweep past his car.   He turns the ignition key just enough to fire the electrics and adjusts the angle of his door mirror. In the mirror he can see the sedan as it pulls up, an indistinct figure at the wheel.   Joe wipes a discreet porthole in the condensation building up on his window to reveal - a man in a tuxedo and black tie as he hurries away in the direction of the exit ramp.   Satisfied, Joe turns his attention back to Nina.  Goldenrod Pages - 8.29.2016   45. She has eaten almost all the chocolate, some of which has smeared onto her lips and cheeks.   A crudely drawn smiley face adorns her passenger window. Nina burps. She raises a hand to her mouth and peers over it - surprised and off guard. Joe’s face wears a massive grin in response. Nina offers Joe the last square of chocolate in the packet. He shakes his head. Nina is unwavering in her offer. JOE It’s the last piece... NINA (O.S.) ...It’s not the last piece in the world... He takes it from her and puts it into his mouth.   He closes his eyes and allows himself to relax back into his seat. O.S. - A distinctive clunk as Nina releases the latch of her seat belt. A rasp as the nylon belt retracts. Joe looks over to her. NINA (CONT’D) I need to go... JOE We have to stay here. Nina’s look is one of confusion and disappointment. CUT TO: The passenger door of the car is wide open. ",
      "dialogue_count": 0,
      "word_count": 913
    },
    {
      "scene_number": 20,
      "slugline": "EXT. SENTON HOTEL - NIGHT 92   92  The rental car pulls up right out front, its pouring again. A BELL-HOP GUY (20’s, iPod earbuds)rounds the corner and heads towards the hotel. In his hand he clutches a pair of well-worn drumsticks. A beat later ANOTHER MAN (30’s, acne scarred, homebrew neck tattoo) emerges, throwing his rucksack over his shoulder. The two have an exchange as they cross paths, he then disappears along the street. Joe takes the room key (card) from the glove compartment. The bell-hop guy has his back turned whilst he struggles into an ill fitting jacket. INT. LOBBY, SENTON HOTEL - NIGHT 93   93  Kitsch lounge musak pipes soothing piano into the low rent surroundings. Joe carries Nina ‘piggy back’ past the reception booth.   Her hair sticks to her wet face, she is still dozing, her dirty bare feet hang loosely by Joe’s side. He takes to the bottom of the stairs. On Joe’s back as he disappears from view. The Bell-hop taps out a ‘rim shot’ on the reception desk with his drumsticks oblivious to Joe’s entrance. INT. STAIRWELL, SENTON HOTEL - NIGHT 94   94  Musak from the lobby fades, giving way to a heightened mix of sounds passing through closed hotel room doors - porn, moving furniture, a muffled cry. Joe carries Nina.  Goldenrod Pages - 8.29.2016   48.",
      "characters": [],
      "action_text": "She rests her head on his shoulder, hovering between sleep and wakefulness - obscenely childlike in the harsh lighting. NINA (whispered, barely audible) Mommy went away. JOE (gently rocking her) Shhhh. INT. SENTON HOTEL, ROOM 719 - NIGHT 95   95  CLOSE ON the photographs Joe took from Votto. Nina holds them between finger and thumb, studying them intently. The OVEREXPOSED SELFIE - NINA (O.S.) Is that me? She is sat in the one armchair in the room, Joe’s jacket drawn around her shoulders.   Joe reaches in with a wet wipe and smooths away chocolate smears from her face. JOE Uh-huh. As Joe wipes, Nina pulls a face.   Joe takes a fresh wipe.   As it hones in towards Nina’s face she deliberately goes CROSS- EYED.   She bursts out giggling. ON JOE - He cannot help but smile. He stands to throw the used wipes into the hotel room trash can. CLOSE ON the family portrait photograph.   Nina covers over her FATHER’S FACE with her thumb.   Then cover’s over her MOTHER’s FACE with her other thumb. Nina lowers the photo, her eyes drawn to the TV screen which flickers away with the sound down, she reaches for the remote and begins to channel-hop. A 24h newscast - an accident scene in midtown Manhattan, police line, emergency lights.   Followed by a montage of archive shots of a suited middle aged man giving a speech at the U.S. Senate - the name ‘Senator Williams’ on the chyron. NINA The crying man.  Goldenrod Pages - 8.29.2016   49. Her finger points to the TV. Joe looks up.   The news cast cuts to a studio anchor, a portrait photograph of SENATOR WILLIAMS emblazoned with “SUICIDE?” displayed beside them. O.S. The electronic mechanical sound of the room key unlocking the door. Joe immediately stands and darts to the door. It opens. The drumming BELL HOP stands in the doorway. A BRIGHT FLASH OF LIGHT and the explosion of a firing gun. His forehead erupts.  Goldenrod Pages - 8.29.2016   49A. CLOSE ON: Joe’s face as the BELL HOP’s blood spatters over him. TWO MEN with raised pistols.",
      "dialogue_count": 0,
      "word_count": 1071
    },
    {
      "scene_number": 21,
      "slugline": "INT. ALL-NIGHT BODEGA, MIDTOWN MANHATTAN - NIGHT 98   98  A bottle of rubbing alcohol, cotton wool roll, roll of gauze and a carded pair of NEEDLE NOSE ELECTRICAL PLIERS - pushed across the counter. Behind a scratched plastic window the cashier barely registers Joe or what he is buying, his eyes fixed on a small TV on the counter. O.S. TV news program covering the apparent ‘suicide’ of Senator Williams IN SPANISH. The TV news cuts to an outside broadcast. A taxi’s caved in roof - the scene flashes red and blue from emergency vehicle roof lights. NEWS ANCHOR (O.S. IN SPANISH) ...Senator William’s political and private life have dogged him since 2012 when an out of court settlement was reached with the parents of a girl below the age of consent... Joe pays cash.   There is BLOOD on his hands and the $50 bill he pays with. His RIGHT HAND CHEEK is swollen.   Thick blood mattes his jaw and throat. The cashier doesn’t raise an eyebrow. EXT. MIDTOWN MANHATTAN - NIGHT 99   99  Joe propped up against the side of a building, rain falls around him. A stray dog, sniffs around the area. Joe eases the PLIERS into his open mouth. He digs around taking time to get purchase, deep inside. Joe suppresses the need to scream. EXTREME CLOSE UP: A BROKEN TOOTH - a Molar, split in two. Joe’s bloodied fingertips set it down. Joe collapses back. (O.S.) Nina’s whispered count down.  Goldenrod Pages - 8.29.2016   52.",
      "characters": [],
      "action_text": "NINA 481, 480, 479... Her counting overlaps into the VOICE of an 8-YR-OLD-BOY...  Goldenrod Pages - 8.29.2016   52A. 8-YR-OLD BOY’S VOICE (O.S.) 478, 477, 476... EXT. DOCKS, FBI RAID - NIGHT   (JOE'S MEMORY) 100   100  CLOSE ON: the rear doors of the refrigerated truck... A heavy padlock. Several FBI agents stand by with flashlights fixed on the truck. CLOSE ON- Dollar bills slowly flapping in a puddle. Heavy duty bolt croppers bite into the hardened steel. With a GASP of rushing air the tall rear door of the truck swings open to reveal Joe. Rain streams from the brim of his cap. JOE’S POV - the gloom of the truck interior gives way to a tableau resembling Géricault’s   The Raft of the Medusa ... ...TWENTY FOUR CHINESE GIRLS. IT IS TOO LATE. They are all dead. Their barely clad bodies entwined in the dark, eyes open, heads cast back, mouths agape. CLOSE ON Joe: closing in on his narrowed eyes. CLOSE ON two of the dead girls.   Neither older than 14, their faces framed by long black hair, cheeks pressed together in eternal embrace. CLOSER STILL - A distinct mole on an upper lip.   The mouth strained wide... O.S. The rising pitch of a dialling tone. FADE OUT: EXT. MIDTOWN, MANHATTAN. NIGHT 101   101  Joe leans against a battered pay phone.   He fishes the receiver to his ear.   His cheek is wrapped with a pad of gauze, crudely taped in place.   Blood is smeared over his face and hands like iodine. It connects straight to a phone company digital voicemail.  Goldenrod Pages - 8.29.2016   53. O.S. McCleary’s voice mail.  Goldenrod Pages - 8.29.2016   53A. SYNTHESIZED ‘ROBOT’ WOMAN You’ve called... (a beat followed by gruff man’s voice) McCleary... Joe immediately hangs up. EXT. MCCLEARY’S STREET - DAWN 102   102  A simple, white clapboard two storey affair backing on to an ocean view.   A pristine 20 year old CADDY is parked in the driveway - a 90’s ‘classic’. A Manhattan Taxi U-turns and diminishes towards the turn off. Joe watches till he sees the blink of its signal l",
      "dialogue_count": 0,
      "word_count": 1020
    },
    {
      "scene_number": 22,
      "slugline": "INT. MCCLEARY’S HOUSE BEDROOM - DAWN 107   107  CLOSE ON: Joe pulls open the bedside drawer. A ROYAL BLUE COLT PYTHON SNUB NOSE.   Joe spins the chamber - fully loaded. INT. MCCLEARY’S HOUSE LIVING ROOM - DAWN A107   A107  Car keys with the familiar Cadillac logo on the key ring. JOE’S HAND - he grabs the keys. INT. MCCLEARY’S CADDY - DAY 108   108  Joe looks like death - driving as fast as the limit allows. Sweat dots his brow, he constantly checks the rear view mirror and the few passing cars on the road. He winces, pops one of the painkillers he bought from his Midtown drug dealer.   It is almost impossible for him to part his lips. His head lolls slightly forward. O.S. The SOUND OF THE CAR ENGINE, loud, quickening, continues over: INT. LIVING ROOM, MOTHER’S HOUSE - NIGHT   (JOE'S MEMORY) 109   109  CLOSE ON: 8-yr-old Joe bare chested, standing poker straight, facing a wall. 8-YR-OLD JOE (voice as an adult) I must do better sir. I must do better sir. I must do better. I must do better... 8-yr-old Joe begins to falls asleep, his head bows forward almost grazing the chintzy wallpaper. 8-YR-OLD JOE (CONT’D) (voice as an adult) I’m fucking up. As it’s just about to touch the wall...  Goldenrod Pages - 8.29.2016   56.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 221
    },
    {
      "scene_number": 23,
      "slugline": "INT. MCCLEARY’S CADDY - DAY   (BACK TO PRESENT) 110   110  JOE’S HEAD jolts himself upright, slaps his face, HARD. Speeds up... INT. MCCLEARY’S OFFICE BUILDING, ELEVATOR - DAY 111   111  O.S. The manic sound of a FLY BUZZING, trapped in the fluorescent light.  Goldenrod Pages - 8.29.2016   56A.",
      "characters": [],
      "action_text": "CLOSE ON: Joe propped against the back wall of the elevator - The doors begin slide shut in front of his face... OMITTED 112   112  INT. MCCLEARY’S OFFICE - DAY 113   113  Joe lets himself into the room. The room is a jungle of gaudy wilted flowers.   McCleary’s body sits at his high backed desk chair. He is wearing a towelling dressing gown and slippers - eyes closed, mouth slightly agape. The only sign of disarray is the shattered Rolodex, its index cards spread out across the glass top of the desk like a blackjack table. JOE (under his breath) Oh John. CLOSE ON: the Rolodex card bearing Angel’s details as Joe turns it over in his hands.   Dried blood foxes the edges. O.S. Dialling tone and three digits punched... From UNDERNEATH the glass tabletop - CONGEALING BLOOD pools around McCleary’s hands where they rest on the top surface, his fingers bent and mangled. 911 DISPATCHER (O.S.) What’s your emergency? JOE (O.S.) Rego Park, fire department... It’s urgent... (beat) ...Yeah I saw smoke coming from an old lady’s house. 1138... INT. ANGEL’S BODEGA STOCKROOM - NIGHT ( IN JOE’S 114   114  IMAGINATION)  CLOSE ON: The terrified face of Moises.   He opens his mouth to speak.   His lips synchronize with Joe’s call.  Goldenrod Pages - 8.29.2016   57. JOE (V.O.) ...Sycamore, a red brick house.  Goldenrod Pages - 8.29.2016   57A. WIDER: Moises is on his knees facing his father.   A gun pressed to the back of Angel’s head. The EXPLOSION of muzzle flash... Blood sprays into Moises’ face. INT. MCCLEARY'S CADDY, IN FRONT OF JOE’S MOTHER’S HOUSE - 115   115  DAY Lights, no siren... FIREMEN haul themselves back into the cab of their fire truck. The caddy parks up opposite. Joe sits forward, scanning the view through the windscreen... The Fire Truck pulls away, revealing a black Dodge Challenger - conspicuous on the genteel street. EXT. BACK ALLEY, MOTHER’S HOUSE - DAY 116   116  Joe looks up to the low roof at the rear of the house. INT/EXT. JOE’S BEDROOM - DAY 117   117  Through",
      "dialogue_count": 0,
      "word_count": 426
    },
    {
      "scene_number": 24,
      "slugline": "INT. MOTHER’S HOUSE, MOTHER’S BEDROOM - DAY 119   119  Joe drops into view onto the exterior balcony.   He turns to the window. CLOSE ON: Joe’s face as he stares in. INT. BEDROOM, MOTHER’S HOUSE - DAY 120   120  Joe’s POV of his Mother on the bed - A PILLOW OVER HER FACE. There is a tear in it and powder burns scorch the pillow case. He stares down at her from the bedside. O.S. The CREAKING of floorboards in 2 separate places - 2 sets of footfalls. The sound of a drawer being pulled open, the crash of cutlery hitting a floor.... INT. UPSTAIRS HALLWAY, MOTHER’S HOUSE - DAY   (FLASHBACK) 121   121  CLOSE ON: 8-yr-old Joe’s shins, angry red welts, his stockinged feet step over a specific floorboard. INT. JOE’S BEDROOM, MOTHER’S HOUSE - DAY 122   122  8-yr-old Joe crouches in the wardrobe. Hiding inside a PLASTIC DRY CLEANING BAG, his shallow breathing distorts his face. 8-YR-OLD JOE (internally) 313, 312, 311... (beat) O.S. CREAKING of shoes on the downstairs floorboards, the muffled sound of a man’s raised voice - GROWLING. 8-yr-old Joe holds his breath, listens, terrified. O.S. SLAPS and THUDS, a woman MOANING ...SOBBING. 8-yr-old Joe breathes again in relief. His face red with shame.  Goldenrod Pages - 8.29.2016   59.",
      "characters": [],
      "action_text": "8-YR-OLD JOE (CONT’D) (internally) 310, 309, 308... (beat) O.S. More SLAPS and SOBS. 8-yr-old Joe clamps his hands over his ears. INT. UPSTAIRS HALLWAY, MOTHER’S HOUSE - DAY ( BACK TO 123   123  PRESENT ) Joe stands at the top of the stairs. Unobserved he can see shadows moving in the living room and dining area downstairs. O.S. Music from the kitchen radio drifts up. INT. BEDROOM, MOTHER’S HOUSE - DAY 124   124  Joe lifts the scorched pillow from his Mother’s face.   He reaches down. CLOSE ON: Joe gently sets her glasses on the bedside table alongside her hearing aide. The left lens is shattered, dripping with blood. INT. UPSTAIRS HALLWAY, MOTHER’S HOUSE - DAY 125   125  O.S. One set of footsteps moves to the front door. Joe’s eyes are closed, head tilting from to one side to the other as he maps the movements below him.   The sound of the radio fades as the sounds of movement increase. O.S. The sound of footsteps walking over CUTLERY on dining area floor. INT. LIVING ROOM, MOTHER’S HOUSE - DAY   (FLASHBACK) 126   126  The SILVER CUTLERY and mahogany case sparkle on the living room floor. Joe’s Mother is slumped beside it. His Father’s feet stride away, a bottle of whiskey swings in his free hand.  Goldenrod Pages - 8.29.2016   60. A Ball peen HAMMER drops to the floor.  Goldenrod Pages - 8.29.2016   60A. 8-yr-old Joe watches from underneath the sofa. His Mother stares at him.   Blood runs from her ear. INT. UPSTAIRS HALLWAY, MOTHER’S HOUSE - DAY 127   127  Joe is at the top of the stairs.   Eye’s closed in concentration. His finger moves onto the trigger of McCleary’s gun. INT. STAIRCASE - HALLWAY, MOTHER’S HOUSE - DAY. 128   128  Joe comes down the stairs like an express train, gun drawn. One continuous move takes him as he spins, firing two shots in quick succession. A long EERIE SILENCE broken by the beep of an incoming text message and the faint sound of a Gunman’s fingernails scratching at the floor. REVEAL - One gunman keels over.   Dead.   The other is on h",
      "dialogue_count": 0,
      "word_count": 1361
    },
    {
      "scene_number": 25,
      "slugline": "EXT. WOODLAND, LAKESIDE, NEW JERSEY - DUSK 139   139  The shrouded form of Joe’s Mother lies   in state   across a broad rock at the water’s edge. CLOSE ON: Joe’s hands precisely placing a neat row of personal effects, the photograph of Nina, McCleary’s gun, amongst the foliage at the edge of lake. CLOSE ON: Joe’s hands as he scoops up a heavy flat rock. EXT. WOODLAND, LAKE - DUSK 140   140  UNDERWATER: Joe’s feet stumble across the coarse shale of the lake bed. Joe wades chest deep into the river pushing his Mother’s corpse ahead of him. Flat rocks weigh her down so that she barely touches the surface of the water. He gently immerses the plastic bundle and with his fingertips tears open a small hole to the side of her head. Snow white hair pours out into the black water, wafting like reeds. Silently the black plastic crimps and flexes as air leaches from it. As Joe walks deeper the small body slowly sinks below the surface in his arms. The water reaches his eyes. UNDERWATER - The pockets of his suit bulge with rocks from the lakeside. He takes another step forward and disappears under the surface. CUT TO: UNDERWATER: In a limitless black void Joe and his mother are in embrace. The black   shroud , cocooned tight around her.   She seems tiny, the size of child as he clings to her. Her silver hair loosens and wafts in the water, whirling around his head and shoulders...glinting, beckoning strands of light. Joe’s mother’s shroud descends into the depths. Joe drifts away from her.  Goldenrod Pages - 8.29.2016   65.",
      "characters": [],
      "action_text": "A CRACK, muffled, from above the surface of the water...  Goldenrod Pages - 8.29.2016   65A. A WHOOSH and almighty subaqueous CRASH as a thirty foot mass of dead tree smashes into and under the surface, almost on top of Joe, its branches spearing out underwater... Joe’s eyes snap open in an underwater   churn of bubbles and   trunk...  On his wide eyes... He closes his mouth, his chest clenches. JOE’S POV - UNDERWATER, against a limitless black void, the diaphanous figure of NINA, her nightdress flowing around her. EXT. HUDSON RIVER, PANINADES - DUSK 141   141  FOLLOWING JOE - His clothes are dripping wet.   The rhythm of his sodden shoes the only sound. O.S Nina’s countdown continuous... NINA’S VOICE (O.S.) 220, 219, 218.. OMITTED 142   142  Goldenrod Pages - 8.29.2016   66. OMITTED 143   143  INT. AMTRAK ‘EMPIRE SERVICE’ TRAIN - NIGHT 144   144  Joe’s head leans against the glass of the window.   His SUNDAY SUIT leeches moisture into his seat. O.S Nina’s countdown continuous... NINA’S VOICE (O.S.) 217, 216, 215.. Her voice merges with the beat of train tracks. Joe stares unblinking through the business compartment window. Nearby, a man reaches for his suitcase from an overhead, he walks up the aisle, Joe takes a moment to notice his black shiny shoes. CUT TO: EXT. SHERATON ROOFTOP, NYC - NIGHT ( IN JOE’S IMAGINATION) 145   145  O.S. The whisper of NINA’S COUNTING, 97, 96, 95... CLOSE ON: A man’s shiny black shoes are slipped off of his feet, we follow his feet up onto the ledge of a roof. NINA (O.S.) Don’t tell Mommy...  A MONTAGE of images and dialogue - overlapping and confused - underscored to the rhythm of the train tracks...  OMITTED 146   146  Goldenrod Pages - 8.29.2016   67.",
      "dialogue_count": 0,
      "word_count": 562
    },
    {
      "scene_number": 26,
      "slugline": "INT. BROTHEL (JOE’S IMAGINATION) 147   147  Senator Williams cries, Nina with her back turned to him. CUT TO: INT. LOTTE NY PALACE HOTEL - DAY (JOE’S IMAGINATION) 148   148  Senator Williams cries, Votto takes it in. CUT TO: INT. LOTTE NY PALACE HOTEL - DAY(JOE’S IMAGINATION) 149   149  ...Votto has Joe’s hand in a firm handshake.   He places his other hand on top of Joe’s - intimate. GUNMAN (O.S.) (pained, whispered) We cleaned up his mess. CUT TO: INT. PARKING GARAGE - NIGHT (JOE’S IMAGINATION) 150   150  The smiley face on the car window beside Nina has begun to run - tears of a clown. CUT TO: INT. LOTTE NY PALACE HOTEL - DAY (JOE’S IMAGINATION) 151   151  CLOSE ON: Votto raises his forefinger to his lips in a gesture of secrecy. CUT TO: INT. SENTON HOTEL - NIGHT 152   152  CLOSE ON: Nina’s tiny feet disappear out of view as the door to room 719 snaps shut. CUT TO:  Goldenrod Pages - 8.29.2016   68.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 166
    },
    {
      "scene_number": 27,
      "slugline": "EXT. LAKE - DUSK 153   153  A GIRL’S PALE BARE FEET (Nina’s) dart between black tree trunks, stuttering in and out view. The briefest of glimpses, then she is gone. OMITTED A153   A153  Goldenrod Pages - 8.29.2016   68A.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 39
    },
    {
      "scene_number": 28,
      "slugline": "INT. JOE’S MOTHER’S HOUSE - NIGHT 154   154  Joe’s face as the clear plastic bag is suddenly sucked onto his skin, distorting his features into an inhuman mask. VOTTO (O.S.) Her name is Nina did I mention that. CUT TO: OMITTED 155   155  INT/EXT. RENTAL CAR. VOTTO’S CONSTITUENCY OFFICE - DAY 156   156  Few signs of life as a solitary intern mans the phone. Across the street Joe watches the campaign office from the front seat of a RENTAL CAR.   He is wearing the dishevelled Sunday Suit. He lifts a Hershey bar to his mouth and takes a bite of chocolate. A SLOW ZOOM.   Closer on Joe. Votto exits his constituency meeting accompanied by TWO SURLY BODYGUARDS in dark suits. They lead him to his Car. On Joe - his attention drifts from Votto to his bodyguards. As one opens the rear door of Votto’s car a concealed gun holster peeps through his jacket opening.   The 2nd Man has a grasp on Votto’s elbow as he edges him into his seat. Both men wear earpieces. Joe watches as the car slowly pulls away - Votto’s face in the rear is set in a grim expression. CUT TO:  Goldenrod Pages - 8.29.2016   69.",
      "characters": [],
      "action_text": "Joe’s hand balls up the HERSHEY wrapper and drops it on the passenger seat.   It lands beside 5 other identically screwed up HERSHEY WRAPPERS. INT. MOTEL ROOM, BATHROOM, ALBANY- NIGHT. 157   157  Steam rises from the bathtub. A SLOW ZOOM. The bare bulb illuminating the room shimmers in the steam. Joe lies in the water with a wet face towel obscuring his eyes and mouth. A SLOW ZOOM. CLOSER on Joe.   His breathing under the towel is wet and laboured.   His eye sockets sunken. OMITTED 158   158  INT. MOTEL ROOM, ALBANY - NIGHT. 159   159  Joe’s SUNDAY SUIT hangs on the back of the bathroom door, wrapped in an ALBANY DRY CLEANER’S plastic bag. A ball peen hammer, duct tape & cable ties lie on the motel bed. O.S. The sound of tearing DUCT TAPE.   A pause in the tearing sound.   WET Laboured breathing... INT/EXT. JOE’S RENTAL CAR, COUNTRY ROAD - DUSK. 160   160  Joe’s hands rest on the wheel of his hire car. The distant shape of Votto’s car traces ahead on the country road. JOE drives, his eyes implacable - fixed on the road ahead. A WHITE RABBIT - flaring in the glare of car headlamps.  Goldenrod Pages - 8.29.2016   70. It runs ahead - mesmerically - in sync with the speed of car CUT TO: Nina’s feet. Running fast in the road ahead. EXT. WILLIAMS’ HOUSE, BETHLEHEM - DUSK 161   161  A MANSION built in colonial style. Joe steps into view, hammer in hand. EXT. WILLIAMS’ HOUSE, BETHLEHEM - DUSK 162   162  Joe runs towards camera hammer raised. EXT. WILLIAMS’ HOUSE, BETHLEHEM - DUSK 163   163  Another angle of the mansion. All is dark except one lit window on the top floor. EXT. WILLIAMS’ HOUSE, GATE BETHLEHEM - DUSK 163A   163A  Another angle of the swimming pool. EXT. WILLIAMS’ HOUSE, GATE, BETHLEHEM - DUSK 164   164  The 1st Bodyguard lies face down, incapacitated. INT. KITCHEN WILLIAMS’ HOUSE - NIGHT 165   165  Joe moves through a brightly lit kitchen leaving a guard down in his wake. INT. HALL, WILLIAMS’ HOUSE - NIGHT 166   166  Joe slowly moves through the house, hammer ",
      "dialogue_count": 0,
      "word_count": 669
    },
    {
      "scene_number": 29,
      "slugline": "INT. BEDROOM, WILLIAMS’ HOUSE - NIGHT 171   171  In Joe’s imagination.   Williams fixes the toys on the shelves, a doll’s house with tiny furniture, teddy bears.   He smells Nina’s pillow. Touches the material of her clothes to his cheek.   Smoothes out her bed... On Joe as he approaches the foot of the bed. He stops and stares. We hold on Joe’s face as his look suddenly changes.  Goldenrod Pages - 8.29.2016   73-74.",
      "characters": [],
      "action_text": "We see Williams, slumped to the floor, his throat is slit, blood has pooled around his lifeless body. We cut back to Joe, the shock fades from his face and gives way to a gamut of emotions. He laughs, he cries, he is full of rage, he is exhausted, he falls apart. There is nothing left of Joe. Joe begins to mumble something indiscernible, he repeats something, again, and again, each time it grows a little louder and louder again. JOE I must do better sir, I must do better sir, I must do better sir, I must do better sir... Joe repeats it, again and again, over this repetition, an amazing high energy pop song swells to full pitch. He stops repeating himself. He listens to the music, Joe is euphoric, elated, light.  Goldenrod Pages - 8.29.2016   73A-75.",
      "dialogue_count": 0,
      "word_count": 212
    },
    {
      "scene_number": 30,
      "slugline": "INT. STAIRCASE, WILLIAMS’ HOUSE - NIGHT 172   172  On his way down and through the house after discovering Williams’ corpse, Joe will see Joe’s Mother, Joe’s Father, and FOUR CHINESE GIRLS. Joe descends the stairs as though in a trance. He see the hand of an old lady.   It is Joe’s Mother. JOE’S MOTHER (Singing) A you’re adorable, B you’re so beautiful, C you’re a cutie full of charms... INT. ROOM, WILLIAMS’ HOUSE - NIGHT 172A   172A  Joe sees a young boy standing head against a wall in a room. It is his 8-year old self. 8-YR OLD JOE I must do better sir, I must do better sir, I must do better sir, I must do better sir... He sees a man with a towel over his head, like the men in the Russian baths. It is Joe’s Late Father. INT. DINING ROOM, WILLIAMS’ HOUSE - CONTINUOUS 172B   172B  Joe comes upon Nina wearing a new outfit. On the table is the remains of a meal for two. A whole chicken, half devoured. An empty bottle of wine, dregs in a glass. A split fruit bowl. Nina has blood on her and has a cutthroat razor. Dialogue and action between Joe and Nina TBD. Nina and Joe leave. OMITTED 173   173  OMITTED 174   174  OMITTED 175   175  OMITTED 176   176  Goldenrod Pages - 8.29.2016   76.",
      "characters": [],
      "action_text": "OMITTED 177   177  Goldenrod Pages - 8.29.2016   76A. OMITTED 178   178  EXT. GAS STATION - DAWN 179   179  Joe stands sentry at a gas pump.   The dollars slowly climb on the digital display. It is interminable. EXT. ROAD SIDE DINER - DAWN 180   180  Joe is sat at the table.   His gaze is fixed on where he was previously standing. Eileen Barton’s   If I Knew You Were Coming I’d Have Baked A Cake   drifts from a tinny PA, reflecting off plastic surfaces. A few travellers now populate the diner... A MIDDLE AGED MAN sat beside an oxygen tank, drawing breath through a hand held mask - A WOMAN and her TEENAGE DAUGHTER, schoolwork spread in front of them - AN ELDERLY COUPLE loudly discussing an imminent hospital visit - A PAIR OF SUITS, commuters, en route to the city. Joe sucks the last drops of a milk shake from a metal cup. Joe has drank it too quickly, he has a brain freeze. It is painful, but he works through it, he then reaches for a second milkshake from a group of three other empty milkshake glasses.  Goldenrod Pages - 8.29.2016   77. A cacophony of voices rises above the music, punctuated with the wheeze of oxygen inhalation... VOICES (O.S.) But you gotta take your pills Frank... 40 X 23 equals... I can’t take it anymore... Drives like a dream... Staring straight ahead Joe reaches into his overcoat pocket. He pulls out McCleary’s snub nose. The muzzle pushes firmly under his chin... NINA’S VOICE (O.S.) 11, 10, 9... THE GUN FIRES. An EXPLOSION of blood   Exit wound gore and matter spray in all directions, splattering tables, chairs, donuts and diners. The commuter couple and their breakfast plates. But they keep on eating. The man with the oxygen mask.   But he keeps on gulping. The woman and her daughter. Math homework now inked in red. The Elderly Couple... Blood dripping from the OLD LADY’s wobbling chin as she slurps a fork full of runny egg into her mouth. The Old Man pours a huge dollop of syrup over his bloody pancakes.  Goldenrod Pages - 8.29.2016   78. OL",
      "dialogue_count": 0,
      "word_count": 967
    },
    {
      "scene_number": 31,
      "slugline": "EXT. ROAD SIDE DINER - DAWN 183   183  Joe’s car pulls out of the diner’s lot. NINA’S VOICE (O.S.) 8, 7, 6... INT. JOE’S RENTAL CAR, INTERSTATE 95 - DAWN 184   184  The first rays of the rising sun flare the lens with searing white light illuminating the freeway sign. CLOSE ON: Joe, his eyes fixed on the road ahead, his face set with a look of sheer determination. NINA’S VOICE (O.S. CONT’D) 3, 2, 1. CUT TO BlacK. ***  Goldenrod Pages - 8.29.2016   81.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 86
    }
  ]
}