{
  "slug": "zombieland-double-tap-2019",
  "title": "zombieland double tap",
  "genre": "action",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 20257,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT.   CONSTRUCTION SITE - DAY DAVE SANDERMAN, a burly CONSTRUCTION WORKER, brings an honest- to-God JACKHAMMER down on the chest of a ZOMBIE. GFX:   ZOMBIE KILL OF THE WEEK Dave TURNS ON the jackhammer.   Just picture that for a moment. EXT.   WHITE HOUSE LAWN - DAY LITTLE ROCK works to zombie-proof the GROUNDS. COLUMBUS (V.O.)  A house is built of wood and beams...  A ZOMBIE lurches into the fence, tangling in barbed wire. COLUMBUS (V.O.)  And barbed wire.   And land mines. But mostly wood and beams.  L.R. puts a BULLET in its head, then a second to its chest. TALLAHASSEE watches out the window, smiling proudly. INT.   LINCOLN BEDROOM - DAY A PRESIDENTIAL PORTRAIT OF ABRAHAM LINCOLN on the wall.   Tilt down to WICHITA in BED, COLUMBUS getting ready for it. COLUMBUS A home... a home is built of love and dreams. WICHITA (uncomfortable) Such sunny little sayings... COLUMBUS It’s from an inspirational poster at my ex-dentist.   R.I.P   D.D.S. WICHITA You seem like a four visits a year guy, given your O.C.D. COLUMBUS (climbs into bed) Actually once every four years, given my irrational fears.   But that was the old me.   Now I go once every never. 6.",
      "characters": [],
      "action_text": "WICHITA Ew. He playfully whips the covers up over their heads. TALLAHASSEE (O.S.) I love you, baby. INT.   WHITE HOUSE MOTOR POOL - DAY TALLAHASSEE rubs his hands LUSTILY over the PRESIDENTIAL LIMO.   Eighteen feet of military-grade armor plating.   Kevlar tires.   Tal has turned this room into a MACHINE SHOP.   LITTLE ROCK watches as he drops his welding mask. TALLAHASSEE You are so gorgeous.   Now, to give you a little bite. Tal begins to WELD a 50-cal. MACHINE GUN to the roof. LITTLE ROCK We seriously need to find you someone. TALLAHASSEE That’s where you’re wrong.   Any romance left in me belongs to the Beast here.   True love died with Hallmark. EXT./INT.   LINCOLN BEDROOM / KITCHEN - NIGHT A gibbous MOON is now high over D.C. COLUMBUS (V.O.)  Cynic.   For the first time since the virus, we’d finally found somewhere truly safe, making every day feel like... well, like Christmas morning.  WICHITA stirs and WAKES UP.   She slips out of bed, not waking COLUMBUS, and trudges to the KITCHEN for a glass of water... ...where she finds TALLAHASSEE, stirring a HUGE POT on the STOVE.   Wichita peers inside the pot. TALLAHASSEE Instant mashed potatoes. 7. WICHITA It’s three AM. (off Tal’s nod) Easy on the marijuana. Wichita trudges out of the room.   Tallahassee watches ‘til she’s gone.   Then quickly CLOSES and LOCKS the KITCHEN DOOR. INT.   LINCOLN BEDROOM - DAWN A cock CROWS.   COLUMBUS and WICHITA get a face full of SUN. They wake up, then freeze at the SOUND of BANGING downstairs. INT.   HALL - DAWN LITTLE ROCK, carrying her SUBMACHINE GUN, joins WICHITA and COLUMBUS in the hall.   They TIPTOE downstairs. INT.   RED ROOM - DAWN The TRIO enters the famed RED ROOM to the sight of a huge MAN in RED, facing the other direction, bent over at the waist. COLUMBUS H-hello? The man stands up, turns around, and throws out his arms: TALLAHASSEE Hello-ho-ho!   Merry Christmas! It’s TALLAHASSEE in a HILARIOUS MAKESHIFT SANTA CLAUS OUTFIT: A RED WHITE HOUSE PAGE JACKET, stuffed wi",
      "dialogue_count": 0,
      "word_count": 2964
    },
    {
      "scene_number": 2,
      "slugline": "INT. TALLAHASSEE’S BEDROOM - NIGHT TALLAHASSEE is in bed, reading the PERSONAL MEMOIRS OF ULYSSES S. GRANT, IRRITATED beyond belief.   He can HEAR Madison down the hall, SHRIEKING with pleasure. TALLAHASSEE They’re nutting up.   Definitely not shutting up. He turns over, desperate to hear no more, when a LOUD CRASH comes from another part of the house. INT.   WHITE HOUSE HALLWAY - NIGHT TALLAHASSEE, carrying a MUSKET with BAYONET, creeps down a hallway toward the MOTOR POOL.   As he turns a corner, he runs into Columbus wielding a SAMURAI SWORD. COLUMBUS (re:   sword) Gift to Dwight Eisenhower by the Emperor of Japan.   I heard a strange noise. TALLAHASSEE Yeah?   I’ve been hearing some noises, too. INT.   WHITE HOUSE - ARMORY - NIGHT COLUMBUS and TALLAHASSEE EXPLODE into the building’s expansive ARMORY... and IMMEDIATELY LOWER THEIR WEAPONS. Standing in the room... is a sheepish WICHITA. WICHITA Hi, hello, hey, what’s up? COLUMBUS You’re back.   They’re back. Tallahassee reluctantly pulls out his wallet.   Gives Columbus a dollar.   They had some sort of bet on it. WICHITA Now that that’s settled.   I’m not staying long.   I just needed some weapons. TALLAHASSEE At three in the morning. COLUMBUS After three months missing. 22.",
      "characters": [],
      "action_text": "A long beat.   Wichita hates owning up to this: WICHITA She’s gone. Tallahassee looks alarmed, ANGRY.   He GRABS his DOLLAR back. INT.   KITCHEN - NIGHT COLUMBUS pours three glasses of MOUNTAIN DEW CODE RED: WICHITA Everything was great. It was so good to be on the move again. COLUMBUS (hurt/angry) I’m sure it was. TALLAHASSEE See?   On the move! WICHITA We even picked up someone new. (off their shock) Just a boy.   A few years older than Little Rock.   He’s from Berkeley. TALLAHASSEE Are you fucking with me?   You’re fucking with me.  INT.   GENERAL STORE - DAY - FLASHBACK In a general store, WICHITA brews a cup of coffee.   LITTLE ROCK eats beef jerky, ENRAPTURED.   ‘BERKELEY’ plays and sings for her from where he sits by a SLUSHIE MACHINE. BERKELEY Bad news on the doorstep... I couldn’t take one more step... INT.   KITCHEN - NIGHT TALLAHASSEE A guitar?!   Noooooo! WICHITA And a pretty good singing voice. TALLAHASSEE Shut the fuck up.   You shut the fuck up right now. (MORE) 23. I already know where this is going. She’s seeing a fucking musician! COLUMBUS Is it possible you’re overreacting? TALLAHASSEE How’s he gonna provide for her?! And the lifestyle!   The lifestyle! You think those guys are faithful to-?!   Out on tour?!   The groupies- WICHITA And he’s a pacifist.   He’s survived on a strict policy of conflict avoidance. A quiet beat.   Then Tallahassee goes BALLISTIC, THROWING SHIT AROUND THE ROOM.   EXPLORING the SPACE with CREATIVE VIOLENCE. He only stops when he’s tired himself out.   Then raises his palms as if to say, ‘I’m not as crazy as I look.’ TALLAHASSEE Got nothing against pacifists.   I just wanna beat the shit outta ‘em. INT.   GAS STATION GENERAL STORE - DAY - FLASHBACK BERKELEY   finishes his song, cooing the last line: BERKELEY The day... the music died. Little Rock is now holding a lit BIC LIGHTER.   Then she starts CLAPPING.   A suspicious Wichita reluctantly JOINS IN. LITTLE ROCK You’ve got a beautiful voice. BERKELEY Momma said I was kiss",
      "dialogue_count": 0,
      "word_count": 5049
    },
    {
      "scene_number": 3,
      "slugline": "EXT.   GAS STATION - DAY The MOTOR HOME is now parked at a GAS STATION.   A still SHELL- SHOCKED COLUMBUS SIPHONS DIESEL from the ground tanks into the RV tank.   He gets a little in his mouth, grimaces, coughs, spits it out.   TAL approaches. COLUMBUS That should kill anything a dentist woulda found. TALLAHASSEE I just wanted to say.   Madison was annoying, but you cared about her. She didn’t deserve that.   Neither did you. COLUMBUS I’m trying your whole ‘God gave me one hour’ thing. TALLAHASSEE (proud) Is it helping? COLUMBUS I woulda chosen a different hour. But yeah.   Thanks. INT.   MOTOR HOME - DAY TALLAHASSEE hops in the driver’s side and starts the R.V. COLUMBUS enters and takes a seat on the couch with WICHITA. COLUMBUS (looks at Scrabble board) Pumba? WICHITA That was actually mine. Retaliation for Skynyrd. TALLAHASSEE Let’s see what this thing’s got. Tallahassee depresses the BRAKE, then jams the ACCELERATOR to the floor.   Then LETS OFF the brake.   The R.V. LURCHES FORWARD.   Immediately, SCREECH-CRUNCH... ...the wedge-shaped AIR CONDITIONING UNIT on the roof of the R.V. LODGES under the concrete OVERHANG of the gas station. TALLAHASSEE Shit.   On.   Me. 49.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 195
    },
    {
      "scene_number": 4,
      "slugline": "EXT.   GAS STATION - DAY COLUMBUS stands outside the bus, surveying the situation, directing TALLAHASSEE, who’s still behind the wheel. COLUMBUS Reverse?   Forward? TALLAHASSEE tries reverse.   Then forward.   The R.V. goes nowhere.   STRAIN-RIP-SCREECH. Columbus enters, sits down.   All without saying a word. Tallahassee grinds gears.   Sits back.   Fights the slow burn. COLUMBUS Where are you right now? TALLAHASSEE Not far enough away from here. Columbus pops the glove box and grabs a TIRE GAUGE. COLUMBUS I’ve got an idea. EXT.   MOTOR HOME - DAY HISSSSSSS.   COLUMBUS is kneeling at one of the tires, using the gauge to let out the air. INT.   MOTOR HOME - DAY COLUMBUS climbs back in, and TALLAHASSEE re-starts the R.V. COLUMBUS Should give us the room we need to drive away!  WICHITA I’ll admit, I’m impressed. Columbus looks really pleased with himself. TALLAHASSEE Hold on to your Stetsons. Tallahassee DRIVES successfully out from under the OVERHANG. But as the R.V. continues to move, a peculiar SOUND reaches our heroes’ ears.   Kind of a... TEARING. ANGLE ON TALLAHASSEE, COLUMBUS, and WICHITA, frowning. 50.",
      "characters": [],
      "action_text": "TALLAHASSEE Lemme guess.   You let all the air out of the tires. ANGLE ON the R.V.   Indeed, COLUMBUS has let ALMOST ALL the air out.   And the RIMS are SHREDDING the rubber to SHIT. COLUMBUS That’s possible, yes. EXT.   FREEWAY - MAGIC HOUR Our HEROES trudge back the way they came in the fading light. TALLAHASSEE (to Columbus) As we walk, I’m picturing all the things I like about you. (claps his shoulder) So I don’t murder you. EXT.   CONVENIENCE STORE - NIGHT We’re now back where we started, at the convenience store. Our CREW, tired, bedraggled, walks out of the pitch black into the spill of fluorescent light.   They STOP.   And frown. WICHITA At least we know where to find the first-aid kit. REVERSE ANGLE to reveal their old PONTIAC TRANS SPORT MINIVAN, right where they left it. TALLAHASSEE In moments of great dishonor - such as this - ancient Samurai warriors were required to commit Seppuku, or ritual suicide by disembowelment. WICHITA (sotto voce, to Columbus) Where did he learn all this shit? TALLAHASSEE So as to avoid such a violent end, I say we take the clown truck. ANGLE ON the ICE CREAM TRUCK with the CLOWN on the side. COLUMBUS No fucking way.   Deal-breaker.   Non- negotiable. 51. A SERIES OF SHOTS as the TRANS SPORT travels through the night toward Memphis, the cotton turns to tall trees and Appalachian MOUNTAINS. COLUMBUS (V.O.)  Look, I’m no happier than Tallahassee to be seen in a white 1990 Pontiac Trans Sport.   But we have a mission here.   To find Little Rock and bring her back home.   Nothing else matters.  We see a road sign saying NEXT EXIT:   GRACELAND.   The minivan pulls off the highway. INT.   TRANS SPORT - NIGHT WICHITA is now driving.   COLUMBUS sits next to her in silence.   TALLAHASSEE saws logs in back. WICHITA I should probably say.   It sucks about what’s-her-name. COLUMBUS Madison.   Her name is- was Madison. WICHITA I know.   Madison.   I’m just saying, it blows you lost your girlfriend. That obviously wasn’t what I wanted. COLUM",
      "dialogue_count": 0,
      "word_count": 1130
    },
    {
      "scene_number": 5,
      "slugline": "INT.   GRACELAND - LIVING ROOM - NIGHT TALLAHASSEE, WICHITA, COLUMBUS, and the VALKYRIE sit on the furniture, eating Elvis’s favorite sandwich:   peanut butter on white bread, but MINUS the requisite BANANA. WICHITA That car in your driveway?   The girl who was driving it, is she- VALKYRIE Gone.   She and her loser pussy peace guy took off a few days ago. And trust me, they shouldn’t have. It’s not safe out there. WICHITA (gut-punched) Goddamnit. TALLAHASSEE Fucking Berkeley! (off Valkyrie’s confusion) That’s the name of the loser pussy peace guy.   We call each other where we’re from. COLUMBUS It keeps us from getting too close. Tallahassee’s idea. VALKYRIE Tallahassee?!   What a dump.   But that’s an idea I can get behind. I’m... Nevada. TALLAHASSEE No, not the state, the city. (points) Wichita.   Columbus. NEVADA Sorry.   Nevada’s as close as you get. COLUMBUS (re:   sandwiches) These just aren’t the same without bananas. NEVADA (seems genuine at first) Sorry, I’ll go get you some.   In Hawaii. 56.",
      "characters": [],
      "action_text": "TALLAHASSEE I like her style. NEVADA I shoulda shot you when I had the chance.   Seriously, do you have any idea how close I came to Murraying you guys? WICHITA To what-ing us? NEVADA Murraying you.   It’s when you kill someone ‘cause you think they’re a zombie.   Apparently that’s how Bill Murray died. COLUMBUS Sounds like an urban legend. NEVADA No, it happened.   COLUMBUS I doubt it. As we push in on Columbus’s guilty visage:  COLUMBUS (V.O.) What?   What do you want me to say? ‘Yeah, that was me.   My bad.   Blew a hole through the finest comic actor of our generation.’   I still feel terrible about it.   In fact, I’d love to make it up to you.   All of you.   Buy you one last ticket to Billville.  EXT.   RIVIERA COUNTRY CLUB - DAY  COLUMBUS (V.O.) And for that, we gotta go back to the very first Z-day...  The ninth tee at RIVIERA COUNTRY CLUB.   A sun-kissed ocean breeze blows at the backs of a well-dressed TWOSOME.   A TALL MAN waits impatiently to TEE OFF, impeded by a faraway GOLFER in a FEDORA on the FAIRWAY, taking his SWEET-ASS time. VOICE (O.S.) Should I hit into him?   I got no problem hitting into him. REVERSE ANGLE to reveal the one-and-only BILL MURRAY. 57. MURRAY Move those little legs, Pesci! ANGLE ON MURRAY’s PLAYING PARTNER: DAN AYKROYD Wanna make this more interesting? Two CADDIES stand behind.   Murray hits a DRIVE toward Pesci. We hear some ranting and raving ahead. MURRAY Always. Murray pulls his wallet out of his checked-linen golf pants. AYKROYD If I par out, you’re in for GB3. MURRAY Can we please not have this conversation again?   They should just reboot it.   New cast.   Switch it up.   Women.   Can’t lose. AYKROYD Very progressive.   But where do we fit in? MURRAY We don’t.   It’s been too long. I’ll tell you the worst.   Where the guy dies in the original, but he’s back for the sequel.   They figure out some clever way. Aykroyd SHANKS his drive EIGHTY YARDS into the bushes. AYKROYD Bite! (rubs chest, in pain) Speaking of dying.   My G",
      "dialogue_count": 0,
      "word_count": 1739
    },
    {
      "scene_number": 6,
      "slugline": "EXT.   GRACELAND - MEDITATION GARDEN - NIGHT WICHITA and COLUMBUS finish their conversation: WICHITA I could see that.   But you’re kinda proving my point.   We were two very different people. Columbus lets this sink in. INT.   GRACELAND - BEDROOM - NIGHT TALLAHASSEE and NEVADA lie in a massive KING BED, RAVAGED. NEVADA Hmm, that was nice. TALLAHASSEE Lady, that was better than nice. NEVADA Been awhile, huh? TALLAHASSEE Nah, not that long. (off her look) Yeah.   That long.   Longer. NEVADA Well, you still got it, brother. TALLAHASSEE It’s all about the little things. NEVADA And the not-so-little things. (beat) This girl you’re following.   She means a lot to you, huh? TALLAHASSEE Nah.   Kinda. NEVADA She your kid? TALLAHASSEE She wouldn’t see it that way.   I just want to make sure she’s safe. NEVADA Good for you.   I wouldn’t stick my neck out for nobody. 65.",
      "characters": [],
      "action_text": "TALLAHASSEE That’s a double negative.   Meaning you would stick your neck out for somebody.   You just ain’t found the right somebody. NEVADA Nah.   Those days are behind me now. Me and you are different. TALLAHASSEE You got me all wrong, Nevada.   Ever heard of the Blackfoot Indians? NEVADA Of course.   A matriarchal tribe. The women owned their homes and were subservient to no one... TALLAHASSEE Hmmm.   That didn’t show up on my Wikipedia search. NEVADA The point is, I don’t wanna be tied down.   It only means trouble. TALLAHASSEE (secretly bummed, almost too quick to agree) Trouble.   Right.   My middle name. NEVADA Just shut the fuck up and put Percy back in the playpen. TALLAHASSEE You use that phrase, too?! Tallahassee smiles ear to ear, rolls left, and dives back in. EXT.   ‘NEW WOODSTOCK’ COMMUNE - DAWN The first rays of SUNSHINE fall across a sleeping ROOSTER, whose eyes bat open.   The rooster ruffles his feathers, struts, and COCK-A-DOODLE-DOOS right on cue. ANGLE on early-morning FARMWORK: HANDS sowing SEEDS.   CROPS being tended to.   HENS’ EGGS being collected. Rows of VEGETABLES, CORN, TOMATOES, etc., are being worked by YOUNG PEOPLE dressed half-hipster/half-hippie. 66. One COLLEGE-AGED STUDENT waters crops with a FIREHOSE.   The camera travels the length of the hose to reveal that it’s connected to a metallic spool you’d expect to find somewhere other than a farm. The camera pulls back further to reveal that the spool is attached to a concrete outbuilding... ...which stands PERCHED on the massive ROOF of an... ...FIFTY STORY OFFICE HIGH-RISE in DOWNTOWN ST. LOUIS, MISSOURI! That’s right.   ‘NEW WOODSTOCK’ is just like a traditional commune, except it’s been transported, soil and all, FIVE HUNDRED FEET above an URBAN ENVIRONMENT.   This pastoral farm covers the entire roof of this office building... ...which provides it perfect SAFETY from the streets below. EXT.   ‘NEW WOODSTOCK’ - STREET LEVEL - DAWN At street level, LITTLE ROCK and BERKELEY’s conv",
      "dialogue_count": 0,
      "word_count": 802
    },
    {
      "scene_number": 7,
      "slugline": "INT.   BEDROOM - DAWN The first rays of SUNSHINE wake NEVADA up.   She opens her eyes to the sound of rustling in the closet.   Perks up. TALLAHASSEE (O.S.) Whaddya think?   Be honest. REVERSE ANGLE to reveal a showered TALLAHASSEE, fresh as a daisy... WEARING one of ELVIS’s SEQUIN-STUDDED JUMPSUITS. NEVADA (smiles) I can’t... help... fallin’ in lo- Suddenly:   BABAAAAMMMMMMM!!!!   We hear one MASSIVE METAL MACHINE colliding with another MASSIVE METAL MACHINE. TALLAHASSEE What the fuck?! EXT.   GRACELAND - MORNING TALLAHASSEE (still in Elvis’s jumpsuit) races out the front door, followed by WICHITA and COLUMBUS. A massive, BLACK MONSTER TRUCK with an ironically CHUBBY GRIM REAPER and the words ‘BIG FAT DEATH’ emblazoned on its side sits RIGHT ON TOP of the FLATTENED BEAST. TALLAHASSEE No.   Oh God, no.   This is not happening.   This did not just happen. A MAN climbs down from the truck.   We TILT UP past his steel- toed Fryes, Wranglers, bandoliers, the .50-Cal in his hand. He’s a great-looking guy in his 40’s, wearing a cowboy hat. This... is ALBUQUERQUE. TALLAHASSEE Motherfucker, that was my ride! ALBUQUERQUE (re:   jumpsuit) Apologies, Tiny E.   Didn't expect anything to be parked in my driveway. TALLAHASSEE Your driveway? 69.",
      "characters": [],
      "action_text": "ALBUQUERQUE That’s right. TALLAHASSEE Funny... when I parked in it, nobody told me to pull out. NEVADA Actually it's my driveway. ALBUQUERQUE But I use it whenever I'm in town. TALLAHASSEE Well I’m in town, and now I’m using it. NEVADA Keep talking like this, I can arrange so neither of you ever uses it again. COLUMBUS I don't think they're talking about the actual driveway. WICHITA No, I don’t think so. TALLAHASSEE and ALBUQUERQUE stare each other down. COLUMBUS Is it me, or does he kind of remind you of-? WICHITA Yeah.   It’s weird.   Not weird. Creepy. COLUMBUS Like an un-funhouse mirror. From the passenger side, a YOUNGER GUY climbs down with more caution.   He’s cerebral, alert.   This is FLAGSTAFF.   If Albuquerque reminds us of Tallahassee, Flagstaff reminds us even more of Columbus. WICHITA Whoa.   What’s going on here? COLUMBUS What? 70. WICHITA What do you mean what?   He doesn’t remind you of-? COLUMBUS Oh...   No.   Really?   Noooo. Flagstaff approaches Columbus and extends a hand. FLAGSTAFF Hi everyone.   This is Albuquerque. I’m Flagstaff. COLUMBUS Hey.   Columbus.   Wichita. Tallahassee.   And you know Nevada. ALBUQUERQUE Yes I do. FLAGSTAFF So sorry about your ex-car.   I guess, as I like to say, Expect the Unexpected.   In fact, that’s one of my commandments.  COMMANDMENT #6   EXPECT THE UNEXPECTED  The title behind Flagstaff is bigger and flashier than Columbus’s titles.   It’s shiny.   It looks expensive. WICHITA (perks up) ‘Commandments?’ FLAGSTAFF You know, like, guidelines for getting by in this fucked-up world. I got a bunch of ‘em. WICHITA Interesting. FLAGSTAFF Number one’s Teamwork.   Always think of the team first.  COMMANDMENT #1   TEAMWORK  Now Flagstaff has TWO shiny commandments piled up behind him. COLUMBUS Teamwork.   Huh, that’s pretty good, actually. 71. TALLAHASSEE I’ve heard better.   No offense. Columbus has some rules, too. FLAGSTAFF Really?!   Wow.   Such as? TALLAHASSEE Number one.   Most important of all. Cardio. Columbus’s ",
      "dialogue_count": 0,
      "word_count": 731
    },
    {
      "scene_number": 8,
      "slugline": "INT.   DINING ROOM - GRACELAND - MORNING EVERYONE sits around the table having an awkward BREAKFAST. TALLAHASSEE Interesting vehicle ya got. ALBUQUERQUE Yessir.   Dallas had a monster truck show the night the zombies first hit. ‘Big Fat Death’ was just sitting there!   Sixty-six-inch tires.   Two-axle steering.   Bitch- and-a-half to drive, but a real in kick once you get the hang. TALLAHASSEE You carrying a lot of weaponry? ALBUQUERQUE You name it - I got it. TALLAHASSEE Grenades?   ALBUQUERQUE Got it. TALLAHASSEE Bazooka?   ALBUQUERQUE Got it. TALLAHASSEE Nuclear football? (off Albuquerque’s frown) So he’s your... sidekick? ALBUQUERQUE My partner.   Flagstaff may not look it, but he’s a beast in battle. Flagstaff looks very ‘aw, shucks.’ TALLAHASSEE Can we not use the word Beast. Tubbs to my Crockett over here is an animal, too.   Eats zombies for breakfast and shits ‘em out by lunch. WICHITA He shits out everything by lunch. Suddenly there’s a loud SCREECH from outside. TALLAHASSEE What the hell was that? 74.",
      "characters": [],
      "action_text": "Everyone runs to the window.   ‘BIG FAT DEATH’ has THREE very athletic-looking T-800s CRAWLING on it. ALBUQUERQUE They musta fucking followed us. WICHITA They do look very T-800-like.   At the very least T-700. FLAGSTAFF There actually was no T-700. COLUMBUS He’s right.   The T-800 was the first model. WICHITA This is great having two of you. Tallahassee pulls out a PISTOL. TALLAHASSEE Time to nut up or shut up.   What? ALBUQUERQUE Nothing.   Just, that saying is a bit 2009. Wichita CHUCKLES.   Tallahassee glares at her. TALLAHASSEE Really?   The knife in my back feels very 2018. One of the T-800s rears back and SMASHES its FIST THROUGH the truck’s BACK WINDOW. TALLAHASSEE We got this.   What?! ALBUQUERQUE (chuckles) Sorry.   I can’t take you serious in that onesie.   Ya want a peanut butter and ‘nana sandwich? COLUMBUS Do I. ALBUQUERQUE Look, we brought ‘em here.   We’ll take care of it.   Come on, Flag. Let’s show these fuckers how we do. 75. Albuquerque and Flagstaff grab their gear and rush out. Tallahassee and Columbus, bummed out, slump down in opposite chairs.   Nevada and Wichita remain by the windows. TALLAHASSEE Anybody else find those two... uniquely annoying? WICHITA Uniquely?   No. Outside we start to hear sporadic SNARLS and GUNFIRE. TALLAHASSEE I don’t love their chances. COLUMBUS They did ignore rule fifty-two. ‘Don’t be afraid to ask for help.’  RULE #52   DON’T BE AFRAID TO ASK FOR HELP  We hear a HUGE EXPLOSION!   GUNFIRE!   A BIGGER EXPLOSION!   Off- screen, Albuquerque and Flagstaff cheer and laugh. The girls share a smirk as the FRONT DOOR opens and ALBUQUERQUE and FLAGSTAFF strut inside. They’re covered in GORE, looking like heroes from an 80’s war movie.   Albuquerque shakes a Polaroid, giddy. ALBUQUERQUE Oh man, this is gonna be a good one. ALBUQUERQUE holds up the pic and uh-oh... there’s a BLOODY BITE MARK on his bicep. NEVADA Uh, Albuquerque, you got a little something on your arm. ALBUQUERQUE becomes visibly nervous. ALBUQUERQUE What tha",
      "dialogue_count": 0,
      "word_count": 1661
    },
    {
      "scene_number": 9,
      "slugline": "INT.   TRANS SPORT - TRAVELING - DAY A bouncy MADISON is now in back with WICHITA.   COLUMBUS and TALLAHASSEE are up front.   Everyone is eating ICE CREAM. COLUMBUS Last time I saw you... you were a zombie. MADISON I wish!   Stupid nut allergy.   I think it was the trail mix Wichita gave me. WICHITA Whoops. (offers her ice cream) Mocha Almond Fudge?   It’s delicious. Columbus shoots Wichita a look. MADISON I kept trying to tell you it was only an allergic reaction, but I guess you thought I was trying to eat you. (smiles) Not that you minded it last time. Tallahassee suppresses a gag reflex. COLUMBUS Listen.   Madison.   About that. Wichita and I were just talking- MADISON Anyway.   There I was.   Hiding in the corn.   Then I figured, I used to live in a freezer.   Why not a- COLUMBUS -freezer on wheels? MADISON OMG.   We’re still finishing each other’s- WICHITA Sandwiches. MADISON (to Wichita) I’ve really missed this. 83.",
      "characters": [],
      "action_text": "WICHITA Hey look at that!   She’s getting the whole sarcasm thing.   Soon you won’t need me for anything. TALLAHASSEE Whoa, whoa, heads up - check it out! Columbus stops the TRANS SPORT.   Ahead is the HIGH RISE with the WALLED ATRIUM and ROOFTOP FARM! COLUMBUS We made it!   New Woodstock! TALLAHASSEE Damn hippies. Columbus hits the accelerator to drive the last few hundred yards, but suddenly hears mechanical GRINDING.   SMOKE POURS from out from under the Trans Sport’s HOOD.   The minivan gradually slows to a HALT again. TALLAHASSEE And not a moment too soon. Everyone gets out of the van and heads for the building.   But something is itching Tallahassee’s brain.   He looks back over his shoulder at the Trans Sport. TALLAHASSEE Hold up. Tallahassee turns back and thoroughly DESTROYS the Transport in a cathartic outburst of vengeful, joyous violence. He KICKS DENTS in the side.   Rips off one of the SIDEVIEW MIRRORS.   Chucks it through the WINDSHIELD.   SHOOTS the car to shit with a COMBAT SHOTGUN.   Pulls out the pin on a GRENADE and drops it inside.   Walks away. The WHOLE CAR EXPLODES behind him. Tallahassee rejoins the others with a tiny, satisfied smile. TALLAHASSEE Enjoy the little things. CUT TO: EXT.   HIGH-RISE - DAY TALLAHASSEE, COLUMBUS, WICHITA, and MADISON walk the last few yards to the high-rise. 84. TALL GIRL Password? TALLAHASSEE Uh, password? The dolly moves the furniture aside.   The front door opens. TALL GIRL Damn it, no one changed it?! TALL GIRL emerges. TALL GIRL Guns. CUT TO: INT.   LOBBY/ELEVATOR - DAY TALLAHASSEE watches, angst coursing through him, as his GUNS are MELTED DOWN. TALL GIRL Not to worry, zombies are pretty harmless. TALL GIRL shows TALLAHASSEE, COLUMBUS, WICHITA, and MADISON toward (and into) an elevator. COLUMBUS Technically, not a hundred percent true. WICHITA More like zero. TALL GIRL Well, they can’t kill what they can’t reach. The elevator doors close. EXT.   NEW WOODSTOCK - ROOFTOP FARM - DAY LITTLE ROCK sits with a few",
      "dialogue_count": 0,
      "word_count": 3792
    },
    {
      "scene_number": 10,
      "slugline": "INT.   ATRIUM - DAY The T-800s... still a HUNDRED STRONG... follow our HEROES into the STAIRWELL and begin climbing after them. These zombies are extraordinarily ATHLETIC, surpassing even our cardio-habituated heroes.   They start to GAIN. TALLAHASSEE Light the candle! CUT TO: COLUMBUS and WICHITA on a LANDING ABOVE.   Waiting there is a MAIL CART with a huge TANK of PROPANE strapped on top.   At the neck of the tank is a MAKESHIFT FUSE created from a RAG soaked in LIGHTER FLUID. Wichita whips out a LIGHTER and lights the jury-rigged FUSE. Then Columbus pushes the cart to the EDGE of the top stair and leaves it there. Columbus, Wichita, Madison, and Berkeley continue UP the stairwell.   Little Rock stops by the cart. Tallahassee and Nevada round the corner of the staircase with ZOMBIES fast on their tail. TALLAHASSEE Now! Little Rock SHOVES the MAIL CART,   which ROLLS, BUMPING, down the stairs, careening right BETWEEN Tallahassee and Nevada... ...and STRIKING the first T-800s just as the FLAMING FUSE reaches the NECK of the PROPANE TANK. KABLAMMMM!   The tank EXPLODES in a WAVE of BLUE FAME and PRESSURE, OBLITERATING the ZOMBIES in front. Tallahassee, Nevada, and Little Rock are nearly KNOCKED off their feet by the blast wave, but continue UPWARD with some combination of GLEE and TERROR. NEVADA Are you as turned on as me? MORE T-800s emerge from the smoke and flames in MAD PURSUIT. Columbus, Wichita, Madison, and Berkeley push upward... shoving their way through the ROOF DOOR and DISAPPEAR. LITTLE ROCK huffs and puffs and EXITS through the same door. 102.",
      "characters": [],
      "action_text": "Which leaves NEVADA and TALLAHASSEE.   It becomes OBVIOUS they WON’T REACH the door BEFORE the ZOMBIES REACH THEM. TALLAHASSEE Run.   Run!   I’m right behind you. NEVADA No chance. The two go hand-to-hand, beating the zombies back.   But it’s a LOSING BATTLE. TALLAHASSEE Let’s both run. NEVADA Fine. Nevada turns and runs upstairs.   Tal doesn’t immediately follow.   He heroically takes on one more zombie, causing it to TEETER backward into its BRETHREN.   At last, he bolts.  EXT.   ROOF - DAY The door on the rooftop BLASTS OPEN, and TALLAHASSEE runs through.   We enter SLOW-MOTION. Like General Custer pursued by the Sioux nation, Tallahassee has reached the TOP OF THE PROVERBIAL MOUNTAIN.   There’s NOWHERE left to run... ...but FORWARD, ARMS CHURNING, LEGS PUMPING. Behind him, BOOM!   The ZOMBIES SMASH through the same door and LURCH after him. Suddenly, we realize that the NEW WOODSTOCK COMMUNITY has LINED UP on either side of Tallahassee, forming a ‘TUNNEL’ - roughly forty feet across - for him to sprint through. The zombies enter this ‘tunnel’ of bodies, realize there’s PREY on EITHER SIDE of them, and start to FAN OUT. ANGLE on WICHITA and COLUMBUS, one on either side of the human tunnel, staring at the zombies with DETERMINATION. They are each HOLDING something, AIMING it from the HIP. We TILT down their bodies to reveal what that something is: A FIREHOSE. WICHITA Fuck ‘em up. 103. Wichita and Columbus throw back the LEVERS on their respective FIREHOSES. WHOOOOOOOOOSHHHHHHH! The hoses BLAST WATER into the ZOMBIES behind TALLAHASSEE, forcing them AWAY from the community on either side and back into a SINGLE FILE LINE behind him. REGULAR SPEED as the ZOMBIES are buffeted by the incredibly powerful streams of water.   We’ve all seen riot control footage.   It’s that crazy. Like a PIED PIPER, TALLAHASSEE runs across the roof through the human tunnel.   The ZOMBIES have been forced into a now SINGLE-FILE LINE on his TAIL. PAIRS of COMMUNITY MEMBERS on either side of",
      "dialogue_count": 0,
      "word_count": 2194
    }
  ]
}