{
  "slug": "zootopia-2016",
  "title": "zootopia",
  "genre": "drama",
  "format": "film",
  "scenes_count": 10,
  "characters_count": 0,
  "characters": [],
  "total_words": 18443,
  "total_dialogue": 0,
  "scenes": [
    {
      "scene_number": 1,
      "slugline": "EXT. POLICE ACADEMY TRAINING FACILITY - DAY  Hopps and the comparatively huge CADETS sit in a circle as MAJOR FRIEDKIN, an intimidating drill instructor, lectures. MAJOR FRIEDKIN Listen up Cadets! Zootopia has 12 unique ecosystems within its city limits-- Tundra Town, Sahara Square, Rainforest District, to name a few. You’re gonna have to master all of them before you hit the streets-- or guess what? (to Hopps) You’ll be dead!  IN SAHARA SQUARE SIMULATOR:  Hopps struggles through the sand. MAJOR FRIEDKIN(CONT’D) Scorching sandstorm. You’re dead, bunny bumpkin!  ON THE VINE-COVERED MONKEY BARS:  Hopps swings across the bars, simulating the RAINFOREST DISTRICT. She falls off, landing face first in the mud. MAJOR FRIEDKIN (O.S.) (CONT’D) 1000 foot fall. You’re dead, carrot face!  TUNDRA TOWN ICE WALL:  Judy and the cadets sprint toward the wall. The CLAWED ANIMALS dig into the ice wall. Hopps slides off. MAJOR FRIEDKIN (CONT’D) Frigid ice wall. You’re dead, farm girl!  IN THE BOXING RING:  Hopps gets in the ring with a BIG BISON. MAJOR FRIEDKIN (CONT’D) E-normous criminal. Hopps gets punched in the nose. MAJOR FRIEDKIN (CONT’D) You’re dead!  8.",
      "characters": [],
      "action_text": "THREE QUICK CUTS OF FAILURE:  MAJOR FRIEDKIN (O.S.) (CONT’D) Dead! / Dead! / Dead!  IN THE TOILET:  Hopps ruses into a stall. The toilet is considerably larger than she is. She shuts the door. We see her climb up the toilet. In the next stall, we see the feet of a Hippo. Then, KERSPLASH! Hopps falls into the toilet. MAJOR FRIEDKIN (CONT’D) Filthy toilet. You’re dead, fluff butt!  HOPPS ON HER OWN--  She runs at sunset-- after everyone else has called it a day. We HEAR the drill instructor’s voice echoing in her mind. MAJOR FRIEDKIN (V.O.) (CONT’D) Just quit and go home, fuzzy bunny! Then those of her parents... STU HOPPS (V.O.) There’s never been a bunny cop. BONNIE HOPPS (V.O.) Never. STU HOPPS (V.O.) Never. Then Gideon’s... GIDEON GREY (V.O.) Just a stupid, carrot farming dumb bunny.  OVERNIGHT, IN THE BARRACKS:  Hopps stays up late studying, doing sit ups.  ON THE ICE WALL:  Hopps bounds up the wall, jumps off of the backs of the big animals and makes it over, impressing the Major Friedkin.  IN THE RING:  9. Hopps dodges a few swings. The Bison misses. Hopps bounds over him and uses his momentum-- kicking his other hand into his face, knocking him down. DISSOLVE TO:  EXT. POLICE ACADEMY - DAY  It’s graduation day. MAYOR LIONHEART is at the podium. LIONHEART As Mayor of Zootopia, I am proud to announce that my Mammal Inclusion Initiative has produced its first police academy graduate. Judy stands proudly in her cop uniform. LIONHEART (CONT’D) Valedictorian of her class, ZPD’s very first rabbit officer... Judy Hopps. Judy walks to the stage as those in attendance cheer-- her FAMILY chief among them. ASSISTANT MAYOR BELLWETHER applauds. She smiles at Judy, lost in the moment. LIONHEART (CONT’D) (clearing his throat) Assistant Mayor Bellwether? Her badge. BELLWETHER Oh! Yes right. LIONHEART Thank you. Bellwether steps forward to pin Hopps’ ZPD badge on her. LIONHEART (CONT’D) Judy, it is my great privilege to officially assign you to the heart of Zootopia: Precinct O",
      "dialogue_count": 0,
      "word_count": 1206
    },
    {
      "scene_number": 2,
      "slugline": "EXT. DOWNTOWN ZOOTOPIA - A LITTLE LATER  Hopps emerges into the main Zootopia central plaza. It’s an amazing, magnificent place. A JUMBOTRON featuring a gazelle pop star, GAZELLE, blares its message in a loop. GAZELLE I am Gazelle. Welcome to Zootopia! CUT TO:  INT. HOPPS’S APARTMENT BUILDING, HALLWAY - DAY  DHARMA ARMADILLO, Hopps’s older ARMADILLO LANDLADY, opens the door to Hopps’ new apartment-- which we can’t see yet. DHARMA ARMADILLO And welcome to the Grand Pangolin Arms. “Luxury Apartments with Charm.” Hopps discovers the room is a tiny, crappy studio apartment. DHARMA ARMADILLO (CONT’D) Complimentary de-lousing once a month. (handing over the keys) Don’t lose your key. HOPPS Thank you! As Dharma leaves, Hopps’ volatile, artsy NEIGHBORS, KUDU and ORYX POOTOSSER, pass by in the hall. HOPPS (CONT’D) Oh hi, I’m Judy! Your new neighbor! KUDU POOTOSSER Yeah? Well we’re loud. ORYX POOTOSSER Don’t expect us to apologize for it. Before Hopps can respond, they’re gone, leaving Hopps alone. She looks around... blank-faced so it’s tough to read her emotions. HOPPS Greasy walls... rickety bed...  15.",
      "characters": [],
      "action_text": "KUDU POOTOSSER (O.S.) Shut up! ORYX POOTOSSER (O.S.) You shut up! KUDU POOTOSSER (O.S.) No! You shut up! HOPPS Crazy neighbors... (big smile as she flops on the bed) I love it! As the shouting continues, she stretches out on her bed, exhausted but overjoyed.  WAKE UP MONTAGE - MORNING  Quick, rhythmic cuts of: - Alarm clock: Beep. Beep. Beep. - Dressing: Vest. Badge. Belt. On the bedside table sits the PINK FOX REPELLENT. Judy glances at it and smirks-- taking it would be silly-- she walks out of frame. HOLD on the table. One second. Then Judy’s hand comes back into frame and grabs the Repellent.  INT. ZOOTOPIA POLICE DEPARTMENT - MORNING  Utter mayhem. COPS parade PERPS through the lobby-- one is wearing cuffs and a plastic (not scary) safety muzzle, he complains to the BEAR COP marching him by. LEOPARD C’mon! He bared his teeth first. We land at the front desk and find CLAWHAUSER, a PUDGY CHEETAH COP, happily eating a bowl of Lucky Chomps cereal. HOPPS (O.C.) Scuse me! Down here? Hi. Clawhauser leans over the desk to find Hopps. CLAWHAUSER O-M goodness! They really did hire a bunny. What?! (MORE)  16. I gotta tell ya, you are even cuter than I thought you’d be. HOPPS (a little wince) Ooo, uh, you probably didn’t know, but a bunny can call another bunny “cute,” but when other animals do it, it’s a little... CLAWHAUSER (gasps, realizing) I am so sorry. Me, Benjamin Clawhauser, the guy everyone thinks is just a flabby, donut-loving cop, stereotyping you...? HOPPS It’s okay-- oh, you’ve actually you’ve actually got a-- there’s a-- in your neck-- the fold-- the-- there’s-- Clawhauser removes a small donut from under some neck fat. CLAWHAUSER Oh, there you went, you little dickens! He crams the donut into his mouth. HOPPS (awkwardly laughing) I should get to roll call, so... which way do I? CLAWHAUSER Oh! Bullpen’s over there to the left. HOPPS Great, thank you! Clawhauser watches admiringly as she heads to the bullpen. CLAWHAUSER (to himself, wistful) Aw... That poor l",
      "dialogue_count": 0,
      "word_count": 530
    },
    {
      "scene_number": 3,
      "slugline": "INT. ZPD - BULLPEN - CONTINUOUS  Hopps enters the bullpen, by far the smallest animal in the room: rhinos, buffalo, hippos, elephants, etc. Hopps holds her paw out to a tough RHINO, MCHORN. HOPPS Hey. Officer Hopps. You ready to make the world a better place? McHorn gives Hopps a reluctant fist bump, nearly knocking her off the chair. OFFICER HIGGINS (O.S.) TEN HUT! In walks CHIEF BOGO, a gruff CAPE BUFFALO. He takes the dais. Everyone snaps to attention and starts stomping the floor. BOGO All right, all right. Everybody sit. As Hopps sits, she disappears below the DESK that is meant for a rhino. BOGO (CONT’D) I’ve got three items on the docket. First... we need to acknowledge the elephant in the room. (nods to ELEPHANT) Francine, happy birthday. An elephant, FRANCINE, blushes as other cops clap. BOGO (CONT’D) Number two: There are some new recruits with us I should introduce. But I’m not going to, because I don’t care. Finally... He turns to a push pin-pocked MAP that’s covered in photos of MISSING MAMMALS. Hopps’s eyes go wide. BOGO (CONT’D) ...We have 14 missing mammal cases. All predators, from a giant polar bear, to a teensy little otter. And City Hall is right up my tail to find them. This is priority number one. Assignments! HIGGINS hands Bogo a stack of CASE FILES. Bogo puts on his reading glasses, examining the files as he assigns cases.  18.",
      "characters": [],
      "action_text": "BOGO (CONT’D) Officers Grizzoli, Fangmeyer, Delgato-- your teams take Missing Mammals from the Rainforest District. Officers McHorn, Rhinowitz, Wolfard, your teams take Sahara Square. Officers Higgins, Snarlov, Trunkaby: Tundratown. And finally, our first bunny, Officer Hopps. Hopps sits up, expectant but steely. Bogo looks at the final case file in his hand. He takes a dramatic breath, then: BOGO (CONT’D) Parking Duty. Dismissed! HOPPS Parking duty? (runs after Bogo) Uh, Chief? Chief Bogo? Bogo looks around... then down to find Hopps. HOPPS (CONT’D) Sir, you said there were 14 missing mammal cases? BOGO So. HOPPS So I can handle one. You probably forgot, but I was top of my class at the academy. BOGO Didn’t forget. Just don’t care. HOPPS Sir, I’m not just some “token” bunny. BOGO Well, then writing a hundred tickets a day should be easy. He goes, slamming the door behind him. Judy stomps her foot. HOPPS 100 tickets...? I’m not gonna write 100 tickets... I’m gonna write 200 tickets!   (MORE)  19. (then, to the closed door) Before noon!  INT. / EXT. METER MAID CART - DAY  Hopps dons a vest, buckles her seat belt, floors the pedal and... takes off at 2 miles an hour. Which leads to a  PARKING METER MONTAGE --  Hopps zooms past a row of cars, marking their tires. Cruising the streets, her super-sensitive ears hear a meter ding. She slams her brakes-- then proudly issues Ticket #1. Ding! Another meter goes off. Then another. And another. She’s on a roll. She looks down at her counter. It’s at 200. HOPPS Boom! 200 tickets before noon. A final ding... Reveal: her own traffic cart is at an expired meter. Hopps rolls her eyes and writes herself a ticket. HOPPS (CONT’D) 201. As Hopps puts the ticket on her windshield, she hears a voice across the street: TRUCK DRIVER (O.S.) Hey, watch where you’re going, Fox! Hopps looks across the street to see... a RED FOX. Hopps looks at him, a little suspicious. The Fox looks around, then slinks into a café. Hopps runs across the street ",
      "dialogue_count": 0,
      "word_count": 7191
    },
    {
      "scene_number": 4,
      "slugline": "INT. WEDDING RECEPTION - A LITTLE LATER  A lavish celebration full of arctic animals dancing. We find Nick and Hopps at the head table, next to Mr. Big. They all eat TINY pieces of WEDDING CAKE. MR. BIG Otterton is my florist. He’s like a part of the family. He had something important he wanted to discuss. That’s why I sent that car to pick him up. But he never arrived. HOPPS Because he was attacked. MR. BIG No... he attacked. HOPPS Otterton? MR. BIG Otterton. He went crazy. Ripped up the car, scared my driver half to death and disappeared into the night. HOPPS He’s a sweet little otter. MR. BIG My child, we may be evolved... but deep down we are still animals. Nick and Hopps trade a worried glance. OVER THE FOLLOWING WE CROSS-DISSOLVE TO NICK AND HOPPS WALKING IN THE RAINFOREST: MR. BIG (V.O.)(CONT’D) You want to find Otterton... talk to the driver of the car. His name’s Manchas, lives in the Rainforest District. Only he can tell you more.  EXT. “RAINFOREST DISTRICT” - LATER THAT NIGHT  Nick and Hopps make their way across a mossy rope bridge high above the forest floor. It leads to a moss-covered apartment.  58.",
      "characters": [],
      "action_text": "EXT. “THE CANOPY” - MOMENTS LATER  At the door of the DRIVER’S APARTMENT, they ring the bell. HOPPS Mr. Manchas? Judy Hopps, ZPD. We just want to know what happened to Emmitt Otterton. Beat. The door creaks open. MANCHAS (MUFFLED INSIDE) You should be asking... what happened to me. The door opens to the chain, revealing... MANCHAS is... a HUGE JAGUAR-- but he’s been badly beaten up. He has a black eye, and a scratches. Nick and Hopps are taken aback. NICK Whoa. A teensy otter... did that? HOPPS What... happened? Off Manchas’s look, we CUT TO:  A FLASHBACK --  Manchas is driving when he’s attacked from the back seat. MANCHAS (THROUGH DOOR GAP) He was an animal... down on all fours... he was a savage. The car spins out. Emmitt growls at Manchas then runs off. BACK TO:  THE CANOPY --  MANCHAS (haunted) There was no warning, he just kept yelling about the “night howlers.” Over and over, “the night howlers...” Nick and Hopps share a subtle look-- they have no idea what “night howlers” are.  59. NICK Oh. So you know about the night howlers too? Good, good, good. Because the night howlers are exactly what we are here to talk about. (to Judy) Right? HOPPS Yep. So, uh, you just open the door and tell us what you know and we will tell you what we know. Okay? MANCHAS (considering) Okay. Manchas closes the door and starts to unlock a series of deadbolts. Judy gives Nick an impressed look. HOPPS Clever fox. There’s a commotion inside, followed by a scream. HOPPS (CONT’D) Mr. Manchas? The door creaks open just an inch. Nick and Hopps seem startled... Hopps slowly pushes the door open, revealing Manchas in the center of the room, hunched over and grunting. NICK Buddy? HOPPS Are you... okay? Hopps looks at Manchas. RAAAGH!!! Manchas turns, right at them. His eyes are dilated, he’s turned savage! He’s poised to pounce on Nick and Hopps. HOPPS (CONT’D) Run. RUN! The Jaguar tears after them, he’s deranged, primal. Nick and Hopps run! The jaguar is closing in. NICK What is wrong with h",
      "dialogue_count": 0,
      "word_count": 741
    },
    {
      "scene_number": 5,
      "slugline": "EXT. THE CANOPY - SAME  RAAGH! Manchas takes a swipe at Nick. HOPPS Clawhauser, listen to me! We have a 10-91! Jaguar gone savage! Vine and Tu-junja! NICK It’s Tujunga! As they emerge from the log, Hopps slips, dropping her radio. CLAWHAUSER (ON RADIO) Okay, we’re sending back up! Hopps? HOPPS?! Nick and Hopps run, sliding around a corner. Ahead is a gondola station. HOPPS There! Head to the skytrams! They run to the gondolas. Hopps darts out of Manchas’ way, but slips and is headed off the platform when she manages to grab on-- dangling from the edge. Nick searches for her... NICK Get in! Carrots? Carrots! He tries to hold on to the gondola for Hopps, who is struggling to pull herself back onto the platform. HOPPS Go! As the gondola pulls away, Nick tries to stop it to no avail. NICK No, no, no! Nick backs up... the jaguar stalks him. NICK (CONT’D) Buddy, one predator to another--   * The jaguar charges, but before it gets Nick-- clank! It’s   * yanked back in place. We see a HANDCUFF on its back paw, attached to a metal post. Hopps cuffed him!  Blue Rev. (mm/dd/yy)   62.",
      "characters": [],
      "action_text": "NICK (CONT’D) Now, I can tell you’re a little tense, so I’m just gonna give you a little personal space-- The jaguar thrashes, knocking Nick and Hopps over the edge. Hopps barely grabs a vine, but struggles to hold Nick in the other hand. As Manchas growls at them from above, Nick looks at the abyss below. Hopps looks around, her mind racing. NICK (CONT’D) Rabbit, whatever you do, do not let go! HOPPS I’m gonna let go! NICK No, you what? No, I said-- listen-- noooo! HOPPS One, two-- Hopps lets go, swinging them over to a netting of vines, kind of on top of each other. They can’t believe they’re alive. They look at each other, stunned, relieved... NICK Carrots. You saved my life. HOPPS Well. That’s what we do at the ZP... (the branch snaps) Deeeeeeeeeeeee..... Nick and Hopps plummet. They are about to hit the ground, but a vine attached to their legs stops them right before impact. Woo! A convoy of police arrive, screeching in front of them. Out steps... Bogo. Hopps smiles, the cavalry has arrived. BOGO Well, this should be good.  MOMENTS LATER --  Hopps leads the cops up to the canopy, full of confidence. HOPPS I thought this was just a missing mammal case, but it’s way bigger. (MORE)  63. Mr. Otterton did not just disappear. I believe he and this jaguar, they... went savage, Sir. BOGO (scoffing) Savage? This isn’t the Stone Age, Hopps. Animals don’t go savage. HOPPS I thought so too, ‘til I saw this: Hopps pulls back some leaves to reveal: the jaguar is gone. There is no sign of him... or his handcuffs. It’s like it never happened. Hopps’ eyes go wide. HOPPS (CONT’D) What? He was right here... BOGO (not buying it) The “savage” jaguar. HOPPS Sir, I know what I saw-- he almost killed us. BOGO Or maybe any aggressive predator looks savage to you rabbits. (calls out, to cops) Let’s go. HOPPS Wait-- Sir, I’m not the only one who saw him! (to Nick) Nick! Hopps turns to Nick, but before he can explain: BOGO (incredulous) You think I’m going to believe a fox? HOPPS Well he",
      "dialogue_count": 0,
      "word_count": 3193
    },
    {
      "scene_number": 6,
      "slugline": "EXT. ASYLUM - DAY  Cop cars and helicopters surround the asylum. Hopps, flanked by Bogo and other COPS, leads Lionheart out of the building. HOPPS Mayor Lionheart, you have the right to remain silent. Anything-- LIONHEART You don’t understand. I was trying to protect the city. HOPPS You were just trying to protect your job. LIONHEART No. Listen, we still don’t know why this is happening. It could destroy Zootopia. HOPPS You have the right to remain silent. Anything you say can and will be used against you in a court of law... Nick hangs back, proudly flashing his Junior Detective badge.  INT. ZPD - LOBBY  Bogo addresses the press. Behind him, POSTERS of the Savage Animals-- each one MUZZLED. BOGO Ladies and Gentlemammals... 14 mammals went missing and all 14 have been found by our newest recruit, who will speak to you in a moment. But first, let me remind you-- Bogo’s voice trails off in the background as Nick and Hopps watch from the side. Hopps bites her nails, nervous. HOPPS Rrrgh. I am so nervous... NICK Okay, press conference 101: You wanna look smart? (MORE)  79.",
      "characters": [],
      "action_text": "Answer their question with your own question and then answer that question. Like this, “Excuse me. Officer Hopps, what can you tell us about the case?” (pretending to be Hopps) “Well, was this a tough case? Yes. Yes it was.” You see? HOPPS You should be there with me. We did this together. NICK Well, am I a cop? No. No, I am not. HOPPS Funny you should say that, because I’ve been thinking... it would be nice to have a partner. She hands Nick an APPLICATION. Then-- click-- she holds out the carrot pen to him. HOPPS (CONT’D) Here. In case you need something to write with. BOGO (O.S.) At twenty-two hundred hours, we found all these missing animals... Bellwether gestures to Judy to come up. BELLWETHER Officer Hopps, it’s time. As Hopps goes, Nick smiles. He’s touched... BOGO So now, I’ll turn things over to the officer who cracked the case. Officer Judy Hopps. Hopps takes a deep breath and steps up to the dais. PRESS Officer Hopps! / Over here! / Here! HOPPS (pointing to a REPORTER) Yes? NICK (CONT'D)  80. REPORTER What can you tell us about the animals that went savage? HOPPS Well, the animals in question... (glances at Nick) Are they all different species? Yes. Yes they are. Nick smiles, gives a thumbs up. REPORTER 2 Okay, so what is the connection? HOPPS Well, all we know is that they are all members of the predator family. ANOTHER REPORTER So, predators are the only ones going savage? HOPPS That is accu-- Yes, that is accurate. Yes... REPORTER 3 Wow. Why is that happening? HOPPS We still don’t know-- More disappointed rumbling. HOPPS (CONT’D) (trying to appease) Ah, it may have something to do with biology. On Nick--   huh?   The press reacts, too... big time. REPORTER (O.S.) What do you mean by that? HOPPS A biological component. You know, something in their DNA... REPORTER 4 (more aggressive) In their DNA? Can you elaborate on that, please?  81. HOPPS Yes. What I mean is, thousands of years ago... um... predators survived through their aggressive hunting instincts",
      "dialogue_count": 0,
      "word_count": 1040
    },
    {
      "scene_number": 7,
      "slugline": "INT. NEWS STUDIO - DAY  Two ANCHORS sit in front of a graphic: TUNDRATOWN TRAGEDY. FEMALE BOBCAT NEWS ANCHOR More bad news in this city gripped by fear. News footage shows a CARIBOU being loaded into an ambulance. Another shot shows a POLAR BEAR in a muzzle. FEMALE BOBCAT NEWS ANCHOR (CONT’D) A caribou is in critical condition, the victim of a mauling by a savage polar bear. This-- the 27th such attack-- comes just one week after ZPD Officer Judy Hopps connected the violence to traditionally predatory animals. MALE MOOSE NEWS ANCHOR Meanwhile, a peace rally organized by pop star, Gazelle, was marred by protest. The news story cuts to footage of  THE PROTEST:   Hopps is caught in the middle of the PROTESTERS, trying to separate them. PIG Go back to the forest, predator! LEOPARD I’m from the savannah! GAZELLE gives a sound bite to a NEWS REPORTER. GAZELLE Zootopia is a unique place. It’s a crazy, beautiful, diverse city where we celebrate our differences. (gestures to PROTESTERS in background) This is not the Zootopia I know. Gazelle’s interview plays as VO over a series of shots:  ON A SUBWAY:   Hopps watches a MOTHER RABBIT bring her CHILD close as a LION gets on the train. GAZELLE (V.O.) The Zootopia I know is better than this.   (MORE)  85.",
      "characters": [],
      "action_text": "We don’t just blindly assign blame. We don’t know why these attacks keep happening...  IN THE HOSPITAL:  Mrs. Otterton watches her husband flail like a madman in a padded room. Judy approaches her. GAZELLE (V.O.) ...but it is irresponsible to label all predators as savages. MRS. OTTERTON That’s not my Emmitt. On Hopps-- a look of exhaustion and distress. BACK ON Gazzelle’s interview-- GAZELLE We cannot let fear divide us. Please-- give me back the Zootopia I love...  INT. ZPD OFFICE - DAY  The broadcast plays from Hopps’ desk computer. As she watches, Bogo walks up behind her. BOGO Come on Hopps. The new Mayor wants to see us. HOPPS The Mayor? Why? BOGO It would seem you’ve arrived.  INT. ZPD LOBBY - DAY  Clawhauser sighs and closes his laptop. He loads it into a box of his desk items. Hopps enters. HOPPS Clawhauser? What’re you doing? CLAWHAUSER Um, they thought it would be better if a   predator   such as myself wasn’t the first face you that you see when you walk into the ZPD. GAZELLE (V.O.) (CONT'D)  86. HOPPS What? CLAWHAUSER They’re gonna move me to Records. It’s downstairs. By the boiler. Hopps’ face falls. Bogo waits for her in the background. BOGO Hopps! Off Hopps’ heartbroken look, we MATCH CUT TO:  CLOSE ON:  A PHOTO of a SMILING HOPPS. Wider to reveal: The photo is on a PAMPHLET that reads,   ZPD: Integrity. Honesty. Bravery.  INT. BELLWETHER’S OFFICE - DAY  Hopps looks at the pamphlet. Bellwether sits across from her at her desk. HOPPS Um... I don’t understand. BELLWETHER Our city is 90% prey, Judy. And right now they’re just really scared. You’re a hero to them. They trust you. And so that’s why Chief Bogo and I want you to be the public face of the ZPD. Bogo sits next to Hopps. She looks at the pamphlet again. HOPPS (struggling to find words) I’m not... I’m not a hero. I came here to make the world a better place, but I think I broke it. BOGO Don’t give yourself so much credit, Hopps. The world has always been broken. That’s why we need good cops-- li",
      "dialogue_count": 0,
      "word_count": 1658
    },
    {
      "scene_number": 8,
      "slugline": "EXT. ZOOTOPIA STREET - LATER  We find the weasel selling crappy knock-off merchandise on a street corner. DUKE WEASELTON Well, hello, step right up! Anything you need... I got it. All your favorite movies! I got movies that haven’t even been released yet! An ARMADILLO CUSTOMER scans an array of blatant knock-off movies like “Wreck-it Rhino,” “Wrangled,” and “Pig Hero 6.” DUKE WEASELTON (CONT’D) Hey, 15% off! 20! Make me an offer! Come on! NICK (suddenly appearing) Well, well, look who it is. The duke of bootleg. DUKE WEASELTON What’s it to you, Wilde? Shouldn’t you be melting down a popsicle or something? (sees Hopps) Hey, if it isn’t Flopsy the Copsy. HOPPS We both know those weren’t moldy onions I caught you stealing. What were you gonna do with those night howlers, Wessleton? DUKE WEASELTON It’s Weaselton. Duke Weaselton. And I ain’t talking, rabbit. And ain’t nothing you can do to make me. Weaselton flicks a toothpick in her face. Hopps smiles at Nick.  INT. MR. BIG’S PLACE - A LITTLE LATER  We find polar bears holding the weasel over the ice pit. MR. BIG Ice ‘em.  94.",
      "characters": [],
      "action_text": "DUKE WEASELTON Aaagh! Agh! (to Nick) Ya dirty rat! Why ya helping her?! She’s a cop! MR. BIG And the godmother to my future granddaughter. Reveal: FRU FRU is pregnant. FRU FRU SHREW I’m gonna name her Judy. HOPPS Aw. MR. BIG (to polar bears) Ice this weasel. DUKE WEASELTON All right, all right, please! I’ll talk! I’ll talk. I stole them night howlers so I could sell ‘em. They offered me what I couldn’t refuse... Money. HOPPS And to whom did you sell them? DUKE WEASELTON (PRE-LAP) A ram named Doug. We got a drop spot underground...  EXT. SUBWAY STATION - A LITTLE LATER  Nick and Hopps approach an abandoned subway station. DUKE WEASELTON (V.O.) ...Just watch it. Doug is the opposite of friendly. He’s unfriendly... They arrive at the entrance and quickly sneak under the gate.  INT. ABANDONED SUBWAY STATION - MOMENTS LATER  They emerge on a platform and spot an abandoned subway car.  95. HOPPS Come on! As they sneak up to it... Hopps pulls open the window and looks inside the car. They both jump into...  INT. THE GREENHOUSE CAR - CONTINUOUS  They both see the rows of night howlers. HOPPS The weasel wasn’t lying. NICK Yeah, looks like old Doug’s cornered the market on night howlers... Click! A door opens off screen! They quickly hide under a desk as a TOUGH SHEEP LABWORKER enters. He goes through the process of harvesting the pollen, eventually producing a small, blue paint ball pellet of night howler toxin. Nick and Hopps watch it all. The Sheep’s phone RINGS. DOUG (into phone) You got Doug here. What’s the mark? Cheetah in Sahara Square. Got it. The Sheep loads a gun, cocks it. We see a MAP with pictures of a various animal targets. DOUG (CONT’D) (into phone) Serious? Yeah, I know they’re fast. I can hit him. Listen, I hit a tiny little otter through the open window of a moving car. Hearing this, the pieces of the puzzle start falling into place for Hopps. She looks up at the picture of Otterton-- we FLASHBACK to see Doug hitting him with a serum pellet.   Then Hopps l",
      "dialogue_count": 0,
      "word_count": 2114
    },
    {
      "scene_number": 9,
      "slugline": "INT. NEWS STUDIO - DAY  A PREDATOR-PREY news team reads the headlines. FOOTAGE shows Bellwether being led to jail in cuffs and an orange jumpsuit. PREDATOR ANCHOR (V.O.) Former Mayor Dawn Bellwether is behind bars today, guilty of masterminding the savage attacks that have plagued Zootopia of late. PREY ANCHOR Her predecessor, Leodore Lionheart, denies any knowledge of her plot, claiming he was just trying to protect the city. A FELINE REPORTER, KITTY COWLICK, interviews Lionheart. LIONHEART Did I falsely imprison those animals? Well, yes. Yes I did. It was a classic “doing the wrong thing for the right reason” kind of a deal.  BACK TO THE NEWS DESK --  PRED ANCHOR In related news, doctors say the night howler antidote is proving effective in rehabilitating the afflicted predators...  INT. HOSPITAL ROOM - DAY  Mr. Otterton, who wakes up into the arms of his wife. MRS. OTTERTON Emmitt? Oh... Emmitt... She hugs him and he holds her tight. We pull back to reveal Hopps in the room, watching their reunion. MRS. OTTERTON (CONT’D) (to Hopps) Thank you.  106.",
      "characters": [],
      "action_text": "",
      "dialogue_count": 0,
      "word_count": 179
    },
    {
      "scene_number": 10,
      "slugline": "EXT. ZOOTOPIA CENTRAL PLAZA - DAY  Hopps walks through the CENTRAL PLAZA of ZOOTOPIA. She looks around to see animals coming back together. She focuses on two KIDS: one pred, one prey playing soccer. HOPPS (V.O.) When I was a kid, I thought Zootopia was this perfect place where everyone got along and anyone could be anything... Hopps kicks the soccer ball with the kids. HOPPS (V.O.) Turns out, real life’s a little bit more complicated than a slogan on a bumper sticker. Real life is messy. AT THE ZPD: Hopps enters to find Clawhauser back at his desk, unpacking. What’s more-- TWO COPS approach him with donuts. HOPPS (V.O.) We all have limitations. We all make mistakes. Which means-- hey, glass half full!-- we all have a lot in common. And the more we try to understand one another, the more exceptional each of us will be. But we have to try.  EXT. CADET TRAINING GROUNDS - DAY  Reveal: Hopps is giving a commencement address to the GRADUATES of the Police Academy. HOPPS So, no matter what type of animal you are, from the biggest elephant to our first fox... Reveal: Nick is a cadet. He removes his shades, winks at Hopps. HOPPS (CONT’D) I implore you... try. Try to make the world a better place. On stage, Hopps readies to pin a BADGE on Nick. As she approaches, they exchange a nod-- a small, sincere gesture. She places the badge, then gives Nick an official salute.  107.",
      "characters": [],
      "action_text": "HOPPS (CONT’D) Look inside yourself, and recognize that change starts with you. It starts with me. It starts with all of us. Caps are thrown in the air. The music fades out, leaving just the APPLAUSE, which is interrupted by: BOGO (PRE-LAP) All right! All right... CUT TO:  INT. ZPD BULLPEN - DAY  Hopps and Nick (now in uniform) sit together among ZPD’s finest. Bogo stands at the podium. BOGO ...Enough! Shut it! We have some new recruits with us this morning, including our first fox. Who cares. NICK Ha! You should have your own line of inspirational greeting cards, sir. BOGO Shut your mouth, Wilde. Assignments! Officers Grizzoli, Fangmeyer, Delgato: Tundratown Swat. Snarlov, Higgins, Wolfard: Undercover. Hopps, Wilde... (beat of anticipation) Parking duty. Dismissed. (beat) Just kidding! We have reports of a street racer tearing up Savannah Central. Find him, shut him down.  INT. / EXT. COP CAR (DRIVING SHOTS) - DAY  Hopps drives. Nick rides shotgun, eating a Pawpsickle. NICK So are all rabbits bad drivers or is it just you? She slams on the brakes. He lurches forward, accidentally jamming the Pawpsickle into his face.  108. HOPPS Oops. Sorry. NICK (as he wipes off his face) Sly bunny. HOPPS Dumb fox. NICK You know you love me. HOPPS Do I know that? Yes. Yes, I do. They smile wide. They’re stopped at a red light, when suddenly-- a TRICKED OUT RED SPORTS CAR blasts through the light! They look at each other and smile even wider. Hopps stomps on the gas. Nick hits the siren. The patrol car takes off...  EXT. STREETS OF ZOOTOPIA - MOMENTS LATER  The fleeing sports car comes to a screeching halt. ANGLE ON the license plate: FST NML. Hopps and Nick exit their car and approach the driver. HOPPS Sir, you were going 115 miles per hour. I hope you have a good explanation. But when they get to the driver’s window... NICK Flash? Flash? Hundred yard dash?! Yep. It’s Flash the sloth. FLASH (several beats) Nick. CUT TO BLACK:  THE END  109.",
      "dialogue_count": 0,
      "word_count": 591
    }
  ]
}